via/viaems/src/platforms/stm32h743/device.h
#ifndef DEVICE_H
#define DEVICE_H

#include <stdint.h>

#define IRQ_NUMBER_MAX 149
enum IRQ_NUMBER {
  WWDG1_IRQ = 0, /* Window Watchdog interrupt */
  PVD_PVM_IRQ = 1, /* PVD through EXTI line */
  RTC_TAMP_STAMP_CSS_LSE_IRQ = 2, /* RTC tamper, timestamp */
  RTC_WKUP_IRQ = 3, /* RTC Wakeup interrupt */
  FLASH_IRQ = 4, /* Flash memory */
  RCC_IRQ = 5, /* RCC global interrupt */
  EXTI0_IRQ = 6, /* EXTI Line 0 interrupt */
  EXTI1_IRQ = 7, /* EXTI Line 1 interrupt */
  EXTI2_IRQ = 8, /* EXTI Line 2 interrupt */
  EXTI3_IRQ = 9, /* EXTI Line 3interrupt */
  EXTI4_IRQ = 10, /* EXTI Line 4interrupt */
  DMA_STR0_IRQ = 11, /* DMA1 Stream0 */
  DMA_STR1_IRQ = 12, /* DMA1 Stream1 */
  DMA_STR2_IRQ = 13, /* DMA1 Stream2 */
  DMA_STR3_IRQ = 14, /* DMA1 Stream3 */
  DMA_STR4_IRQ = 15, /* DMA1 Stream4 */
  DMA_STR5_IRQ = 16, /* DMA1 Stream5 */
  DMA_STR6_IRQ = 17, /* DMA1 Stream6 */
  ADC1_2_IRQ = 18, /* ADC1 and ADC2 */
  FDCAN1_IT0_IRQ = 19, /* FDCAN1 Interrupt 0 */
  FDCAN2_IT0_IRQ = 20, /* FDCAN2 Interrupt 0 */
  FDCAN1_IT1_IRQ = 21, /* FDCAN1 Interrupt 1 */
  FDCAN2_IT1_IRQ = 22, /* FDCAN2 Interrupt 1 */
  EXTI9_5_IRQ = 23, /* EXTI Line[9:5] interrupts */
  TIM1_BRK_IRQ = 24, /* TIM1 break interrupt */
  TIM1_UP_IRQ = 25, /* TIM1 update interrupt */
  TIM1_TRG_COM_IRQ = 26, /* TIM1 trigger and commutation */
  TIM_CC_IRQ = 27, /* TIM1 capture / compare */
  TIM2_IRQ = 28, /* TIM2 global interrupt */
  TIM3_IRQ = 29, /* TIM3 global interrupt */
  TIM4_IRQ = 30, /* TIM4 global interrupt */
  I2C1_EV_IRQ = 31, /* I2C1 event interrupt */
  I2C1_ER_IRQ = 32, /* I2C1 error interrupt */
  I2C2_EV_IRQ = 33, /* I2C2 event interrupt */
  I2C2_ER_IRQ = 34, /* I2C2 error interrupt */
  SPI1_IRQ = 35, /* SPI1 global interrupt */
  SPI2_IRQ = 36, /* SPI2 global interrupt */
  USART1_IRQ = 37, /* USART1 global interrupt */
  USART2_IRQ = 38, /* USART2 global interrupt */
  USART3_IRQ = 39, /* USART3 global interrupt */
  EXTI15_10_IRQ = 40, /* EXTI Line[15:10] interrupts */
  RTC_ALARM_IRQ = 41, /* RTC alarms (A and B) */
  TIM8_BRK_TIM12_IRQ = 43, /* TIM8 and 12 break global */
  TIM8_UP_TIM13_IRQ = 44, /* TIM8 and 13 update global */
  TIM8_TRG_COM_TIM14_IRQ = 45, /* TIM8 and 14 trigger /commutation and
        global */
  TIM8_CC_IRQ = 46, /* TIM8 capture / compare */
  DMA1_STR7_IRQ = 47, /* DMA1 Stream7 */
  FMC_IRQ = 48, /* FMC global interrupt */
  SDMMC1_IRQ = 49, /* SDMMC global interrupt */
  TIM5_IRQ = 50, /* TIM5 global interrupt */
  SPI3_IRQ = 51, /* SPI3 global interrupt */
  UART4_IRQ = 52, /* UART4 global interrupt */
  UART5_IRQ = 53, /* UART5 global interrupt */
  TIM6_DAC_IRQ = 54, /* TIM6 global interrupt */
  TIM7_IRQ = 55, /* TIM7 global interrupt */
  DMA2_STR0_IRQ = 56, /* DMA2 Stream0 interrupt */
  DMA2_STR1_IRQ = 57, /* DMA2 Stream1 interrupt */
  DMA2_STR2_IRQ = 58, /* DMA2 Stream2 interrupt */
  DMA2_STR3_IRQ = 59, /* DMA2 Stream3 interrupt */
  DMA2_STR4_IRQ = 60, /* DMA2 Stream4 interrupt */
  ETH_IRQ = 61, /* Ethernet global interrupt */
  ETH_WKUP_IRQ = 62, /* Ethernet wakeup through EXTI */
  FDCAN_CAL_IRQ = 63, /* CAN2TX interrupts */
  DMA2_STR5_IRQ = 68, /* DMA2 Stream5 interrupt */
  DMA2_STR6_IRQ = 69, /* DMA2 Stream6 interrupt */
  DMA2_STR7_IRQ = 70, /* DMA2 Stream7 interrupt */
  USART6_IRQ = 71, /* USART6 global interrupt */
  I2C3_EV_IRQ = 72, /* I2C3 event interrupt */
  I2C3_ER_IRQ = 73, /* I2C3 error interrupt */
  OTG_HS_EP1_OUT_IRQ = 74, /* OTG_HS out global interrupt */
  OTG_HS_EP1_IN_IRQ = 75, /* OTG_HS in global interrupt */
  OTG_HS_WKUP_IRQ = 76, /* OTG_HS wakeup interrupt */
  OTG_HS_IRQ = 77, /* OTG_HS global interrupt */
  DCMI_IRQ = 78, /* DCMI global interrupt */
  FPU_IRQ = 81, /* Floating point unit interrupt */
  UART7_IRQ = 82, /* UART7 global interrupt */
  UART8_IRQ = 83, /* UART8 global interrupt */
  SPI4_IRQ = 84, /* SPI4 global interrupt */
  SPI5_IRQ = 85, /* SPI5 global interrupt */
  SPI6_IRQ = 86, /* SPI6 global interrupt */
  SAI1_IRQ = 87, /* SAI1 global interrupt */
  LTDC_IRQ = 88, /* LCD-TFT global interrupt */
  LTDC_ER_IRQ = 89, /* LCD-TFT error interrupt */
  DMA2D_IRQ = 90, /* DMA2D global interrupt */
  SAI2_IRQ = 91, /* SAI2 global interrupt */
  QUADSPI_IRQ = 92, /* QuadSPI global interrupt */
  LPTIM1_IRQ = 93, /* LPTIM1 global interrupt */
  CEC_IRQ = 94, /* HDMI-CEC global interrupt */
  I2C4_EV_IRQ = 95, /* I2C4 event interrupt */
  I2C4_ER_IRQ = 96, /* I2C4 error interrupt */
  SPDIF_IRQ = 97, /* SPDIFRX global interrupt */
  OTG_FS_EP1_OUT_IRQ = 98, /* OTG_FS out global interrupt */
  OTG_FS_EP1_IN_IRQ = 99, /* OTG_FS in global interrupt */
  OTG_FS_WKUP_IRQ = 100, /* OTG_FS wakeup */
  OTG_FS_IRQ = 101, /* OTG_FS global interrupt */
  DMAMUX1_OV_IRQ = 102, /* DMAMUX1 overrun interrupt */
  HRTIM1_MST_IRQ = 103, /* HRTIM1 master timer interrupt */
  HRTIM1_TIMA_IRQ = 104, /* HRTIM1 timer A interrupt */
  HRTIM_TIMB_IRQ = 105, /* HRTIM1 timer B interrupt */
  HRTIM1_TIMC_IRQ = 106, /* HRTIM1 timer C interrupt */
  HRTIM1_TIMD_IRQ = 107, /* HRTIM1 timer D interrupt */
  HRTIM_TIME_IRQ = 108, /* HRTIM1 timer E interrupt */
  HRTIM1_FLT_IRQ = 109, /* HRTIM1 fault interrupt */
  DFSDM1_FLT0_IRQ = 110, /* DFSDM1 filter 0 interrupt */
  DFSDM1_FLT1_IRQ = 111, /* DFSDM1 filter 1 interrupt */
  DFSDM1_FLT2_IRQ = 112, /* DFSDM1 filter 2 interrupt */
  DFSDM1_FLT3_IRQ = 113, /* DFSDM1 filter 3 interrupt */
  SAI3_IRQ = 114, /* SAI3 global interrupt */
  SWPMI1_IRQ = 115, /* SWPMI global interrupt */
  TIM15_IRQ = 116, /* TIM15 global interrupt */
  TIM16_IRQ = 117, /* TIM16 global interrupt */
  TIM17_IRQ = 118, /* TIM17 global interrupt */
  MDIOS_WKUP_IRQ = 119, /* MDIOS wakeup */
  MDIOS_IRQ = 120, /* MDIOS global interrupt */
  JPEG_IRQ = 121, /* JPEG global interrupt */
  MDMA_IRQ = 122, /* MDMA */
  SDMMC_IRQ = 124, /* SDMMC global interrupt */
  HSEM0_IRQ = 125, /* HSEM global interrupt 1 */
  ADC3_IRQ = 127, /* ADC3 global interrupt */
  DMAMUX2_OVR_IRQ = 128, /* DMAMUX2 overrun interrupt */
  BDMA_CH1_IRQ = 129, /* BDMA channel 1 interrupt */
  BDMA_CH2_IRQ = 130, /* BDMA channel 2 interrupt */
  BDMA_CH3_IRQ = 131, /* BDMA channel 3 interrupt */
  BDMA_CH4_IRQ = 132, /* BDMA channel 4 interrupt */
  BDMA_CH5_IRQ = 133, /* BDMA channel 5 interrupt */
  BDMA_CH6_IRQ = 134, /* BDMA channel 6 interrupt */
  BDMA_CH7_IRQ = 135, /* BDMA channel 7 interrupt */
  BDMA_CH8_IRQ = 136, /* BDMA channel 8 interrupt */
  COMP_IRQ = 137, /* COMP1 and COMP2 */
  LPTIM2_IRQ = 138, /* LPTIM2 timer interrupt */
  LPTIM3_IRQ = 139, /* LPTIM2 timer interrupt */
  LPTIM4_IRQ = 140, /* LPTIM2 timer interrupt */
  LPTIM5_IRQ = 141, /* LPTIM2 timer interrupt */
  LPUART_IRQ = 142, /* LPUART global interrupt */
  WWDG1_RST_IRQ = 143, /* Window Watchdog interrupt */
  CRS_IRQ = 144, /* Clock Recovery System globa */
  SAI4_IRQ = 146, /* SAI4 global interrupt */
  WKUP_IRQ = 149, /* WKUP1 to WKUP6 pins */
};
struct COMP1 {
  volatile const uint32_t SR;
  volatile uint32_t ICFR;
  volatile uint32_t OR;
  volatile uint32_t CFGR1;
  volatile uint32_t CFGR2;
};
