via/viaems/src/platforms/stm32h743/device.h
#define COMP1_SR_C1VAL          (0x1UL << 0) 
#define COMP1_SR_C1VAL_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define COMP1_SR_C2VAL          (0x1UL << 1) 
#define COMP1_SR_C2VAL_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define COMP1_SR_C1IF          (0x1UL << 16) 
#define COMP1_SR_C1IF_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define COMP1_SR_C2IF          (0x1UL << 17) 
#define COMP1_SR_C2IF_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define COMP1_ICFR_CC1IF          (0x1UL << 16) 
#define COMP1_ICFR_CC1IF_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define COMP1_ICFR_CC2IF          (0x1UL << 17) 
#define COMP1_ICFR_CC2IF_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define COMP1_OR_AFOP          (0x7FFUL << 0) 
#define COMP1_OR_AFOP_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 0)
#define COMP1_OR_OR          (0x1FFFFFUL << 11) 
#define COMP1_OR_OR_VAL(X) (((uint32_t)(X) & 0x1FFFFFUL) << 11)
#define COMP1_CFGR1_EN          (0x1UL << 0) 
#define COMP1_CFGR1_EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define COMP1_CFGR1_BRGEN          (0x1UL << 1) 
#define COMP1_CFGR1_BRGEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define COMP1_CFGR1_SCALEN          (0x1UL << 2) 
#define COMP1_CFGR1_SCALEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define COMP1_CFGR1_POLARITY          (0x1UL << 3) 
#define COMP1_CFGR1_POLARITY_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define COMP1_CFGR1_ITEN          (0x1UL << 6) 
#define COMP1_CFGR1_ITEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define COMP1_CFGR1_HYST          (0x3UL << 8) 
#define COMP1_CFGR1_HYST_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define COMP1_CFGR1_PWRMODE          (0x3UL << 12) 
#define COMP1_CFGR1_PWRMODE_VAL(X) (((uint32_t)(X) & 0x3UL) << 12)
#define COMP1_CFGR1_INMSEL          (0x7UL << 16) 
#define COMP1_CFGR1_INMSEL_VAL(X) (((uint32_t)(X) & 0x7UL) << 16)
#define COMP1_CFGR1_INPSEL          (0x1UL << 20) 
#define COMP1_CFGR1_INPSEL_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define COMP1_CFGR1_BLANKING          (0xFUL << 24) 
#define COMP1_CFGR1_BLANKING_VAL(X) (((uint32_t)(X) & 0xFUL) << 24)
#define COMP1_CFGR1_LOCK          (0x1UL << 31) 
#define COMP1_CFGR1_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define COMP1_CFGR2_EN          (0x1UL << 0) 
#define COMP1_CFGR2_EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define COMP1_CFGR2_BRGEN          (0x1UL << 1) 
#define COMP1_CFGR2_BRGEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define COMP1_CFGR2_SCALEN          (0x1UL << 2) 
#define COMP1_CFGR2_SCALEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define COMP1_CFGR2_POLARITY          (0x1UL << 3) 
#define COMP1_CFGR2_POLARITY_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define COMP1_CFGR2_WINMODE          (0x1UL << 4) 
#define COMP1_CFGR2_WINMODE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define COMP1_CFGR2_ITEN          (0x1UL << 6) 
#define COMP1_CFGR2_ITEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define COMP1_CFGR2_HYST          (0x3UL << 8) 
#define COMP1_CFGR2_HYST_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define COMP1_CFGR2_PWRMODE          (0x3UL << 12) 
#define COMP1_CFGR2_PWRMODE_VAL(X) (((uint32_t)(X) & 0x3UL) << 12)
#define COMP1_CFGR2_INMSEL          (0x7UL << 16) 
#define COMP1_CFGR2_INMSEL_VAL(X) (((uint32_t)(X) & 0x7UL) << 16)
#define COMP1_CFGR2_INPSEL          (0x1UL << 20) 
#define COMP1_CFGR2_INPSEL_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define COMP1_CFGR2_BLANKING          (0xFUL << 24) 
#define COMP1_CFGR2_BLANKING_VAL(X) (((uint32_t)(X) & 0xFUL) << 24)
#define COMP1_CFGR2_LOCK          (0x1UL << 31) 
#define COMP1_CFGR2_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)

#define COMP1  ((struct COMP1*)(0x58003800UL))
struct CRS {
  volatile uint32_t CR;
  volatile uint32_t CFGR;
  volatile const uint32_t ISR;
  volatile uint32_t ICR;
};
#define CRS_CR_SYNCOKIE          (0x1UL << 0) 
#define CRS_CR_SYNCOKIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define CRS_CR_SYNCWARNIE          (0x1UL << 1) 
#define CRS_CR_SYNCWARNIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define CRS_CR_ERRIE          (0x1UL << 2) 
#define CRS_CR_ERRIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define CRS_CR_ESYNCIE          (0x1UL << 3) 
#define CRS_CR_ESYNCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define CRS_CR_CEN          (0x1UL << 5) 
#define CRS_CR_CEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define CRS_CR_AUTOTRIMEN          (0x1UL << 6) 
#define CRS_CR_AUTOTRIMEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define CRS_CR_SWSYNC          (0x1UL << 7) 
#define CRS_CR_SWSYNC_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define CRS_CR_TRIM          (0x3FUL << 8) 
#define CRS_CR_TRIM_VAL(X) (((uint32_t)(X) & 0x3FUL) << 8)
#define CRS_CFGR_RELOAD          (0xFFFFUL << 0) 
#define CRS_CFGR_RELOAD_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define CRS_CFGR_FELIM          (0xFFUL << 16) 
#define CRS_CFGR_FELIM_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define CRS_CFGR_SYNCDIV          (0x7UL << 24) 
#define CRS_CFGR_SYNCDIV_VAL(X) (((uint32_t)(X) & 0x7UL) << 24)
#define CRS_CFGR_SYNCSRC          (0x3UL << 28) 
#define CRS_CFGR_SYNCSRC_VAL(X) (((uint32_t)(X) & 0x3UL) << 28)
#define CRS_CFGR_SYNCPOL          (0x1UL << 31) 
#define CRS_CFGR_SYNCPOL_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define CRS_ISR_SYNCOKF          (0x1UL << 0) 
#define CRS_ISR_SYNCOKF_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define CRS_ISR_SYNCWARNF          (0x1UL << 1) 
#define CRS_ISR_SYNCWARNF_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define CRS_ISR_ERRF          (0x1UL << 2) 
#define CRS_ISR_ERRF_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define CRS_ISR_ESYNCF          (0x1UL << 3) 
#define CRS_ISR_ESYNCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define CRS_ISR_SYNCERR          (0x1UL << 8) 
#define CRS_ISR_SYNCERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define CRS_ISR_SYNCMISS          (0x1UL << 9) 
#define CRS_ISR_SYNCMISS_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define CRS_ISR_TRIMOVF          (0x1UL << 10) 
#define CRS_ISR_TRIMOVF_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define CRS_ISR_FEDIR          (0x1UL << 15) 
#define CRS_ISR_FEDIR_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define CRS_ISR_FECAP          (0xFFFFUL << 16) 
#define CRS_ISR_FECAP_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define CRS_ICR_SYNCOKC          (0x1UL << 0) 
#define CRS_ICR_SYNCOKC_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define CRS_ICR_SYNCWARNC          (0x1UL << 1) 
#define CRS_ICR_SYNCWARNC_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define CRS_ICR_ERRC          (0x1UL << 2) 
#define CRS_ICR_ERRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define CRS_ICR_ESYNCC          (0x1UL << 3) 
#define CRS_ICR_ESYNCC_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)

#define CRS  ((struct CRS*)(0x40008400UL))
struct DAC {
  volatile uint32_t CR;
  volatile uint32_t SWTRGR;
  volatile uint32_t DHR12R1;
  volatile uint32_t DHR12L1;
  volatile uint32_t DHR8R1;
  volatile uint32_t DHR12R2;
  volatile uint32_t DHR12L2;
  volatile uint32_t DHR8R2;
  volatile uint32_t DHR12RD;
  volatile uint32_t DHR12LD;
  volatile uint32_t DHR8RD;
  volatile const uint32_t DOR1;
  volatile const uint32_t DOR2;
  volatile uint32_t SR;
  volatile uint32_t CCR;
  volatile uint32_t MCR;
  volatile uint32_t SHSR1;
  volatile uint32_t SHSR2;
  volatile uint32_t SHHR;
  volatile uint32_t SHRR;
};
#define DAC_CR_EN1          (0x1UL << 0) 
#define DAC_CR_EN1_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define DAC_CR_TEN1          (0x1UL << 1) 
#define DAC_CR_TEN1_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define DAC_CR_TSEL1          (0x7UL << 2) 
#define DAC_CR_TSEL1_VAL(X) (((uint32_t)(X) & 0x7UL) << 2)
#define DAC_CR_WAVE1          (0x3UL << 6) 
#define DAC_CR_WAVE1_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define DAC_CR_MAMP1          (0xFUL << 8) 
#define DAC_CR_MAMP1_VAL(X) (((uint32_t)(X) & 0xFUL) << 8)
#define DAC_CR_DMAEN1          (0x1UL << 12) 
#define DAC_CR_DMAEN1_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define DAC_CR_DMAUDRIE1          (0x1UL << 13) 
#define DAC_CR_DMAUDRIE1_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define DAC_CR_CEN1          (0x1UL << 14) 
#define DAC_CR_CEN1_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define DAC_CR_EN2          (0x1UL << 16) 
#define DAC_CR_EN2_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define DAC_CR_TEN2          (0x1UL << 17) 
#define DAC_CR_TEN2_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define DAC_CR_TSEL2          (0x7UL << 18) 
#define DAC_CR_TSEL2_VAL(X) (((uint32_t)(X) & 0x7UL) << 18)
#define DAC_CR_WAVE2          (0x3UL << 22) 
#define DAC_CR_WAVE2_VAL(X) (((uint32_t)(X) & 0x3UL) << 22)
#define DAC_CR_MAMP2          (0xFUL << 24) 
#define DAC_CR_MAMP2_VAL(X) (((uint32_t)(X) & 0xFUL) << 24)
#define DAC_CR_DMAEN2          (0x1UL << 28) 
#define DAC_CR_DMAEN2_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define DAC_CR_DMAUDRIE2          (0x1UL << 29) 
#define DAC_CR_DMAUDRIE2_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define DAC_CR_CEN2          (0x1UL << 30) 
#define DAC_CR_CEN2_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define DAC_SWTRGR_SWTRIG1          (0x1UL << 0) 
#define DAC_SWTRGR_SWTRIG1_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define DAC_SWTRGR_SWTRIG2          (0x1UL << 1) 
#define DAC_SWTRGR_SWTRIG2_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define DAC_DHR12R1_DACC1DHR          (0xFFFUL << 0) 
#define DAC_DHR12R1_DACC1DHR_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 0)
#define DAC_DHR12L1_DACC1DHR          (0xFFFUL << 4) 
#define DAC_DHR12L1_DACC1DHR_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 4)
#define DAC_DHR8R1_DACC1DHR          (0xFFUL << 0) 
#define DAC_DHR8R1_DACC1DHR_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DAC_DHR12R2_DACC2DHR          (0xFFFUL << 0) 
#define DAC_DHR12R2_DACC2DHR_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 0)
#define DAC_DHR12L2_DACC2DHR          (0xFFFUL << 4) 
#define DAC_DHR12L2_DACC2DHR_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 4)
#define DAC_DHR8R2_DACC2DHR          (0xFFUL << 0) 
#define DAC_DHR8R2_DACC2DHR_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DAC_DHR12RD_DACC1DHR          (0xFFFUL << 0) 
#define DAC_DHR12RD_DACC1DHR_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 0)
#define DAC_DHR12RD_DACC2DHR          (0xFFFUL << 16) 
#define DAC_DHR12RD_DACC2DHR_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 16)
#define DAC_DHR12LD_DACC1DHR          (0xFFFUL << 4) 
#define DAC_DHR12LD_DACC1DHR_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 4)
#define DAC_DHR12LD_DACC2DHR          (0xFFFUL << 20) 
#define DAC_DHR12LD_DACC2DHR_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 20)
#define DAC_DHR8RD_DACC1DHR          (0xFFUL << 0) 
#define DAC_DHR8RD_DACC1DHR_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DAC_DHR8RD_DACC2DHR          (0xFFUL << 8) 
#define DAC_DHR8RD_DACC2DHR_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define DAC_DOR1_DACC1DOR          (0xFFFUL << 0) 
#define DAC_DOR1_DACC1DOR_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 0)
#define DAC_DOR2_DACC2DOR          (0xFFFUL << 0) 
#define DAC_DOR2_DACC2DOR_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 0)
#define DAC_SR_DMAUDR1          (0x1UL << 13) 
#define DAC_SR_DMAUDR1_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define DAC_SR_CAL_FLAG1          (0x1UL << 14) 
#define DAC_SR_CAL_FLAG1_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define DAC_SR_BWST1          (0x1UL << 15) 
#define DAC_SR_BWST1_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define DAC_SR_DMAUDR2          (0x1UL << 29) 
#define DAC_SR_DMAUDR2_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define DAC_SR_CAL_FLAG2          (0x1UL << 30) 
#define DAC_SR_CAL_FLAG2_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define DAC_SR_BWST2          (0x1UL << 31) 
#define DAC_SR_BWST2_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define DAC_CCR_OTRIM1          (0x1FUL << 0) 
#define DAC_CCR_OTRIM1_VAL(X) (((uint32_t)(X) & 0x1FUL) << 0)
#define DAC_CCR_OTRIM2          (0x1FUL << 16) 
#define DAC_CCR_OTRIM2_VAL(X) (((uint32_t)(X) & 0x1FUL) << 16)
#define DAC_MCR_MODE1          (0x7UL << 0) 
#define DAC_MCR_MODE1_VAL(X) (((uint32_t)(X) & 0x7UL) << 0)
#define DAC_MCR_MODE2          (0x7UL << 16) 
#define DAC_MCR_MODE2_VAL(X) (((uint32_t)(X) & 0x7UL) << 16)
#define DAC_SHSR1_TSAMPLE1          (0x3FFUL << 0) 
#define DAC_SHSR1_TSAMPLE1_VAL(X) (((uint32_t)(X) & 0x3FFUL) << 0)
#define DAC_SHSR2_TSAMPLE2          (0x3FFUL << 0) 
#define DAC_SHSR2_TSAMPLE2_VAL(X) (((uint32_t)(X) & 0x3FFUL) << 0)
#define DAC_SHHR_THOLD1          (0x3FFUL << 0) 
#define DAC_SHHR_THOLD1_VAL(X) (((uint32_t)(X) & 0x3FFUL) << 0)
#define DAC_SHHR_THOLD2          (0x3FFUL << 16) 
#define DAC_SHHR_THOLD2_VAL(X) (((uint32_t)(X) & 0x3FFUL) << 16)
#define DAC_SHRR_TREFRESH1          (0xFFUL << 0) 
#define DAC_SHRR_TREFRESH1_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DAC_SHRR_TREFRESH2          (0xFFUL << 16) 
#define DAC_SHRR_TREFRESH2_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)

#define DAC  ((struct DAC*)(0x40007400UL))
struct BDMA {
  volatile const uint32_t ISR;
  volatile uint32_t IFCR;
  volatile uint32_t CCR1;
  volatile uint32_t CNDTR1;
  volatile uint32_t CPAR1;
  volatile uint32_t CMAR1;
  const volatile uint32_t RESERVED28[1];
  volatile uint32_t CCR2;
  volatile uint32_t CNDTR2;
  volatile uint32_t CPAR2;
  volatile uint32_t CMAR2;
  const volatile uint32_t RESERVED48[1];
  volatile uint32_t CCR3;
  volatile uint32_t CNDTR3;
  volatile uint32_t CPAR3;
  volatile uint32_t CMAR3;
  const volatile uint32_t RESERVED68[1];
  volatile uint32_t CCR4;
  volatile uint32_t CNDTR4;
  volatile uint32_t CPAR4;
  volatile uint32_t CMAR4;
  const volatile uint32_t RESERVED88[1];
  volatile uint32_t CCR5;
  volatile uint32_t CNDTR5;
  volatile uint32_t CPAR5;
  volatile uint32_t CMAR5;
  const volatile uint32_t RESERVED108[1];
  volatile uint32_t CCR6;
  volatile uint32_t CNDTR6;
  volatile uint32_t CPAR6;
  volatile uint32_t CMAR6;
  const volatile uint32_t RESERVED128[1];
  volatile uint32_t CCR7;
  volatile uint32_t CNDTR7;
  volatile uint32_t CPAR7;
  volatile uint32_t CMAR7;
  const volatile uint32_t RESERVED148[1];
  volatile uint32_t CCR8;
  volatile uint32_t CNDTR8;
  volatile uint32_t CPAR8;
  volatile uint32_t CMAR8;
};
