via/viaems/src/platforms/stm32h743/device.h
#define BDMA_ISR_GIF1          (0x1UL << 0) 
#define BDMA_ISR_GIF1_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define BDMA_ISR_TCIF1          (0x1UL << 1) 
#define BDMA_ISR_TCIF1_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define BDMA_ISR_HTIF1          (0x1UL << 2) 
#define BDMA_ISR_HTIF1_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define BDMA_ISR_TEIF1          (0x1UL << 3) 
#define BDMA_ISR_TEIF1_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define BDMA_ISR_GIF2          (0x1UL << 4) 
#define BDMA_ISR_GIF2_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define BDMA_ISR_TCIF2          (0x1UL << 5) 
#define BDMA_ISR_TCIF2_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define BDMA_ISR_HTIF2          (0x1UL << 6) 
#define BDMA_ISR_HTIF2_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define BDMA_ISR_TEIF2          (0x1UL << 7) 
#define BDMA_ISR_TEIF2_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define BDMA_ISR_GIF3          (0x1UL << 8) 
#define BDMA_ISR_GIF3_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define BDMA_ISR_TCIF3          (0x1UL << 9) 
#define BDMA_ISR_TCIF3_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define BDMA_ISR_HTIF3          (0x1UL << 10) 
#define BDMA_ISR_HTIF3_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define BDMA_ISR_TEIF3          (0x1UL << 11) 
#define BDMA_ISR_TEIF3_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define BDMA_ISR_GIF4          (0x1UL << 12) 
#define BDMA_ISR_GIF4_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define BDMA_ISR_TCIF4          (0x1UL << 13) 
#define BDMA_ISR_TCIF4_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define BDMA_ISR_HTIF4          (0x1UL << 14) 
#define BDMA_ISR_HTIF4_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define BDMA_ISR_TEIF4          (0x1UL << 15) 
#define BDMA_ISR_TEIF4_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define BDMA_ISR_GIF5          (0x1UL << 16) 
#define BDMA_ISR_GIF5_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define BDMA_ISR_TCIF5          (0x1UL << 17) 
#define BDMA_ISR_TCIF5_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define BDMA_ISR_HTIF5          (0x1UL << 18) 
#define BDMA_ISR_HTIF5_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define BDMA_ISR_TEIF5          (0x1UL << 19) 
#define BDMA_ISR_TEIF5_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define BDMA_ISR_GIF6          (0x1UL << 20) 
#define BDMA_ISR_GIF6_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define BDMA_ISR_TCIF6          (0x1UL << 21) 
#define BDMA_ISR_TCIF6_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define BDMA_ISR_HTIF6          (0x1UL << 22) 
#define BDMA_ISR_HTIF6_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define BDMA_ISR_TEIF6          (0x1UL << 23) 
#define BDMA_ISR_TEIF6_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define BDMA_ISR_GIF7          (0x1UL << 24) 
#define BDMA_ISR_GIF7_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define BDMA_ISR_TCIF7          (0x1UL << 25) 
#define BDMA_ISR_TCIF7_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define BDMA_ISR_HTIF7          (0x1UL << 26) 
#define BDMA_ISR_HTIF7_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define BDMA_ISR_TEIF7          (0x1UL << 27) 
#define BDMA_ISR_TEIF7_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define BDMA_ISR_GIF8          (0x1UL << 28) 
#define BDMA_ISR_GIF8_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define BDMA_ISR_TCIF8          (0x1UL << 29) 
#define BDMA_ISR_TCIF8_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define BDMA_ISR_HTIF8          (0x1UL << 30) 
#define BDMA_ISR_HTIF8_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define BDMA_ISR_TEIF8          (0x1UL << 31) 
#define BDMA_ISR_TEIF8_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define BDMA_IFCR_CGIF1          (0x1UL << 0) 
#define BDMA_IFCR_CGIF1_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define BDMA_IFCR_CTCIF1          (0x1UL << 1) 
#define BDMA_IFCR_CTCIF1_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define BDMA_IFCR_CHTIF1          (0x1UL << 2) 
#define BDMA_IFCR_CHTIF1_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define BDMA_IFCR_CTEIF1          (0x1UL << 3) 
#define BDMA_IFCR_CTEIF1_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define BDMA_IFCR_CGIF2          (0x1UL << 4) 
#define BDMA_IFCR_CGIF2_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define BDMA_IFCR_CTCIF2          (0x1UL << 5) 
#define BDMA_IFCR_CTCIF2_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define BDMA_IFCR_CHTIF2          (0x1UL << 6) 
#define BDMA_IFCR_CHTIF2_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define BDMA_IFCR_CTEIF2          (0x1UL << 7) 
#define BDMA_IFCR_CTEIF2_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define BDMA_IFCR_CGIF3          (0x1UL << 8) 
#define BDMA_IFCR_CGIF3_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define BDMA_IFCR_CTCIF3          (0x1UL << 9) 
#define BDMA_IFCR_CTCIF3_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define BDMA_IFCR_CHTIF3          (0x1UL << 10) 
#define BDMA_IFCR_CHTIF3_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define BDMA_IFCR_CTEIF3          (0x1UL << 11) 
#define BDMA_IFCR_CTEIF3_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define BDMA_IFCR_CGIF4          (0x1UL << 12) 
#define BDMA_IFCR_CGIF4_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define BDMA_IFCR_CTCIF4          (0x1UL << 13) 
#define BDMA_IFCR_CTCIF4_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define BDMA_IFCR_CHTIF4          (0x1UL << 14) 
#define BDMA_IFCR_CHTIF4_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define BDMA_IFCR_CTEIF4          (0x1UL << 15) 
#define BDMA_IFCR_CTEIF4_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define BDMA_IFCR_CGIF5          (0x1UL << 16) 
#define BDMA_IFCR_CGIF5_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define BDMA_IFCR_CTCIF5          (0x1UL << 17) 
#define BDMA_IFCR_CTCIF5_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define BDMA_IFCR_CHTIF5          (0x1UL << 18) 
#define BDMA_IFCR_CHTIF5_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define BDMA_IFCR_CTEIF5          (0x1UL << 19) 
#define BDMA_IFCR_CTEIF5_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define BDMA_IFCR_CGIF6          (0x1UL << 20) 
#define BDMA_IFCR_CGIF6_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define BDMA_IFCR_CTCIF6          (0x1UL << 21) 
#define BDMA_IFCR_CTCIF6_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define BDMA_IFCR_CHTIF6          (0x1UL << 22) 
#define BDMA_IFCR_CHTIF6_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define BDMA_IFCR_CTEIF6          (0x1UL << 23) 
#define BDMA_IFCR_CTEIF6_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define BDMA_IFCR_CGIF7          (0x1UL << 24) 
#define BDMA_IFCR_CGIF7_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define BDMA_IFCR_CTCIF7          (0x1UL << 25) 
#define BDMA_IFCR_CTCIF7_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define BDMA_IFCR_CHTIF7          (0x1UL << 26) 
#define BDMA_IFCR_CHTIF7_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define BDMA_IFCR_CTEIF7          (0x1UL << 27) 
#define BDMA_IFCR_CTEIF7_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define BDMA_IFCR_CGIF8          (0x1UL << 28) 
#define BDMA_IFCR_CGIF8_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define BDMA_IFCR_CTCIF8          (0x1UL << 29) 
#define BDMA_IFCR_CTCIF8_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define BDMA_IFCR_CHTIF8          (0x1UL << 30) 
#define BDMA_IFCR_CHTIF8_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define BDMA_IFCR_CTEIF8          (0x1UL << 31) 
#define BDMA_IFCR_CTEIF8_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define BDMA_CCR1_EN          (0x1UL << 0) 
#define BDMA_CCR1_EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define BDMA_CCR1_TCIE          (0x1UL << 1) 
#define BDMA_CCR1_TCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define BDMA_CCR1_HTIE          (0x1UL << 2) 
#define BDMA_CCR1_HTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define BDMA_CCR1_TEIE          (0x1UL << 3) 
#define BDMA_CCR1_TEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define BDMA_CCR1_DIR          (0x1UL << 4) 
#define BDMA_CCR1_DIR_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define BDMA_CCR1_CIRC          (0x1UL << 5) 
#define BDMA_CCR1_CIRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define BDMA_CCR1_PINC          (0x1UL << 6) 
#define BDMA_CCR1_PINC_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define BDMA_CCR1_MINC          (0x1UL << 7) 
#define BDMA_CCR1_MINC_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define BDMA_CCR1_PSIZE          (0x3UL << 8) 
#define BDMA_CCR1_PSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define BDMA_CCR1_MSIZE          (0x3UL << 10) 
#define BDMA_CCR1_MSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 10)
#define BDMA_CCR1_PL          (0x3UL << 12) 
#define BDMA_CCR1_PL_VAL(X) (((uint32_t)(X) & 0x3UL) << 12)
#define BDMA_CCR1_MEM2MEM          (0x1UL << 14) 
#define BDMA_CCR1_MEM2MEM_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define BDMA_CNDTR1_NDT          (0xFFFFUL << 0) 
#define BDMA_CNDTR1_NDT_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define BDMA_CPAR1_PA          (0xFFFFFFFFUL << 0) 
#define BDMA_CPAR1_PA_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define BDMA_CMAR1_MA          (0xFFFFFFFFUL << 0) 
#define BDMA_CMAR1_MA_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define BDMA_CCR2_EN          (0x1UL << 0) 
#define BDMA_CCR2_EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define BDMA_CCR2_TCIE          (0x1UL << 1) 
#define BDMA_CCR2_TCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define BDMA_CCR2_HTIE          (0x1UL << 2) 
#define BDMA_CCR2_HTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define BDMA_CCR2_TEIE          (0x1UL << 3) 
#define BDMA_CCR2_TEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define BDMA_CCR2_DIR          (0x1UL << 4) 
#define BDMA_CCR2_DIR_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define BDMA_CCR2_CIRC          (0x1UL << 5) 
#define BDMA_CCR2_CIRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define BDMA_CCR2_PINC          (0x1UL << 6) 
#define BDMA_CCR2_PINC_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define BDMA_CCR2_MINC          (0x1UL << 7) 
#define BDMA_CCR2_MINC_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define BDMA_CCR2_PSIZE          (0x3UL << 8) 
#define BDMA_CCR2_PSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define BDMA_CCR2_MSIZE          (0x3UL << 10) 
#define BDMA_CCR2_MSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 10)
#define BDMA_CCR2_PL          (0x3UL << 12) 
#define BDMA_CCR2_PL_VAL(X) (((uint32_t)(X) & 0x3UL) << 12)
#define BDMA_CCR2_MEM2MEM          (0x1UL << 14) 
#define BDMA_CCR2_MEM2MEM_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define BDMA_CNDTR2_NDT          (0xFFFFUL << 0) 
#define BDMA_CNDTR2_NDT_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define BDMA_CPAR2_PA          (0xFFFFFFFFUL << 0) 
#define BDMA_CPAR2_PA_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define BDMA_CMAR2_MA          (0xFFFFFFFFUL << 0) 
#define BDMA_CMAR2_MA_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define BDMA_CCR3_EN          (0x1UL << 0) 
#define BDMA_CCR3_EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define BDMA_CCR3_TCIE          (0x1UL << 1) 
#define BDMA_CCR3_TCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define BDMA_CCR3_HTIE          (0x1UL << 2) 
#define BDMA_CCR3_HTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define BDMA_CCR3_TEIE          (0x1UL << 3) 
#define BDMA_CCR3_TEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define BDMA_CCR3_DIR          (0x1UL << 4) 
#define BDMA_CCR3_DIR_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define BDMA_CCR3_CIRC          (0x1UL << 5) 
#define BDMA_CCR3_CIRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define BDMA_CCR3_PINC          (0x1UL << 6) 
#define BDMA_CCR3_PINC_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define BDMA_CCR3_MINC          (0x1UL << 7) 
#define BDMA_CCR3_MINC_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define BDMA_CCR3_PSIZE          (0x3UL << 8) 
#define BDMA_CCR3_PSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define BDMA_CCR3_MSIZE          (0x3UL << 10) 
#define BDMA_CCR3_MSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 10)
#define BDMA_CCR3_PL          (0x3UL << 12) 
#define BDMA_CCR3_PL_VAL(X) (((uint32_t)(X) & 0x3UL) << 12)
#define BDMA_CCR3_MEM2MEM          (0x1UL << 14) 
#define BDMA_CCR3_MEM2MEM_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define BDMA_CNDTR3_NDT          (0xFFFFUL << 0) 
#define BDMA_CNDTR3_NDT_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define BDMA_CPAR3_PA          (0xFFFFFFFFUL << 0) 
#define BDMA_CPAR3_PA_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define BDMA_CMAR3_MA          (0xFFFFFFFFUL << 0) 
#define BDMA_CMAR3_MA_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define BDMA_CCR4_EN          (0x1UL << 0) 
#define BDMA_CCR4_EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define BDMA_CCR4_TCIE          (0x1UL << 1) 
#define BDMA_CCR4_TCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define BDMA_CCR4_HTIE          (0x1UL << 2) 
#define BDMA_CCR4_HTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define BDMA_CCR4_TEIE          (0x1UL << 3) 
#define BDMA_CCR4_TEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define BDMA_CCR4_DIR          (0x1UL << 4) 
#define BDMA_CCR4_DIR_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define BDMA_CCR4_CIRC          (0x1UL << 5) 
#define BDMA_CCR4_CIRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define BDMA_CCR4_PINC          (0x1UL << 6) 
#define BDMA_CCR4_PINC_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define BDMA_CCR4_MINC          (0x1UL << 7) 
#define BDMA_CCR4_MINC_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define BDMA_CCR4_PSIZE          (0x3UL << 8) 
#define BDMA_CCR4_PSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define BDMA_CCR4_MSIZE          (0x3UL << 10) 
#define BDMA_CCR4_MSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 10)
#define BDMA_CCR4_PL          (0x3UL << 12) 
#define BDMA_CCR4_PL_VAL(X) (((uint32_t)(X) & 0x3UL) << 12)
#define BDMA_CCR4_MEM2MEM          (0x1UL << 14) 
#define BDMA_CCR4_MEM2MEM_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define BDMA_CNDTR4_NDT          (0xFFFFUL << 0) 
#define BDMA_CNDTR4_NDT_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define BDMA_CPAR4_PA          (0xFFFFFFFFUL << 0) 
#define BDMA_CPAR4_PA_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define BDMA_CMAR4_MA          (0xFFFFFFFFUL << 0) 
#define BDMA_CMAR4_MA_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define BDMA_CCR5_EN          (0x1UL << 0) 
#define BDMA_CCR5_EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define BDMA_CCR5_TCIE          (0x1UL << 1) 
#define BDMA_CCR5_TCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define BDMA_CCR5_HTIE          (0x1UL << 2) 
#define BDMA_CCR5_HTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define BDMA_CCR5_TEIE          (0x1UL << 3) 
#define BDMA_CCR5_TEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define BDMA_CCR5_DIR          (0x1UL << 4) 
#define BDMA_CCR5_DIR_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define BDMA_CCR5_CIRC          (0x1UL << 5) 
#define BDMA_CCR5_CIRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define BDMA_CCR5_PINC          (0x1UL << 6) 
#define BDMA_CCR5_PINC_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define BDMA_CCR5_MINC          (0x1UL << 7) 
#define BDMA_CCR5_MINC_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define BDMA_CCR5_PSIZE          (0x3UL << 8) 
#define BDMA_CCR5_PSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define BDMA_CCR5_MSIZE          (0x3UL << 10) 
#define BDMA_CCR5_MSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 10)
#define BDMA_CCR5_PL          (0x3UL << 12) 
#define BDMA_CCR5_PL_VAL(X) (((uint32_t)(X) & 0x3UL) << 12)
#define BDMA_CCR5_MEM2MEM          (0x1UL << 14) 
#define BDMA_CCR5_MEM2MEM_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define BDMA_CNDTR5_NDT          (0xFFFFUL << 0) 
#define BDMA_CNDTR5_NDT_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define BDMA_CPAR5_PA          (0xFFFFFFFFUL << 0) 
#define BDMA_CPAR5_PA_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define BDMA_CMAR5_MA          (0xFFFFFFFFUL << 0) 
#define BDMA_CMAR5_MA_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define BDMA_CCR6_EN          (0x1UL << 0) 
#define BDMA_CCR6_EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define BDMA_CCR6_TCIE          (0x1UL << 1) 
#define BDMA_CCR6_TCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define BDMA_CCR6_HTIE          (0x1UL << 2) 
#define BDMA_CCR6_HTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define BDMA_CCR6_TEIE          (0x1UL << 3) 
#define BDMA_CCR6_TEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define BDMA_CCR6_DIR          (0x1UL << 4) 
#define BDMA_CCR6_DIR_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define BDMA_CCR6_CIRC          (0x1UL << 5) 
#define BDMA_CCR6_CIRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define BDMA_CCR6_PINC          (0x1UL << 6) 
#define BDMA_CCR6_PINC_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define BDMA_CCR6_MINC          (0x1UL << 7) 
#define BDMA_CCR6_MINC_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define BDMA_CCR6_PSIZE          (0x3UL << 8) 
#define BDMA_CCR6_PSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define BDMA_CCR6_MSIZE          (0x3UL << 10) 
#define BDMA_CCR6_MSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 10)
#define BDMA_CCR6_PL          (0x3UL << 12) 
#define BDMA_CCR6_PL_VAL(X) (((uint32_t)(X) & 0x3UL) << 12)
#define BDMA_CCR6_MEM2MEM          (0x1UL << 14) 
#define BDMA_CCR6_MEM2MEM_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define BDMA_CNDTR6_NDT          (0xFFFFUL << 0) 
#define BDMA_CNDTR6_NDT_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define BDMA_CPAR6_PA          (0xFFFFFFFFUL << 0) 
#define BDMA_CPAR6_PA_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define BDMA_CMAR6_MA          (0xFFFFFFFFUL << 0) 
#define BDMA_CMAR6_MA_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define BDMA_CCR7_EN          (0x1UL << 0) 
#define BDMA_CCR7_EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define BDMA_CCR7_TCIE          (0x1UL << 1) 
#define BDMA_CCR7_TCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define BDMA_CCR7_HTIE          (0x1UL << 2) 
#define BDMA_CCR7_HTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define BDMA_CCR7_TEIE          (0x1UL << 3) 
#define BDMA_CCR7_TEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define BDMA_CCR7_DIR          (0x1UL << 4) 
#define BDMA_CCR7_DIR_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define BDMA_CCR7_CIRC          (0x1UL << 5) 
#define BDMA_CCR7_CIRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define BDMA_CCR7_PINC          (0x1UL << 6) 
#define BDMA_CCR7_PINC_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define BDMA_CCR7_MINC          (0x1UL << 7) 
#define BDMA_CCR7_MINC_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define BDMA_CCR7_PSIZE          (0x3UL << 8) 
#define BDMA_CCR7_PSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define BDMA_CCR7_MSIZE          (0x3UL << 10) 
#define BDMA_CCR7_MSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 10)
#define BDMA_CCR7_PL          (0x3UL << 12) 
#define BDMA_CCR7_PL_VAL(X) (((uint32_t)(X) & 0x3UL) << 12)
#define BDMA_CCR7_MEM2MEM          (0x1UL << 14) 
#define BDMA_CCR7_MEM2MEM_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define BDMA_CNDTR7_NDT          (0xFFFFUL << 0) 
#define BDMA_CNDTR7_NDT_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define BDMA_CPAR7_PA          (0xFFFFFFFFUL << 0) 
#define BDMA_CPAR7_PA_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define BDMA_CMAR7_MA          (0xFFFFFFFFUL << 0) 
#define BDMA_CMAR7_MA_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define BDMA_CCR8_EN          (0x1UL << 0) 
#define BDMA_CCR8_EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define BDMA_CCR8_TCIE          (0x1UL << 1) 
#define BDMA_CCR8_TCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define BDMA_CCR8_HTIE          (0x1UL << 2) 
#define BDMA_CCR8_HTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define BDMA_CCR8_TEIE          (0x1UL << 3) 
#define BDMA_CCR8_TEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define BDMA_CCR8_DIR          (0x1UL << 4) 
#define BDMA_CCR8_DIR_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define BDMA_CCR8_CIRC          (0x1UL << 5) 
#define BDMA_CCR8_CIRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define BDMA_CCR8_PINC          (0x1UL << 6) 
#define BDMA_CCR8_PINC_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define BDMA_CCR8_MINC          (0x1UL << 7) 
#define BDMA_CCR8_MINC_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define BDMA_CCR8_PSIZE          (0x3UL << 8) 
#define BDMA_CCR8_PSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define BDMA_CCR8_MSIZE          (0x3UL << 10) 
#define BDMA_CCR8_MSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 10)
#define BDMA_CCR8_PL          (0x3UL << 12) 
#define BDMA_CCR8_PL_VAL(X) (((uint32_t)(X) & 0x3UL) << 12)
#define BDMA_CCR8_MEM2MEM          (0x1UL << 14) 
#define BDMA_CCR8_MEM2MEM_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define BDMA_CNDTR8_NDT          (0xFFFFUL << 0) 
#define BDMA_CNDTR8_NDT_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define BDMA_CPAR8_PA          (0xFFFFFFFFUL << 0) 
#define BDMA_CPAR8_PA_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define BDMA_CMAR8_MA          (0xFFFFFFFFUL << 0) 
#define BDMA_CMAR8_MA_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)

