via/viaems/src/platforms/stm32h743/device.h
#define BDMA  ((struct BDMA*)(0x58025400UL))
struct DMA2D {
  volatile uint32_t CR;
  volatile const uint32_t ISR;
  volatile uint32_t IFCR;
  volatile uint32_t FGMAR;
  volatile uint32_t FGOR;
  volatile uint32_t BGMAR;
  volatile uint32_t BGOR;
  volatile uint32_t FGPFCCR;
  volatile uint32_t FGCOLR;
  volatile uint32_t BGPFCCR;
  volatile uint32_t BGCOLR;
  volatile uint32_t FGCMAR;
  volatile uint32_t BGCMAR;
  volatile uint32_t OPFCCR;
  volatile uint32_t OCOLR;
  volatile uint32_t OMAR;
  volatile uint32_t OOR;
  volatile uint32_t NLR;
  volatile uint32_t LWR;
  volatile uint32_t AMTCR;
};
#define DMA2D_CR_START          (0x1UL << 0) 
#define DMA2D_CR_START_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define DMA2D_CR_SUSP          (0x1UL << 1) 
#define DMA2D_CR_SUSP_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define DMA2D_CR_ABORT          (0x1UL << 2) 
#define DMA2D_CR_ABORT_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define DMA2D_CR_TEIE          (0x1UL << 8) 
#define DMA2D_CR_TEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DMA2D_CR_TCIE          (0x1UL << 9) 
#define DMA2D_CR_TCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define DMA2D_CR_TWIE          (0x1UL << 10) 
#define DMA2D_CR_TWIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define DMA2D_CR_CAEIE          (0x1UL << 11) 
#define DMA2D_CR_CAEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define DMA2D_CR_CTCIE          (0x1UL << 12) 
#define DMA2D_CR_CTCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define DMA2D_CR_CEIE          (0x1UL << 13) 
#define DMA2D_CR_CEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define DMA2D_CR_MODE          (0x3UL << 16) 
#define DMA2D_CR_MODE_VAL(X) (((uint32_t)(X) & 0x3UL) << 16)
#define DMA2D_ISR_TEIF          (0x1UL << 0) 
#define DMA2D_ISR_TEIF_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define DMA2D_ISR_TCIF          (0x1UL << 1) 
#define DMA2D_ISR_TCIF_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define DMA2D_ISR_TWIF          (0x1UL << 2) 
#define DMA2D_ISR_TWIF_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define DMA2D_ISR_CAEIF          (0x1UL << 3) 
#define DMA2D_ISR_CAEIF_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define DMA2D_ISR_CTCIF          (0x1UL << 4) 
#define DMA2D_ISR_CTCIF_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define DMA2D_ISR_CEIF          (0x1UL << 5) 
#define DMA2D_ISR_CEIF_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define DMA2D_IFCR_CTEIF          (0x1UL << 0) 
#define DMA2D_IFCR_CTEIF_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define DMA2D_IFCR_CTCIF          (0x1UL << 1) 
#define DMA2D_IFCR_CTCIF_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define DMA2D_IFCR_CTWIF          (0x1UL << 2) 
#define DMA2D_IFCR_CTWIF_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define DMA2D_IFCR_CAECIF          (0x1UL << 3) 
#define DMA2D_IFCR_CAECIF_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define DMA2D_IFCR_CCTCIF          (0x1UL << 4) 
#define DMA2D_IFCR_CCTCIF_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define DMA2D_IFCR_CCEIF          (0x1UL << 5) 
#define DMA2D_IFCR_CCEIF_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define DMA2D_FGMAR_MA          (0xFFFFFFFFUL << 0) 
#define DMA2D_FGMAR_MA_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define DMA2D_FGOR_LO          (0x3FFFUL << 0) 
#define DMA2D_FGOR_LO_VAL(X) (((uint32_t)(X) & 0x3FFFUL) << 0)
#define DMA2D_BGMAR_MA          (0xFFFFFFFFUL << 0) 
#define DMA2D_BGMAR_MA_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define DMA2D_BGOR_LO          (0x3FFFUL << 0) 
#define DMA2D_BGOR_LO_VAL(X) (((uint32_t)(X) & 0x3FFFUL) << 0)
#define DMA2D_FGPFCCR_CM          (0xFUL << 0) 
#define DMA2D_FGPFCCR_CM_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define DMA2D_FGPFCCR_CCM          (0x1UL << 4) 
#define DMA2D_FGPFCCR_CCM_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define DMA2D_FGPFCCR_START          (0x1UL << 5) 
#define DMA2D_FGPFCCR_START_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define DMA2D_FGPFCCR_CS          (0xFFUL << 8) 
#define DMA2D_FGPFCCR_CS_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define DMA2D_FGPFCCR_AM          (0x3UL << 16) 
#define DMA2D_FGPFCCR_AM_VAL(X) (((uint32_t)(X) & 0x3UL) << 16)
#define DMA2D_FGPFCCR_CSS          (0x3UL << 18) 
#define DMA2D_FGPFCCR_CSS_VAL(X) (((uint32_t)(X) & 0x3UL) << 18)
#define DMA2D_FGPFCCR_AI          (0x1UL << 20) 
#define DMA2D_FGPFCCR_AI_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define DMA2D_FGPFCCR_RBS          (0x1UL << 21) 
#define DMA2D_FGPFCCR_RBS_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define DMA2D_FGPFCCR_ALPHA          (0xFFUL << 24) 
#define DMA2D_FGPFCCR_ALPHA_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define DMA2D_FGCOLR_BLUE          (0xFFUL << 0) 
#define DMA2D_FGCOLR_BLUE_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DMA2D_FGCOLR_GREEN          (0xFFUL << 8) 
#define DMA2D_FGCOLR_GREEN_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define DMA2D_FGCOLR_RED          (0xFFUL << 16) 
#define DMA2D_FGCOLR_RED_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define DMA2D_BGPFCCR_CM          (0xFUL << 0) 
#define DMA2D_BGPFCCR_CM_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define DMA2D_BGPFCCR_CCM          (0x1UL << 4) 
#define DMA2D_BGPFCCR_CCM_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define DMA2D_BGPFCCR_START          (0x1UL << 5) 
#define DMA2D_BGPFCCR_START_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define DMA2D_BGPFCCR_CS          (0xFFUL << 8) 
#define DMA2D_BGPFCCR_CS_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define DMA2D_BGPFCCR_AM          (0x3UL << 16) 
#define DMA2D_BGPFCCR_AM_VAL(X) (((uint32_t)(X) & 0x3UL) << 16)
#define DMA2D_BGPFCCR_AI          (0x1UL << 20) 
#define DMA2D_BGPFCCR_AI_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define DMA2D_BGPFCCR_RBS          (0x1UL << 21) 
#define DMA2D_BGPFCCR_RBS_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define DMA2D_BGPFCCR_ALPHA          (0xFFUL << 24) 
#define DMA2D_BGPFCCR_ALPHA_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define DMA2D_BGCOLR_BLUE          (0xFFUL << 0) 
#define DMA2D_BGCOLR_BLUE_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DMA2D_BGCOLR_GREEN          (0xFFUL << 8) 
#define DMA2D_BGCOLR_GREEN_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define DMA2D_BGCOLR_RED          (0xFFUL << 16) 
#define DMA2D_BGCOLR_RED_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define DMA2D_FGCMAR_MA          (0xFFFFFFFFUL << 0) 
#define DMA2D_FGCMAR_MA_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define DMA2D_BGCMAR_MA          (0xFFFFFFFFUL << 0) 
#define DMA2D_BGCMAR_MA_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define DMA2D_OPFCCR_CM          (0x7UL << 0) 
#define DMA2D_OPFCCR_CM_VAL(X) (((uint32_t)(X) & 0x7UL) << 0)
#define DMA2D_OPFCCR_AI          (0x1UL << 20) 
#define DMA2D_OPFCCR_AI_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define DMA2D_OPFCCR_RBS          (0x1UL << 21) 
#define DMA2D_OPFCCR_RBS_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define DMA2D_OCOLR_BLUE          (0xFFUL << 0) 
#define DMA2D_OCOLR_BLUE_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DMA2D_OCOLR_GREEN          (0xFFUL << 8) 
#define DMA2D_OCOLR_GREEN_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define DMA2D_OCOLR_RED          (0xFFUL << 16) 
#define DMA2D_OCOLR_RED_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define DMA2D_OCOLR_ALPHA          (0xFFUL << 24) 
#define DMA2D_OCOLR_ALPHA_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define DMA2D_OMAR_MA          (0xFFFFFFFFUL << 0) 
#define DMA2D_OMAR_MA_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define DMA2D_OOR_LO          (0x3FFFUL << 0) 
#define DMA2D_OOR_LO_VAL(X) (((uint32_t)(X) & 0x3FFFUL) << 0)
#define DMA2D_NLR_NL          (0xFFFFUL << 0) 
#define DMA2D_NLR_NL_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define DMA2D_NLR_PL          (0x3FFFUL << 16) 
#define DMA2D_NLR_PL_VAL(X) (((uint32_t)(X) & 0x3FFFUL) << 16)
#define DMA2D_LWR_LW          (0xFFFFUL << 0) 
#define DMA2D_LWR_LW_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define DMA2D_AMTCR_EN          (0x1UL << 0) 
#define DMA2D_AMTCR_EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define DMA2D_AMTCR_DT          (0xFFUL << 8) 
#define DMA2D_AMTCR_DT_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)

