via/viaems/src/platforms/stm32h743/device.h
#define DMA2D  ((struct DMA2D*)(0x52001000UL))
struct DMAMUX2 {
  volatile uint32_t C0CR;
  volatile uint32_t C1CR;
  volatile uint32_t C2CR;
  volatile uint32_t C3CR;
  volatile uint32_t C4CR;
  volatile uint32_t C5CR;
  volatile uint32_t C6CR;
  volatile uint32_t C7CR;
  const volatile uint32_t RESERVED128[24];
  volatile const uint32_t CSR;
  volatile uint32_t CFR;
  const volatile uint32_t RESERVED256[30];
  volatile uint32_t RG0CR;
  volatile uint32_t RG1CR;
  volatile uint32_t RG2CR;
  volatile uint32_t RG3CR;
  volatile uint32_t RG4CR;
  volatile uint32_t RG5CR;
  volatile uint32_t RG6CR;
  volatile uint32_t RG7CR;
  const volatile uint32_t RESERVED320[8];
  volatile const uint32_t RGSR;
  volatile uint32_t RGCFR;
};
#define DMAMUX2_C0CR_DMAREQ_ID          (0xFFUL << 0) 
#define DMAMUX2_C0CR_DMAREQ_ID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DMAMUX2_C0CR_SOIE          (0x1UL << 8) 
#define DMAMUX2_C0CR_SOIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DMAMUX2_C0CR_EGE          (0x1UL << 9) 
#define DMAMUX2_C0CR_EGE_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define DMAMUX2_C0CR_SE          (0x1UL << 16) 
#define DMAMUX2_C0CR_SE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define DMAMUX2_C0CR_SPOL          (0x3UL << 17) 
#define DMAMUX2_C0CR_SPOL_VAL(X) (((uint32_t)(X) & 0x3UL) << 17)
#define DMAMUX2_C0CR_NBREQ          (0x1FUL << 19) 
#define DMAMUX2_C0CR_NBREQ_VAL(X) (((uint32_t)(X) & 0x1FUL) << 19)
#define DMAMUX2_C0CR_SYNC_ID          (0x1FUL << 24) 
#define DMAMUX2_C0CR_SYNC_ID_VAL(X) (((uint32_t)(X) & 0x1FUL) << 24)
#define DMAMUX2_C1CR_DMAREQ_ID          (0xFFUL << 0) 
#define DMAMUX2_C1CR_DMAREQ_ID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DMAMUX2_C1CR_SOIE          (0x1UL << 8) 
#define DMAMUX2_C1CR_SOIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DMAMUX2_C1CR_EGE          (0x1UL << 9) 
#define DMAMUX2_C1CR_EGE_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define DMAMUX2_C1CR_SE          (0x1UL << 16) 
#define DMAMUX2_C1CR_SE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define DMAMUX2_C1CR_SPOL          (0x3UL << 17) 
#define DMAMUX2_C1CR_SPOL_VAL(X) (((uint32_t)(X) & 0x3UL) << 17)
#define DMAMUX2_C1CR_NBREQ          (0x1FUL << 19) 
#define DMAMUX2_C1CR_NBREQ_VAL(X) (((uint32_t)(X) & 0x1FUL) << 19)
#define DMAMUX2_C1CR_SYNC_ID          (0x1FUL << 24) 
#define DMAMUX2_C1CR_SYNC_ID_VAL(X) (((uint32_t)(X) & 0x1FUL) << 24)
#define DMAMUX2_C2CR_DMAREQ_ID          (0xFFUL << 0) 
#define DMAMUX2_C2CR_DMAREQ_ID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DMAMUX2_C2CR_SOIE          (0x1UL << 8) 
#define DMAMUX2_C2CR_SOIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DMAMUX2_C2CR_EGE          (0x1UL << 9) 
#define DMAMUX2_C2CR_EGE_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define DMAMUX2_C2CR_SE          (0x1UL << 16) 
#define DMAMUX2_C2CR_SE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define DMAMUX2_C2CR_SPOL          (0x3UL << 17) 
#define DMAMUX2_C2CR_SPOL_VAL(X) (((uint32_t)(X) & 0x3UL) << 17)
#define DMAMUX2_C2CR_NBREQ          (0x1FUL << 19) 
#define DMAMUX2_C2CR_NBREQ_VAL(X) (((uint32_t)(X) & 0x1FUL) << 19)
#define DMAMUX2_C2CR_SYNC_ID          (0x1FUL << 24) 
#define DMAMUX2_C2CR_SYNC_ID_VAL(X) (((uint32_t)(X) & 0x1FUL) << 24)
#define DMAMUX2_C3CR_DMAREQ_ID          (0xFFUL << 0) 
#define DMAMUX2_C3CR_DMAREQ_ID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DMAMUX2_C3CR_SOIE          (0x1UL << 8) 
#define DMAMUX2_C3CR_SOIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DMAMUX2_C3CR_EGE          (0x1UL << 9) 
#define DMAMUX2_C3CR_EGE_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define DMAMUX2_C3CR_SE          (0x1UL << 16) 
#define DMAMUX2_C3CR_SE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define DMAMUX2_C3CR_SPOL          (0x3UL << 17) 
#define DMAMUX2_C3CR_SPOL_VAL(X) (((uint32_t)(X) & 0x3UL) << 17)
#define DMAMUX2_C3CR_NBREQ          (0x1FUL << 19) 
#define DMAMUX2_C3CR_NBREQ_VAL(X) (((uint32_t)(X) & 0x1FUL) << 19)
#define DMAMUX2_C3CR_SYNC_ID          (0x1FUL << 24) 
#define DMAMUX2_C3CR_SYNC_ID_VAL(X) (((uint32_t)(X) & 0x1FUL) << 24)
#define DMAMUX2_C4CR_DMAREQ_ID          (0xFFUL << 0) 
#define DMAMUX2_C4CR_DMAREQ_ID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DMAMUX2_C4CR_SOIE          (0x1UL << 8) 
#define DMAMUX2_C4CR_SOIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DMAMUX2_C4CR_EGE          (0x1UL << 9) 
#define DMAMUX2_C4CR_EGE_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define DMAMUX2_C4CR_SE          (0x1UL << 16) 
#define DMAMUX2_C4CR_SE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define DMAMUX2_C4CR_SPOL          (0x3UL << 17) 
#define DMAMUX2_C4CR_SPOL_VAL(X) (((uint32_t)(X) & 0x3UL) << 17)
#define DMAMUX2_C4CR_NBREQ          (0x1FUL << 19) 
#define DMAMUX2_C4CR_NBREQ_VAL(X) (((uint32_t)(X) & 0x1FUL) << 19)
#define DMAMUX2_C4CR_SYNC_ID          (0x1FUL << 24) 
#define DMAMUX2_C4CR_SYNC_ID_VAL(X) (((uint32_t)(X) & 0x1FUL) << 24)
#define DMAMUX2_C5CR_DMAREQ_ID          (0xFFUL << 0) 
#define DMAMUX2_C5CR_DMAREQ_ID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DMAMUX2_C5CR_SOIE          (0x1UL << 8) 
#define DMAMUX2_C5CR_SOIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DMAMUX2_C5CR_EGE          (0x1UL << 9) 
#define DMAMUX2_C5CR_EGE_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define DMAMUX2_C5CR_SE          (0x1UL << 16) 
#define DMAMUX2_C5CR_SE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define DMAMUX2_C5CR_SPOL          (0x3UL << 17) 
#define DMAMUX2_C5CR_SPOL_VAL(X) (((uint32_t)(X) & 0x3UL) << 17)
#define DMAMUX2_C5CR_NBREQ          (0x1FUL << 19) 
#define DMAMUX2_C5CR_NBREQ_VAL(X) (((uint32_t)(X) & 0x1FUL) << 19)
#define DMAMUX2_C5CR_SYNC_ID          (0x1FUL << 24) 
#define DMAMUX2_C5CR_SYNC_ID_VAL(X) (((uint32_t)(X) & 0x1FUL) << 24)
#define DMAMUX2_C6CR_DMAREQ_ID          (0xFFUL << 0) 
#define DMAMUX2_C6CR_DMAREQ_ID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DMAMUX2_C6CR_SOIE          (0x1UL << 8) 
#define DMAMUX2_C6CR_SOIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DMAMUX2_C6CR_EGE          (0x1UL << 9) 
#define DMAMUX2_C6CR_EGE_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define DMAMUX2_C6CR_SE          (0x1UL << 16) 
#define DMAMUX2_C6CR_SE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define DMAMUX2_C6CR_SPOL          (0x3UL << 17) 
#define DMAMUX2_C6CR_SPOL_VAL(X) (((uint32_t)(X) & 0x3UL) << 17)
#define DMAMUX2_C6CR_NBREQ          (0x1FUL << 19) 
#define DMAMUX2_C6CR_NBREQ_VAL(X) (((uint32_t)(X) & 0x1FUL) << 19)
#define DMAMUX2_C6CR_SYNC_ID          (0x1FUL << 24) 
#define DMAMUX2_C6CR_SYNC_ID_VAL(X) (((uint32_t)(X) & 0x1FUL) << 24)
#define DMAMUX2_C7CR_DMAREQ_ID          (0xFFUL << 0) 
#define DMAMUX2_C7CR_DMAREQ_ID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DMAMUX2_C7CR_SOIE          (0x1UL << 8) 
#define DMAMUX2_C7CR_SOIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DMAMUX2_C7CR_EGE          (0x1UL << 9) 
#define DMAMUX2_C7CR_EGE_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define DMAMUX2_C7CR_SE          (0x1UL << 16) 
#define DMAMUX2_C7CR_SE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define DMAMUX2_C7CR_SPOL          (0x3UL << 17) 
#define DMAMUX2_C7CR_SPOL_VAL(X) (((uint32_t)(X) & 0x3UL) << 17)
#define DMAMUX2_C7CR_NBREQ          (0x1FUL << 19) 
#define DMAMUX2_C7CR_NBREQ_VAL(X) (((uint32_t)(X) & 0x1FUL) << 19)
#define DMAMUX2_C7CR_SYNC_ID          (0x1FUL << 24) 
#define DMAMUX2_C7CR_SYNC_ID_VAL(X) (((uint32_t)(X) & 0x1FUL) << 24)
#define DMAMUX2_RG0CR_SIG_ID          (0x1FUL << 0) 
#define DMAMUX2_RG0CR_SIG_ID_VAL(X) (((uint32_t)(X) & 0x1FUL) << 0)
#define DMAMUX2_RG0CR_OIE          (0x1UL << 8) 
#define DMAMUX2_RG0CR_OIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DMAMUX2_RG0CR_GE          (0x1UL << 16) 
#define DMAMUX2_RG0CR_GE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define DMAMUX2_RG0CR_GPOL          (0x3UL << 17) 
#define DMAMUX2_RG0CR_GPOL_VAL(X) (((uint32_t)(X) & 0x3UL) << 17)
#define DMAMUX2_RG0CR_GNBREQ          (0x1FUL << 19) 
#define DMAMUX2_RG0CR_GNBREQ_VAL(X) (((uint32_t)(X) & 0x1FUL) << 19)
#define DMAMUX2_RG1CR_SIG_ID          (0x1FUL << 0) 
#define DMAMUX2_RG1CR_SIG_ID_VAL(X) (((uint32_t)(X) & 0x1FUL) << 0)
#define DMAMUX2_RG1CR_OIE          (0x1UL << 8) 
#define DMAMUX2_RG1CR_OIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DMAMUX2_RG1CR_GE          (0x1UL << 16) 
#define DMAMUX2_RG1CR_GE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define DMAMUX2_RG1CR_GPOL          (0x3UL << 17) 
#define DMAMUX2_RG1CR_GPOL_VAL(X) (((uint32_t)(X) & 0x3UL) << 17)
#define DMAMUX2_RG1CR_GNBREQ          (0x1FUL << 19) 
#define DMAMUX2_RG1CR_GNBREQ_VAL(X) (((uint32_t)(X) & 0x1FUL) << 19)
#define DMAMUX2_RG2CR_SIG_ID          (0x1FUL << 0) 
#define DMAMUX2_RG2CR_SIG_ID_VAL(X) (((uint32_t)(X) & 0x1FUL) << 0)
#define DMAMUX2_RG2CR_OIE          (0x1UL << 8) 
#define DMAMUX2_RG2CR_OIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DMAMUX2_RG2CR_GE          (0x1UL << 16) 
#define DMAMUX2_RG2CR_GE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define DMAMUX2_RG2CR_GPOL          (0x3UL << 17) 
#define DMAMUX2_RG2CR_GPOL_VAL(X) (((uint32_t)(X) & 0x3UL) << 17)
#define DMAMUX2_RG2CR_GNBREQ          (0x1FUL << 19) 
#define DMAMUX2_RG2CR_GNBREQ_VAL(X) (((uint32_t)(X) & 0x1FUL) << 19)
#define DMAMUX2_RG3CR_SIG_ID          (0x1FUL << 0) 
#define DMAMUX2_RG3CR_SIG_ID_VAL(X) (((uint32_t)(X) & 0x1FUL) << 0)
#define DMAMUX2_RG3CR_OIE          (0x1UL << 8) 
#define DMAMUX2_RG3CR_OIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DMAMUX2_RG3CR_GE          (0x1UL << 16) 
#define DMAMUX2_RG3CR_GE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define DMAMUX2_RG3CR_GPOL          (0x3UL << 17) 
#define DMAMUX2_RG3CR_GPOL_VAL(X) (((uint32_t)(X) & 0x3UL) << 17)
#define DMAMUX2_RG3CR_GNBREQ          (0x1FUL << 19) 
#define DMAMUX2_RG3CR_GNBREQ_VAL(X) (((uint32_t)(X) & 0x1FUL) << 19)
#define DMAMUX2_RG4CR_SIG_ID          (0x1FUL << 0) 
#define DMAMUX2_RG4CR_SIG_ID_VAL(X) (((uint32_t)(X) & 0x1FUL) << 0)
#define DMAMUX2_RG4CR_OIE          (0x1UL << 8) 
#define DMAMUX2_RG4CR_OIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DMAMUX2_RG4CR_GE          (0x1UL << 16) 
#define DMAMUX2_RG4CR_GE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define DMAMUX2_RG4CR_GPOL          (0x3UL << 17) 
#define DMAMUX2_RG4CR_GPOL_VAL(X) (((uint32_t)(X) & 0x3UL) << 17)
#define DMAMUX2_RG4CR_GNBREQ          (0x1FUL << 19) 
#define DMAMUX2_RG4CR_GNBREQ_VAL(X) (((uint32_t)(X) & 0x1FUL) << 19)
#define DMAMUX2_RG5CR_SIG_ID          (0x1FUL << 0) 
#define DMAMUX2_RG5CR_SIG_ID_VAL(X) (((uint32_t)(X) & 0x1FUL) << 0)
#define DMAMUX2_RG5CR_OIE          (0x1UL << 8) 
#define DMAMUX2_RG5CR_OIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DMAMUX2_RG5CR_GE          (0x1UL << 16) 
#define DMAMUX2_RG5CR_GE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define DMAMUX2_RG5CR_GPOL          (0x3UL << 17) 
#define DMAMUX2_RG5CR_GPOL_VAL(X) (((uint32_t)(X) & 0x3UL) << 17)
#define DMAMUX2_RG5CR_GNBREQ          (0x1FUL << 19) 
#define DMAMUX2_RG5CR_GNBREQ_VAL(X) (((uint32_t)(X) & 0x1FUL) << 19)
#define DMAMUX2_RG6CR_SIG_ID          (0x1FUL << 0) 
#define DMAMUX2_RG6CR_SIG_ID_VAL(X) (((uint32_t)(X) & 0x1FUL) << 0)
#define DMAMUX2_RG6CR_OIE          (0x1UL << 8) 
#define DMAMUX2_RG6CR_OIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DMAMUX2_RG6CR_GE          (0x1UL << 16) 
#define DMAMUX2_RG6CR_GE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define DMAMUX2_RG6CR_GPOL          (0x3UL << 17) 
#define DMAMUX2_RG6CR_GPOL_VAL(X) (((uint32_t)(X) & 0x3UL) << 17)
#define DMAMUX2_RG6CR_GNBREQ          (0x1FUL << 19) 
#define DMAMUX2_RG6CR_GNBREQ_VAL(X) (((uint32_t)(X) & 0x1FUL) << 19)
#define DMAMUX2_RG7CR_SIG_ID          (0x1FUL << 0) 
#define DMAMUX2_RG7CR_SIG_ID_VAL(X) (((uint32_t)(X) & 0x1FUL) << 0)
#define DMAMUX2_RG7CR_OIE          (0x1UL << 8) 
#define DMAMUX2_RG7CR_OIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DMAMUX2_RG7CR_GE          (0x1UL << 16) 
#define DMAMUX2_RG7CR_GE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define DMAMUX2_RG7CR_GPOL          (0x3UL << 17) 
#define DMAMUX2_RG7CR_GPOL_VAL(X) (((uint32_t)(X) & 0x3UL) << 17)
#define DMAMUX2_RG7CR_GNBREQ          (0x1FUL << 19) 
#define DMAMUX2_RG7CR_GNBREQ_VAL(X) (((uint32_t)(X) & 0x1FUL) << 19)
#define DMAMUX2_RGSR_OF          (0xFFUL << 0) 
#define DMAMUX2_RGSR_OF_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DMAMUX2_RGCFR_COF          (0xFFUL << 0) 
#define DMAMUX2_RGCFR_COF_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DMAMUX2_CSR_SOF          (0xFFFFUL << 0) 
#define DMAMUX2_CSR_SOF_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define DMAMUX2_CFR_CSOF          (0xFFFFUL << 0) 
#define DMAMUX2_CFR_CSOF_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)

#define DMAMUX2  ((struct DMAMUX2*)(0x58025800UL))
struct FMC {
  volatile uint32_t BCR1;
  volatile uint32_t BTR1;
  volatile uint32_t BCR2;
  volatile uint32_t BTR2;
  volatile uint32_t BCR3;
  volatile uint32_t BTR3;
  volatile uint32_t BCR4;
  volatile uint32_t BTR4;
  const volatile uint32_t RESERVED128[24];
  volatile uint32_t PCR;
  volatile uint32_t SR;
  volatile uint32_t PMEM;
  volatile uint32_t PATT;
  const volatile uint32_t RESERVED148[1];
  volatile const uint32_t ECCR;
  const volatile uint32_t RESERVED260[27];
  volatile uint32_t BWTR1;
  const volatile uint32_t RESERVED268[1];
  volatile uint32_t BWTR2;
  const volatile uint32_t RESERVED276[1];
  volatile uint32_t BWTR3;
  const volatile uint32_t RESERVED284[1];
  volatile uint32_t BWTR4;
  const volatile uint32_t RESERVED320[8];
  volatile uint32_t SDCR1;
  volatile uint32_t SDCR2;
  volatile uint32_t SDTR1;
  volatile uint32_t SDTR2;
  volatile uint32_t SDCMR;
  volatile uint32_t SDRTR;
  volatile const uint32_t SDSR;
};
