via/viaems/src/platforms/stm32h743/device.h
#define FMC_BCR1_MBKEN          (0x1UL << 0) 
#define FMC_BCR1_MBKEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define FMC_BCR1_MUXEN          (0x1UL << 1) 
#define FMC_BCR1_MUXEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define FMC_BCR1_MTYP          (0x3UL << 2) 
#define FMC_BCR1_MTYP_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define FMC_BCR1_MWID          (0x3UL << 4) 
#define FMC_BCR1_MWID_VAL(X) (((uint32_t)(X) & 0x3UL) << 4)
#define FMC_BCR1_FACCEN          (0x1UL << 6) 
#define FMC_BCR1_FACCEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define FMC_BCR1_BURSTEN          (0x1UL << 8) 
#define FMC_BCR1_BURSTEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define FMC_BCR1_WAITPOL          (0x1UL << 9) 
#define FMC_BCR1_WAITPOL_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define FMC_BCR1_WAITCFG          (0x1UL << 11) 
#define FMC_BCR1_WAITCFG_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define FMC_BCR1_WREN          (0x1UL << 12) 
#define FMC_BCR1_WREN_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define FMC_BCR1_WAITEN          (0x1UL << 13) 
#define FMC_BCR1_WAITEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define FMC_BCR1_EXTMOD          (0x1UL << 14) 
#define FMC_BCR1_EXTMOD_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define FMC_BCR1_ASYNCWAIT          (0x1UL << 15) 
#define FMC_BCR1_ASYNCWAIT_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define FMC_BCR1_CPSIZE          (0x7UL << 16) 
#define FMC_BCR1_CPSIZE_VAL(X) (((uint32_t)(X) & 0x7UL) << 16)
#define FMC_BCR1_CBURSTRW          (0x1UL << 19) 
#define FMC_BCR1_CBURSTRW_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define FMC_BCR1_CCLKEN          (0x1UL << 20) 
#define FMC_BCR1_CCLKEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define FMC_BCR1_WFDIS          (0x1UL << 21) 
#define FMC_BCR1_WFDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define FMC_BCR1_BMAP          (0x3UL << 24) 
#define FMC_BCR1_BMAP_VAL(X) (((uint32_t)(X) & 0x3UL) << 24)
#define FMC_BCR1_FMCEN          (0x1UL << 31) 
#define FMC_BCR1_FMCEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define FMC_BTR1_ADDSET          (0xFUL << 0) 
#define FMC_BTR1_ADDSET_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define FMC_BTR1_ADDHLD          (0xFUL << 4) 
#define FMC_BTR1_ADDHLD_VAL(X) (((uint32_t)(X) & 0xFUL) << 4)
#define FMC_BTR1_DATAST          (0xFFUL << 8) 
#define FMC_BTR1_DATAST_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define FMC_BTR1_BUSTURN          (0xFUL << 16) 
#define FMC_BTR1_BUSTURN_VAL(X) (((uint32_t)(X) & 0xFUL) << 16)
#define FMC_BTR1_CLKDIV          (0xFUL << 20) 
#define FMC_BTR1_CLKDIV_VAL(X) (((uint32_t)(X) & 0xFUL) << 20)
#define FMC_BTR1_DATLAT          (0xFUL << 24) 
#define FMC_BTR1_DATLAT_VAL(X) (((uint32_t)(X) & 0xFUL) << 24)
#define FMC_BTR1_ACCMOD          (0x3UL << 28) 
#define FMC_BTR1_ACCMOD_VAL(X) (((uint32_t)(X) & 0x3UL) << 28)
#define FMC_BCR2_MBKEN          (0x1UL << 0) 
#define FMC_BCR2_MBKEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define FMC_BCR2_MUXEN          (0x1UL << 1) 
#define FMC_BCR2_MUXEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define FMC_BCR2_MTYP          (0x3UL << 2) 
#define FMC_BCR2_MTYP_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define FMC_BCR2_MWID          (0x3UL << 4) 
#define FMC_BCR2_MWID_VAL(X) (((uint32_t)(X) & 0x3UL) << 4)
#define FMC_BCR2_FACCEN          (0x1UL << 6) 
#define FMC_BCR2_FACCEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define FMC_BCR2_BURSTEN          (0x1UL << 8) 
#define FMC_BCR2_BURSTEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define FMC_BCR2_WAITPOL          (0x1UL << 9) 
#define FMC_BCR2_WAITPOL_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define FMC_BCR2_WAITCFG          (0x1UL << 11) 
#define FMC_BCR2_WAITCFG_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define FMC_BCR2_WREN          (0x1UL << 12) 
#define FMC_BCR2_WREN_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define FMC_BCR2_WAITEN          (0x1UL << 13) 
#define FMC_BCR2_WAITEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define FMC_BCR2_EXTMOD          (0x1UL << 14) 
#define FMC_BCR2_EXTMOD_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define FMC_BCR2_ASYNCWAIT          (0x1UL << 15) 
#define FMC_BCR2_ASYNCWAIT_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define FMC_BCR2_CPSIZE          (0x7UL << 16) 
#define FMC_BCR2_CPSIZE_VAL(X) (((uint32_t)(X) & 0x7UL) << 16)
#define FMC_BCR2_CBURSTRW          (0x1UL << 19) 
#define FMC_BCR2_CBURSTRW_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define FMC_BCR2_CCLKEN          (0x1UL << 20) 
#define FMC_BCR2_CCLKEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define FMC_BCR2_WFDIS          (0x1UL << 21) 
#define FMC_BCR2_WFDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define FMC_BCR2_BMAP          (0x3UL << 24) 
#define FMC_BCR2_BMAP_VAL(X) (((uint32_t)(X) & 0x3UL) << 24)
#define FMC_BCR2_FMCEN          (0x1UL << 31) 
#define FMC_BCR2_FMCEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define FMC_BTR2_ADDSET          (0xFUL << 0) 
#define FMC_BTR2_ADDSET_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define FMC_BTR2_ADDHLD          (0xFUL << 4) 
#define FMC_BTR2_ADDHLD_VAL(X) (((uint32_t)(X) & 0xFUL) << 4)
#define FMC_BTR2_DATAST          (0xFFUL << 8) 
#define FMC_BTR2_DATAST_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define FMC_BTR2_BUSTURN          (0xFUL << 16) 
#define FMC_BTR2_BUSTURN_VAL(X) (((uint32_t)(X) & 0xFUL) << 16)
#define FMC_BTR2_CLKDIV          (0xFUL << 20) 
#define FMC_BTR2_CLKDIV_VAL(X) (((uint32_t)(X) & 0xFUL) << 20)
#define FMC_BTR2_DATLAT          (0xFUL << 24) 
#define FMC_BTR2_DATLAT_VAL(X) (((uint32_t)(X) & 0xFUL) << 24)
#define FMC_BTR2_ACCMOD          (0x3UL << 28) 
#define FMC_BTR2_ACCMOD_VAL(X) (((uint32_t)(X) & 0x3UL) << 28)
#define FMC_BCR3_MBKEN          (0x1UL << 0) 
#define FMC_BCR3_MBKEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define FMC_BCR3_MUXEN          (0x1UL << 1) 
#define FMC_BCR3_MUXEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define FMC_BCR3_MTYP          (0x3UL << 2) 
#define FMC_BCR3_MTYP_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define FMC_BCR3_MWID          (0x3UL << 4) 
#define FMC_BCR3_MWID_VAL(X) (((uint32_t)(X) & 0x3UL) << 4)
#define FMC_BCR3_FACCEN          (0x1UL << 6) 
#define FMC_BCR3_FACCEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define FMC_BCR3_BURSTEN          (0x1UL << 8) 
#define FMC_BCR3_BURSTEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define FMC_BCR3_WAITPOL          (0x1UL << 9) 
#define FMC_BCR3_WAITPOL_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define FMC_BCR3_WAITCFG          (0x1UL << 11) 
#define FMC_BCR3_WAITCFG_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define FMC_BCR3_WREN          (0x1UL << 12) 
#define FMC_BCR3_WREN_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define FMC_BCR3_WAITEN          (0x1UL << 13) 
#define FMC_BCR3_WAITEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define FMC_BCR3_EXTMOD          (0x1UL << 14) 
#define FMC_BCR3_EXTMOD_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define FMC_BCR3_ASYNCWAIT          (0x1UL << 15) 
#define FMC_BCR3_ASYNCWAIT_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define FMC_BCR3_CPSIZE          (0x7UL << 16) 
#define FMC_BCR3_CPSIZE_VAL(X) (((uint32_t)(X) & 0x7UL) << 16)
#define FMC_BCR3_CBURSTRW          (0x1UL << 19) 
#define FMC_BCR3_CBURSTRW_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define FMC_BCR3_CCLKEN          (0x1UL << 20) 
#define FMC_BCR3_CCLKEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define FMC_BCR3_WFDIS          (0x1UL << 21) 
#define FMC_BCR3_WFDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define FMC_BCR3_BMAP          (0x3UL << 24) 
#define FMC_BCR3_BMAP_VAL(X) (((uint32_t)(X) & 0x3UL) << 24)
#define FMC_BCR3_FMCEN          (0x1UL << 31) 
#define FMC_BCR3_FMCEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define FMC_BTR3_ADDSET          (0xFUL << 0) 
#define FMC_BTR3_ADDSET_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define FMC_BTR3_ADDHLD          (0xFUL << 4) 
#define FMC_BTR3_ADDHLD_VAL(X) (((uint32_t)(X) & 0xFUL) << 4)
#define FMC_BTR3_DATAST          (0xFFUL << 8) 
#define FMC_BTR3_DATAST_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define FMC_BTR3_BUSTURN          (0xFUL << 16) 
#define FMC_BTR3_BUSTURN_VAL(X) (((uint32_t)(X) & 0xFUL) << 16)
#define FMC_BTR3_CLKDIV          (0xFUL << 20) 
#define FMC_BTR3_CLKDIV_VAL(X) (((uint32_t)(X) & 0xFUL) << 20)
#define FMC_BTR3_DATLAT          (0xFUL << 24) 
#define FMC_BTR3_DATLAT_VAL(X) (((uint32_t)(X) & 0xFUL) << 24)
#define FMC_BTR3_ACCMOD          (0x3UL << 28) 
#define FMC_BTR3_ACCMOD_VAL(X) (((uint32_t)(X) & 0x3UL) << 28)
#define FMC_BCR4_MBKEN          (0x1UL << 0) 
#define FMC_BCR4_MBKEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define FMC_BCR4_MUXEN          (0x1UL << 1) 
#define FMC_BCR4_MUXEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define FMC_BCR4_MTYP          (0x3UL << 2) 
#define FMC_BCR4_MTYP_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define FMC_BCR4_MWID          (0x3UL << 4) 
#define FMC_BCR4_MWID_VAL(X) (((uint32_t)(X) & 0x3UL) << 4)
#define FMC_BCR4_FACCEN          (0x1UL << 6) 
#define FMC_BCR4_FACCEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define FMC_BCR4_BURSTEN          (0x1UL << 8) 
#define FMC_BCR4_BURSTEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define FMC_BCR4_WAITPOL          (0x1UL << 9) 
#define FMC_BCR4_WAITPOL_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define FMC_BCR4_WAITCFG          (0x1UL << 11) 
#define FMC_BCR4_WAITCFG_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define FMC_BCR4_WREN          (0x1UL << 12) 
#define FMC_BCR4_WREN_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define FMC_BCR4_WAITEN          (0x1UL << 13) 
#define FMC_BCR4_WAITEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define FMC_BCR4_EXTMOD          (0x1UL << 14) 
#define FMC_BCR4_EXTMOD_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define FMC_BCR4_ASYNCWAIT          (0x1UL << 15) 
#define FMC_BCR4_ASYNCWAIT_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define FMC_BCR4_CPSIZE          (0x7UL << 16) 
#define FMC_BCR4_CPSIZE_VAL(X) (((uint32_t)(X) & 0x7UL) << 16)
#define FMC_BCR4_CBURSTRW          (0x1UL << 19) 
#define FMC_BCR4_CBURSTRW_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define FMC_BCR4_CCLKEN          (0x1UL << 20) 
#define FMC_BCR4_CCLKEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define FMC_BCR4_WFDIS          (0x1UL << 21) 
#define FMC_BCR4_WFDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define FMC_BCR4_BMAP          (0x3UL << 24) 
#define FMC_BCR4_BMAP_VAL(X) (((uint32_t)(X) & 0x3UL) << 24)
#define FMC_BCR4_FMCEN          (0x1UL << 31) 
#define FMC_BCR4_FMCEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define FMC_BTR4_ADDSET          (0xFUL << 0) 
#define FMC_BTR4_ADDSET_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define FMC_BTR4_ADDHLD          (0xFUL << 4) 
#define FMC_BTR4_ADDHLD_VAL(X) (((uint32_t)(X) & 0xFUL) << 4)
#define FMC_BTR4_DATAST          (0xFFUL << 8) 
#define FMC_BTR4_DATAST_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define FMC_BTR4_BUSTURN          (0xFUL << 16) 
#define FMC_BTR4_BUSTURN_VAL(X) (((uint32_t)(X) & 0xFUL) << 16)
#define FMC_BTR4_CLKDIV          (0xFUL << 20) 
#define FMC_BTR4_CLKDIV_VAL(X) (((uint32_t)(X) & 0xFUL) << 20)
#define FMC_BTR4_DATLAT          (0xFUL << 24) 
#define FMC_BTR4_DATLAT_VAL(X) (((uint32_t)(X) & 0xFUL) << 24)
#define FMC_BTR4_ACCMOD          (0x3UL << 28) 
#define FMC_BTR4_ACCMOD_VAL(X) (((uint32_t)(X) & 0x3UL) << 28)
#define FMC_PCR_PWAITEN          (0x1UL << 1) 
#define FMC_PCR_PWAITEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define FMC_PCR_PBKEN          (0x1UL << 2) 
#define FMC_PCR_PBKEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define FMC_PCR_PWID          (0x3UL << 4) 
#define FMC_PCR_PWID_VAL(X) (((uint32_t)(X) & 0x3UL) << 4)
#define FMC_PCR_ECCEN          (0x1UL << 6) 
#define FMC_PCR_ECCEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define FMC_PCR_TCLR          (0xFUL << 9) 
#define FMC_PCR_TCLR_VAL(X) (((uint32_t)(X) & 0xFUL) << 9)
#define FMC_PCR_TAR          (0xFUL << 13) 
#define FMC_PCR_TAR_VAL(X) (((uint32_t)(X) & 0xFUL) << 13)
#define FMC_PCR_ECCPS          (0x7UL << 17) 
#define FMC_PCR_ECCPS_VAL(X) (((uint32_t)(X) & 0x7UL) << 17)
#define FMC_SR_IRS          (0x1UL << 0) 
#define FMC_SR_IRS_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define FMC_SR_ILS          (0x1UL << 1) 
#define FMC_SR_ILS_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define FMC_SR_IFS          (0x1UL << 2) 
#define FMC_SR_IFS_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define FMC_SR_IREN          (0x1UL << 3) 
#define FMC_SR_IREN_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define FMC_SR_ILEN          (0x1UL << 4) 
#define FMC_SR_ILEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define FMC_SR_IFEN          (0x1UL << 5) 
#define FMC_SR_IFEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define FMC_SR_FEMPT          (0x1UL << 6) 
#define FMC_SR_FEMPT_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define FMC_PMEM_MEMSET          (0xFFUL << 0) 
#define FMC_PMEM_MEMSET_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define FMC_PMEM_MEMWAIT          (0xFFUL << 8) 
#define FMC_PMEM_MEMWAIT_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define FMC_PMEM_MEMHOLD          (0xFFUL << 16) 
#define FMC_PMEM_MEMHOLD_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define FMC_PMEM_MEMHIZ          (0xFFUL << 24) 
#define FMC_PMEM_MEMHIZ_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define FMC_PATT_ATTSET          (0xFFUL << 0) 
#define FMC_PATT_ATTSET_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define FMC_PATT_ATTWAIT          (0xFFUL << 8) 
#define FMC_PATT_ATTWAIT_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define FMC_PATT_ATTHOLD          (0xFFUL << 16) 
#define FMC_PATT_ATTHOLD_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define FMC_PATT_ATTHIZ          (0xFFUL << 24) 
#define FMC_PATT_ATTHIZ_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define FMC_ECCR_ECC          (0xFFFFFFFFUL << 0) 
#define FMC_ECCR_ECC_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define FMC_BWTR1_ADDSET          (0xFUL << 0) 
#define FMC_BWTR1_ADDSET_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define FMC_BWTR1_ADDHLD          (0xFUL << 4) 
#define FMC_BWTR1_ADDHLD_VAL(X) (((uint32_t)(X) & 0xFUL) << 4)
#define FMC_BWTR1_DATAST          (0xFFUL << 8) 
#define FMC_BWTR1_DATAST_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define FMC_BWTR1_BUSTURN          (0xFUL << 16) 
#define FMC_BWTR1_BUSTURN_VAL(X) (((uint32_t)(X) & 0xFUL) << 16)
#define FMC_BWTR1_ACCMOD          (0x3UL << 28) 
#define FMC_BWTR1_ACCMOD_VAL(X) (((uint32_t)(X) & 0x3UL) << 28)
#define FMC_BWTR2_ADDSET          (0xFUL << 0) 
#define FMC_BWTR2_ADDSET_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define FMC_BWTR2_ADDHLD          (0xFUL << 4) 
#define FMC_BWTR2_ADDHLD_VAL(X) (((uint32_t)(X) & 0xFUL) << 4)
#define FMC_BWTR2_DATAST          (0xFFUL << 8) 
#define FMC_BWTR2_DATAST_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define FMC_BWTR2_BUSTURN          (0xFUL << 16) 
#define FMC_BWTR2_BUSTURN_VAL(X) (((uint32_t)(X) & 0xFUL) << 16)
#define FMC_BWTR2_ACCMOD          (0x3UL << 28) 
#define FMC_BWTR2_ACCMOD_VAL(X) (((uint32_t)(X) & 0x3UL) << 28)
#define FMC_BWTR3_ADDSET          (0xFUL << 0) 
#define FMC_BWTR3_ADDSET_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define FMC_BWTR3_ADDHLD          (0xFUL << 4) 
#define FMC_BWTR3_ADDHLD_VAL(X) (((uint32_t)(X) & 0xFUL) << 4)
#define FMC_BWTR3_DATAST          (0xFFUL << 8) 
#define FMC_BWTR3_DATAST_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define FMC_BWTR3_BUSTURN          (0xFUL << 16) 
#define FMC_BWTR3_BUSTURN_VAL(X) (((uint32_t)(X) & 0xFUL) << 16)
#define FMC_BWTR3_ACCMOD          (0x3UL << 28) 
#define FMC_BWTR3_ACCMOD_VAL(X) (((uint32_t)(X) & 0x3UL) << 28)
#define FMC_BWTR4_ADDSET          (0xFUL << 0) 
#define FMC_BWTR4_ADDSET_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define FMC_BWTR4_ADDHLD          (0xFUL << 4) 
#define FMC_BWTR4_ADDHLD_VAL(X) (((uint32_t)(X) & 0xFUL) << 4)
#define FMC_BWTR4_DATAST          (0xFFUL << 8) 
#define FMC_BWTR4_DATAST_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define FMC_BWTR4_BUSTURN          (0xFUL << 16) 
#define FMC_BWTR4_BUSTURN_VAL(X) (((uint32_t)(X) & 0xFUL) << 16)
#define FMC_BWTR4_ACCMOD          (0x3UL << 28) 
#define FMC_BWTR4_ACCMOD_VAL(X) (((uint32_t)(X) & 0x3UL) << 28)
#define FMC_SDCR1_NC          (0x3UL << 0) 
#define FMC_SDCR1_NC_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define FMC_SDCR1_NR          (0x3UL << 2) 
#define FMC_SDCR1_NR_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define FMC_SDCR1_MWID          (0x3UL << 4) 
#define FMC_SDCR1_MWID_VAL(X) (((uint32_t)(X) & 0x3UL) << 4)
#define FMC_SDCR1_NB          (0x1UL << 6) 
#define FMC_SDCR1_NB_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define FMC_SDCR1_CAS          (0x3UL << 7) 
#define FMC_SDCR1_CAS_VAL(X) (((uint32_t)(X) & 0x3UL) << 7)
#define FMC_SDCR1_WP          (0x1UL << 9) 
#define FMC_SDCR1_WP_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define FMC_SDCR1_SDCLK          (0x3UL << 10) 
#define FMC_SDCR1_SDCLK_VAL(X) (((uint32_t)(X) & 0x3UL) << 10)
#define FMC_SDCR1_RBURST          (0x1UL << 12) 
#define FMC_SDCR1_RBURST_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define FMC_SDCR1_RPIPE          (0x3UL << 13) 
#define FMC_SDCR1_RPIPE_VAL(X) (((uint32_t)(X) & 0x3UL) << 13)
#define FMC_SDCR2_NC          (0x3UL << 0) 
#define FMC_SDCR2_NC_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define FMC_SDCR2_NR          (0x3UL << 2) 
#define FMC_SDCR2_NR_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define FMC_SDCR2_MWID          (0x3UL << 4) 
#define FMC_SDCR2_MWID_VAL(X) (((uint32_t)(X) & 0x3UL) << 4)
#define FMC_SDCR2_NB          (0x1UL << 6) 
#define FMC_SDCR2_NB_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define FMC_SDCR2_CAS          (0x3UL << 7) 
#define FMC_SDCR2_CAS_VAL(X) (((uint32_t)(X) & 0x3UL) << 7)
#define FMC_SDCR2_WP          (0x1UL << 9) 
#define FMC_SDCR2_WP_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define FMC_SDCR2_SDCLK          (0x3UL << 10) 
#define FMC_SDCR2_SDCLK_VAL(X) (((uint32_t)(X) & 0x3UL) << 10)
#define FMC_SDCR2_RBURST          (0x1UL << 12) 
#define FMC_SDCR2_RBURST_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define FMC_SDCR2_RPIPE          (0x3UL << 13) 
#define FMC_SDCR2_RPIPE_VAL(X) (((uint32_t)(X) & 0x3UL) << 13)
#define FMC_SDTR1_TMRD          (0xFUL << 0) 
#define FMC_SDTR1_TMRD_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define FMC_SDTR1_TXSR          (0xFUL << 4) 
#define FMC_SDTR1_TXSR_VAL(X) (((uint32_t)(X) & 0xFUL) << 4)
#define FMC_SDTR1_TRAS          (0xFUL << 8) 
#define FMC_SDTR1_TRAS_VAL(X) (((uint32_t)(X) & 0xFUL) << 8)
#define FMC_SDTR1_TRC          (0xFUL << 12) 
#define FMC_SDTR1_TRC_VAL(X) (((uint32_t)(X) & 0xFUL) << 12)
#define FMC_SDTR1_TWR          (0xFUL << 16) 
#define FMC_SDTR1_TWR_VAL(X) (((uint32_t)(X) & 0xFUL) << 16)
#define FMC_SDTR1_TRP          (0xFUL << 20) 
#define FMC_SDTR1_TRP_VAL(X) (((uint32_t)(X) & 0xFUL) << 20)
#define FMC_SDTR1_TRCD          (0xFUL << 24) 
#define FMC_SDTR1_TRCD_VAL(X) (((uint32_t)(X) & 0xFUL) << 24)
#define FMC_SDTR2_TMRD          (0xFUL << 0) 
#define FMC_SDTR2_TMRD_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define FMC_SDTR2_TXSR          (0xFUL << 4) 
#define FMC_SDTR2_TXSR_VAL(X) (((uint32_t)(X) & 0xFUL) << 4)
#define FMC_SDTR2_TRAS          (0xFUL << 8) 
#define FMC_SDTR2_TRAS_VAL(X) (((uint32_t)(X) & 0xFUL) << 8)
#define FMC_SDTR2_TRC          (0xFUL << 12) 
#define FMC_SDTR2_TRC_VAL(X) (((uint32_t)(X) & 0xFUL) << 12)
#define FMC_SDTR2_TWR          (0xFUL << 16) 
#define FMC_SDTR2_TWR_VAL(X) (((uint32_t)(X) & 0xFUL) << 16)
#define FMC_SDTR2_TRP          (0xFUL << 20) 
#define FMC_SDTR2_TRP_VAL(X) (((uint32_t)(X) & 0xFUL) << 20)
#define FMC_SDTR2_TRCD          (0xFUL << 24) 
#define FMC_SDTR2_TRCD_VAL(X) (((uint32_t)(X) & 0xFUL) << 24)
#define FMC_SDCMR_MODE          (0x7UL << 0) 
#define FMC_SDCMR_MODE_VAL(X) (((uint32_t)(X) & 0x7UL) << 0)
#define FMC_SDCMR_CTB2          (0x1UL << 3) 
#define FMC_SDCMR_CTB2_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define FMC_SDCMR_CTB1          (0x1UL << 4) 
#define FMC_SDCMR_CTB1_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define FMC_SDCMR_NRFS          (0xFUL << 5) 
#define FMC_SDCMR_NRFS_VAL(X) (((uint32_t)(X) & 0xFUL) << 5)
#define FMC_SDCMR_MRD          (0x3FFFUL << 9) 
#define FMC_SDCMR_MRD_VAL(X) (((uint32_t)(X) & 0x3FFFUL) << 9)
#define FMC_SDRTR_CRE          (0x1UL << 0) 
#define FMC_SDRTR_CRE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define FMC_SDRTR_COUNT          (0x1FFFUL << 1) 
#define FMC_SDRTR_COUNT_VAL(X) (((uint32_t)(X) & 0x1FFFUL) << 1)
#define FMC_SDRTR_REIE          (0x1UL << 14) 
#define FMC_SDRTR_REIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define FMC_SDSR_RE          (0x1UL << 0) 
#define FMC_SDSR_RE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define FMC_SDSR_MODES1          (0x3UL << 1) 
#define FMC_SDSR_MODES1_VAL(X) (((uint32_t)(X) & 0x3UL) << 1)
#define FMC_SDSR_MODES2          (0x3UL << 3) 
#define FMC_SDSR_MODES2_VAL(X) (((uint32_t)(X) & 0x3UL) << 3)

#define FMC  ((struct FMC*)(0x52004000UL))
struct CEC {
  volatile uint32_t CR;
  volatile uint32_t CFGR;
  volatile uint32_t TXDR;
  volatile const uint32_t RXDR;
  volatile uint32_t ISR;
  volatile uint32_t IER;
};
