via/viaems/src/platforms/stm32h743/device.h
#define CEC_CR_CECEN          (0x1UL << 0) 
#define CEC_CR_CECEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define CEC_CR_TXSOM          (0x1UL << 1) 
#define CEC_CR_TXSOM_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define CEC_CR_TXEOM          (0x1UL << 2) 
#define CEC_CR_TXEOM_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define CEC_CFGR_SFT          (0x7UL << 0) 
#define CEC_CFGR_SFT_VAL(X) (((uint32_t)(X) & 0x7UL) << 0)
#define CEC_CFGR_RXTOL          (0x1UL << 3) 
#define CEC_CFGR_RXTOL_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define CEC_CFGR_BRESTP          (0x1UL << 4) 
#define CEC_CFGR_BRESTP_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define CEC_CFGR_BREGEN          (0x1UL << 5) 
#define CEC_CFGR_BREGEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define CEC_CFGR_LBPEGEN          (0x1UL << 6) 
#define CEC_CFGR_LBPEGEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define CEC_CFGR_BRDNOGEN          (0x1UL << 7) 
#define CEC_CFGR_BRDNOGEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define CEC_CFGR_SFTOPT          (0x1UL << 8) 
#define CEC_CFGR_SFTOPT_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define CEC_CFGR_OAR          (0x7FFFUL << 16) 
#define CEC_CFGR_OAR_VAL(X) (((uint32_t)(X) & 0x7FFFUL) << 16)
#define CEC_CFGR_LSTN          (0x1UL << 31) 
#define CEC_CFGR_LSTN_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define CEC_TXDR_TXD          (0xFFUL << 0) 
#define CEC_TXDR_TXD_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define CEC_RXDR_RXD          (0xFFUL << 0) 
#define CEC_RXDR_RXD_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define CEC_ISR_RXBR          (0x1UL << 0) 
#define CEC_ISR_RXBR_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define CEC_ISR_RXEND          (0x1UL << 1) 
#define CEC_ISR_RXEND_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define CEC_ISR_RXOVR          (0x1UL << 2) 
#define CEC_ISR_RXOVR_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define CEC_ISR_BRE          (0x1UL << 3) 
#define CEC_ISR_BRE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define CEC_ISR_SBPE          (0x1UL << 4) 
#define CEC_ISR_SBPE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define CEC_ISR_LBPE          (0x1UL << 5) 
#define CEC_ISR_LBPE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define CEC_ISR_RXACKE          (0x1UL << 6) 
#define CEC_ISR_RXACKE_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define CEC_ISR_ARBLST          (0x1UL << 7) 
#define CEC_ISR_ARBLST_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define CEC_ISR_TXBR          (0x1UL << 8) 
#define CEC_ISR_TXBR_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define CEC_ISR_TXEND          (0x1UL << 9) 
#define CEC_ISR_TXEND_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define CEC_ISR_TXUDR          (0x1UL << 10) 
#define CEC_ISR_TXUDR_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define CEC_ISR_TXERR          (0x1UL << 11) 
#define CEC_ISR_TXERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define CEC_ISR_TXACKE          (0x1UL << 12) 
#define CEC_ISR_TXACKE_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define CEC_IER_RXBRIE          (0x1UL << 0) 
#define CEC_IER_RXBRIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define CEC_IER_RXENDIE          (0x1UL << 1) 
#define CEC_IER_RXENDIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define CEC_IER_RXOVRIE          (0x1UL << 2) 
#define CEC_IER_RXOVRIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define CEC_IER_BREIE          (0x1UL << 3) 
#define CEC_IER_BREIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define CEC_IER_SBPEIE          (0x1UL << 4) 
#define CEC_IER_SBPEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define CEC_IER_LBPEIE          (0x1UL << 5) 
#define CEC_IER_LBPEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define CEC_IER_RXACKIE          (0x1UL << 6) 
#define CEC_IER_RXACKIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define CEC_IER_ARBLSTIE          (0x1UL << 7) 
#define CEC_IER_ARBLSTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define CEC_IER_TXBRIE          (0x1UL << 8) 
#define CEC_IER_TXBRIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define CEC_IER_TXENDIE          (0x1UL << 9) 
#define CEC_IER_TXENDIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define CEC_IER_TXUDRIE          (0x1UL << 10) 
#define CEC_IER_TXUDRIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define CEC_IER_TXERRIE          (0x1UL << 11) 
#define CEC_IER_TXERRIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define CEC_IER_TXACKIE          (0x1UL << 12) 
#define CEC_IER_TXACKIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)

#define CEC  ((struct CEC*)(0x40006C00UL))
struct HSEM {
  volatile uint32_t HSEM_R0;
  volatile uint32_t HSEM_R1;
  volatile uint32_t HSEM_R2;
  volatile uint32_t HSEM_R3;
  volatile uint32_t HSEM_R4;
  volatile uint32_t HSEM_R5;
  volatile uint32_t HSEM_R6;
  volatile uint32_t HSEM_R7;
  volatile uint32_t HSEM_R8;
  volatile uint32_t HSEM_R9;
  volatile uint32_t HSEM_R10;
  volatile uint32_t HSEM_R11;
  volatile uint32_t HSEM_R12;
  volatile uint32_t HSEM_R13;
  volatile uint32_t HSEM_R14;
  volatile uint32_t HSEM_R15;
  volatile uint32_t HSEM_R16;
  volatile uint32_t HSEM_R17;
  volatile uint32_t HSEM_R18;
  volatile uint32_t HSEM_R19;
  volatile uint32_t HSEM_R20;
  volatile uint32_t HSEM_R21;
  volatile uint32_t HSEM_R22;
  volatile uint32_t HSEM_R23;
  volatile uint32_t HSEM_R24;
  volatile uint32_t HSEM_R25;
  volatile uint32_t HSEM_R26;
  volatile uint32_t HSEM_R27;
  volatile uint32_t HSEM_R28;
  volatile uint32_t HSEM_R29;
  volatile uint32_t HSEM_R30;
  volatile uint32_t HSEM_R31;
  volatile const uint32_t HSEM_RLR0;
  volatile const uint32_t HSEM_RLR1;
  volatile const uint32_t HSEM_RLR2;
  volatile const uint32_t HSEM_RLR3;
  volatile const uint32_t HSEM_RLR4;
  volatile const uint32_t HSEM_RLR5;
  volatile const uint32_t HSEM_RLR6;
  volatile const uint32_t HSEM_RLR7;
  volatile const uint32_t HSEM_RLR8;
  volatile const uint32_t HSEM_RLR9;
  volatile const uint32_t HSEM_RLR10;
  volatile const uint32_t HSEM_RLR11;
  volatile const uint32_t HSEM_RLR12;
  volatile const uint32_t HSEM_RLR13;
  volatile const uint32_t HSEM_RLR14;
  volatile const uint32_t HSEM_RLR15;
  volatile const uint32_t HSEM_RLR16;
  volatile const uint32_t HSEM_RLR17;
  volatile const uint32_t HSEM_RLR18;
  volatile const uint32_t HSEM_RLR19;
  volatile const uint32_t HSEM_RLR20;
  volatile const uint32_t HSEM_RLR21;
  volatile const uint32_t HSEM_RLR22;
  volatile const uint32_t HSEM_RLR23;
  volatile const uint32_t HSEM_RLR24;
  volatile const uint32_t HSEM_RLR25;
  volatile const uint32_t HSEM_RLR26;
  volatile const uint32_t HSEM_RLR27;
  volatile const uint32_t HSEM_RLR28;
  volatile const uint32_t HSEM_RLR29;
  volatile const uint32_t HSEM_RLR30;
  volatile const uint32_t HSEM_RLR31;
  volatile uint32_t HSEM_IER;
  volatile const uint32_t HSEM_ICR;
  volatile const uint32_t HSEM_ISR;
  volatile const uint32_t HSEM_MISR;
  const volatile uint32_t RESERVED320[12];
  volatile uint32_t HSEM_CR;
  volatile uint32_t HSEM_KEYR;
};
