via/viaems/src/platforms/stm32h743/device.h
#define HSEM_HSEM_R0_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_R0_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_R0_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_R0_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_R0_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_R0_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_R1_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_R1_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_R1_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_R1_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_R1_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_R1_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_R2_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_R2_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_R2_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_R2_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_R2_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_R2_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_R3_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_R3_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_R3_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_R3_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_R3_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_R3_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_R4_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_R4_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_R4_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_R4_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_R4_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_R4_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_R5_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_R5_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_R5_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_R5_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_R5_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_R5_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_R6_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_R6_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_R6_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_R6_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_R6_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_R6_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_R7_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_R7_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_R7_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_R7_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_R7_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_R7_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_R8_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_R8_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_R8_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_R8_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_R8_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_R8_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_R9_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_R9_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_R9_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_R9_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_R9_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_R9_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_R10_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_R10_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_R10_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_R10_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_R10_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_R10_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_R11_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_R11_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_R11_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_R11_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_R11_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_R11_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_R12_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_R12_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_R12_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_R12_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_R12_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_R12_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_R13_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_R13_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_R13_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_R13_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_R13_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_R13_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_R14_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_R14_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_R14_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_R14_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_R14_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_R14_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_R15_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_R15_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_R15_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_R15_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_R15_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_R15_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_R16_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_R16_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_R16_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_R16_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_R16_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_R16_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_R17_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_R17_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_R17_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_R17_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_R17_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_R17_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_R18_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_R18_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_R18_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_R18_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_R18_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_R18_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_R19_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_R19_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_R19_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_R19_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_R19_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_R19_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_R20_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_R20_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_R20_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_R20_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_R20_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_R20_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_R21_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_R21_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_R21_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_R21_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_R21_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_R21_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_R22_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_R22_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_R22_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_R22_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_R22_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_R22_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_R23_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_R23_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_R23_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_R23_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_R23_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_R23_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_R24_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_R24_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_R24_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_R24_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_R24_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_R24_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_R25_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_R25_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_R25_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_R25_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_R25_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_R25_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_R26_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_R26_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_R26_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_R26_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_R26_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_R26_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_R27_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_R27_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_R27_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_R27_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_R27_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_R27_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_R28_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_R28_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_R28_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_R28_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_R28_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_R28_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_R29_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_R29_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_R29_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_R29_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_R29_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_R29_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_R30_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_R30_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_R30_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_R30_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_R30_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_R30_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_R31_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_R31_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_R31_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_R31_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_R31_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_R31_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_RLR0_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_RLR0_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_RLR0_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_RLR0_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_RLR0_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_RLR0_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_RLR1_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_RLR1_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_RLR1_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_RLR1_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_RLR1_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_RLR1_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_RLR2_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_RLR2_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_RLR2_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_RLR2_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_RLR2_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_RLR2_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_RLR3_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_RLR3_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_RLR3_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_RLR3_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_RLR3_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_RLR3_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_RLR4_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_RLR4_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_RLR4_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_RLR4_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_RLR4_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_RLR4_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_RLR5_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_RLR5_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_RLR5_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_RLR5_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_RLR5_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_RLR5_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_RLR6_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_RLR6_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_RLR6_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_RLR6_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_RLR6_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_RLR6_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_RLR7_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_RLR7_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_RLR7_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_RLR7_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_RLR7_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_RLR7_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_RLR8_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_RLR8_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_RLR8_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_RLR8_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_RLR8_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_RLR8_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_RLR9_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_RLR9_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_RLR9_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_RLR9_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_RLR9_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_RLR9_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_RLR10_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_RLR10_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_RLR10_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_RLR10_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_RLR10_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_RLR10_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_RLR11_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_RLR11_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_RLR11_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_RLR11_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_RLR11_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_RLR11_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_RLR12_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_RLR12_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_RLR12_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_RLR12_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_RLR12_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_RLR12_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_RLR13_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_RLR13_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_RLR13_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_RLR13_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_RLR13_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_RLR13_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_RLR14_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_RLR14_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_RLR14_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_RLR14_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_RLR14_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_RLR14_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_RLR15_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_RLR15_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_RLR15_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_RLR15_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_RLR15_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_RLR15_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_RLR16_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_RLR16_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_RLR16_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_RLR16_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_RLR16_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_RLR16_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_RLR17_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_RLR17_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_RLR17_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_RLR17_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_RLR17_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_RLR17_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_RLR18_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_RLR18_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_RLR18_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_RLR18_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_RLR18_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_RLR18_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_RLR19_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_RLR19_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_RLR19_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_RLR19_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_RLR19_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_RLR19_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_RLR20_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_RLR20_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_RLR20_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_RLR20_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_RLR20_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_RLR20_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_RLR21_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_RLR21_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_RLR21_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_RLR21_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_RLR21_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_RLR21_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_RLR22_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_RLR22_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_RLR22_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_RLR22_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_RLR22_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_RLR22_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_RLR23_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_RLR23_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_RLR23_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_RLR23_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_RLR23_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_RLR23_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_RLR24_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_RLR24_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_RLR24_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_RLR24_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_RLR24_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_RLR24_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_RLR25_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_RLR25_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_RLR25_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_RLR25_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_RLR25_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_RLR25_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_RLR26_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_RLR26_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_RLR26_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_RLR26_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_RLR26_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_RLR26_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_RLR27_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_RLR27_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_RLR27_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_RLR27_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_RLR27_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_RLR27_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_RLR28_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_RLR28_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_RLR28_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_RLR28_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_RLR28_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_RLR28_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_RLR29_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_RLR29_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_RLR29_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_RLR29_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_RLR29_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_RLR29_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_RLR30_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_RLR30_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_RLR30_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_RLR30_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_RLR30_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_RLR30_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_RLR31_PROCID          (0xFFUL << 0) 
#define HSEM_HSEM_RLR31_PROCID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HSEM_HSEM_RLR31_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_RLR31_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_RLR31_LOCK          (0x1UL << 31) 
#define HSEM_HSEM_RLR31_LOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_IER_ISEM0          (0x1UL << 0) 
#define HSEM_HSEM_IER_ISEM0_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HSEM_HSEM_IER_ISEM1          (0x1UL << 1) 
#define HSEM_HSEM_IER_ISEM1_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HSEM_HSEM_IER_ISEM2          (0x1UL << 2) 
#define HSEM_HSEM_IER_ISEM2_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HSEM_HSEM_IER_ISEM3          (0x1UL << 3) 
#define HSEM_HSEM_IER_ISEM3_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
