via/viaems/src/platforms/stm32h743/device.h
#define HSEM_HSEM_IER_ISEM4          (0x1UL << 4) 
#define HSEM_HSEM_IER_ISEM4_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HSEM_HSEM_IER_ISEM5          (0x1UL << 5) 
#define HSEM_HSEM_IER_ISEM5_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define HSEM_HSEM_IER_ISEM6          (0x1UL << 6) 
#define HSEM_HSEM_IER_ISEM6_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HSEM_HSEM_IER_ISEM7          (0x1UL << 7) 
#define HSEM_HSEM_IER_ISEM7_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define HSEM_HSEM_IER_ISEM8          (0x1UL << 8) 
#define HSEM_HSEM_IER_ISEM8_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HSEM_HSEM_IER_ISEM9          (0x1UL << 9) 
#define HSEM_HSEM_IER_ISEM9_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HSEM_HSEM_IER_ISEM10          (0x1UL << 10) 
#define HSEM_HSEM_IER_ISEM10_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define HSEM_HSEM_IER_ISEM11          (0x1UL << 11) 
#define HSEM_HSEM_IER_ISEM11_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define HSEM_HSEM_IER_ISEM12          (0x1UL << 12) 
#define HSEM_HSEM_IER_ISEM12_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define HSEM_HSEM_IER_ISEM13          (0x1UL << 13) 
#define HSEM_HSEM_IER_ISEM13_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define HSEM_HSEM_IER_ISEM14          (0x1UL << 14) 
#define HSEM_HSEM_IER_ISEM14_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define HSEM_HSEM_IER_ISEM15          (0x1UL << 15) 
#define HSEM_HSEM_IER_ISEM15_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define HSEM_HSEM_IER_ISEM16          (0x1UL << 16) 
#define HSEM_HSEM_IER_ISEM16_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define HSEM_HSEM_IER_ISEM17          (0x1UL << 17) 
#define HSEM_HSEM_IER_ISEM17_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HSEM_HSEM_IER_ISEM18          (0x1UL << 18) 
#define HSEM_HSEM_IER_ISEM18_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HSEM_HSEM_IER_ISEM19          (0x1UL << 19) 
#define HSEM_HSEM_IER_ISEM19_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define HSEM_HSEM_IER_ISEM20          (0x1UL << 20) 
#define HSEM_HSEM_IER_ISEM20_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define HSEM_HSEM_IER_ISEM21          (0x1UL << 21) 
#define HSEM_HSEM_IER_ISEM21_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define HSEM_HSEM_IER_ISEM22          (0x1UL << 22) 
#define HSEM_HSEM_IER_ISEM22_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define HSEM_HSEM_IER_ISEM23          (0x1UL << 23) 
#define HSEM_HSEM_IER_ISEM23_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define HSEM_HSEM_IER_ISEM24          (0x1UL << 24) 
#define HSEM_HSEM_IER_ISEM24_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define HSEM_HSEM_IER_ISEM25          (0x1UL << 25) 
#define HSEM_HSEM_IER_ISEM25_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define HSEM_HSEM_IER_ISEM26          (0x1UL << 26) 
#define HSEM_HSEM_IER_ISEM26_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define HSEM_HSEM_IER_ISEM27          (0x1UL << 27) 
#define HSEM_HSEM_IER_ISEM27_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define HSEM_HSEM_IER_ISEM28          (0x1UL << 28) 
#define HSEM_HSEM_IER_ISEM28_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define HSEM_HSEM_IER_ISEM29          (0x1UL << 29) 
#define HSEM_HSEM_IER_ISEM29_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define HSEM_HSEM_IER_ISEM30          (0x1UL << 30) 
#define HSEM_HSEM_IER_ISEM30_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define HSEM_HSEM_IER_ISEM31          (0x1UL << 31) 
#define HSEM_HSEM_IER_ISEM31_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_ICR_ISEM0          (0x1UL << 0) 
#define HSEM_HSEM_ICR_ISEM0_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HSEM_HSEM_ICR_ISEM1          (0x1UL << 1) 
#define HSEM_HSEM_ICR_ISEM1_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HSEM_HSEM_ICR_ISEM2          (0x1UL << 2) 
#define HSEM_HSEM_ICR_ISEM2_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HSEM_HSEM_ICR_ISEM3          (0x1UL << 3) 
#define HSEM_HSEM_ICR_ISEM3_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HSEM_HSEM_ICR_ISEM4          (0x1UL << 4) 
#define HSEM_HSEM_ICR_ISEM4_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HSEM_HSEM_ICR_ISEM5          (0x1UL << 5) 
#define HSEM_HSEM_ICR_ISEM5_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define HSEM_HSEM_ICR_ISEM6          (0x1UL << 6) 
#define HSEM_HSEM_ICR_ISEM6_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HSEM_HSEM_ICR_ISEM7          (0x1UL << 7) 
#define HSEM_HSEM_ICR_ISEM7_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define HSEM_HSEM_ICR_ISEM8          (0x1UL << 8) 
#define HSEM_HSEM_ICR_ISEM8_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HSEM_HSEM_ICR_ISEM9          (0x1UL << 9) 
#define HSEM_HSEM_ICR_ISEM9_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HSEM_HSEM_ICR_ISEM10          (0x1UL << 10) 
#define HSEM_HSEM_ICR_ISEM10_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define HSEM_HSEM_ICR_ISEM11          (0x1UL << 11) 
#define HSEM_HSEM_ICR_ISEM11_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define HSEM_HSEM_ICR_ISEM12          (0x1UL << 12) 
#define HSEM_HSEM_ICR_ISEM12_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define HSEM_HSEM_ICR_ISEM13          (0x1UL << 13) 
#define HSEM_HSEM_ICR_ISEM13_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define HSEM_HSEM_ICR_ISEM14          (0x1UL << 14) 
#define HSEM_HSEM_ICR_ISEM14_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define HSEM_HSEM_ICR_ISEM15          (0x1UL << 15) 
#define HSEM_HSEM_ICR_ISEM15_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define HSEM_HSEM_ICR_ISEM16          (0x1UL << 16) 
#define HSEM_HSEM_ICR_ISEM16_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define HSEM_HSEM_ICR_ISEM17          (0x1UL << 17) 
#define HSEM_HSEM_ICR_ISEM17_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HSEM_HSEM_ICR_ISEM18          (0x1UL << 18) 
#define HSEM_HSEM_ICR_ISEM18_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HSEM_HSEM_ICR_ISEM19          (0x1UL << 19) 
#define HSEM_HSEM_ICR_ISEM19_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define HSEM_HSEM_ICR_ISEM20          (0x1UL << 20) 
#define HSEM_HSEM_ICR_ISEM20_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define HSEM_HSEM_ICR_ISEM21          (0x1UL << 21) 
#define HSEM_HSEM_ICR_ISEM21_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define HSEM_HSEM_ICR_ISEM22          (0x1UL << 22) 
#define HSEM_HSEM_ICR_ISEM22_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define HSEM_HSEM_ICR_ISEM23          (0x1UL << 23) 
#define HSEM_HSEM_ICR_ISEM23_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define HSEM_HSEM_ICR_ISEM24          (0x1UL << 24) 
#define HSEM_HSEM_ICR_ISEM24_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define HSEM_HSEM_ICR_ISEM25          (0x1UL << 25) 
#define HSEM_HSEM_ICR_ISEM25_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define HSEM_HSEM_ICR_ISEM26          (0x1UL << 26) 
#define HSEM_HSEM_ICR_ISEM26_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define HSEM_HSEM_ICR_ISEM27          (0x1UL << 27) 
#define HSEM_HSEM_ICR_ISEM27_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define HSEM_HSEM_ICR_ISEM28          (0x1UL << 28) 
#define HSEM_HSEM_ICR_ISEM28_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define HSEM_HSEM_ICR_ISEM29          (0x1UL << 29) 
#define HSEM_HSEM_ICR_ISEM29_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define HSEM_HSEM_ICR_ISEM30          (0x1UL << 30) 
#define HSEM_HSEM_ICR_ISEM30_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define HSEM_HSEM_ICR_ISEM31          (0x1UL << 31) 
#define HSEM_HSEM_ICR_ISEM31_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_ISR_ISEM0          (0x1UL << 0) 
#define HSEM_HSEM_ISR_ISEM0_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HSEM_HSEM_ISR_ISEM1          (0x1UL << 1) 
#define HSEM_HSEM_ISR_ISEM1_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HSEM_HSEM_ISR_ISEM2          (0x1UL << 2) 
#define HSEM_HSEM_ISR_ISEM2_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HSEM_HSEM_ISR_ISEM3          (0x1UL << 3) 
#define HSEM_HSEM_ISR_ISEM3_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HSEM_HSEM_ISR_ISEM4          (0x1UL << 4) 
#define HSEM_HSEM_ISR_ISEM4_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HSEM_HSEM_ISR_ISEM5          (0x1UL << 5) 
#define HSEM_HSEM_ISR_ISEM5_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define HSEM_HSEM_ISR_ISEM6          (0x1UL << 6) 
#define HSEM_HSEM_ISR_ISEM6_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HSEM_HSEM_ISR_ISEM7          (0x1UL << 7) 
#define HSEM_HSEM_ISR_ISEM7_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define HSEM_HSEM_ISR_ISEM8          (0x1UL << 8) 
#define HSEM_HSEM_ISR_ISEM8_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HSEM_HSEM_ISR_ISEM9          (0x1UL << 9) 
#define HSEM_HSEM_ISR_ISEM9_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HSEM_HSEM_ISR_ISEM10          (0x1UL << 10) 
#define HSEM_HSEM_ISR_ISEM10_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define HSEM_HSEM_ISR_ISEM11          (0x1UL << 11) 
#define HSEM_HSEM_ISR_ISEM11_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define HSEM_HSEM_ISR_ISEM12          (0x1UL << 12) 
#define HSEM_HSEM_ISR_ISEM12_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define HSEM_HSEM_ISR_ISEM13          (0x1UL << 13) 
#define HSEM_HSEM_ISR_ISEM13_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define HSEM_HSEM_ISR_ISEM14          (0x1UL << 14) 
#define HSEM_HSEM_ISR_ISEM14_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define HSEM_HSEM_ISR_ISEM15          (0x1UL << 15) 
#define HSEM_HSEM_ISR_ISEM15_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define HSEM_HSEM_ISR_ISEM16          (0x1UL << 16) 
#define HSEM_HSEM_ISR_ISEM16_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define HSEM_HSEM_ISR_ISEM17          (0x1UL << 17) 
#define HSEM_HSEM_ISR_ISEM17_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HSEM_HSEM_ISR_ISEM18          (0x1UL << 18) 
#define HSEM_HSEM_ISR_ISEM18_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HSEM_HSEM_ISR_ISEM19          (0x1UL << 19) 
#define HSEM_HSEM_ISR_ISEM19_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define HSEM_HSEM_ISR_ISEM20          (0x1UL << 20) 
#define HSEM_HSEM_ISR_ISEM20_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define HSEM_HSEM_ISR_ISEM21          (0x1UL << 21) 
#define HSEM_HSEM_ISR_ISEM21_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define HSEM_HSEM_ISR_ISEM22          (0x1UL << 22) 
#define HSEM_HSEM_ISR_ISEM22_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define HSEM_HSEM_ISR_ISEM23          (0x1UL << 23) 
#define HSEM_HSEM_ISR_ISEM23_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define HSEM_HSEM_ISR_ISEM24          (0x1UL << 24) 
#define HSEM_HSEM_ISR_ISEM24_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define HSEM_HSEM_ISR_ISEM25          (0x1UL << 25) 
#define HSEM_HSEM_ISR_ISEM25_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define HSEM_HSEM_ISR_ISEM26          (0x1UL << 26) 
#define HSEM_HSEM_ISR_ISEM26_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define HSEM_HSEM_ISR_ISEM27          (0x1UL << 27) 
#define HSEM_HSEM_ISR_ISEM27_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define HSEM_HSEM_ISR_ISEM28          (0x1UL << 28) 
#define HSEM_HSEM_ISR_ISEM28_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define HSEM_HSEM_ISR_ISEM29          (0x1UL << 29) 
#define HSEM_HSEM_ISR_ISEM29_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define HSEM_HSEM_ISR_ISEM30          (0x1UL << 30) 
#define HSEM_HSEM_ISR_ISEM30_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define HSEM_HSEM_ISR_ISEM31          (0x1UL << 31) 
#define HSEM_HSEM_ISR_ISEM31_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_MISR_ISEM0          (0x1UL << 0) 
#define HSEM_HSEM_MISR_ISEM0_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HSEM_HSEM_MISR_ISEM1          (0x1UL << 1) 
#define HSEM_HSEM_MISR_ISEM1_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HSEM_HSEM_MISR_ISEM2          (0x1UL << 2) 
#define HSEM_HSEM_MISR_ISEM2_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HSEM_HSEM_MISR_ISEM3          (0x1UL << 3) 
#define HSEM_HSEM_MISR_ISEM3_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HSEM_HSEM_MISR_ISEM4          (0x1UL << 4) 
#define HSEM_HSEM_MISR_ISEM4_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HSEM_HSEM_MISR_ISEM5          (0x1UL << 5) 
#define HSEM_HSEM_MISR_ISEM5_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define HSEM_HSEM_MISR_ISEM6          (0x1UL << 6) 
#define HSEM_HSEM_MISR_ISEM6_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HSEM_HSEM_MISR_ISEM7          (0x1UL << 7) 
#define HSEM_HSEM_MISR_ISEM7_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define HSEM_HSEM_MISR_ISEM8          (0x1UL << 8) 
#define HSEM_HSEM_MISR_ISEM8_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HSEM_HSEM_MISR_ISEM9          (0x1UL << 9) 
#define HSEM_HSEM_MISR_ISEM9_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HSEM_HSEM_MISR_ISEM10          (0x1UL << 10) 
#define HSEM_HSEM_MISR_ISEM10_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define HSEM_HSEM_MISR_ISEM11          (0x1UL << 11) 
#define HSEM_HSEM_MISR_ISEM11_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define HSEM_HSEM_MISR_ISEM12          (0x1UL << 12) 
#define HSEM_HSEM_MISR_ISEM12_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define HSEM_HSEM_MISR_ISEM13          (0x1UL << 13) 
#define HSEM_HSEM_MISR_ISEM13_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define HSEM_HSEM_MISR_ISEM14          (0x1UL << 14) 
#define HSEM_HSEM_MISR_ISEM14_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define HSEM_HSEM_MISR_ISEM15          (0x1UL << 15) 
#define HSEM_HSEM_MISR_ISEM15_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define HSEM_HSEM_MISR_ISEM16          (0x1UL << 16) 
#define HSEM_HSEM_MISR_ISEM16_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define HSEM_HSEM_MISR_ISEM17          (0x1UL << 17) 
#define HSEM_HSEM_MISR_ISEM17_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HSEM_HSEM_MISR_ISEM18          (0x1UL << 18) 
#define HSEM_HSEM_MISR_ISEM18_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HSEM_HSEM_MISR_ISEM19          (0x1UL << 19) 
#define HSEM_HSEM_MISR_ISEM19_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define HSEM_HSEM_MISR_ISEM20          (0x1UL << 20) 
#define HSEM_HSEM_MISR_ISEM20_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define HSEM_HSEM_MISR_ISEM21          (0x1UL << 21) 
#define HSEM_HSEM_MISR_ISEM21_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define HSEM_HSEM_MISR_ISEM22          (0x1UL << 22) 
#define HSEM_HSEM_MISR_ISEM22_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define HSEM_HSEM_MISR_ISEM23          (0x1UL << 23) 
#define HSEM_HSEM_MISR_ISEM23_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define HSEM_HSEM_MISR_ISEM24          (0x1UL << 24) 
#define HSEM_HSEM_MISR_ISEM24_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define HSEM_HSEM_MISR_ISEM25          (0x1UL << 25) 
#define HSEM_HSEM_MISR_ISEM25_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define HSEM_HSEM_MISR_ISEM26          (0x1UL << 26) 
#define HSEM_HSEM_MISR_ISEM26_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define HSEM_HSEM_MISR_ISEM27          (0x1UL << 27) 
#define HSEM_HSEM_MISR_ISEM27_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define HSEM_HSEM_MISR_ISEM28          (0x1UL << 28) 
#define HSEM_HSEM_MISR_ISEM28_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define HSEM_HSEM_MISR_ISEM29          (0x1UL << 29) 
#define HSEM_HSEM_MISR_ISEM29_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define HSEM_HSEM_MISR_ISEM30          (0x1UL << 30) 
#define HSEM_HSEM_MISR_ISEM30_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define HSEM_HSEM_MISR_ISEM31          (0x1UL << 31) 
#define HSEM_HSEM_MISR_ISEM31_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HSEM_HSEM_CR_MASTERID          (0xFFUL << 8) 
#define HSEM_HSEM_CR_MASTERID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define HSEM_HSEM_CR_KEY          (0xFFFFUL << 16) 
#define HSEM_HSEM_CR_KEY_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define HSEM_HSEM_KEYR_KEY          (0xFFFFUL << 16) 
#define HSEM_HSEM_KEYR_KEY_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)

