via/viaems/src/platforms/stm32h743/device.h
#define I2C3_CR1_PE          (0x1UL << 0) 
#define I2C3_CR1_PE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define I2C3_CR1_TXIE          (0x1UL << 1) 
#define I2C3_CR1_TXIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define I2C3_CR1_RXIE          (0x1UL << 2) 
#define I2C3_CR1_RXIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define I2C3_CR1_ADDRIE          (0x1UL << 3) 
#define I2C3_CR1_ADDRIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define I2C3_CR1_NACKIE          (0x1UL << 4) 
#define I2C3_CR1_NACKIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define I2C3_CR1_STOPIE          (0x1UL << 5) 
#define I2C3_CR1_STOPIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define I2C3_CR1_TCIE          (0x1UL << 6) 
#define I2C3_CR1_TCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define I2C3_CR1_ERRIE          (0x1UL << 7) 
#define I2C3_CR1_ERRIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define I2C3_CR1_DNF          (0xFUL << 8) 
#define I2C3_CR1_DNF_VAL(X) (((uint32_t)(X) & 0xFUL) << 8)
#define I2C3_CR1_ANFOFF          (0x1UL << 12) 
#define I2C3_CR1_ANFOFF_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define I2C3_CR1_TXDMAEN          (0x1UL << 14) 
#define I2C3_CR1_TXDMAEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define I2C3_CR1_RXDMAEN          (0x1UL << 15) 
#define I2C3_CR1_RXDMAEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define I2C3_CR1_SBC          (0x1UL << 16) 
#define I2C3_CR1_SBC_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define I2C3_CR1_NOSTRETCH          (0x1UL << 17) 
#define I2C3_CR1_NOSTRETCH_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define I2C3_CR1_WUPEN          (0x1UL << 18) 
#define I2C3_CR1_WUPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define I2C3_CR1_GCEN          (0x1UL << 19) 
#define I2C3_CR1_GCEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define I2C3_CR1_SMBHEN          (0x1UL << 20) 
#define I2C3_CR1_SMBHEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define I2C3_CR1_SMBDEN          (0x1UL << 21) 
#define I2C3_CR1_SMBDEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define I2C3_CR1_ALERTEN          (0x1UL << 22) 
#define I2C3_CR1_ALERTEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define I2C3_CR1_PECEN          (0x1UL << 23) 
#define I2C3_CR1_PECEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define I2C3_CR2_SADD0          (0x1UL << 0) 
#define I2C3_CR2_SADD0_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define I2C3_CR2_SADD1          (0x1UL << 1) 
#define I2C3_CR2_SADD1_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define I2C3_CR2_SADD2          (0x1UL << 2) 
#define I2C3_CR2_SADD2_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define I2C3_CR2_SADD3          (0x1UL << 3) 
#define I2C3_CR2_SADD3_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define I2C3_CR2_SADD4          (0x1UL << 4) 
#define I2C3_CR2_SADD4_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define I2C3_CR2_SADD5          (0x1UL << 5) 
#define I2C3_CR2_SADD5_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define I2C3_CR2_SADD6          (0x1UL << 6) 
#define I2C3_CR2_SADD6_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define I2C3_CR2_SADD7          (0x1UL << 7) 
#define I2C3_CR2_SADD7_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define I2C3_CR2_SADD8          (0x1UL << 8) 
#define I2C3_CR2_SADD8_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define I2C3_CR2_SADD9          (0x1UL << 9) 
#define I2C3_CR2_SADD9_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define I2C3_CR2_RD_WRN          (0x1UL << 10) 
#define I2C3_CR2_RD_WRN_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define I2C3_CR2_ADD10          (0x1UL << 11) 
#define I2C3_CR2_ADD10_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define I2C3_CR2_HEAD10R          (0x1UL << 12) 
#define I2C3_CR2_HEAD10R_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define I2C3_CR2_START          (0x1UL << 13) 
#define I2C3_CR2_START_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define I2C3_CR2_STOP          (0x1UL << 14) 
#define I2C3_CR2_STOP_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define I2C3_CR2_NACK          (0x1UL << 15) 
#define I2C3_CR2_NACK_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define I2C3_CR2_NBYTES          (0xFFUL << 16) 
#define I2C3_CR2_NBYTES_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define I2C3_CR2_RELOAD          (0x1UL << 24) 
#define I2C3_CR2_RELOAD_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define I2C3_CR2_AUTOEND          (0x1UL << 25) 
#define I2C3_CR2_AUTOEND_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define I2C3_CR2_PECBYTE          (0x1UL << 26) 
#define I2C3_CR2_PECBYTE_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define I2C3_OAR1_OA1          (0x3FFUL << 0) 
#define I2C3_OAR1_OA1_VAL(X) (((uint32_t)(X) & 0x3FFUL) << 0)
#define I2C3_OAR1_OA1MODE          (0x1UL << 10) 
#define I2C3_OAR1_OA1MODE_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define I2C3_OAR1_OA1EN          (0x1UL << 15) 
#define I2C3_OAR1_OA1EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define I2C3_OAR2_OA2          (0x7FUL << 1) 
#define I2C3_OAR2_OA2_VAL(X) (((uint32_t)(X) & 0x7FUL) << 1)
#define I2C3_OAR2_OA2MSK          (0x7UL << 8) 
#define I2C3_OAR2_OA2MSK_VAL(X) (((uint32_t)(X) & 0x7UL) << 8)
#define I2C3_OAR2_OA2EN          (0x1UL << 15) 
#define I2C3_OAR2_OA2EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define I2C3_TIMINGR_SCLL          (0xFFUL << 0) 
#define I2C3_TIMINGR_SCLL_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define I2C3_TIMINGR_SCLH          (0xFFUL << 8) 
#define I2C3_TIMINGR_SCLH_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define I2C3_TIMINGR_SDADEL          (0xFUL << 16) 
#define I2C3_TIMINGR_SDADEL_VAL(X) (((uint32_t)(X) & 0xFUL) << 16)
#define I2C3_TIMINGR_SCLDEL          (0xFUL << 20) 
#define I2C3_TIMINGR_SCLDEL_VAL(X) (((uint32_t)(X) & 0xFUL) << 20)
#define I2C3_TIMINGR_PRESC          (0xFUL << 28) 
#define I2C3_TIMINGR_PRESC_VAL(X) (((uint32_t)(X) & 0xFUL) << 28)
#define I2C3_TIMEOUTR_TIMEOUTA          (0xFFFUL << 0) 
#define I2C3_TIMEOUTR_TIMEOUTA_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 0)
#define I2C3_TIMEOUTR_TIDLE          (0x1UL << 12) 
#define I2C3_TIMEOUTR_TIDLE_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define I2C3_TIMEOUTR_TIMOUTEN          (0x1UL << 15) 
#define I2C3_TIMEOUTR_TIMOUTEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define I2C3_TIMEOUTR_TIMEOUTB          (0xFFFUL << 16) 
#define I2C3_TIMEOUTR_TIMEOUTB_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 16)
#define I2C3_TIMEOUTR_TEXTEN          (0x1UL << 31) 
#define I2C3_TIMEOUTR_TEXTEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define I2C3_ISR_TXE          (0x1UL << 0) 
#define I2C3_ISR_TXE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define I2C3_ISR_TXIS          (0x1UL << 1) 
#define I2C3_ISR_TXIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define I2C3_ISR_RXNE          (0x1UL << 2) 
#define I2C3_ISR_RXNE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define I2C3_ISR_ADDR          (0x1UL << 3) 
#define I2C3_ISR_ADDR_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define I2C3_ISR_NACKF          (0x1UL << 4) 
#define I2C3_ISR_NACKF_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define I2C3_ISR_STOPF          (0x1UL << 5) 
#define I2C3_ISR_STOPF_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define I2C3_ISR_TC          (0x1UL << 6) 
#define I2C3_ISR_TC_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define I2C3_ISR_TCR          (0x1UL << 7) 
#define I2C3_ISR_TCR_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define I2C3_ISR_BERR          (0x1UL << 8) 
#define I2C3_ISR_BERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define I2C3_ISR_ARLO          (0x1UL << 9) 
#define I2C3_ISR_ARLO_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define I2C3_ISR_OVR          (0x1UL << 10) 
#define I2C3_ISR_OVR_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define I2C3_ISR_PECERR          (0x1UL << 11) 
#define I2C3_ISR_PECERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define I2C3_ISR_TIMEOUT          (0x1UL << 12) 
#define I2C3_ISR_TIMEOUT_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define I2C3_ISR_ALERT          (0x1UL << 13) 
#define I2C3_ISR_ALERT_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define I2C3_ISR_BUSY          (0x1UL << 15) 
#define I2C3_ISR_BUSY_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define I2C3_ISR_DIR          (0x1UL << 16) 
#define I2C3_ISR_DIR_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define I2C3_ISR_ADDCODE          (0x7FUL << 17) 
#define I2C3_ISR_ADDCODE_VAL(X) (((uint32_t)(X) & 0x7FUL) << 17)
#define I2C3_ICR_ADDRCF          (0x1UL << 3) 
#define I2C3_ICR_ADDRCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define I2C3_ICR_NACKCF          (0x1UL << 4) 
#define I2C3_ICR_NACKCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define I2C3_ICR_STOPCF          (0x1UL << 5) 
#define I2C3_ICR_STOPCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define I2C3_ICR_BERRCF          (0x1UL << 8) 
#define I2C3_ICR_BERRCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define I2C3_ICR_ARLOCF          (0x1UL << 9) 
#define I2C3_ICR_ARLOCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define I2C3_ICR_OVRCF          (0x1UL << 10) 
#define I2C3_ICR_OVRCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define I2C3_ICR_PECCF          (0x1UL << 11) 
#define I2C3_ICR_PECCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define I2C3_ICR_TIMOUTCF          (0x1UL << 12) 
#define I2C3_ICR_TIMOUTCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define I2C3_ICR_ALERTCF          (0x1UL << 13) 
#define I2C3_ICR_ALERTCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define I2C3_PECR_PEC          (0xFFUL << 0) 
#define I2C3_PECR_PEC_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define I2C3_RXDR_RXDATA          (0xFFUL << 0) 
#define I2C3_RXDR_RXDATA_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define I2C3_TXDR_TXDATA          (0xFFUL << 0) 
#define I2C3_TXDR_TXDATA_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)

#define I2C3  ((struct I2C3*)(0x40005C00UL))
struct I2C4 {
  volatile uint32_t CR1;
  volatile uint32_t CR2;
  volatile uint32_t OAR1;
  volatile uint32_t OAR2;
  volatile uint32_t TIMINGR;
  volatile uint32_t TIMEOUTR;
  volatile uint32_t ISR;
  volatile uint32_t ICR;
  volatile const uint32_t PECR;
  volatile const uint32_t RXDR;
  volatile uint32_t TXDR;
};
#define I2C4_CR1_PE          (0x1UL << 0) 
#define I2C4_CR1_PE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define I2C4_CR1_TXIE          (0x1UL << 1) 
#define I2C4_CR1_TXIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define I2C4_CR1_RXIE          (0x1UL << 2) 
#define I2C4_CR1_RXIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define I2C4_CR1_ADDRIE          (0x1UL << 3) 
#define I2C4_CR1_ADDRIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define I2C4_CR1_NACKIE          (0x1UL << 4) 
#define I2C4_CR1_NACKIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define I2C4_CR1_STOPIE          (0x1UL << 5) 
#define I2C4_CR1_STOPIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define I2C4_CR1_TCIE          (0x1UL << 6) 
#define I2C4_CR1_TCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define I2C4_CR1_ERRIE          (0x1UL << 7) 
#define I2C4_CR1_ERRIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define I2C4_CR1_DNF          (0xFUL << 8) 
#define I2C4_CR1_DNF_VAL(X) (((uint32_t)(X) & 0xFUL) << 8)
#define I2C4_CR1_ANFOFF          (0x1UL << 12) 
#define I2C4_CR1_ANFOFF_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define I2C4_CR1_TXDMAEN          (0x1UL << 14) 
#define I2C4_CR1_TXDMAEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define I2C4_CR1_RXDMAEN          (0x1UL << 15) 
#define I2C4_CR1_RXDMAEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define I2C4_CR1_SBC          (0x1UL << 16) 
#define I2C4_CR1_SBC_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define I2C4_CR1_NOSTRETCH          (0x1UL << 17) 
#define I2C4_CR1_NOSTRETCH_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define I2C4_CR1_WUPEN          (0x1UL << 18) 
#define I2C4_CR1_WUPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define I2C4_CR1_GCEN          (0x1UL << 19) 
#define I2C4_CR1_GCEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define I2C4_CR1_SMBHEN          (0x1UL << 20) 
#define I2C4_CR1_SMBHEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define I2C4_CR1_SMBDEN          (0x1UL << 21) 
#define I2C4_CR1_SMBDEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define I2C4_CR1_ALERTEN          (0x1UL << 22) 
#define I2C4_CR1_ALERTEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define I2C4_CR1_PECEN          (0x1UL << 23) 
#define I2C4_CR1_PECEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define I2C4_CR2_SADD0          (0x1UL << 0) 
#define I2C4_CR2_SADD0_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define I2C4_CR2_SADD1          (0x1UL << 1) 
#define I2C4_CR2_SADD1_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define I2C4_CR2_SADD2          (0x1UL << 2) 
#define I2C4_CR2_SADD2_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define I2C4_CR2_SADD3          (0x1UL << 3) 
#define I2C4_CR2_SADD3_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define I2C4_CR2_SADD4          (0x1UL << 4) 
#define I2C4_CR2_SADD4_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define I2C4_CR2_SADD5          (0x1UL << 5) 
#define I2C4_CR2_SADD5_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define I2C4_CR2_SADD6          (0x1UL << 6) 
#define I2C4_CR2_SADD6_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define I2C4_CR2_SADD7          (0x1UL << 7) 
#define I2C4_CR2_SADD7_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define I2C4_CR2_SADD8          (0x1UL << 8) 
#define I2C4_CR2_SADD8_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define I2C4_CR2_SADD9          (0x1UL << 9) 
#define I2C4_CR2_SADD9_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define I2C4_CR2_RD_WRN          (0x1UL << 10) 
#define I2C4_CR2_RD_WRN_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define I2C4_CR2_ADD10          (0x1UL << 11) 
#define I2C4_CR2_ADD10_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define I2C4_CR2_HEAD10R          (0x1UL << 12) 
#define I2C4_CR2_HEAD10R_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define I2C4_CR2_START          (0x1UL << 13) 
#define I2C4_CR2_START_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define I2C4_CR2_STOP          (0x1UL << 14) 
#define I2C4_CR2_STOP_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define I2C4_CR2_NACK          (0x1UL << 15) 
#define I2C4_CR2_NACK_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define I2C4_CR2_NBYTES          (0xFFUL << 16) 
#define I2C4_CR2_NBYTES_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define I2C4_CR2_RELOAD          (0x1UL << 24) 
#define I2C4_CR2_RELOAD_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define I2C4_CR2_AUTOEND          (0x1UL << 25) 
#define I2C4_CR2_AUTOEND_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define I2C4_CR2_PECBYTE          (0x1UL << 26) 
#define I2C4_CR2_PECBYTE_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define I2C4_OAR1_OA1          (0x3FFUL << 0) 
#define I2C4_OAR1_OA1_VAL(X) (((uint32_t)(X) & 0x3FFUL) << 0)
#define I2C4_OAR1_OA1MODE          (0x1UL << 10) 
#define I2C4_OAR1_OA1MODE_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define I2C4_OAR1_OA1EN          (0x1UL << 15) 
#define I2C4_OAR1_OA1EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define I2C4_OAR2_OA2          (0x7FUL << 1) 
#define I2C4_OAR2_OA2_VAL(X) (((uint32_t)(X) & 0x7FUL) << 1)
#define I2C4_OAR2_OA2MSK          (0x7UL << 8) 
#define I2C4_OAR2_OA2MSK_VAL(X) (((uint32_t)(X) & 0x7UL) << 8)
#define I2C4_OAR2_OA2EN          (0x1UL << 15) 
#define I2C4_OAR2_OA2EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define I2C4_TIMINGR_SCLL          (0xFFUL << 0) 
#define I2C4_TIMINGR_SCLL_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define I2C4_TIMINGR_SCLH          (0xFFUL << 8) 
#define I2C4_TIMINGR_SCLH_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define I2C4_TIMINGR_SDADEL          (0xFUL << 16) 
#define I2C4_TIMINGR_SDADEL_VAL(X) (((uint32_t)(X) & 0xFUL) << 16)
#define I2C4_TIMINGR_SCLDEL          (0xFUL << 20) 
#define I2C4_TIMINGR_SCLDEL_VAL(X) (((uint32_t)(X) & 0xFUL) << 20)
#define I2C4_TIMINGR_PRESC          (0xFUL << 28) 
#define I2C4_TIMINGR_PRESC_VAL(X) (((uint32_t)(X) & 0xFUL) << 28)
#define I2C4_TIMEOUTR_TIMEOUTA          (0xFFFUL << 0) 
#define I2C4_TIMEOUTR_TIMEOUTA_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 0)
#define I2C4_TIMEOUTR_TIDLE          (0x1UL << 12) 
#define I2C4_TIMEOUTR_TIDLE_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define I2C4_TIMEOUTR_TIMOUTEN          (0x1UL << 15) 
#define I2C4_TIMEOUTR_TIMOUTEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define I2C4_TIMEOUTR_TIMEOUTB          (0xFFFUL << 16) 
#define I2C4_TIMEOUTR_TIMEOUTB_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 16)
#define I2C4_TIMEOUTR_TEXTEN          (0x1UL << 31) 
#define I2C4_TIMEOUTR_TEXTEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define I2C4_ISR_TXE          (0x1UL << 0) 
#define I2C4_ISR_TXE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define I2C4_ISR_TXIS          (0x1UL << 1) 
#define I2C4_ISR_TXIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define I2C4_ISR_RXNE          (0x1UL << 2) 
#define I2C4_ISR_RXNE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define I2C4_ISR_ADDR          (0x1UL << 3) 
#define I2C4_ISR_ADDR_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define I2C4_ISR_NACKF          (0x1UL << 4) 
#define I2C4_ISR_NACKF_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define I2C4_ISR_STOPF          (0x1UL << 5) 
#define I2C4_ISR_STOPF_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define I2C4_ISR_TC          (0x1UL << 6) 
#define I2C4_ISR_TC_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define I2C4_ISR_TCR          (0x1UL << 7) 
#define I2C4_ISR_TCR_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define I2C4_ISR_BERR          (0x1UL << 8) 
#define I2C4_ISR_BERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define I2C4_ISR_ARLO          (0x1UL << 9) 
#define I2C4_ISR_ARLO_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define I2C4_ISR_OVR          (0x1UL << 10) 
#define I2C4_ISR_OVR_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define I2C4_ISR_PECERR          (0x1UL << 11) 
#define I2C4_ISR_PECERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define I2C4_ISR_TIMEOUT          (0x1UL << 12) 
#define I2C4_ISR_TIMEOUT_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define I2C4_ISR_ALERT          (0x1UL << 13) 
#define I2C4_ISR_ALERT_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define I2C4_ISR_BUSY          (0x1UL << 15) 
#define I2C4_ISR_BUSY_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define I2C4_ISR_DIR          (0x1UL << 16) 
#define I2C4_ISR_DIR_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define I2C4_ISR_ADDCODE          (0x7FUL << 17) 
#define I2C4_ISR_ADDCODE_VAL(X) (((uint32_t)(X) & 0x7FUL) << 17)
#define I2C4_ICR_ADDRCF          (0x1UL << 3) 
#define I2C4_ICR_ADDRCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define I2C4_ICR_NACKCF          (0x1UL << 4) 
#define I2C4_ICR_NACKCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define I2C4_ICR_STOPCF          (0x1UL << 5) 
#define I2C4_ICR_STOPCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define I2C4_ICR_BERRCF          (0x1UL << 8) 
#define I2C4_ICR_BERRCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define I2C4_ICR_ARLOCF          (0x1UL << 9) 
#define I2C4_ICR_ARLOCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define I2C4_ICR_OVRCF          (0x1UL << 10) 
#define I2C4_ICR_OVRCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define I2C4_ICR_PECCF          (0x1UL << 11) 
#define I2C4_ICR_PECCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define I2C4_ICR_TIMOUTCF          (0x1UL << 12) 
#define I2C4_ICR_TIMOUTCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define I2C4_ICR_ALERTCF          (0x1UL << 13) 
#define I2C4_ICR_ALERTCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define I2C4_PECR_PEC          (0xFFUL << 0) 
#define I2C4_PECR_PEC_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define I2C4_RXDR_RXDATA          (0xFFUL << 0) 
#define I2C4_RXDR_RXDATA_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define I2C4_TXDR_TXDATA          (0xFFUL << 0) 
#define I2C4_TXDR_TXDATA_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)

