via/viaems/src/platforms/stm32h743/device.h
#define GPIOK_MODER_MODE0          (0x3UL << 0) 
#define GPIOK_MODER_MODE0_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define GPIOK_MODER_MODE1          (0x3UL << 2) 
#define GPIOK_MODER_MODE1_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define GPIOK_MODER_MODE2          (0x3UL << 4) 
#define GPIOK_MODER_MODE2_VAL(X) (((uint32_t)(X) & 0x3UL) << 4)
#define GPIOK_MODER_MODE3          (0x3UL << 6) 
#define GPIOK_MODER_MODE3_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define GPIOK_MODER_MODE4          (0x3UL << 8) 
#define GPIOK_MODER_MODE4_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define GPIOK_MODER_MODE5          (0x3UL << 10) 
#define GPIOK_MODER_MODE5_VAL(X) (((uint32_t)(X) & 0x3UL) << 10)
#define GPIOK_MODER_MODE6          (0x3UL << 12) 
#define GPIOK_MODER_MODE6_VAL(X) (((uint32_t)(X) & 0x3UL) << 12)
#define GPIOK_MODER_MODE7          (0x3UL << 14) 
#define GPIOK_MODER_MODE7_VAL(X) (((uint32_t)(X) & 0x3UL) << 14)
#define GPIOK_MODER_MODE8          (0x3UL << 16) 
#define GPIOK_MODER_MODE8_VAL(X) (((uint32_t)(X) & 0x3UL) << 16)
#define GPIOK_MODER_MODE9          (0x3UL << 18) 
#define GPIOK_MODER_MODE9_VAL(X) (((uint32_t)(X) & 0x3UL) << 18)
#define GPIOK_MODER_MODE10          (0x3UL << 20) 
#define GPIOK_MODER_MODE10_VAL(X) (((uint32_t)(X) & 0x3UL) << 20)
#define GPIOK_MODER_MODE11          (0x3UL << 22) 
#define GPIOK_MODER_MODE11_VAL(X) (((uint32_t)(X) & 0x3UL) << 22)
#define GPIOK_MODER_MODE12          (0x3UL << 24) 
#define GPIOK_MODER_MODE12_VAL(X) (((uint32_t)(X) & 0x3UL) << 24)
#define GPIOK_MODER_MODE13          (0x3UL << 26) 
#define GPIOK_MODER_MODE13_VAL(X) (((uint32_t)(X) & 0x3UL) << 26)
#define GPIOK_MODER_MODE14          (0x3UL << 28) 
#define GPIOK_MODER_MODE14_VAL(X) (((uint32_t)(X) & 0x3UL) << 28)
#define GPIOK_MODER_MODE15          (0x3UL << 30) 
#define GPIOK_MODER_MODE15_VAL(X) (((uint32_t)(X) & 0x3UL) << 30)
#define GPIOK_OTYPER_OT0          (0x1UL << 0) 
#define GPIOK_OTYPER_OT0_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define GPIOK_OTYPER_OT1          (0x1UL << 1) 
#define GPIOK_OTYPER_OT1_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define GPIOK_OTYPER_OT2          (0x1UL << 2) 
#define GPIOK_OTYPER_OT2_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define GPIOK_OTYPER_OT3          (0x1UL << 3) 
#define GPIOK_OTYPER_OT3_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define GPIOK_OTYPER_OT4          (0x1UL << 4) 
#define GPIOK_OTYPER_OT4_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define GPIOK_OTYPER_OT5          (0x1UL << 5) 
#define GPIOK_OTYPER_OT5_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define GPIOK_OTYPER_OT6          (0x1UL << 6) 
#define GPIOK_OTYPER_OT6_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define GPIOK_OTYPER_OT7          (0x1UL << 7) 
#define GPIOK_OTYPER_OT7_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define GPIOK_OTYPER_OT8          (0x1UL << 8) 
#define GPIOK_OTYPER_OT8_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define GPIOK_OTYPER_OT9          (0x1UL << 9) 
#define GPIOK_OTYPER_OT9_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define GPIOK_OTYPER_OT10          (0x1UL << 10) 
#define GPIOK_OTYPER_OT10_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define GPIOK_OTYPER_OT11          (0x1UL << 11) 
#define GPIOK_OTYPER_OT11_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define GPIOK_OTYPER_OT12          (0x1UL << 12) 
#define GPIOK_OTYPER_OT12_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define GPIOK_OTYPER_OT13          (0x1UL << 13) 
#define GPIOK_OTYPER_OT13_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define GPIOK_OTYPER_OT14          (0x1UL << 14) 
#define GPIOK_OTYPER_OT14_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define GPIOK_OTYPER_OT15          (0x1UL << 15) 
#define GPIOK_OTYPER_OT15_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define GPIOK_OSPEEDR_OSPEED0          (0x3UL << 0) 
#define GPIOK_OSPEEDR_OSPEED0_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define GPIOK_OSPEEDR_OSPEED1          (0x3UL << 2) 
#define GPIOK_OSPEEDR_OSPEED1_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define GPIOK_OSPEEDR_OSPEED2          (0x3UL << 4) 
#define GPIOK_OSPEEDR_OSPEED2_VAL(X) (((uint32_t)(X) & 0x3UL) << 4)
#define GPIOK_OSPEEDR_OSPEED3          (0x3UL << 6) 
#define GPIOK_OSPEEDR_OSPEED3_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define GPIOK_OSPEEDR_OSPEED4          (0x3UL << 8) 
#define GPIOK_OSPEEDR_OSPEED4_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define GPIOK_OSPEEDR_OSPEED5          (0x3UL << 10) 
#define GPIOK_OSPEEDR_OSPEED5_VAL(X) (((uint32_t)(X) & 0x3UL) << 10)
#define GPIOK_OSPEEDR_OSPEED6          (0x3UL << 12) 
#define GPIOK_OSPEEDR_OSPEED6_VAL(X) (((uint32_t)(X) & 0x3UL) << 12)
#define GPIOK_OSPEEDR_OSPEED7          (0x3UL << 14) 
#define GPIOK_OSPEEDR_OSPEED7_VAL(X) (((uint32_t)(X) & 0x3UL) << 14)
#define GPIOK_OSPEEDR_OSPEED8          (0x3UL << 16) 
#define GPIOK_OSPEEDR_OSPEED8_VAL(X) (((uint32_t)(X) & 0x3UL) << 16)
#define GPIOK_OSPEEDR_OSPEED9          (0x3UL << 18) 
#define GPIOK_OSPEEDR_OSPEED9_VAL(X) (((uint32_t)(X) & 0x3UL) << 18)
#define GPIOK_OSPEEDR_OSPEED10          (0x3UL << 20) 
#define GPIOK_OSPEEDR_OSPEED10_VAL(X) (((uint32_t)(X) & 0x3UL) << 20)
#define GPIOK_OSPEEDR_OSPEED11          (0x3UL << 22) 
#define GPIOK_OSPEEDR_OSPEED11_VAL(X) (((uint32_t)(X) & 0x3UL) << 22)
#define GPIOK_OSPEEDR_OSPEED12          (0x3UL << 24) 
#define GPIOK_OSPEEDR_OSPEED12_VAL(X) (((uint32_t)(X) & 0x3UL) << 24)
#define GPIOK_OSPEEDR_OSPEED13          (0x3UL << 26) 
#define GPIOK_OSPEEDR_OSPEED13_VAL(X) (((uint32_t)(X) & 0x3UL) << 26)
#define GPIOK_OSPEEDR_OSPEED14          (0x3UL << 28) 
#define GPIOK_OSPEEDR_OSPEED14_VAL(X) (((uint32_t)(X) & 0x3UL) << 28)
#define GPIOK_OSPEEDR_OSPEED15          (0x3UL << 30) 
#define GPIOK_OSPEEDR_OSPEED15_VAL(X) (((uint32_t)(X) & 0x3UL) << 30)
#define GPIOK_PUPDR_PUPD0          (0x3UL << 0) 
#define GPIOK_PUPDR_PUPD0_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define GPIOK_PUPDR_PUPD1          (0x3UL << 2) 
#define GPIOK_PUPDR_PUPD1_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define GPIOK_PUPDR_PUPD2          (0x3UL << 4) 
#define GPIOK_PUPDR_PUPD2_VAL(X) (((uint32_t)(X) & 0x3UL) << 4)
#define GPIOK_PUPDR_PUPD3          (0x3UL << 6) 
#define GPIOK_PUPDR_PUPD3_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define GPIOK_PUPDR_PUPD4          (0x3UL << 8) 
#define GPIOK_PUPDR_PUPD4_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define GPIOK_PUPDR_PUPD5          (0x3UL << 10) 
#define GPIOK_PUPDR_PUPD5_VAL(X) (((uint32_t)(X) & 0x3UL) << 10)
#define GPIOK_PUPDR_PUPD6          (0x3UL << 12) 
#define GPIOK_PUPDR_PUPD6_VAL(X) (((uint32_t)(X) & 0x3UL) << 12)
#define GPIOK_PUPDR_PUPD7          (0x3UL << 14) 
#define GPIOK_PUPDR_PUPD7_VAL(X) (((uint32_t)(X) & 0x3UL) << 14)
#define GPIOK_PUPDR_PUPD8          (0x3UL << 16) 
#define GPIOK_PUPDR_PUPD8_VAL(X) (((uint32_t)(X) & 0x3UL) << 16)
#define GPIOK_PUPDR_PUPD9          (0x3UL << 18) 
#define GPIOK_PUPDR_PUPD9_VAL(X) (((uint32_t)(X) & 0x3UL) << 18)
#define GPIOK_PUPDR_PUPD10          (0x3UL << 20) 
#define GPIOK_PUPDR_PUPD10_VAL(X) (((uint32_t)(X) & 0x3UL) << 20)
#define GPIOK_PUPDR_PUPD11          (0x3UL << 22) 
#define GPIOK_PUPDR_PUPD11_VAL(X) (((uint32_t)(X) & 0x3UL) << 22)
#define GPIOK_PUPDR_PUPD12          (0x3UL << 24) 
#define GPIOK_PUPDR_PUPD12_VAL(X) (((uint32_t)(X) & 0x3UL) << 24)
#define GPIOK_PUPDR_PUPD13          (0x3UL << 26) 
#define GPIOK_PUPDR_PUPD13_VAL(X) (((uint32_t)(X) & 0x3UL) << 26)
#define GPIOK_PUPDR_PUPD14          (0x3UL << 28) 
#define GPIOK_PUPDR_PUPD14_VAL(X) (((uint32_t)(X) & 0x3UL) << 28)
#define GPIOK_PUPDR_PUPD15          (0x3UL << 30) 
#define GPIOK_PUPDR_PUPD15_VAL(X) (((uint32_t)(X) & 0x3UL) << 30)
#define GPIOK_IDR_ID0          (0x1UL << 0) 
#define GPIOK_IDR_ID0_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define GPIOK_IDR_ID1          (0x1UL << 1) 
#define GPIOK_IDR_ID1_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define GPIOK_IDR_ID2          (0x1UL << 2) 
#define GPIOK_IDR_ID2_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define GPIOK_IDR_ID3          (0x1UL << 3) 
#define GPIOK_IDR_ID3_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define GPIOK_IDR_ID4          (0x1UL << 4) 
#define GPIOK_IDR_ID4_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define GPIOK_IDR_ID5          (0x1UL << 5) 
#define GPIOK_IDR_ID5_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define GPIOK_IDR_ID6          (0x1UL << 6) 
#define GPIOK_IDR_ID6_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define GPIOK_IDR_ID7          (0x1UL << 7) 
#define GPIOK_IDR_ID7_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define GPIOK_IDR_ID8          (0x1UL << 8) 
#define GPIOK_IDR_ID8_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define GPIOK_IDR_ID9          (0x1UL << 9) 
#define GPIOK_IDR_ID9_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define GPIOK_IDR_ID10          (0x1UL << 10) 
#define GPIOK_IDR_ID10_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define GPIOK_IDR_ID11          (0x1UL << 11) 
#define GPIOK_IDR_ID11_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define GPIOK_IDR_ID12          (0x1UL << 12) 
#define GPIOK_IDR_ID12_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define GPIOK_IDR_ID13          (0x1UL << 13) 
#define GPIOK_IDR_ID13_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define GPIOK_IDR_ID14          (0x1UL << 14) 
#define GPIOK_IDR_ID14_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define GPIOK_IDR_ID15          (0x1UL << 15) 
#define GPIOK_IDR_ID15_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define GPIOK_ODR_OD0          (0x1UL << 0) 
#define GPIOK_ODR_OD0_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define GPIOK_ODR_OD1          (0x1UL << 1) 
#define GPIOK_ODR_OD1_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define GPIOK_ODR_OD2          (0x1UL << 2) 
#define GPIOK_ODR_OD2_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define GPIOK_ODR_OD3          (0x1UL << 3) 
#define GPIOK_ODR_OD3_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define GPIOK_ODR_OD4          (0x1UL << 4) 
#define GPIOK_ODR_OD4_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define GPIOK_ODR_OD5          (0x1UL << 5) 
#define GPIOK_ODR_OD5_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define GPIOK_ODR_OD6          (0x1UL << 6) 
#define GPIOK_ODR_OD6_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define GPIOK_ODR_OD7          (0x1UL << 7) 
#define GPIOK_ODR_OD7_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define GPIOK_ODR_OD8          (0x1UL << 8) 
#define GPIOK_ODR_OD8_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define GPIOK_ODR_OD9          (0x1UL << 9) 
#define GPIOK_ODR_OD9_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define GPIOK_ODR_OD10          (0x1UL << 10) 
#define GPIOK_ODR_OD10_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define GPIOK_ODR_OD11          (0x1UL << 11) 
#define GPIOK_ODR_OD11_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define GPIOK_ODR_OD12          (0x1UL << 12) 
#define GPIOK_ODR_OD12_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define GPIOK_ODR_OD13          (0x1UL << 13) 
#define GPIOK_ODR_OD13_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define GPIOK_ODR_OD14          (0x1UL << 14) 
#define GPIOK_ODR_OD14_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define GPIOK_ODR_OD15          (0x1UL << 15) 
#define GPIOK_ODR_OD15_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define GPIOK_BSRR_BS0          (0x1UL << 0) 
#define GPIOK_BSRR_BS0_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define GPIOK_BSRR_BS1          (0x1UL << 1) 
#define GPIOK_BSRR_BS1_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define GPIOK_BSRR_BS2          (0x1UL << 2) 
#define GPIOK_BSRR_BS2_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define GPIOK_BSRR_BS3          (0x1UL << 3) 
#define GPIOK_BSRR_BS3_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define GPIOK_BSRR_BS4          (0x1UL << 4) 
#define GPIOK_BSRR_BS4_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define GPIOK_BSRR_BS5          (0x1UL << 5) 
#define GPIOK_BSRR_BS5_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define GPIOK_BSRR_BS6          (0x1UL << 6) 
#define GPIOK_BSRR_BS6_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define GPIOK_BSRR_BS7          (0x1UL << 7) 
#define GPIOK_BSRR_BS7_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define GPIOK_BSRR_BS8          (0x1UL << 8) 
#define GPIOK_BSRR_BS8_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define GPIOK_BSRR_BS9          (0x1UL << 9) 
#define GPIOK_BSRR_BS9_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define GPIOK_BSRR_BS10          (0x1UL << 10) 
#define GPIOK_BSRR_BS10_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define GPIOK_BSRR_BS11          (0x1UL << 11) 
#define GPIOK_BSRR_BS11_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define GPIOK_BSRR_BS12          (0x1UL << 12) 
#define GPIOK_BSRR_BS12_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define GPIOK_BSRR_BS13          (0x1UL << 13) 
#define GPIOK_BSRR_BS13_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define GPIOK_BSRR_BS14          (0x1UL << 14) 
#define GPIOK_BSRR_BS14_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define GPIOK_BSRR_BS15          (0x1UL << 15) 
#define GPIOK_BSRR_BS15_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define GPIOK_BSRR_BR0          (0x1UL << 16) 
#define GPIOK_BSRR_BR0_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define GPIOK_BSRR_BR1          (0x1UL << 17) 
#define GPIOK_BSRR_BR1_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define GPIOK_BSRR_BR2          (0x1UL << 18) 
#define GPIOK_BSRR_BR2_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define GPIOK_BSRR_BR3          (0x1UL << 19) 
#define GPIOK_BSRR_BR3_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define GPIOK_BSRR_BR4          (0x1UL << 20) 
#define GPIOK_BSRR_BR4_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define GPIOK_BSRR_BR5          (0x1UL << 21) 
#define GPIOK_BSRR_BR5_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define GPIOK_BSRR_BR6          (0x1UL << 22) 
#define GPIOK_BSRR_BR6_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define GPIOK_BSRR_BR7          (0x1UL << 23) 
#define GPIOK_BSRR_BR7_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define GPIOK_BSRR_BR8          (0x1UL << 24) 
#define GPIOK_BSRR_BR8_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define GPIOK_BSRR_BR9          (0x1UL << 25) 
#define GPIOK_BSRR_BR9_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define GPIOK_BSRR_BR10          (0x1UL << 26) 
#define GPIOK_BSRR_BR10_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define GPIOK_BSRR_BR11          (0x1UL << 27) 
#define GPIOK_BSRR_BR11_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define GPIOK_BSRR_BR12          (0x1UL << 28) 
#define GPIOK_BSRR_BR12_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define GPIOK_BSRR_BR13          (0x1UL << 29) 
#define GPIOK_BSRR_BR13_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define GPIOK_BSRR_BR14          (0x1UL << 30) 
#define GPIOK_BSRR_BR14_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define GPIOK_BSRR_BR15          (0x1UL << 31) 
#define GPIOK_BSRR_BR15_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define GPIOK_LCKR_LCK0          (0x1UL << 0) 
#define GPIOK_LCKR_LCK0_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define GPIOK_LCKR_LCK1          (0x1UL << 1) 
#define GPIOK_LCKR_LCK1_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define GPIOK_LCKR_LCK2          (0x1UL << 2) 
#define GPIOK_LCKR_LCK2_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define GPIOK_LCKR_LCK3          (0x1UL << 3) 
#define GPIOK_LCKR_LCK3_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define GPIOK_LCKR_LCK4          (0x1UL << 4) 
#define GPIOK_LCKR_LCK4_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define GPIOK_LCKR_LCK5          (0x1UL << 5) 
#define GPIOK_LCKR_LCK5_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define GPIOK_LCKR_LCK6          (0x1UL << 6) 
#define GPIOK_LCKR_LCK6_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define GPIOK_LCKR_LCK7          (0x1UL << 7) 
#define GPIOK_LCKR_LCK7_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define GPIOK_LCKR_LCK8          (0x1UL << 8) 
#define GPIOK_LCKR_LCK8_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define GPIOK_LCKR_LCK9          (0x1UL << 9) 
#define GPIOK_LCKR_LCK9_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define GPIOK_LCKR_LCK10          (0x1UL << 10) 
#define GPIOK_LCKR_LCK10_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define GPIOK_LCKR_LCK11          (0x1UL << 11) 
#define GPIOK_LCKR_LCK11_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define GPIOK_LCKR_LCK12          (0x1UL << 12) 
#define GPIOK_LCKR_LCK12_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define GPIOK_LCKR_LCK13          (0x1UL << 13) 
#define GPIOK_LCKR_LCK13_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define GPIOK_LCKR_LCK14          (0x1UL << 14) 
#define GPIOK_LCKR_LCK14_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define GPIOK_LCKR_LCK15          (0x1UL << 15) 
#define GPIOK_LCKR_LCK15_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define GPIOK_LCKR_LCKK          (0x1UL << 16) 
#define GPIOK_LCKR_LCKK_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define GPIOK_AFRL_AFSEL0          (0xFUL << 0) 
#define GPIOK_AFRL_AFSEL0_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define GPIOK_AFRL_AFSEL1          (0xFUL << 4) 
#define GPIOK_AFRL_AFSEL1_VAL(X) (((uint32_t)(X) & 0xFUL) << 4)
#define GPIOK_AFRL_AFSEL2          (0xFUL << 8) 
#define GPIOK_AFRL_AFSEL2_VAL(X) (((uint32_t)(X) & 0xFUL) << 8)
#define GPIOK_AFRL_AFSEL3          (0xFUL << 12) 
#define GPIOK_AFRL_AFSEL3_VAL(X) (((uint32_t)(X) & 0xFUL) << 12)
#define GPIOK_AFRL_AFSEL4          (0xFUL << 16) 
#define GPIOK_AFRL_AFSEL4_VAL(X) (((uint32_t)(X) & 0xFUL) << 16)
#define GPIOK_AFRL_AFSEL5          (0xFUL << 20) 
#define GPIOK_AFRL_AFSEL5_VAL(X) (((uint32_t)(X) & 0xFUL) << 20)
#define GPIOK_AFRL_AFSEL6          (0xFUL << 24) 
#define GPIOK_AFRL_AFSEL6_VAL(X) (((uint32_t)(X) & 0xFUL) << 24)
#define GPIOK_AFRL_AFSEL7          (0xFUL << 28) 
#define GPIOK_AFRL_AFSEL7_VAL(X) (((uint32_t)(X) & 0xFUL) << 28)
#define GPIOK_AFRH_AFSEL8          (0xFUL << 0) 
#define GPIOK_AFRH_AFSEL8_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define GPIOK_AFRH_AFSEL9          (0xFUL << 4) 
#define GPIOK_AFRH_AFSEL9_VAL(X) (((uint32_t)(X) & 0xFUL) << 4)
#define GPIOK_AFRH_AFSEL10          (0xFUL << 8) 
#define GPIOK_AFRH_AFSEL10_VAL(X) (((uint32_t)(X) & 0xFUL) << 8)
#define GPIOK_AFRH_AFSEL11          (0xFUL << 12) 
#define GPIOK_AFRH_AFSEL11_VAL(X) (((uint32_t)(X) & 0xFUL) << 12)
#define GPIOK_AFRH_AFSEL12          (0xFUL << 16) 
#define GPIOK_AFRH_AFSEL12_VAL(X) (((uint32_t)(X) & 0xFUL) << 16)
#define GPIOK_AFRH_AFSEL13          (0xFUL << 20) 
#define GPIOK_AFRH_AFSEL13_VAL(X) (((uint32_t)(X) & 0xFUL) << 20)
#define GPIOK_AFRH_AFSEL14          (0xFUL << 24) 
#define GPIOK_AFRH_AFSEL14_VAL(X) (((uint32_t)(X) & 0xFUL) << 24)
#define GPIOK_AFRH_AFSEL15          (0xFUL << 28) 
#define GPIOK_AFRH_AFSEL15_VAL(X) (((uint32_t)(X) & 0xFUL) << 28)

