via/viaems/src/platforms/stm32h743/device.h
#define GPIOK  ((struct GPIOK*)(0x58022800UL))
struct JPEG {
  volatile uint32_t CONFR0;
  volatile uint32_t CONFR1;
  volatile uint32_t CONFR2;
  volatile uint32_t CONFR3;
  volatile uint32_t CONFRN1;
  volatile uint32_t CONFRN2;
  volatile uint32_t CONFRN3;
  volatile uint32_t CONFRN4;
  const volatile uint32_t RESERVED48[4];
  volatile uint32_t CR;
  volatile const uint32_t SR;
  volatile uint32_t CFR;
  const volatile uint32_t RESERVED64[1];
  volatile uint32_t DIR;
  volatile const uint32_t DOR;
};
#define JPEG_CONFR0_START          (0x1UL << 0) 
#define JPEG_CONFR0_START_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define JPEG_CONFR1_NF          (0x3UL << 0) 
#define JPEG_CONFR1_NF_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define JPEG_CONFR1_DE          (0x1UL << 3) 
#define JPEG_CONFR1_DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define JPEG_CONFR1_COLORSPACE          (0x3UL << 4) 
#define JPEG_CONFR1_COLORSPACE_VAL(X) (((uint32_t)(X) & 0x3UL) << 4)
#define JPEG_CONFR1_NS          (0x3UL << 6) 
#define JPEG_CONFR1_NS_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define JPEG_CONFR1_HDR          (0x1UL << 8) 
#define JPEG_CONFR1_HDR_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define JPEG_CONFR1_YSIZE          (0xFFFFUL << 16) 
#define JPEG_CONFR1_YSIZE_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define JPEG_CONFR2_NMCU          (0x3FFFFFFUL << 0) 
#define JPEG_CONFR2_NMCU_VAL(X) (((uint32_t)(X) & 0x3FFFFFFUL) << 0)
#define JPEG_CONFR3_XSIZE          (0xFFFFUL << 16) 
#define JPEG_CONFR3_XSIZE_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define JPEG_CONFRN1_HD          (0x1UL << 0) 
#define JPEG_CONFRN1_HD_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define JPEG_CONFRN1_HA          (0x1UL << 1) 
#define JPEG_CONFRN1_HA_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define JPEG_CONFRN1_QT          (0x3UL << 2) 
#define JPEG_CONFRN1_QT_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define JPEG_CONFRN1_NB          (0xFUL << 4) 
#define JPEG_CONFRN1_NB_VAL(X) (((uint32_t)(X) & 0xFUL) << 4)
#define JPEG_CONFRN1_VSF          (0xFUL << 8) 
#define JPEG_CONFRN1_VSF_VAL(X) (((uint32_t)(X) & 0xFUL) << 8)
#define JPEG_CONFRN1_HSF          (0xFUL << 12) 
#define JPEG_CONFRN1_HSF_VAL(X) (((uint32_t)(X) & 0xFUL) << 12)
#define JPEG_CONFRN2_HD          (0x1UL << 0) 
#define JPEG_CONFRN2_HD_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define JPEG_CONFRN2_HA          (0x1UL << 1) 
#define JPEG_CONFRN2_HA_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define JPEG_CONFRN2_QT          (0x3UL << 2) 
#define JPEG_CONFRN2_QT_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define JPEG_CONFRN2_NB          (0xFUL << 4) 
#define JPEG_CONFRN2_NB_VAL(X) (((uint32_t)(X) & 0xFUL) << 4)
#define JPEG_CONFRN2_VSF          (0xFUL << 8) 
#define JPEG_CONFRN2_VSF_VAL(X) (((uint32_t)(X) & 0xFUL) << 8)
#define JPEG_CONFRN2_HSF          (0xFUL << 12) 
#define JPEG_CONFRN2_HSF_VAL(X) (((uint32_t)(X) & 0xFUL) << 12)
#define JPEG_CONFRN3_HD          (0x1UL << 0) 
#define JPEG_CONFRN3_HD_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define JPEG_CONFRN3_HA          (0x1UL << 1) 
#define JPEG_CONFRN3_HA_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define JPEG_CONFRN3_QT          (0x3UL << 2) 
#define JPEG_CONFRN3_QT_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define JPEG_CONFRN3_NB          (0xFUL << 4) 
#define JPEG_CONFRN3_NB_VAL(X) (((uint32_t)(X) & 0xFUL) << 4)
#define JPEG_CONFRN3_VSF          (0xFUL << 8) 
#define JPEG_CONFRN3_VSF_VAL(X) (((uint32_t)(X) & 0xFUL) << 8)
#define JPEG_CONFRN3_HSF          (0xFUL << 12) 
#define JPEG_CONFRN3_HSF_VAL(X) (((uint32_t)(X) & 0xFUL) << 12)
#define JPEG_CONFRN4_HD          (0x1UL << 0) 
#define JPEG_CONFRN4_HD_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define JPEG_CONFRN4_HA          (0x1UL << 1) 
#define JPEG_CONFRN4_HA_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define JPEG_CONFRN4_QT          (0x3UL << 2) 
#define JPEG_CONFRN4_QT_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define JPEG_CONFRN4_NB          (0xFUL << 4) 
#define JPEG_CONFRN4_NB_VAL(X) (((uint32_t)(X) & 0xFUL) << 4)
#define JPEG_CONFRN4_VSF          (0xFUL << 8) 
#define JPEG_CONFRN4_VSF_VAL(X) (((uint32_t)(X) & 0xFUL) << 8)
#define JPEG_CONFRN4_HSF          (0xFUL << 12) 
#define JPEG_CONFRN4_HSF_VAL(X) (((uint32_t)(X) & 0xFUL) << 12)
#define JPEG_CR_JCEN          (0x1UL << 0) 
#define JPEG_CR_JCEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define JPEG_CR_IFTIE          (0x1UL << 1) 
#define JPEG_CR_IFTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define JPEG_CR_IFNFIE          (0x1UL << 2) 
#define JPEG_CR_IFNFIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define JPEG_CR_OFTIE          (0x1UL << 3) 
#define JPEG_CR_OFTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define JPEG_CR_OFNEIE          (0x1UL << 4) 
#define JPEG_CR_OFNEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define JPEG_CR_EOCIE          (0x1UL << 5) 
#define JPEG_CR_EOCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define JPEG_CR_HPDIE          (0x1UL << 6) 
#define JPEG_CR_HPDIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define JPEG_CR_IDMAEN          (0x1UL << 11) 
#define JPEG_CR_IDMAEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define JPEG_CR_ODMAEN          (0x1UL << 12) 
#define JPEG_CR_ODMAEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define JPEG_CR_IFF          (0x1UL << 13) 
#define JPEG_CR_IFF_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define JPEG_CR_OFF          (0x1UL << 14) 
#define JPEG_CR_OFF_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define JPEG_SR_IFTF          (0x1UL << 1) 
#define JPEG_SR_IFTF_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define JPEG_SR_IFNFF          (0x1UL << 2) 
#define JPEG_SR_IFNFF_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define JPEG_SR_OFTF          (0x1UL << 3) 
#define JPEG_SR_OFTF_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define JPEG_SR_OFNEF          (0x1UL << 4) 
#define JPEG_SR_OFNEF_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define JPEG_SR_EOCF          (0x1UL << 5) 
#define JPEG_SR_EOCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define JPEG_SR_HPDF          (0x1UL << 6) 
#define JPEG_SR_HPDF_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define JPEG_SR_COF          (0x1UL << 7) 
#define JPEG_SR_COF_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define JPEG_CFR_CEOCF          (0x1UL << 5) 
#define JPEG_CFR_CEOCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define JPEG_CFR_CHPDF          (0x1UL << 6) 
#define JPEG_CFR_CHPDF_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define JPEG_DIR_DATAIN          (0xFFFFFFFFUL << 0) 
#define JPEG_DIR_DATAIN_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define JPEG_DOR_DATAOUT          (0xFFFFFFFFUL << 0) 
#define JPEG_DOR_DATAOUT_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)

