via/viaems/src/platforms/stm32h743/device.h
#define JPEG  ((struct JPEG*)(0x52003000UL))
struct MDMA {
  volatile const uint32_t MDMA_GISR0;
  const volatile uint32_t RESERVED64[15];
  volatile const uint32_t MDMA_C0ISR;
  volatile uint32_t MDMA_C0IFCR;
  volatile const uint32_t MDMA_C0ESR;
  volatile uint32_t MDMA_C0CR;
  volatile uint32_t MDMA_C0TCR;
  volatile uint32_t MDMA_C0BNDTR;
  volatile uint32_t MDMA_C0SAR;
  volatile uint32_t MDMA_C0DAR;
  volatile uint32_t MDMA_C0BRUR;
  volatile uint32_t MDMA_C0LAR;
  volatile uint32_t MDMA_C0TBR;
  const volatile uint32_t RESERVED112[1];
  volatile uint32_t MDMA_C0MAR;
  volatile uint32_t MDMA_C0MDR;
  const volatile uint32_t RESERVED128[2];
  volatile const uint32_t MDMA_C1ISR;
  volatile uint32_t MDMA_C1IFCR;
  volatile const uint32_t MDMA_C1ESR;
  volatile uint32_t MDMA_C1CR;
  volatile uint32_t MDMA_C1TCR;
  volatile uint32_t MDMA_C1BNDTR;
  volatile uint32_t MDMA_C1SAR;
  volatile uint32_t MDMA_C1DAR;
  volatile uint32_t MDMA_C1BRUR;
  volatile uint32_t MDMA_C1LAR;
  volatile uint32_t MDMA_C1TBR;
  const volatile uint32_t RESERVED176[1];
  volatile uint32_t MDMA_C1MAR;
  volatile uint32_t MDMA_C1MDR;
  const volatile uint32_t RESERVED192[2];
  volatile const uint32_t MDMA_C2ISR;
  volatile uint32_t MDMA_C2IFCR;
  volatile const uint32_t MDMA_C2ESR;
  volatile uint32_t MDMA_C2CR;
  volatile uint32_t MDMA_C2TCR;
  volatile uint32_t MDMA_C2BNDTR;
  volatile uint32_t MDMA_C2SAR;
  volatile uint32_t MDMA_C2DAR;
  volatile uint32_t MDMA_C2BRUR;
  volatile uint32_t MDMA_C2LAR;
  volatile uint32_t MDMA_C2TBR;
  const volatile uint32_t RESERVED240[1];
  volatile uint32_t MDMA_C2MAR;
  volatile uint32_t MDMA_C2MDR;
  const volatile uint32_t RESERVED256[2];
  volatile const uint32_t MDMA_C3ISR;
  volatile uint32_t MDMA_C3IFCR;
  volatile const uint32_t MDMA_C3ESR;
  volatile uint32_t MDMA_C3CR;
  volatile uint32_t MDMA_C3TCR;
  volatile uint32_t MDMA_C3BNDTR;
  volatile uint32_t MDMA_C3SAR;
  volatile uint32_t MDMA_C3DAR;
  volatile uint32_t MDMA_C3BRUR;
  volatile uint32_t MDMA_C3LAR;
  volatile uint32_t MDMA_C3TBR;
  const volatile uint32_t RESERVED304[1];
  volatile uint32_t MDMA_C3MAR;
  volatile uint32_t MDMA_C3MDR;
  const volatile uint32_t RESERVED320[2];
  volatile const uint32_t MDMA_C4ISR;
  volatile uint32_t MDMA_C4IFCR;
  volatile const uint32_t MDMA_C4ESR;
  volatile uint32_t MDMA_C4CR;
  volatile uint32_t MDMA_C4TCR;
  volatile uint32_t MDMA_C4BNDTR;
  volatile uint32_t MDMA_C4SAR;
  volatile uint32_t MDMA_C4DAR;
  volatile uint32_t MDMA_C4BRUR;
  volatile uint32_t MDMA_C4LAR;
  volatile uint32_t MDMA_C4TBR;
  const volatile uint32_t RESERVED368[1];
  volatile uint32_t MDMA_C4MAR;
  volatile uint32_t MDMA_C4MDR;
  const volatile uint32_t RESERVED384[2];
  volatile const uint32_t MDMA_C5ISR;
  volatile uint32_t MDMA_C5IFCR;
  volatile const uint32_t MDMA_C5ESR;
  volatile uint32_t MDMA_C5CR;
  volatile uint32_t MDMA_C5TCR;
  volatile uint32_t MDMA_C5BNDTR;
  volatile uint32_t MDMA_C5SAR;
  volatile uint32_t MDMA_C5DAR;
  volatile uint32_t MDMA_C5BRUR;
  volatile uint32_t MDMA_C5LAR;
  volatile uint32_t MDMA_C5TBR;
  const volatile uint32_t RESERVED432[1];
  volatile uint32_t MDMA_C5MAR;
  volatile uint32_t MDMA_C5MDR;
  const volatile uint32_t RESERVED448[2];
  volatile const uint32_t MDMA_C6ISR;
  volatile uint32_t MDMA_C6IFCR;
  volatile const uint32_t MDMA_C6ESR;
  volatile uint32_t MDMA_C6CR;
  volatile uint32_t MDMA_C6TCR;
  volatile uint32_t MDMA_C6BNDTR;
  volatile uint32_t MDMA_C6SAR;
  volatile uint32_t MDMA_C6DAR;
  volatile uint32_t MDMA_C6BRUR;
  volatile uint32_t MDMA_C6LAR;
  volatile uint32_t MDMA_C6TBR;
  const volatile uint32_t RESERVED496[1];
  volatile uint32_t MDMA_C6MAR;
  volatile uint32_t MDMA_C6MDR;
  const volatile uint32_t RESERVED512[2];
  volatile const uint32_t MDMA_C7ISR;
  volatile uint32_t MDMA_C7IFCR;
  volatile const uint32_t MDMA_C7ESR;
  volatile uint32_t MDMA_C7CR;
  volatile uint32_t MDMA_C7TCR;
  volatile uint32_t MDMA_C7BNDTR;
  volatile uint32_t MDMA_C7SAR;
  volatile uint32_t MDMA_C7DAR;
  volatile uint32_t MDMA_C7BRUR;
  volatile uint32_t MDMA_C7LAR;
  volatile uint32_t MDMA_C7TBR;
  const volatile uint32_t RESERVED560[1];
  volatile uint32_t MDMA_C7MAR;
  volatile uint32_t MDMA_C7MDR;
  const volatile uint32_t RESERVED576[2];
  volatile const uint32_t MDMA_C8ISR;
  volatile uint32_t MDMA_C8IFCR;
  volatile const uint32_t MDMA_C8ESR;
  volatile uint32_t MDMA_C8CR;
  volatile uint32_t MDMA_C8TCR;
  volatile uint32_t MDMA_C8BNDTR;
  volatile uint32_t MDMA_C8SAR;
  volatile uint32_t MDMA_C8DAR;
  volatile uint32_t MDMA_C8BRUR;
  volatile uint32_t MDMA_C8LAR;
  volatile uint32_t MDMA_C8TBR;
  const volatile uint32_t RESERVED624[1];
  volatile uint32_t MDMA_C8MAR;
  volatile uint32_t MDMA_C8MDR;
  const volatile uint32_t RESERVED640[2];
  volatile const uint32_t MDMA_C9ISR;
  volatile uint32_t MDMA_C9IFCR;
  volatile const uint32_t MDMA_C9ESR;
  volatile uint32_t MDMA_C9CR;
  volatile uint32_t MDMA_C9TCR;
  volatile uint32_t MDMA_C9BNDTR;
  volatile uint32_t MDMA_C9SAR;
  volatile uint32_t MDMA_C9DAR;
  volatile uint32_t MDMA_C9BRUR;
  volatile uint32_t MDMA_C9LAR;
  volatile uint32_t MDMA_C9TBR;
  const volatile uint32_t RESERVED688[1];
  volatile uint32_t MDMA_C9MAR;
  volatile uint32_t MDMA_C9MDR;
  const volatile uint32_t RESERVED704[2];
  volatile const uint32_t MDMA_C10ISR;
  volatile uint32_t MDMA_C10IFCR;
  volatile const uint32_t MDMA_C10ESR;
  volatile uint32_t MDMA_C10CR;
  volatile uint32_t MDMA_C10TCR;
  volatile uint32_t MDMA_C10BNDTR;
  volatile uint32_t MDMA_C10SAR;
  volatile uint32_t MDMA_C10DAR;
  volatile uint32_t MDMA_C10BRUR;
  volatile uint32_t MDMA_C10LAR;
  volatile uint32_t MDMA_C10TBR;
  const volatile uint32_t RESERVED752[1];
  volatile uint32_t MDMA_C10MAR;
  volatile uint32_t MDMA_C10MDR;
  const volatile uint32_t RESERVED768[2];
  volatile const uint32_t MDMA_C11ISR;
  volatile uint32_t MDMA_C11IFCR;
  volatile const uint32_t MDMA_C11ESR;
  volatile uint32_t MDMA_C11CR;
  volatile uint32_t MDMA_C11TCR;
  volatile uint32_t MDMA_C11BNDTR;
  volatile uint32_t MDMA_C11SAR;
  volatile uint32_t MDMA_C11DAR;
  volatile uint32_t MDMA_C11BRUR;
  volatile uint32_t MDMA_C11LAR;
  volatile uint32_t MDMA_C11TBR;
  const volatile uint32_t RESERVED816[1];
  volatile uint32_t MDMA_C11MAR;
  volatile uint32_t MDMA_C11MDR;
  const volatile uint32_t RESERVED832[2];
  volatile const uint32_t MDMA_C12ISR;
  volatile uint32_t MDMA_C12IFCR;
  volatile const uint32_t MDMA_C12ESR;
  volatile uint32_t MDMA_C12CR;
  volatile uint32_t MDMA_C12TCR;
  volatile uint32_t MDMA_C12BNDTR;
  volatile uint32_t MDMA_C12SAR;
  volatile uint32_t MDMA_C12DAR;
  volatile uint32_t MDMA_C12BRUR;
  volatile uint32_t MDMA_C12LAR;
  volatile uint32_t MDMA_C12TBR;
  const volatile uint32_t RESERVED880[1];
  volatile uint32_t MDMA_C12MAR;
  volatile uint32_t MDMA_C12MDR;
  const volatile uint32_t RESERVED896[2];
  volatile const uint32_t MDMA_C13ISR;
  volatile uint32_t MDMA_C13IFCR;
  volatile const uint32_t MDMA_C13ESR;
  volatile uint32_t MDMA_C13CR;
  volatile uint32_t MDMA_C13TCR;
  volatile uint32_t MDMA_C13BNDTR;
  volatile uint32_t MDMA_C13SAR;
  volatile uint32_t MDMA_C13DAR;
  volatile uint32_t MDMA_C13BRUR;
  volatile uint32_t MDMA_C13LAR;
  volatile uint32_t MDMA_C13TBR;
  const volatile uint32_t RESERVED944[1];
  volatile uint32_t MDMA_C13MAR;
  volatile uint32_t MDMA_C13MDR;
  const volatile uint32_t RESERVED960[2];
  volatile const uint32_t MDMA_C14ISR;
  volatile uint32_t MDMA_C14IFCR;
  volatile const uint32_t MDMA_C14ESR;
  volatile uint32_t MDMA_C14CR;
  volatile uint32_t MDMA_C14TCR;
  volatile uint32_t MDMA_C14BNDTR;
  volatile uint32_t MDMA_C14SAR;
  volatile uint32_t MDMA_C14DAR;
  volatile uint32_t MDMA_C14BRUR;
  volatile uint32_t MDMA_C14LAR;
  volatile uint32_t MDMA_C14TBR;
  const volatile uint32_t RESERVED1008[1];
  volatile uint32_t MDMA_C14MAR;
  volatile uint32_t MDMA_C14MDR;
  const volatile uint32_t RESERVED1024[2];
  volatile const uint32_t MDMA_C15ISR;
  volatile uint32_t MDMA_C15IFCR;
  volatile const uint32_t MDMA_C15ESR;
  volatile uint32_t MDMA_C15CR;
  volatile uint32_t MDMA_C15TCR;
  volatile uint32_t MDMA_C15BNDTR;
  volatile uint32_t MDMA_C15SAR;
  volatile uint32_t MDMA_C15DAR;
  volatile uint32_t MDMA_C15BRUR;
  volatile uint32_t MDMA_C15LAR;
  volatile uint32_t MDMA_C15TBR;
  const volatile uint32_t RESERVED1072[1];
  volatile uint32_t MDMA_C15MAR;
  volatile uint32_t MDMA_C15MDR;
};
