via/viaems/src/platforms/stm32h743/device.h
#define MDMA_MDMA_GISR0_GIF0          (0x1UL << 0) 
#define MDMA_MDMA_GISR0_GIF0_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MDMA_MDMA_GISR0_GIF1          (0x1UL << 1) 
#define MDMA_MDMA_GISR0_GIF1_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define MDMA_MDMA_GISR0_GIF2          (0x1UL << 2) 
#define MDMA_MDMA_GISR0_GIF2_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define MDMA_MDMA_GISR0_GIF3          (0x1UL << 3) 
#define MDMA_MDMA_GISR0_GIF3_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define MDMA_MDMA_GISR0_GIF4          (0x1UL << 4) 
#define MDMA_MDMA_GISR0_GIF4_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define MDMA_MDMA_GISR0_GIF5          (0x1UL << 5) 
#define MDMA_MDMA_GISR0_GIF5_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define MDMA_MDMA_GISR0_GIF6          (0x1UL << 6) 
#define MDMA_MDMA_GISR0_GIF6_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define MDMA_MDMA_GISR0_GIF7          (0x1UL << 7) 
#define MDMA_MDMA_GISR0_GIF7_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define MDMA_MDMA_GISR0_GIF8          (0x1UL << 8) 
#define MDMA_MDMA_GISR0_GIF8_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define MDMA_MDMA_GISR0_GIF9          (0x1UL << 9) 
#define MDMA_MDMA_GISR0_GIF9_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define MDMA_MDMA_GISR0_GIF10          (0x1UL << 10) 
#define MDMA_MDMA_GISR0_GIF10_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define MDMA_MDMA_GISR0_GIF11          (0x1UL << 11) 
#define MDMA_MDMA_GISR0_GIF11_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define MDMA_MDMA_GISR0_GIF12          (0x1UL << 12) 
#define MDMA_MDMA_GISR0_GIF12_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define MDMA_MDMA_GISR0_GIF13          (0x1UL << 13) 
#define MDMA_MDMA_GISR0_GIF13_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define MDMA_MDMA_GISR0_GIF14          (0x1UL << 14) 
#define MDMA_MDMA_GISR0_GIF14_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define MDMA_MDMA_GISR0_GIF15          (0x1UL << 15) 
#define MDMA_MDMA_GISR0_GIF15_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define MDMA_MDMA_C0ISR_TEIF0          (0x1UL << 0) 
#define MDMA_MDMA_C0ISR_TEIF0_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MDMA_MDMA_C0ISR_CTCIF0          (0x1UL << 1) 
#define MDMA_MDMA_C0ISR_CTCIF0_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define MDMA_MDMA_C0ISR_BRTIF0          (0x1UL << 2) 
#define MDMA_MDMA_C0ISR_BRTIF0_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define MDMA_MDMA_C0ISR_BTIF0          (0x1UL << 3) 
#define MDMA_MDMA_C0ISR_BTIF0_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define MDMA_MDMA_C0ISR_TCIF0          (0x1UL << 4) 
#define MDMA_MDMA_C0ISR_TCIF0_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define MDMA_MDMA_C0ISR_CRQA0          (0x1UL << 16) 
#define MDMA_MDMA_C0ISR_CRQA0_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define MDMA_MDMA_C0IFCR_CTEIF0          (0x1UL << 0) 
#define MDMA_MDMA_C0IFCR_CTEIF0_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MDMA_MDMA_C0IFCR_CCTCIF0          (0x1UL << 1) 
#define MDMA_MDMA_C0IFCR_CCTCIF0_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define MDMA_MDMA_C0IFCR_CBRTIF0          (0x1UL << 2) 
#define MDMA_MDMA_C0IFCR_CBRTIF0_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define MDMA_MDMA_C0IFCR_CBTIF0          (0x1UL << 3) 
#define MDMA_MDMA_C0IFCR_CBTIF0_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define MDMA_MDMA_C0IFCR_CLTCIF0          (0x1UL << 4) 
#define MDMA_MDMA_C0IFCR_CLTCIF0_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define MDMA_MDMA_C0ESR_TEA          (0x7FUL << 0) 
#define MDMA_MDMA_C0ESR_TEA_VAL(X) (((uint32_t)(X) & 0x7FUL) << 0)
#define MDMA_MDMA_C0ESR_TED          (0x1UL << 7) 
#define MDMA_MDMA_C0ESR_TED_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define MDMA_MDMA_C0ESR_TELD          (0x1UL << 8) 
#define MDMA_MDMA_C0ESR_TELD_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define MDMA_MDMA_C0ESR_TEMD          (0x1UL << 9) 
#define MDMA_MDMA_C0ESR_TEMD_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define MDMA_MDMA_C0ESR_ASE          (0x1UL << 10) 
#define MDMA_MDMA_C0ESR_ASE_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define MDMA_MDMA_C0ESR_BSE          (0x1UL << 11) 
#define MDMA_MDMA_C0ESR_BSE_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define MDMA_MDMA_C0CR_EN          (0x1UL << 0) 
#define MDMA_MDMA_C0CR_EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MDMA_MDMA_C0CR_TEIE          (0x1UL << 1) 
#define MDMA_MDMA_C0CR_TEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define MDMA_MDMA_C0CR_CTCIE          (0x1UL << 2) 
#define MDMA_MDMA_C0CR_CTCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define MDMA_MDMA_C0CR_BRTIE          (0x1UL << 3) 
#define MDMA_MDMA_C0CR_BRTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define MDMA_MDMA_C0CR_BTIE          (0x1UL << 4) 
#define MDMA_MDMA_C0CR_BTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define MDMA_MDMA_C0CR_TCIE          (0x1UL << 5) 
#define MDMA_MDMA_C0CR_TCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define MDMA_MDMA_C0CR_PL          (0x3UL << 6) 
#define MDMA_MDMA_C0CR_PL_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define MDMA_MDMA_C0CR_BEX          (0x1UL << 12) 
#define MDMA_MDMA_C0CR_BEX_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define MDMA_MDMA_C0CR_HEX          (0x1UL << 13) 
#define MDMA_MDMA_C0CR_HEX_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define MDMA_MDMA_C0CR_WEX          (0x1UL << 14) 
#define MDMA_MDMA_C0CR_WEX_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define MDMA_MDMA_C0CR_SWRQ          (0x1UL << 16) 
#define MDMA_MDMA_C0CR_SWRQ_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define MDMA_MDMA_C0TCR_SINC          (0x3UL << 0) 
#define MDMA_MDMA_C0TCR_SINC_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define MDMA_MDMA_C0TCR_DINC          (0x3UL << 2) 
#define MDMA_MDMA_C0TCR_DINC_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define MDMA_MDMA_C0TCR_SSIZE          (0x3UL << 4) 
#define MDMA_MDMA_C0TCR_SSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 4)
#define MDMA_MDMA_C0TCR_DSIZE          (0x3UL << 6) 
#define MDMA_MDMA_C0TCR_DSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define MDMA_MDMA_C0TCR_SINCOS          (0x3UL << 8) 
#define MDMA_MDMA_C0TCR_SINCOS_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define MDMA_MDMA_C0TCR_DINCOS          (0x3UL << 10) 
#define MDMA_MDMA_C0TCR_DINCOS_VAL(X) (((uint32_t)(X) & 0x3UL) << 10)
#define MDMA_MDMA_C0TCR_SBURST          (0x7UL << 12) 
#define MDMA_MDMA_C0TCR_SBURST_VAL(X) (((uint32_t)(X) & 0x7UL) << 12)
#define MDMA_MDMA_C0TCR_DBURST          (0x7UL << 15) 
#define MDMA_MDMA_C0TCR_DBURST_VAL(X) (((uint32_t)(X) & 0x7UL) << 15)
#define MDMA_MDMA_C0TCR_TLEN          (0x7FUL << 18) 
#define MDMA_MDMA_C0TCR_TLEN_VAL(X) (((uint32_t)(X) & 0x7FUL) << 18)
#define MDMA_MDMA_C0TCR_PKE          (0x1UL << 25) 
#define MDMA_MDMA_C0TCR_PKE_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define MDMA_MDMA_C0TCR_PAM          (0x3UL << 26) 
#define MDMA_MDMA_C0TCR_PAM_VAL(X) (((uint32_t)(X) & 0x3UL) << 26)
#define MDMA_MDMA_C0TCR_TRGM          (0x3UL << 28) 
#define MDMA_MDMA_C0TCR_TRGM_VAL(X) (((uint32_t)(X) & 0x3UL) << 28)
#define MDMA_MDMA_C0TCR_SWRM          (0x1UL << 30) 
#define MDMA_MDMA_C0TCR_SWRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define MDMA_MDMA_C0TCR_BWM          (0x1UL << 31) 
#define MDMA_MDMA_C0TCR_BWM_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define MDMA_MDMA_C0BNDTR_BNDT          (0x1FFFFUL << 0) 
#define MDMA_MDMA_C0BNDTR_BNDT_VAL(X) (((uint32_t)(X) & 0x1FFFFUL) << 0)
#define MDMA_MDMA_C0BNDTR_BRSUM          (0x1UL << 18) 
#define MDMA_MDMA_C0BNDTR_BRSUM_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define MDMA_MDMA_C0BNDTR_BRDUM          (0x1UL << 19) 
#define MDMA_MDMA_C0BNDTR_BRDUM_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define MDMA_MDMA_C0BNDTR_BRC          (0xFFFUL << 20) 
#define MDMA_MDMA_C0BNDTR_BRC_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 20)
#define MDMA_MDMA_C0SAR_SAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C0SAR_SAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C0DAR_DAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C0DAR_DAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C0BRUR_SUV          (0xFFFFUL << 0) 
#define MDMA_MDMA_C0BRUR_SUV_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDMA_MDMA_C0BRUR_DUV          (0xFFFFUL << 16) 
#define MDMA_MDMA_C0BRUR_DUV_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define MDMA_MDMA_C0LAR_LAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C0LAR_LAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C0TBR_TSEL          (0x3FUL << 0) 
#define MDMA_MDMA_C0TBR_TSEL_VAL(X) (((uint32_t)(X) & 0x3FUL) << 0)
#define MDMA_MDMA_C0TBR_SBUS          (0x1UL << 16) 
#define MDMA_MDMA_C0TBR_SBUS_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define MDMA_MDMA_C0TBR_DBUS          (0x1UL << 17) 
#define MDMA_MDMA_C0TBR_DBUS_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define MDMA_MDMA_C0MAR_MAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C0MAR_MAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C0MDR_MDR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C0MDR_MDR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C1ISR_TEIF1          (0x1UL << 0) 
#define MDMA_MDMA_C1ISR_TEIF1_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MDMA_MDMA_C1ISR_CTCIF1          (0x1UL << 1) 
#define MDMA_MDMA_C1ISR_CTCIF1_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define MDMA_MDMA_C1ISR_BRTIF1          (0x1UL << 2) 
#define MDMA_MDMA_C1ISR_BRTIF1_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define MDMA_MDMA_C1ISR_BTIF1          (0x1UL << 3) 
#define MDMA_MDMA_C1ISR_BTIF1_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define MDMA_MDMA_C1ISR_TCIF1          (0x1UL << 4) 
#define MDMA_MDMA_C1ISR_TCIF1_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define MDMA_MDMA_C1ISR_CRQA1          (0x1UL << 16) 
#define MDMA_MDMA_C1ISR_CRQA1_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define MDMA_MDMA_C1IFCR_CTEIF1          (0x1UL << 0) 
#define MDMA_MDMA_C1IFCR_CTEIF1_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MDMA_MDMA_C1IFCR_CCTCIF1          (0x1UL << 1) 
#define MDMA_MDMA_C1IFCR_CCTCIF1_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define MDMA_MDMA_C1IFCR_CBRTIF1          (0x1UL << 2) 
#define MDMA_MDMA_C1IFCR_CBRTIF1_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define MDMA_MDMA_C1IFCR_CBTIF1          (0x1UL << 3) 
#define MDMA_MDMA_C1IFCR_CBTIF1_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define MDMA_MDMA_C1IFCR_CLTCIF1          (0x1UL << 4) 
#define MDMA_MDMA_C1IFCR_CLTCIF1_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define MDMA_MDMA_C1ESR_TEA          (0x7FUL << 0) 
#define MDMA_MDMA_C1ESR_TEA_VAL(X) (((uint32_t)(X) & 0x7FUL) << 0)
#define MDMA_MDMA_C1ESR_TED          (0x1UL << 7) 
#define MDMA_MDMA_C1ESR_TED_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define MDMA_MDMA_C1ESR_TELD          (0x1UL << 8) 
#define MDMA_MDMA_C1ESR_TELD_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define MDMA_MDMA_C1ESR_TEMD          (0x1UL << 9) 
#define MDMA_MDMA_C1ESR_TEMD_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define MDMA_MDMA_C1ESR_ASE          (0x1UL << 10) 
#define MDMA_MDMA_C1ESR_ASE_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define MDMA_MDMA_C1ESR_BSE          (0x1UL << 11) 
#define MDMA_MDMA_C1ESR_BSE_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define MDMA_MDMA_C1CR_EN          (0x1UL << 0) 
#define MDMA_MDMA_C1CR_EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MDMA_MDMA_C1CR_TEIE          (0x1UL << 1) 
#define MDMA_MDMA_C1CR_TEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define MDMA_MDMA_C1CR_CTCIE          (0x1UL << 2) 
#define MDMA_MDMA_C1CR_CTCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define MDMA_MDMA_C1CR_BRTIE          (0x1UL << 3) 
#define MDMA_MDMA_C1CR_BRTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define MDMA_MDMA_C1CR_BTIE          (0x1UL << 4) 
#define MDMA_MDMA_C1CR_BTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define MDMA_MDMA_C1CR_TCIE          (0x1UL << 5) 
#define MDMA_MDMA_C1CR_TCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define MDMA_MDMA_C1CR_PL          (0x3UL << 6) 
#define MDMA_MDMA_C1CR_PL_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define MDMA_MDMA_C1CR_BEX          (0x1UL << 12) 
#define MDMA_MDMA_C1CR_BEX_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define MDMA_MDMA_C1CR_HEX          (0x1UL << 13) 
#define MDMA_MDMA_C1CR_HEX_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define MDMA_MDMA_C1CR_WEX          (0x1UL << 14) 
#define MDMA_MDMA_C1CR_WEX_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define MDMA_MDMA_C1CR_SWRQ          (0x1UL << 16) 
#define MDMA_MDMA_C1CR_SWRQ_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define MDMA_MDMA_C1TCR_SINC          (0x3UL << 0) 
#define MDMA_MDMA_C1TCR_SINC_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define MDMA_MDMA_C1TCR_DINC          (0x3UL << 2) 
#define MDMA_MDMA_C1TCR_DINC_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define MDMA_MDMA_C1TCR_SSIZE          (0x3UL << 4) 
#define MDMA_MDMA_C1TCR_SSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 4)
#define MDMA_MDMA_C1TCR_DSIZE          (0x3UL << 6) 
#define MDMA_MDMA_C1TCR_DSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define MDMA_MDMA_C1TCR_SINCOS          (0x3UL << 8) 
#define MDMA_MDMA_C1TCR_SINCOS_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define MDMA_MDMA_C1TCR_DINCOS          (0x3UL << 10) 
#define MDMA_MDMA_C1TCR_DINCOS_VAL(X) (((uint32_t)(X) & 0x3UL) << 10)
#define MDMA_MDMA_C1TCR_SBURST          (0x7UL << 12) 
#define MDMA_MDMA_C1TCR_SBURST_VAL(X) (((uint32_t)(X) & 0x7UL) << 12)
#define MDMA_MDMA_C1TCR_DBURST          (0x7UL << 15) 
#define MDMA_MDMA_C1TCR_DBURST_VAL(X) (((uint32_t)(X) & 0x7UL) << 15)
#define MDMA_MDMA_C1TCR_TLEN          (0x7FUL << 18) 
#define MDMA_MDMA_C1TCR_TLEN_VAL(X) (((uint32_t)(X) & 0x7FUL) << 18)
#define MDMA_MDMA_C1TCR_PKE          (0x1UL << 25) 
#define MDMA_MDMA_C1TCR_PKE_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define MDMA_MDMA_C1TCR_PAM          (0x3UL << 26) 
#define MDMA_MDMA_C1TCR_PAM_VAL(X) (((uint32_t)(X) & 0x3UL) << 26)
#define MDMA_MDMA_C1TCR_TRGM          (0x3UL << 28) 
#define MDMA_MDMA_C1TCR_TRGM_VAL(X) (((uint32_t)(X) & 0x3UL) << 28)
#define MDMA_MDMA_C1TCR_SWRM          (0x1UL << 30) 
#define MDMA_MDMA_C1TCR_SWRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define MDMA_MDMA_C1TCR_BWM          (0x1UL << 31) 
#define MDMA_MDMA_C1TCR_BWM_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define MDMA_MDMA_C1BNDTR_BNDT          (0x1FFFFUL << 0) 
#define MDMA_MDMA_C1BNDTR_BNDT_VAL(X) (((uint32_t)(X) & 0x1FFFFUL) << 0)
#define MDMA_MDMA_C1BNDTR_BRSUM          (0x1UL << 18) 
#define MDMA_MDMA_C1BNDTR_BRSUM_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define MDMA_MDMA_C1BNDTR_BRDUM          (0x1UL << 19) 
#define MDMA_MDMA_C1BNDTR_BRDUM_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define MDMA_MDMA_C1BNDTR_BRC          (0xFFFUL << 20) 
#define MDMA_MDMA_C1BNDTR_BRC_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 20)
#define MDMA_MDMA_C1SAR_SAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C1SAR_SAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C1DAR_DAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C1DAR_DAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C1BRUR_SUV          (0xFFFFUL << 0) 
#define MDMA_MDMA_C1BRUR_SUV_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDMA_MDMA_C1BRUR_DUV          (0xFFFFUL << 16) 
#define MDMA_MDMA_C1BRUR_DUV_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define MDMA_MDMA_C1LAR_LAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C1LAR_LAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C1TBR_TSEL          (0x3FUL << 0) 
#define MDMA_MDMA_C1TBR_TSEL_VAL(X) (((uint32_t)(X) & 0x3FUL) << 0)
#define MDMA_MDMA_C1TBR_SBUS          (0x1UL << 16) 
#define MDMA_MDMA_C1TBR_SBUS_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define MDMA_MDMA_C1TBR_DBUS          (0x1UL << 17) 
#define MDMA_MDMA_C1TBR_DBUS_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define MDMA_MDMA_C1MAR_MAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C1MAR_MAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C1MDR_MDR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C1MDR_MDR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C2ISR_TEIF2          (0x1UL << 0) 
#define MDMA_MDMA_C2ISR_TEIF2_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MDMA_MDMA_C2ISR_CTCIF2          (0x1UL << 1) 
#define MDMA_MDMA_C2ISR_CTCIF2_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define MDMA_MDMA_C2ISR_BRTIF2          (0x1UL << 2) 
#define MDMA_MDMA_C2ISR_BRTIF2_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define MDMA_MDMA_C2ISR_BTIF2          (0x1UL << 3) 
#define MDMA_MDMA_C2ISR_BTIF2_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define MDMA_MDMA_C2ISR_TCIF2          (0x1UL << 4) 
#define MDMA_MDMA_C2ISR_TCIF2_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define MDMA_MDMA_C2ISR_CRQA2          (0x1UL << 16) 
#define MDMA_MDMA_C2ISR_CRQA2_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define MDMA_MDMA_C2IFCR_CTEIF2          (0x1UL << 0) 
#define MDMA_MDMA_C2IFCR_CTEIF2_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MDMA_MDMA_C2IFCR_CCTCIF2          (0x1UL << 1) 
#define MDMA_MDMA_C2IFCR_CCTCIF2_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define MDMA_MDMA_C2IFCR_CBRTIF2          (0x1UL << 2) 
#define MDMA_MDMA_C2IFCR_CBRTIF2_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define MDMA_MDMA_C2IFCR_CBTIF2          (0x1UL << 3) 
#define MDMA_MDMA_C2IFCR_CBTIF2_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define MDMA_MDMA_C2IFCR_CLTCIF2          (0x1UL << 4) 
#define MDMA_MDMA_C2IFCR_CLTCIF2_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define MDMA_MDMA_C2ESR_TEA          (0x7FUL << 0) 
#define MDMA_MDMA_C2ESR_TEA_VAL(X) (((uint32_t)(X) & 0x7FUL) << 0)
#define MDMA_MDMA_C2ESR_TED          (0x1UL << 7) 
#define MDMA_MDMA_C2ESR_TED_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define MDMA_MDMA_C2ESR_TELD          (0x1UL << 8) 
#define MDMA_MDMA_C2ESR_TELD_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define MDMA_MDMA_C2ESR_TEMD          (0x1UL << 9) 
#define MDMA_MDMA_C2ESR_TEMD_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define MDMA_MDMA_C2ESR_ASE          (0x1UL << 10) 
#define MDMA_MDMA_C2ESR_ASE_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define MDMA_MDMA_C2ESR_BSE          (0x1UL << 11) 
#define MDMA_MDMA_C2ESR_BSE_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define MDMA_MDMA_C2CR_EN          (0x1UL << 0) 
#define MDMA_MDMA_C2CR_EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MDMA_MDMA_C2CR_TEIE          (0x1UL << 1) 
#define MDMA_MDMA_C2CR_TEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define MDMA_MDMA_C2CR_CTCIE          (0x1UL << 2) 
#define MDMA_MDMA_C2CR_CTCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define MDMA_MDMA_C2CR_BRTIE          (0x1UL << 3) 
#define MDMA_MDMA_C2CR_BRTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define MDMA_MDMA_C2CR_BTIE          (0x1UL << 4) 
#define MDMA_MDMA_C2CR_BTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define MDMA_MDMA_C2CR_TCIE          (0x1UL << 5) 
#define MDMA_MDMA_C2CR_TCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define MDMA_MDMA_C2CR_PL          (0x3UL << 6) 
#define MDMA_MDMA_C2CR_PL_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define MDMA_MDMA_C2CR_BEX          (0x1UL << 12) 
#define MDMA_MDMA_C2CR_BEX_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define MDMA_MDMA_C2CR_HEX          (0x1UL << 13) 
#define MDMA_MDMA_C2CR_HEX_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define MDMA_MDMA_C2CR_WEX          (0x1UL << 14) 
#define MDMA_MDMA_C2CR_WEX_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define MDMA_MDMA_C2CR_SWRQ          (0x1UL << 16) 
#define MDMA_MDMA_C2CR_SWRQ_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define MDMA_MDMA_C2TCR_SINC          (0x3UL << 0) 
#define MDMA_MDMA_C2TCR_SINC_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define MDMA_MDMA_C2TCR_DINC          (0x3UL << 2) 
#define MDMA_MDMA_C2TCR_DINC_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define MDMA_MDMA_C2TCR_SSIZE          (0x3UL << 4) 
#define MDMA_MDMA_C2TCR_SSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 4)
#define MDMA_MDMA_C2TCR_DSIZE          (0x3UL << 6) 
#define MDMA_MDMA_C2TCR_DSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define MDMA_MDMA_C2TCR_SINCOS          (0x3UL << 8) 
#define MDMA_MDMA_C2TCR_SINCOS_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define MDMA_MDMA_C2TCR_DINCOS          (0x3UL << 10) 
#define MDMA_MDMA_C2TCR_DINCOS_VAL(X) (((uint32_t)(X) & 0x3UL) << 10)
#define MDMA_MDMA_C2TCR_SBURST          (0x7UL << 12) 
#define MDMA_MDMA_C2TCR_SBURST_VAL(X) (((uint32_t)(X) & 0x7UL) << 12)
#define MDMA_MDMA_C2TCR_DBURST          (0x7UL << 15) 
#define MDMA_MDMA_C2TCR_DBURST_VAL(X) (((uint32_t)(X) & 0x7UL) << 15)
#define MDMA_MDMA_C2TCR_TLEN          (0x7FUL << 18) 
#define MDMA_MDMA_C2TCR_TLEN_VAL(X) (((uint32_t)(X) & 0x7FUL) << 18)
#define MDMA_MDMA_C2TCR_PKE          (0x1UL << 25) 
#define MDMA_MDMA_C2TCR_PKE_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define MDMA_MDMA_C2TCR_PAM          (0x3UL << 26) 
#define MDMA_MDMA_C2TCR_PAM_VAL(X) (((uint32_t)(X) & 0x3UL) << 26)
#define MDMA_MDMA_C2TCR_TRGM          (0x3UL << 28) 
#define MDMA_MDMA_C2TCR_TRGM_VAL(X) (((uint32_t)(X) & 0x3UL) << 28)
#define MDMA_MDMA_C2TCR_SWRM          (0x1UL << 30) 
#define MDMA_MDMA_C2TCR_SWRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define MDMA_MDMA_C2TCR_BWM          (0x1UL << 31) 
#define MDMA_MDMA_C2TCR_BWM_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define MDMA_MDMA_C2BNDTR_BNDT          (0x1FFFFUL << 0) 
#define MDMA_MDMA_C2BNDTR_BNDT_VAL(X) (((uint32_t)(X) & 0x1FFFFUL) << 0)
#define MDMA_MDMA_C2BNDTR_BRSUM          (0x1UL << 18) 
#define MDMA_MDMA_C2BNDTR_BRSUM_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define MDMA_MDMA_C2BNDTR_BRDUM          (0x1UL << 19) 
#define MDMA_MDMA_C2BNDTR_BRDUM_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define MDMA_MDMA_C2BNDTR_BRC          (0xFFFUL << 20) 
#define MDMA_MDMA_C2BNDTR_BRC_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 20)
#define MDMA_MDMA_C2SAR_SAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C2SAR_SAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C2DAR_DAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C2DAR_DAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C2BRUR_SUV          (0xFFFFUL << 0) 
#define MDMA_MDMA_C2BRUR_SUV_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDMA_MDMA_C2BRUR_DUV          (0xFFFFUL << 16) 
#define MDMA_MDMA_C2BRUR_DUV_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define MDMA_MDMA_C2LAR_LAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C2LAR_LAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C2TBR_TSEL          (0x3FUL << 0) 
#define MDMA_MDMA_C2TBR_TSEL_VAL(X) (((uint32_t)(X) & 0x3FUL) << 0)
#define MDMA_MDMA_C2TBR_SBUS          (0x1UL << 16) 
#define MDMA_MDMA_C2TBR_SBUS_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define MDMA_MDMA_C2TBR_DBUS          (0x1UL << 17) 
#define MDMA_MDMA_C2TBR_DBUS_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define MDMA_MDMA_C2MAR_MAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C2MAR_MAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C2MDR_MDR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C2MDR_MDR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C3ISR_TEIF3          (0x1UL << 0) 
#define MDMA_MDMA_C3ISR_TEIF3_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MDMA_MDMA_C3ISR_CTCIF3          (0x1UL << 1) 
#define MDMA_MDMA_C3ISR_CTCIF3_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define MDMA_MDMA_C3ISR_BRTIF3          (0x1UL << 2) 
#define MDMA_MDMA_C3ISR_BRTIF3_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define MDMA_MDMA_C3ISR_BTIF3          (0x1UL << 3) 
#define MDMA_MDMA_C3ISR_BTIF3_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define MDMA_MDMA_C3ISR_TCIF3          (0x1UL << 4) 
#define MDMA_MDMA_C3ISR_TCIF3_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define MDMA_MDMA_C3ISR_CRQA3          (0x1UL << 16) 
#define MDMA_MDMA_C3ISR_CRQA3_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define MDMA_MDMA_C3IFCR_CTEIF3          (0x1UL << 0) 
#define MDMA_MDMA_C3IFCR_CTEIF3_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MDMA_MDMA_C3IFCR_CCTCIF3          (0x1UL << 1) 
#define MDMA_MDMA_C3IFCR_CCTCIF3_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define MDMA_MDMA_C3IFCR_CBRTIF3          (0x1UL << 2) 
#define MDMA_MDMA_C3IFCR_CBRTIF3_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define MDMA_MDMA_C3IFCR_CBTIF3          (0x1UL << 3) 
#define MDMA_MDMA_C3IFCR_CBTIF3_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define MDMA_MDMA_C3IFCR_CLTCIF3          (0x1UL << 4) 
#define MDMA_MDMA_C3IFCR_CLTCIF3_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define MDMA_MDMA_C3ESR_TEA          (0x7FUL << 0) 
#define MDMA_MDMA_C3ESR_TEA_VAL(X) (((uint32_t)(X) & 0x7FUL) << 0)
#define MDMA_MDMA_C3ESR_TED          (0x1UL << 7) 
