via/viaems/src/platforms/stm32h743/device.h
#define MDMA_MDMA_C3ESR_TED_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define MDMA_MDMA_C3ESR_TELD          (0x1UL << 8) 
#define MDMA_MDMA_C3ESR_TELD_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define MDMA_MDMA_C3ESR_TEMD          (0x1UL << 9) 
#define MDMA_MDMA_C3ESR_TEMD_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define MDMA_MDMA_C3ESR_ASE          (0x1UL << 10) 
#define MDMA_MDMA_C3ESR_ASE_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define MDMA_MDMA_C3ESR_BSE          (0x1UL << 11) 
#define MDMA_MDMA_C3ESR_BSE_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define MDMA_MDMA_C3CR_EN          (0x1UL << 0) 
#define MDMA_MDMA_C3CR_EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MDMA_MDMA_C3CR_TEIE          (0x1UL << 1) 
#define MDMA_MDMA_C3CR_TEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define MDMA_MDMA_C3CR_CTCIE          (0x1UL << 2) 
#define MDMA_MDMA_C3CR_CTCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define MDMA_MDMA_C3CR_BRTIE          (0x1UL << 3) 
#define MDMA_MDMA_C3CR_BRTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define MDMA_MDMA_C3CR_BTIE          (0x1UL << 4) 
#define MDMA_MDMA_C3CR_BTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define MDMA_MDMA_C3CR_TCIE          (0x1UL << 5) 
#define MDMA_MDMA_C3CR_TCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define MDMA_MDMA_C3CR_PL          (0x3UL << 6) 
#define MDMA_MDMA_C3CR_PL_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define MDMA_MDMA_C3CR_BEX          (0x1UL << 12) 
#define MDMA_MDMA_C3CR_BEX_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define MDMA_MDMA_C3CR_HEX          (0x1UL << 13) 
#define MDMA_MDMA_C3CR_HEX_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define MDMA_MDMA_C3CR_WEX          (0x1UL << 14) 
#define MDMA_MDMA_C3CR_WEX_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define MDMA_MDMA_C3CR_SWRQ          (0x1UL << 16) 
#define MDMA_MDMA_C3CR_SWRQ_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define MDMA_MDMA_C3TCR_SINC          (0x3UL << 0) 
#define MDMA_MDMA_C3TCR_SINC_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define MDMA_MDMA_C3TCR_DINC          (0x3UL << 2) 
#define MDMA_MDMA_C3TCR_DINC_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define MDMA_MDMA_C3TCR_SSIZE          (0x3UL << 4) 
#define MDMA_MDMA_C3TCR_SSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 4)
#define MDMA_MDMA_C3TCR_DSIZE          (0x3UL << 6) 
#define MDMA_MDMA_C3TCR_DSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define MDMA_MDMA_C3TCR_SINCOS          (0x3UL << 8) 
#define MDMA_MDMA_C3TCR_SINCOS_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define MDMA_MDMA_C3TCR_DINCOS          (0x3UL << 10) 
#define MDMA_MDMA_C3TCR_DINCOS_VAL(X) (((uint32_t)(X) & 0x3UL) << 10)
#define MDMA_MDMA_C3TCR_SBURST          (0x7UL << 12) 
#define MDMA_MDMA_C3TCR_SBURST_VAL(X) (((uint32_t)(X) & 0x7UL) << 12)
#define MDMA_MDMA_C3TCR_DBURST          (0x7UL << 15) 
#define MDMA_MDMA_C3TCR_DBURST_VAL(X) (((uint32_t)(X) & 0x7UL) << 15)
#define MDMA_MDMA_C3TCR_TLEN          (0x7FUL << 18) 
#define MDMA_MDMA_C3TCR_TLEN_VAL(X) (((uint32_t)(X) & 0x7FUL) << 18)
#define MDMA_MDMA_C3TCR_PKE          (0x1UL << 25) 
#define MDMA_MDMA_C3TCR_PKE_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define MDMA_MDMA_C3TCR_PAM          (0x3UL << 26) 
#define MDMA_MDMA_C3TCR_PAM_VAL(X) (((uint32_t)(X) & 0x3UL) << 26)
#define MDMA_MDMA_C3TCR_TRGM          (0x3UL << 28) 
#define MDMA_MDMA_C3TCR_TRGM_VAL(X) (((uint32_t)(X) & 0x3UL) << 28)
#define MDMA_MDMA_C3TCR_SWRM          (0x1UL << 30) 
#define MDMA_MDMA_C3TCR_SWRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define MDMA_MDMA_C3TCR_BWM          (0x1UL << 31) 
#define MDMA_MDMA_C3TCR_BWM_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define MDMA_MDMA_C3BNDTR_BNDT          (0x1FFFFUL << 0) 
#define MDMA_MDMA_C3BNDTR_BNDT_VAL(X) (((uint32_t)(X) & 0x1FFFFUL) << 0)
#define MDMA_MDMA_C3BNDTR_BRSUM          (0x1UL << 18) 
#define MDMA_MDMA_C3BNDTR_BRSUM_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define MDMA_MDMA_C3BNDTR_BRDUM          (0x1UL << 19) 
#define MDMA_MDMA_C3BNDTR_BRDUM_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define MDMA_MDMA_C3BNDTR_BRC          (0xFFFUL << 20) 
#define MDMA_MDMA_C3BNDTR_BRC_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 20)
#define MDMA_MDMA_C3SAR_SAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C3SAR_SAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C3DAR_DAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C3DAR_DAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C3BRUR_SUV          (0xFFFFUL << 0) 
#define MDMA_MDMA_C3BRUR_SUV_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDMA_MDMA_C3BRUR_DUV          (0xFFFFUL << 16) 
#define MDMA_MDMA_C3BRUR_DUV_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define MDMA_MDMA_C3LAR_LAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C3LAR_LAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C3TBR_TSEL          (0x3FUL << 0) 
#define MDMA_MDMA_C3TBR_TSEL_VAL(X) (((uint32_t)(X) & 0x3FUL) << 0)
#define MDMA_MDMA_C3TBR_SBUS          (0x1UL << 16) 
#define MDMA_MDMA_C3TBR_SBUS_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define MDMA_MDMA_C3TBR_DBUS          (0x1UL << 17) 
#define MDMA_MDMA_C3TBR_DBUS_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define MDMA_MDMA_C3MAR_MAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C3MAR_MAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C3MDR_MDR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C3MDR_MDR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C4ISR_TEIF4          (0x1UL << 0) 
#define MDMA_MDMA_C4ISR_TEIF4_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MDMA_MDMA_C4ISR_CTCIF4          (0x1UL << 1) 
#define MDMA_MDMA_C4ISR_CTCIF4_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define MDMA_MDMA_C4ISR_BRTIF4          (0x1UL << 2) 
#define MDMA_MDMA_C4ISR_BRTIF4_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define MDMA_MDMA_C4ISR_BTIF4          (0x1UL << 3) 
#define MDMA_MDMA_C4ISR_BTIF4_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define MDMA_MDMA_C4ISR_TCIF4          (0x1UL << 4) 
#define MDMA_MDMA_C4ISR_TCIF4_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define MDMA_MDMA_C4ISR_CRQA4          (0x1UL << 16) 
#define MDMA_MDMA_C4ISR_CRQA4_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define MDMA_MDMA_C4IFCR_CTEIF4          (0x1UL << 0) 
#define MDMA_MDMA_C4IFCR_CTEIF4_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MDMA_MDMA_C4IFCR_CCTCIF4          (0x1UL << 1) 
#define MDMA_MDMA_C4IFCR_CCTCIF4_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define MDMA_MDMA_C4IFCR_CBRTIF4          (0x1UL << 2) 
#define MDMA_MDMA_C4IFCR_CBRTIF4_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define MDMA_MDMA_C4IFCR_CBTIF4          (0x1UL << 3) 
#define MDMA_MDMA_C4IFCR_CBTIF4_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define MDMA_MDMA_C4IFCR_CLTCIF4          (0x1UL << 4) 
#define MDMA_MDMA_C4IFCR_CLTCIF4_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define MDMA_MDMA_C4ESR_TEA          (0x7FUL << 0) 
#define MDMA_MDMA_C4ESR_TEA_VAL(X) (((uint32_t)(X) & 0x7FUL) << 0)
#define MDMA_MDMA_C4ESR_TED          (0x1UL << 7) 
#define MDMA_MDMA_C4ESR_TED_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define MDMA_MDMA_C4ESR_TELD          (0x1UL << 8) 
#define MDMA_MDMA_C4ESR_TELD_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define MDMA_MDMA_C4ESR_TEMD          (0x1UL << 9) 
#define MDMA_MDMA_C4ESR_TEMD_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define MDMA_MDMA_C4ESR_ASE          (0x1UL << 10) 
#define MDMA_MDMA_C4ESR_ASE_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define MDMA_MDMA_C4ESR_BSE          (0x1UL << 11) 
#define MDMA_MDMA_C4ESR_BSE_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define MDMA_MDMA_C4CR_EN          (0x1UL << 0) 
#define MDMA_MDMA_C4CR_EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MDMA_MDMA_C4CR_TEIE          (0x1UL << 1) 
#define MDMA_MDMA_C4CR_TEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define MDMA_MDMA_C4CR_CTCIE          (0x1UL << 2) 
#define MDMA_MDMA_C4CR_CTCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define MDMA_MDMA_C4CR_BRTIE          (0x1UL << 3) 
#define MDMA_MDMA_C4CR_BRTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define MDMA_MDMA_C4CR_BTIE          (0x1UL << 4) 
#define MDMA_MDMA_C4CR_BTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define MDMA_MDMA_C4CR_TCIE          (0x1UL << 5) 
#define MDMA_MDMA_C4CR_TCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define MDMA_MDMA_C4CR_PL          (0x3UL << 6) 
#define MDMA_MDMA_C4CR_PL_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define MDMA_MDMA_C4CR_BEX          (0x1UL << 12) 
#define MDMA_MDMA_C4CR_BEX_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define MDMA_MDMA_C4CR_HEX          (0x1UL << 13) 
#define MDMA_MDMA_C4CR_HEX_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define MDMA_MDMA_C4CR_WEX          (0x1UL << 14) 
#define MDMA_MDMA_C4CR_WEX_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define MDMA_MDMA_C4CR_SWRQ          (0x1UL << 16) 
#define MDMA_MDMA_C4CR_SWRQ_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define MDMA_MDMA_C4TCR_SINC          (0x3UL << 0) 
#define MDMA_MDMA_C4TCR_SINC_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define MDMA_MDMA_C4TCR_DINC          (0x3UL << 2) 
#define MDMA_MDMA_C4TCR_DINC_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define MDMA_MDMA_C4TCR_SSIZE          (0x3UL << 4) 
#define MDMA_MDMA_C4TCR_SSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 4)
#define MDMA_MDMA_C4TCR_DSIZE          (0x3UL << 6) 
#define MDMA_MDMA_C4TCR_DSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define MDMA_MDMA_C4TCR_SINCOS          (0x3UL << 8) 
#define MDMA_MDMA_C4TCR_SINCOS_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define MDMA_MDMA_C4TCR_DINCOS          (0x3UL << 10) 
#define MDMA_MDMA_C4TCR_DINCOS_VAL(X) (((uint32_t)(X) & 0x3UL) << 10)
#define MDMA_MDMA_C4TCR_SBURST          (0x7UL << 12) 
#define MDMA_MDMA_C4TCR_SBURST_VAL(X) (((uint32_t)(X) & 0x7UL) << 12)
#define MDMA_MDMA_C4TCR_DBURST          (0x7UL << 15) 
#define MDMA_MDMA_C4TCR_DBURST_VAL(X) (((uint32_t)(X) & 0x7UL) << 15)
#define MDMA_MDMA_C4TCR_TLEN          (0x7FUL << 18) 
#define MDMA_MDMA_C4TCR_TLEN_VAL(X) (((uint32_t)(X) & 0x7FUL) << 18)
#define MDMA_MDMA_C4TCR_PKE          (0x1UL << 25) 
#define MDMA_MDMA_C4TCR_PKE_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define MDMA_MDMA_C4TCR_PAM          (0x3UL << 26) 
#define MDMA_MDMA_C4TCR_PAM_VAL(X) (((uint32_t)(X) & 0x3UL) << 26)
#define MDMA_MDMA_C4TCR_TRGM          (0x3UL << 28) 
#define MDMA_MDMA_C4TCR_TRGM_VAL(X) (((uint32_t)(X) & 0x3UL) << 28)
#define MDMA_MDMA_C4TCR_SWRM          (0x1UL << 30) 
#define MDMA_MDMA_C4TCR_SWRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define MDMA_MDMA_C4TCR_BWM          (0x1UL << 31) 
#define MDMA_MDMA_C4TCR_BWM_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define MDMA_MDMA_C4BNDTR_BNDT          (0x1FFFFUL << 0) 
#define MDMA_MDMA_C4BNDTR_BNDT_VAL(X) (((uint32_t)(X) & 0x1FFFFUL) << 0)
#define MDMA_MDMA_C4BNDTR_BRSUM          (0x1UL << 18) 
#define MDMA_MDMA_C4BNDTR_BRSUM_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define MDMA_MDMA_C4BNDTR_BRDUM          (0x1UL << 19) 
#define MDMA_MDMA_C4BNDTR_BRDUM_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define MDMA_MDMA_C4BNDTR_BRC          (0xFFFUL << 20) 
#define MDMA_MDMA_C4BNDTR_BRC_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 20)
#define MDMA_MDMA_C4SAR_SAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C4SAR_SAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C4DAR_DAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C4DAR_DAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C4BRUR_SUV          (0xFFFFUL << 0) 
#define MDMA_MDMA_C4BRUR_SUV_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDMA_MDMA_C4BRUR_DUV          (0xFFFFUL << 16) 
#define MDMA_MDMA_C4BRUR_DUV_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define MDMA_MDMA_C4LAR_LAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C4LAR_LAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C4TBR_TSEL          (0x3FUL << 0) 
#define MDMA_MDMA_C4TBR_TSEL_VAL(X) (((uint32_t)(X) & 0x3FUL) << 0)
#define MDMA_MDMA_C4TBR_SBUS          (0x1UL << 16) 
#define MDMA_MDMA_C4TBR_SBUS_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define MDMA_MDMA_C4TBR_DBUS          (0x1UL << 17) 
#define MDMA_MDMA_C4TBR_DBUS_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define MDMA_MDMA_C4MAR_MAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C4MAR_MAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C4MDR_MDR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C4MDR_MDR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C5ISR_TEIF5          (0x1UL << 0) 
#define MDMA_MDMA_C5ISR_TEIF5_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MDMA_MDMA_C5ISR_CTCIF5          (0x1UL << 1) 
#define MDMA_MDMA_C5ISR_CTCIF5_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define MDMA_MDMA_C5ISR_BRTIF5          (0x1UL << 2) 
#define MDMA_MDMA_C5ISR_BRTIF5_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define MDMA_MDMA_C5ISR_BTIF5          (0x1UL << 3) 
#define MDMA_MDMA_C5ISR_BTIF5_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define MDMA_MDMA_C5ISR_TCIF5          (0x1UL << 4) 
#define MDMA_MDMA_C5ISR_TCIF5_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define MDMA_MDMA_C5ISR_CRQA5          (0x1UL << 16) 
#define MDMA_MDMA_C5ISR_CRQA5_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define MDMA_MDMA_C5IFCR_CTEIF5          (0x1UL << 0) 
#define MDMA_MDMA_C5IFCR_CTEIF5_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MDMA_MDMA_C5IFCR_CCTCIF5          (0x1UL << 1) 
#define MDMA_MDMA_C5IFCR_CCTCIF5_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define MDMA_MDMA_C5IFCR_CBRTIF5          (0x1UL << 2) 
#define MDMA_MDMA_C5IFCR_CBRTIF5_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define MDMA_MDMA_C5IFCR_CBTIF5          (0x1UL << 3) 
#define MDMA_MDMA_C5IFCR_CBTIF5_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define MDMA_MDMA_C5IFCR_CLTCIF5          (0x1UL << 4) 
#define MDMA_MDMA_C5IFCR_CLTCIF5_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define MDMA_MDMA_C5ESR_TEA          (0x7FUL << 0) 
#define MDMA_MDMA_C5ESR_TEA_VAL(X) (((uint32_t)(X) & 0x7FUL) << 0)
#define MDMA_MDMA_C5ESR_TED          (0x1UL << 7) 
#define MDMA_MDMA_C5ESR_TED_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define MDMA_MDMA_C5ESR_TELD          (0x1UL << 8) 
#define MDMA_MDMA_C5ESR_TELD_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define MDMA_MDMA_C5ESR_TEMD          (0x1UL << 9) 
#define MDMA_MDMA_C5ESR_TEMD_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define MDMA_MDMA_C5ESR_ASE          (0x1UL << 10) 
#define MDMA_MDMA_C5ESR_ASE_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define MDMA_MDMA_C5ESR_BSE          (0x1UL << 11) 
#define MDMA_MDMA_C5ESR_BSE_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define MDMA_MDMA_C5CR_EN          (0x1UL << 0) 
#define MDMA_MDMA_C5CR_EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MDMA_MDMA_C5CR_TEIE          (0x1UL << 1) 
#define MDMA_MDMA_C5CR_TEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define MDMA_MDMA_C5CR_CTCIE          (0x1UL << 2) 
#define MDMA_MDMA_C5CR_CTCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define MDMA_MDMA_C5CR_BRTIE          (0x1UL << 3) 
#define MDMA_MDMA_C5CR_BRTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define MDMA_MDMA_C5CR_BTIE          (0x1UL << 4) 
#define MDMA_MDMA_C5CR_BTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define MDMA_MDMA_C5CR_TCIE          (0x1UL << 5) 
#define MDMA_MDMA_C5CR_TCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define MDMA_MDMA_C5CR_PL          (0x3UL << 6) 
#define MDMA_MDMA_C5CR_PL_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define MDMA_MDMA_C5CR_BEX          (0x1UL << 12) 
#define MDMA_MDMA_C5CR_BEX_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define MDMA_MDMA_C5CR_HEX          (0x1UL << 13) 
#define MDMA_MDMA_C5CR_HEX_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define MDMA_MDMA_C5CR_WEX          (0x1UL << 14) 
#define MDMA_MDMA_C5CR_WEX_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define MDMA_MDMA_C5CR_SWRQ          (0x1UL << 16) 
#define MDMA_MDMA_C5CR_SWRQ_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define MDMA_MDMA_C5TCR_SINC          (0x3UL << 0) 
#define MDMA_MDMA_C5TCR_SINC_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define MDMA_MDMA_C5TCR_DINC          (0x3UL << 2) 
#define MDMA_MDMA_C5TCR_DINC_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define MDMA_MDMA_C5TCR_SSIZE          (0x3UL << 4) 
#define MDMA_MDMA_C5TCR_SSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 4)
#define MDMA_MDMA_C5TCR_DSIZE          (0x3UL << 6) 
#define MDMA_MDMA_C5TCR_DSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define MDMA_MDMA_C5TCR_SINCOS          (0x3UL << 8) 
#define MDMA_MDMA_C5TCR_SINCOS_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define MDMA_MDMA_C5TCR_DINCOS          (0x3UL << 10) 
#define MDMA_MDMA_C5TCR_DINCOS_VAL(X) (((uint32_t)(X) & 0x3UL) << 10)
#define MDMA_MDMA_C5TCR_SBURST          (0x7UL << 12) 
#define MDMA_MDMA_C5TCR_SBURST_VAL(X) (((uint32_t)(X) & 0x7UL) << 12)
#define MDMA_MDMA_C5TCR_DBURST          (0x7UL << 15) 
#define MDMA_MDMA_C5TCR_DBURST_VAL(X) (((uint32_t)(X) & 0x7UL) << 15)
#define MDMA_MDMA_C5TCR_TLEN          (0x7FUL << 18) 
#define MDMA_MDMA_C5TCR_TLEN_VAL(X) (((uint32_t)(X) & 0x7FUL) << 18)
#define MDMA_MDMA_C5TCR_PKE          (0x1UL << 25) 
#define MDMA_MDMA_C5TCR_PKE_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define MDMA_MDMA_C5TCR_PAM          (0x3UL << 26) 
#define MDMA_MDMA_C5TCR_PAM_VAL(X) (((uint32_t)(X) & 0x3UL) << 26)
#define MDMA_MDMA_C5TCR_TRGM          (0x3UL << 28) 
#define MDMA_MDMA_C5TCR_TRGM_VAL(X) (((uint32_t)(X) & 0x3UL) << 28)
#define MDMA_MDMA_C5TCR_SWRM          (0x1UL << 30) 
#define MDMA_MDMA_C5TCR_SWRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define MDMA_MDMA_C5TCR_BWM          (0x1UL << 31) 
#define MDMA_MDMA_C5TCR_BWM_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define MDMA_MDMA_C5BNDTR_BNDT          (0x1FFFFUL << 0) 
#define MDMA_MDMA_C5BNDTR_BNDT_VAL(X) (((uint32_t)(X) & 0x1FFFFUL) << 0)
#define MDMA_MDMA_C5BNDTR_BRSUM          (0x1UL << 18) 
#define MDMA_MDMA_C5BNDTR_BRSUM_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define MDMA_MDMA_C5BNDTR_BRDUM          (0x1UL << 19) 
#define MDMA_MDMA_C5BNDTR_BRDUM_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define MDMA_MDMA_C5BNDTR_BRC          (0xFFFUL << 20) 
#define MDMA_MDMA_C5BNDTR_BRC_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 20)
#define MDMA_MDMA_C5SAR_SAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C5SAR_SAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C5DAR_DAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C5DAR_DAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C5BRUR_SUV          (0xFFFFUL << 0) 
#define MDMA_MDMA_C5BRUR_SUV_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDMA_MDMA_C5BRUR_DUV          (0xFFFFUL << 16) 
#define MDMA_MDMA_C5BRUR_DUV_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define MDMA_MDMA_C5LAR_LAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C5LAR_LAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C5TBR_TSEL          (0x3FUL << 0) 
#define MDMA_MDMA_C5TBR_TSEL_VAL(X) (((uint32_t)(X) & 0x3FUL) << 0)
#define MDMA_MDMA_C5TBR_SBUS          (0x1UL << 16) 
#define MDMA_MDMA_C5TBR_SBUS_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define MDMA_MDMA_C5TBR_DBUS          (0x1UL << 17) 
#define MDMA_MDMA_C5TBR_DBUS_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define MDMA_MDMA_C5MAR_MAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C5MAR_MAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C5MDR_MDR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C5MDR_MDR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C6ISR_TEIF6          (0x1UL << 0) 
#define MDMA_MDMA_C6ISR_TEIF6_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MDMA_MDMA_C6ISR_CTCIF6          (0x1UL << 1) 
#define MDMA_MDMA_C6ISR_CTCIF6_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define MDMA_MDMA_C6ISR_BRTIF6          (0x1UL << 2) 
#define MDMA_MDMA_C6ISR_BRTIF6_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define MDMA_MDMA_C6ISR_BTIF6          (0x1UL << 3) 
#define MDMA_MDMA_C6ISR_BTIF6_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define MDMA_MDMA_C6ISR_TCIF6          (0x1UL << 4) 
#define MDMA_MDMA_C6ISR_TCIF6_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define MDMA_MDMA_C6ISR_CRQA6          (0x1UL << 16) 
#define MDMA_MDMA_C6ISR_CRQA6_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define MDMA_MDMA_C6IFCR_CTEIF6          (0x1UL << 0) 
#define MDMA_MDMA_C6IFCR_CTEIF6_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MDMA_MDMA_C6IFCR_CCTCIF6          (0x1UL << 1) 
#define MDMA_MDMA_C6IFCR_CCTCIF6_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define MDMA_MDMA_C6IFCR_CBRTIF6          (0x1UL << 2) 
#define MDMA_MDMA_C6IFCR_CBRTIF6_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define MDMA_MDMA_C6IFCR_CBTIF6          (0x1UL << 3) 
#define MDMA_MDMA_C6IFCR_CBTIF6_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define MDMA_MDMA_C6IFCR_CLTCIF6          (0x1UL << 4) 
#define MDMA_MDMA_C6IFCR_CLTCIF6_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define MDMA_MDMA_C6ESR_TEA          (0x7FUL << 0) 
#define MDMA_MDMA_C6ESR_TEA_VAL(X) (((uint32_t)(X) & 0x7FUL) << 0)
#define MDMA_MDMA_C6ESR_TED          (0x1UL << 7) 
#define MDMA_MDMA_C6ESR_TED_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define MDMA_MDMA_C6ESR_TELD          (0x1UL << 8) 
#define MDMA_MDMA_C6ESR_TELD_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define MDMA_MDMA_C6ESR_TEMD          (0x1UL << 9) 
#define MDMA_MDMA_C6ESR_TEMD_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define MDMA_MDMA_C6ESR_ASE          (0x1UL << 10) 
#define MDMA_MDMA_C6ESR_ASE_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define MDMA_MDMA_C6ESR_BSE          (0x1UL << 11) 
#define MDMA_MDMA_C6ESR_BSE_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define MDMA_MDMA_C6CR_EN          (0x1UL << 0) 
#define MDMA_MDMA_C6CR_EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MDMA_MDMA_C6CR_TEIE          (0x1UL << 1) 
#define MDMA_MDMA_C6CR_TEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define MDMA_MDMA_C6CR_CTCIE          (0x1UL << 2) 
#define MDMA_MDMA_C6CR_CTCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define MDMA_MDMA_C6CR_BRTIE          (0x1UL << 3) 
#define MDMA_MDMA_C6CR_BRTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define MDMA_MDMA_C6CR_BTIE          (0x1UL << 4) 
#define MDMA_MDMA_C6CR_BTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define MDMA_MDMA_C6CR_TCIE          (0x1UL << 5) 
#define MDMA_MDMA_C6CR_TCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define MDMA_MDMA_C6CR_PL          (0x3UL << 6) 
#define MDMA_MDMA_C6CR_PL_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define MDMA_MDMA_C6CR_BEX          (0x1UL << 12) 
#define MDMA_MDMA_C6CR_BEX_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define MDMA_MDMA_C6CR_HEX          (0x1UL << 13) 
#define MDMA_MDMA_C6CR_HEX_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define MDMA_MDMA_C6CR_WEX          (0x1UL << 14) 
#define MDMA_MDMA_C6CR_WEX_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define MDMA_MDMA_C6CR_SWRQ          (0x1UL << 16) 
#define MDMA_MDMA_C6CR_SWRQ_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define MDMA_MDMA_C6TCR_SINC          (0x3UL << 0) 
#define MDMA_MDMA_C6TCR_SINC_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define MDMA_MDMA_C6TCR_DINC          (0x3UL << 2) 
#define MDMA_MDMA_C6TCR_DINC_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define MDMA_MDMA_C6TCR_SSIZE          (0x3UL << 4) 
#define MDMA_MDMA_C6TCR_SSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 4)
#define MDMA_MDMA_C6TCR_DSIZE          (0x3UL << 6) 
#define MDMA_MDMA_C6TCR_DSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define MDMA_MDMA_C6TCR_SINCOS          (0x3UL << 8) 
#define MDMA_MDMA_C6TCR_SINCOS_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define MDMA_MDMA_C6TCR_DINCOS          (0x3UL << 10) 
#define MDMA_MDMA_C6TCR_DINCOS_VAL(X) (((uint32_t)(X) & 0x3UL) << 10)
#define MDMA_MDMA_C6TCR_SBURST          (0x7UL << 12) 
#define MDMA_MDMA_C6TCR_SBURST_VAL(X) (((uint32_t)(X) & 0x7UL) << 12)
#define MDMA_MDMA_C6TCR_DBURST          (0x7UL << 15) 
#define MDMA_MDMA_C6TCR_DBURST_VAL(X) (((uint32_t)(X) & 0x7UL) << 15)
#define MDMA_MDMA_C6TCR_TLEN          (0x7FUL << 18) 
#define MDMA_MDMA_C6TCR_TLEN_VAL(X) (((uint32_t)(X) & 0x7FUL) << 18)
#define MDMA_MDMA_C6TCR_PKE          (0x1UL << 25) 
#define MDMA_MDMA_C6TCR_PKE_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define MDMA_MDMA_C6TCR_PAM          (0x3UL << 26) 
#define MDMA_MDMA_C6TCR_PAM_VAL(X) (((uint32_t)(X) & 0x3UL) << 26)
#define MDMA_MDMA_C6TCR_TRGM          (0x3UL << 28) 
#define MDMA_MDMA_C6TCR_TRGM_VAL(X) (((uint32_t)(X) & 0x3UL) << 28)
#define MDMA_MDMA_C6TCR_SWRM          (0x1UL << 30) 
#define MDMA_MDMA_C6TCR_SWRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define MDMA_MDMA_C6TCR_BWM          (0x1UL << 31) 
