via/viaems/src/platforms/stm32h743/device.h
#define MDMA_MDMA_C6TCR_BWM_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define MDMA_MDMA_C6BNDTR_BNDT          (0x1FFFFUL << 0) 
#define MDMA_MDMA_C6BNDTR_BNDT_VAL(X) (((uint32_t)(X) & 0x1FFFFUL) << 0)
#define MDMA_MDMA_C6BNDTR_BRSUM          (0x1UL << 18) 
#define MDMA_MDMA_C6BNDTR_BRSUM_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define MDMA_MDMA_C6BNDTR_BRDUM          (0x1UL << 19) 
#define MDMA_MDMA_C6BNDTR_BRDUM_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define MDMA_MDMA_C6BNDTR_BRC          (0xFFFUL << 20) 
#define MDMA_MDMA_C6BNDTR_BRC_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 20)
#define MDMA_MDMA_C6SAR_SAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C6SAR_SAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C6DAR_DAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C6DAR_DAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C6BRUR_SUV          (0xFFFFUL << 0) 
#define MDMA_MDMA_C6BRUR_SUV_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDMA_MDMA_C6BRUR_DUV          (0xFFFFUL << 16) 
#define MDMA_MDMA_C6BRUR_DUV_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define MDMA_MDMA_C6LAR_LAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C6LAR_LAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C6TBR_TSEL          (0x3FUL << 0) 
#define MDMA_MDMA_C6TBR_TSEL_VAL(X) (((uint32_t)(X) & 0x3FUL) << 0)
#define MDMA_MDMA_C6TBR_SBUS          (0x1UL << 16) 
#define MDMA_MDMA_C6TBR_SBUS_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define MDMA_MDMA_C6TBR_DBUS          (0x1UL << 17) 
#define MDMA_MDMA_C6TBR_DBUS_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define MDMA_MDMA_C6MAR_MAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C6MAR_MAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C6MDR_MDR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C6MDR_MDR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C7ISR_TEIF7          (0x1UL << 0) 
#define MDMA_MDMA_C7ISR_TEIF7_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MDMA_MDMA_C7ISR_CTCIF7          (0x1UL << 1) 
#define MDMA_MDMA_C7ISR_CTCIF7_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define MDMA_MDMA_C7ISR_BRTIF7          (0x1UL << 2) 
#define MDMA_MDMA_C7ISR_BRTIF7_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define MDMA_MDMA_C7ISR_BTIF7          (0x1UL << 3) 
#define MDMA_MDMA_C7ISR_BTIF7_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define MDMA_MDMA_C7ISR_TCIF7          (0x1UL << 4) 
#define MDMA_MDMA_C7ISR_TCIF7_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define MDMA_MDMA_C7ISR_CRQA7          (0x1UL << 16) 
#define MDMA_MDMA_C7ISR_CRQA7_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define MDMA_MDMA_C7IFCR_CTEIF7          (0x1UL << 0) 
#define MDMA_MDMA_C7IFCR_CTEIF7_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MDMA_MDMA_C7IFCR_CCTCIF7          (0x1UL << 1) 
#define MDMA_MDMA_C7IFCR_CCTCIF7_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define MDMA_MDMA_C7IFCR_CBRTIF7          (0x1UL << 2) 
#define MDMA_MDMA_C7IFCR_CBRTIF7_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define MDMA_MDMA_C7IFCR_CBTIF7          (0x1UL << 3) 
#define MDMA_MDMA_C7IFCR_CBTIF7_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define MDMA_MDMA_C7IFCR_CLTCIF7          (0x1UL << 4) 
#define MDMA_MDMA_C7IFCR_CLTCIF7_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define MDMA_MDMA_C7ESR_TEA          (0x7FUL << 0) 
#define MDMA_MDMA_C7ESR_TEA_VAL(X) (((uint32_t)(X) & 0x7FUL) << 0)
#define MDMA_MDMA_C7ESR_TED          (0x1UL << 7) 
#define MDMA_MDMA_C7ESR_TED_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define MDMA_MDMA_C7ESR_TELD          (0x1UL << 8) 
#define MDMA_MDMA_C7ESR_TELD_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define MDMA_MDMA_C7ESR_TEMD          (0x1UL << 9) 
#define MDMA_MDMA_C7ESR_TEMD_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define MDMA_MDMA_C7ESR_ASE          (0x1UL << 10) 
#define MDMA_MDMA_C7ESR_ASE_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define MDMA_MDMA_C7ESR_BSE          (0x1UL << 11) 
#define MDMA_MDMA_C7ESR_BSE_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define MDMA_MDMA_C7CR_EN          (0x1UL << 0) 
#define MDMA_MDMA_C7CR_EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MDMA_MDMA_C7CR_TEIE          (0x1UL << 1) 
#define MDMA_MDMA_C7CR_TEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define MDMA_MDMA_C7CR_CTCIE          (0x1UL << 2) 
#define MDMA_MDMA_C7CR_CTCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define MDMA_MDMA_C7CR_BRTIE          (0x1UL << 3) 
#define MDMA_MDMA_C7CR_BRTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define MDMA_MDMA_C7CR_BTIE          (0x1UL << 4) 
#define MDMA_MDMA_C7CR_BTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define MDMA_MDMA_C7CR_TCIE          (0x1UL << 5) 
#define MDMA_MDMA_C7CR_TCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define MDMA_MDMA_C7CR_PL          (0x3UL << 6) 
#define MDMA_MDMA_C7CR_PL_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define MDMA_MDMA_C7CR_BEX          (0x1UL << 12) 
#define MDMA_MDMA_C7CR_BEX_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define MDMA_MDMA_C7CR_HEX          (0x1UL << 13) 
#define MDMA_MDMA_C7CR_HEX_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define MDMA_MDMA_C7CR_WEX          (0x1UL << 14) 
#define MDMA_MDMA_C7CR_WEX_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define MDMA_MDMA_C7CR_SWRQ          (0x1UL << 16) 
#define MDMA_MDMA_C7CR_SWRQ_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define MDMA_MDMA_C7TCR_SINC          (0x3UL << 0) 
#define MDMA_MDMA_C7TCR_SINC_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define MDMA_MDMA_C7TCR_DINC          (0x3UL << 2) 
#define MDMA_MDMA_C7TCR_DINC_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define MDMA_MDMA_C7TCR_SSIZE          (0x3UL << 4) 
#define MDMA_MDMA_C7TCR_SSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 4)
#define MDMA_MDMA_C7TCR_DSIZE          (0x3UL << 6) 
#define MDMA_MDMA_C7TCR_DSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define MDMA_MDMA_C7TCR_SINCOS          (0x3UL << 8) 
#define MDMA_MDMA_C7TCR_SINCOS_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define MDMA_MDMA_C7TCR_DINCOS          (0x3UL << 10) 
#define MDMA_MDMA_C7TCR_DINCOS_VAL(X) (((uint32_t)(X) & 0x3UL) << 10)
#define MDMA_MDMA_C7TCR_SBURST          (0x7UL << 12) 
#define MDMA_MDMA_C7TCR_SBURST_VAL(X) (((uint32_t)(X) & 0x7UL) << 12)
#define MDMA_MDMA_C7TCR_DBURST          (0x7UL << 15) 
#define MDMA_MDMA_C7TCR_DBURST_VAL(X) (((uint32_t)(X) & 0x7UL) << 15)
#define MDMA_MDMA_C7TCR_TLEN          (0x7FUL << 18) 
#define MDMA_MDMA_C7TCR_TLEN_VAL(X) (((uint32_t)(X) & 0x7FUL) << 18)
#define MDMA_MDMA_C7TCR_PKE          (0x1UL << 25) 
#define MDMA_MDMA_C7TCR_PKE_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define MDMA_MDMA_C7TCR_PAM          (0x3UL << 26) 
#define MDMA_MDMA_C7TCR_PAM_VAL(X) (((uint32_t)(X) & 0x3UL) << 26)
#define MDMA_MDMA_C7TCR_TRGM          (0x3UL << 28) 
#define MDMA_MDMA_C7TCR_TRGM_VAL(X) (((uint32_t)(X) & 0x3UL) << 28)
#define MDMA_MDMA_C7TCR_SWRM          (0x1UL << 30) 
#define MDMA_MDMA_C7TCR_SWRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define MDMA_MDMA_C7TCR_BWM          (0x1UL << 31) 
#define MDMA_MDMA_C7TCR_BWM_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define MDMA_MDMA_C7BNDTR_BNDT          (0x1FFFFUL << 0) 
#define MDMA_MDMA_C7BNDTR_BNDT_VAL(X) (((uint32_t)(X) & 0x1FFFFUL) << 0)
#define MDMA_MDMA_C7BNDTR_BRSUM          (0x1UL << 18) 
#define MDMA_MDMA_C7BNDTR_BRSUM_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define MDMA_MDMA_C7BNDTR_BRDUM          (0x1UL << 19) 
#define MDMA_MDMA_C7BNDTR_BRDUM_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define MDMA_MDMA_C7BNDTR_BRC          (0xFFFUL << 20) 
#define MDMA_MDMA_C7BNDTR_BRC_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 20)
#define MDMA_MDMA_C7SAR_SAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C7SAR_SAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C7DAR_DAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C7DAR_DAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C7BRUR_SUV          (0xFFFFUL << 0) 
#define MDMA_MDMA_C7BRUR_SUV_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDMA_MDMA_C7BRUR_DUV          (0xFFFFUL << 16) 
#define MDMA_MDMA_C7BRUR_DUV_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define MDMA_MDMA_C7LAR_LAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C7LAR_LAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C7TBR_TSEL          (0x3FUL << 0) 
#define MDMA_MDMA_C7TBR_TSEL_VAL(X) (((uint32_t)(X) & 0x3FUL) << 0)
#define MDMA_MDMA_C7TBR_SBUS          (0x1UL << 16) 
#define MDMA_MDMA_C7TBR_SBUS_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define MDMA_MDMA_C7TBR_DBUS          (0x1UL << 17) 
#define MDMA_MDMA_C7TBR_DBUS_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define MDMA_MDMA_C7MAR_MAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C7MAR_MAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C7MDR_MDR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C7MDR_MDR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C8ISR_TEIF8          (0x1UL << 0) 
#define MDMA_MDMA_C8ISR_TEIF8_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MDMA_MDMA_C8ISR_CTCIF8          (0x1UL << 1) 
#define MDMA_MDMA_C8ISR_CTCIF8_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define MDMA_MDMA_C8ISR_BRTIF8          (0x1UL << 2) 
#define MDMA_MDMA_C8ISR_BRTIF8_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define MDMA_MDMA_C8ISR_BTIF8          (0x1UL << 3) 
#define MDMA_MDMA_C8ISR_BTIF8_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define MDMA_MDMA_C8ISR_TCIF8          (0x1UL << 4) 
#define MDMA_MDMA_C8ISR_TCIF8_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define MDMA_MDMA_C8ISR_CRQA8          (0x1UL << 16) 
#define MDMA_MDMA_C8ISR_CRQA8_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define MDMA_MDMA_C8IFCR_CTEIF8          (0x1UL << 0) 
#define MDMA_MDMA_C8IFCR_CTEIF8_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MDMA_MDMA_C8IFCR_CCTCIF8          (0x1UL << 1) 
#define MDMA_MDMA_C8IFCR_CCTCIF8_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define MDMA_MDMA_C8IFCR_CBRTIF8          (0x1UL << 2) 
#define MDMA_MDMA_C8IFCR_CBRTIF8_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define MDMA_MDMA_C8IFCR_CBTIF8          (0x1UL << 3) 
#define MDMA_MDMA_C8IFCR_CBTIF8_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define MDMA_MDMA_C8IFCR_CLTCIF8          (0x1UL << 4) 
#define MDMA_MDMA_C8IFCR_CLTCIF8_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define MDMA_MDMA_C8ESR_TEA          (0x7FUL << 0) 
#define MDMA_MDMA_C8ESR_TEA_VAL(X) (((uint32_t)(X) & 0x7FUL) << 0)
#define MDMA_MDMA_C8ESR_TED          (0x1UL << 7) 
#define MDMA_MDMA_C8ESR_TED_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define MDMA_MDMA_C8ESR_TELD          (0x1UL << 8) 
#define MDMA_MDMA_C8ESR_TELD_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define MDMA_MDMA_C8ESR_TEMD          (0x1UL << 9) 
#define MDMA_MDMA_C8ESR_TEMD_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define MDMA_MDMA_C8ESR_ASE          (0x1UL << 10) 
#define MDMA_MDMA_C8ESR_ASE_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define MDMA_MDMA_C8ESR_BSE          (0x1UL << 11) 
#define MDMA_MDMA_C8ESR_BSE_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define MDMA_MDMA_C8CR_EN          (0x1UL << 0) 
#define MDMA_MDMA_C8CR_EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MDMA_MDMA_C8CR_TEIE          (0x1UL << 1) 
#define MDMA_MDMA_C8CR_TEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define MDMA_MDMA_C8CR_CTCIE          (0x1UL << 2) 
#define MDMA_MDMA_C8CR_CTCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define MDMA_MDMA_C8CR_BRTIE          (0x1UL << 3) 
#define MDMA_MDMA_C8CR_BRTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define MDMA_MDMA_C8CR_BTIE          (0x1UL << 4) 
#define MDMA_MDMA_C8CR_BTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define MDMA_MDMA_C8CR_TCIE          (0x1UL << 5) 
#define MDMA_MDMA_C8CR_TCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define MDMA_MDMA_C8CR_PL          (0x3UL << 6) 
#define MDMA_MDMA_C8CR_PL_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define MDMA_MDMA_C8CR_BEX          (0x1UL << 12) 
#define MDMA_MDMA_C8CR_BEX_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define MDMA_MDMA_C8CR_HEX          (0x1UL << 13) 
#define MDMA_MDMA_C8CR_HEX_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define MDMA_MDMA_C8CR_WEX          (0x1UL << 14) 
#define MDMA_MDMA_C8CR_WEX_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define MDMA_MDMA_C8CR_SWRQ          (0x1UL << 16) 
#define MDMA_MDMA_C8CR_SWRQ_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define MDMA_MDMA_C8TCR_SINC          (0x3UL << 0) 
#define MDMA_MDMA_C8TCR_SINC_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define MDMA_MDMA_C8TCR_DINC          (0x3UL << 2) 
#define MDMA_MDMA_C8TCR_DINC_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define MDMA_MDMA_C8TCR_SSIZE          (0x3UL << 4) 
#define MDMA_MDMA_C8TCR_SSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 4)
#define MDMA_MDMA_C8TCR_DSIZE          (0x3UL << 6) 
#define MDMA_MDMA_C8TCR_DSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define MDMA_MDMA_C8TCR_SINCOS          (0x3UL << 8) 
#define MDMA_MDMA_C8TCR_SINCOS_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define MDMA_MDMA_C8TCR_DINCOS          (0x3UL << 10) 
#define MDMA_MDMA_C8TCR_DINCOS_VAL(X) (((uint32_t)(X) & 0x3UL) << 10)
#define MDMA_MDMA_C8TCR_SBURST          (0x7UL << 12) 
#define MDMA_MDMA_C8TCR_SBURST_VAL(X) (((uint32_t)(X) & 0x7UL) << 12)
#define MDMA_MDMA_C8TCR_DBURST          (0x7UL << 15) 
#define MDMA_MDMA_C8TCR_DBURST_VAL(X) (((uint32_t)(X) & 0x7UL) << 15)
#define MDMA_MDMA_C8TCR_TLEN          (0x7FUL << 18) 
#define MDMA_MDMA_C8TCR_TLEN_VAL(X) (((uint32_t)(X) & 0x7FUL) << 18)
#define MDMA_MDMA_C8TCR_PKE          (0x1UL << 25) 
#define MDMA_MDMA_C8TCR_PKE_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define MDMA_MDMA_C8TCR_PAM          (0x3UL << 26) 
#define MDMA_MDMA_C8TCR_PAM_VAL(X) (((uint32_t)(X) & 0x3UL) << 26)
#define MDMA_MDMA_C8TCR_TRGM          (0x3UL << 28) 
#define MDMA_MDMA_C8TCR_TRGM_VAL(X) (((uint32_t)(X) & 0x3UL) << 28)
#define MDMA_MDMA_C8TCR_SWRM          (0x1UL << 30) 
#define MDMA_MDMA_C8TCR_SWRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define MDMA_MDMA_C8TCR_BWM          (0x1UL << 31) 
#define MDMA_MDMA_C8TCR_BWM_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define MDMA_MDMA_C8BNDTR_BNDT          (0x1FFFFUL << 0) 
#define MDMA_MDMA_C8BNDTR_BNDT_VAL(X) (((uint32_t)(X) & 0x1FFFFUL) << 0)
#define MDMA_MDMA_C8BNDTR_BRSUM          (0x1UL << 18) 
#define MDMA_MDMA_C8BNDTR_BRSUM_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define MDMA_MDMA_C8BNDTR_BRDUM          (0x1UL << 19) 
#define MDMA_MDMA_C8BNDTR_BRDUM_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define MDMA_MDMA_C8BNDTR_BRC          (0xFFFUL << 20) 
#define MDMA_MDMA_C8BNDTR_BRC_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 20)
#define MDMA_MDMA_C8SAR_SAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C8SAR_SAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C8DAR_DAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C8DAR_DAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C8BRUR_SUV          (0xFFFFUL << 0) 
#define MDMA_MDMA_C8BRUR_SUV_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDMA_MDMA_C8BRUR_DUV          (0xFFFFUL << 16) 
#define MDMA_MDMA_C8BRUR_DUV_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define MDMA_MDMA_C8LAR_LAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C8LAR_LAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C8TBR_TSEL          (0x3FUL << 0) 
#define MDMA_MDMA_C8TBR_TSEL_VAL(X) (((uint32_t)(X) & 0x3FUL) << 0)
#define MDMA_MDMA_C8TBR_SBUS          (0x1UL << 16) 
#define MDMA_MDMA_C8TBR_SBUS_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define MDMA_MDMA_C8TBR_DBUS          (0x1UL << 17) 
#define MDMA_MDMA_C8TBR_DBUS_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define MDMA_MDMA_C8MAR_MAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C8MAR_MAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C8MDR_MDR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C8MDR_MDR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C9ISR_TEIF9          (0x1UL << 0) 
#define MDMA_MDMA_C9ISR_TEIF9_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MDMA_MDMA_C9ISR_CTCIF9          (0x1UL << 1) 
#define MDMA_MDMA_C9ISR_CTCIF9_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define MDMA_MDMA_C9ISR_BRTIF9          (0x1UL << 2) 
#define MDMA_MDMA_C9ISR_BRTIF9_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define MDMA_MDMA_C9ISR_BTIF9          (0x1UL << 3) 
#define MDMA_MDMA_C9ISR_BTIF9_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define MDMA_MDMA_C9ISR_TCIF9          (0x1UL << 4) 
#define MDMA_MDMA_C9ISR_TCIF9_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define MDMA_MDMA_C9ISR_CRQA9          (0x1UL << 16) 
#define MDMA_MDMA_C9ISR_CRQA9_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define MDMA_MDMA_C9IFCR_CTEIF9          (0x1UL << 0) 
#define MDMA_MDMA_C9IFCR_CTEIF9_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MDMA_MDMA_C9IFCR_CCTCIF9          (0x1UL << 1) 
#define MDMA_MDMA_C9IFCR_CCTCIF9_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define MDMA_MDMA_C9IFCR_CBRTIF9          (0x1UL << 2) 
#define MDMA_MDMA_C9IFCR_CBRTIF9_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define MDMA_MDMA_C9IFCR_CBTIF9          (0x1UL << 3) 
#define MDMA_MDMA_C9IFCR_CBTIF9_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define MDMA_MDMA_C9IFCR_CLTCIF9          (0x1UL << 4) 
#define MDMA_MDMA_C9IFCR_CLTCIF9_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define MDMA_MDMA_C9ESR_TEA          (0x7FUL << 0) 
#define MDMA_MDMA_C9ESR_TEA_VAL(X) (((uint32_t)(X) & 0x7FUL) << 0)
#define MDMA_MDMA_C9ESR_TED          (0x1UL << 7) 
#define MDMA_MDMA_C9ESR_TED_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define MDMA_MDMA_C9ESR_TELD          (0x1UL << 8) 
#define MDMA_MDMA_C9ESR_TELD_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define MDMA_MDMA_C9ESR_TEMD          (0x1UL << 9) 
#define MDMA_MDMA_C9ESR_TEMD_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define MDMA_MDMA_C9ESR_ASE          (0x1UL << 10) 
#define MDMA_MDMA_C9ESR_ASE_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define MDMA_MDMA_C9ESR_BSE          (0x1UL << 11) 
#define MDMA_MDMA_C9ESR_BSE_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define MDMA_MDMA_C9CR_EN          (0x1UL << 0) 
#define MDMA_MDMA_C9CR_EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MDMA_MDMA_C9CR_TEIE          (0x1UL << 1) 
#define MDMA_MDMA_C9CR_TEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define MDMA_MDMA_C9CR_CTCIE          (0x1UL << 2) 
#define MDMA_MDMA_C9CR_CTCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define MDMA_MDMA_C9CR_BRTIE          (0x1UL << 3) 
#define MDMA_MDMA_C9CR_BRTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define MDMA_MDMA_C9CR_BTIE          (0x1UL << 4) 
#define MDMA_MDMA_C9CR_BTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define MDMA_MDMA_C9CR_TCIE          (0x1UL << 5) 
#define MDMA_MDMA_C9CR_TCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define MDMA_MDMA_C9CR_PL          (0x3UL << 6) 
#define MDMA_MDMA_C9CR_PL_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define MDMA_MDMA_C9CR_BEX          (0x1UL << 12) 
#define MDMA_MDMA_C9CR_BEX_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define MDMA_MDMA_C9CR_HEX          (0x1UL << 13) 
#define MDMA_MDMA_C9CR_HEX_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define MDMA_MDMA_C9CR_WEX          (0x1UL << 14) 
#define MDMA_MDMA_C9CR_WEX_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define MDMA_MDMA_C9CR_SWRQ          (0x1UL << 16) 
#define MDMA_MDMA_C9CR_SWRQ_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define MDMA_MDMA_C9TCR_SINC          (0x3UL << 0) 
#define MDMA_MDMA_C9TCR_SINC_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define MDMA_MDMA_C9TCR_DINC          (0x3UL << 2) 
#define MDMA_MDMA_C9TCR_DINC_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define MDMA_MDMA_C9TCR_SSIZE          (0x3UL << 4) 
#define MDMA_MDMA_C9TCR_SSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 4)
#define MDMA_MDMA_C9TCR_DSIZE          (0x3UL << 6) 
#define MDMA_MDMA_C9TCR_DSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define MDMA_MDMA_C9TCR_SINCOS          (0x3UL << 8) 
#define MDMA_MDMA_C9TCR_SINCOS_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define MDMA_MDMA_C9TCR_DINCOS          (0x3UL << 10) 
#define MDMA_MDMA_C9TCR_DINCOS_VAL(X) (((uint32_t)(X) & 0x3UL) << 10)
#define MDMA_MDMA_C9TCR_SBURST          (0x7UL << 12) 
#define MDMA_MDMA_C9TCR_SBURST_VAL(X) (((uint32_t)(X) & 0x7UL) << 12)
#define MDMA_MDMA_C9TCR_DBURST          (0x7UL << 15) 
#define MDMA_MDMA_C9TCR_DBURST_VAL(X) (((uint32_t)(X) & 0x7UL) << 15)
#define MDMA_MDMA_C9TCR_TLEN          (0x7FUL << 18) 
#define MDMA_MDMA_C9TCR_TLEN_VAL(X) (((uint32_t)(X) & 0x7FUL) << 18)
#define MDMA_MDMA_C9TCR_PKE          (0x1UL << 25) 
#define MDMA_MDMA_C9TCR_PKE_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define MDMA_MDMA_C9TCR_PAM          (0x3UL << 26) 
#define MDMA_MDMA_C9TCR_PAM_VAL(X) (((uint32_t)(X) & 0x3UL) << 26)
#define MDMA_MDMA_C9TCR_TRGM          (0x3UL << 28) 
#define MDMA_MDMA_C9TCR_TRGM_VAL(X) (((uint32_t)(X) & 0x3UL) << 28)
#define MDMA_MDMA_C9TCR_SWRM          (0x1UL << 30) 
#define MDMA_MDMA_C9TCR_SWRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define MDMA_MDMA_C9TCR_BWM          (0x1UL << 31) 
#define MDMA_MDMA_C9TCR_BWM_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define MDMA_MDMA_C9BNDTR_BNDT          (0x1FFFFUL << 0) 
#define MDMA_MDMA_C9BNDTR_BNDT_VAL(X) (((uint32_t)(X) & 0x1FFFFUL) << 0)
#define MDMA_MDMA_C9BNDTR_BRSUM          (0x1UL << 18) 
#define MDMA_MDMA_C9BNDTR_BRSUM_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define MDMA_MDMA_C9BNDTR_BRDUM          (0x1UL << 19) 
#define MDMA_MDMA_C9BNDTR_BRDUM_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define MDMA_MDMA_C9BNDTR_BRC          (0xFFFUL << 20) 
#define MDMA_MDMA_C9BNDTR_BRC_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 20)
#define MDMA_MDMA_C9SAR_SAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C9SAR_SAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C9DAR_DAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C9DAR_DAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C9BRUR_SUV          (0xFFFFUL << 0) 
#define MDMA_MDMA_C9BRUR_SUV_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDMA_MDMA_C9BRUR_DUV          (0xFFFFUL << 16) 
#define MDMA_MDMA_C9BRUR_DUV_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define MDMA_MDMA_C9LAR_LAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C9LAR_LAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C9TBR_TSEL          (0x3FUL << 0) 
#define MDMA_MDMA_C9TBR_TSEL_VAL(X) (((uint32_t)(X) & 0x3FUL) << 0)
#define MDMA_MDMA_C9TBR_SBUS          (0x1UL << 16) 
#define MDMA_MDMA_C9TBR_SBUS_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define MDMA_MDMA_C9TBR_DBUS          (0x1UL << 17) 
#define MDMA_MDMA_C9TBR_DBUS_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define MDMA_MDMA_C9MAR_MAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C9MAR_MAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C9MDR_MDR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C9MDR_MDR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C10ISR_TEIF10          (0x1UL << 0) 
#define MDMA_MDMA_C10ISR_TEIF10_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MDMA_MDMA_C10ISR_CTCIF10          (0x1UL << 1) 
#define MDMA_MDMA_C10ISR_CTCIF10_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define MDMA_MDMA_C10ISR_BRTIF10          (0x1UL << 2) 
#define MDMA_MDMA_C10ISR_BRTIF10_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define MDMA_MDMA_C10ISR_BTIF10          (0x1UL << 3) 
#define MDMA_MDMA_C10ISR_BTIF10_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define MDMA_MDMA_C10ISR_TCIF10          (0x1UL << 4) 
#define MDMA_MDMA_C10ISR_TCIF10_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define MDMA_MDMA_C10ISR_CRQA10          (0x1UL << 16) 
#define MDMA_MDMA_C10ISR_CRQA10_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define MDMA_MDMA_C10IFCR_CTEIF10          (0x1UL << 0) 
#define MDMA_MDMA_C10IFCR_CTEIF10_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MDMA_MDMA_C10IFCR_CCTCIF10          (0x1UL << 1) 
#define MDMA_MDMA_C10IFCR_CCTCIF10_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define MDMA_MDMA_C10IFCR_CBRTIF10          (0x1UL << 2) 
#define MDMA_MDMA_C10IFCR_CBRTIF10_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define MDMA_MDMA_C10IFCR_CBTIF10          (0x1UL << 3) 
#define MDMA_MDMA_C10IFCR_CBTIF10_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define MDMA_MDMA_C10IFCR_CLTCIF10          (0x1UL << 4) 
#define MDMA_MDMA_C10IFCR_CLTCIF10_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define MDMA_MDMA_C10ESR_TEA          (0x7FUL << 0) 
#define MDMA_MDMA_C10ESR_TEA_VAL(X) (((uint32_t)(X) & 0x7FUL) << 0)
#define MDMA_MDMA_C10ESR_TED          (0x1UL << 7) 
