via/viaems/src/platforms/stm32h743/device.h
#define MDMA_MDMA_C10ESR_TED_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define MDMA_MDMA_C10ESR_TELD          (0x1UL << 8) 
#define MDMA_MDMA_C10ESR_TELD_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define MDMA_MDMA_C10ESR_TEMD          (0x1UL << 9) 
#define MDMA_MDMA_C10ESR_TEMD_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define MDMA_MDMA_C10ESR_ASE          (0x1UL << 10) 
#define MDMA_MDMA_C10ESR_ASE_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define MDMA_MDMA_C10ESR_BSE          (0x1UL << 11) 
#define MDMA_MDMA_C10ESR_BSE_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define MDMA_MDMA_C10CR_EN          (0x1UL << 0) 
#define MDMA_MDMA_C10CR_EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MDMA_MDMA_C10CR_TEIE          (0x1UL << 1) 
#define MDMA_MDMA_C10CR_TEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define MDMA_MDMA_C10CR_CTCIE          (0x1UL << 2) 
#define MDMA_MDMA_C10CR_CTCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define MDMA_MDMA_C10CR_BRTIE          (0x1UL << 3) 
#define MDMA_MDMA_C10CR_BRTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define MDMA_MDMA_C10CR_BTIE          (0x1UL << 4) 
#define MDMA_MDMA_C10CR_BTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define MDMA_MDMA_C10CR_TCIE          (0x1UL << 5) 
#define MDMA_MDMA_C10CR_TCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define MDMA_MDMA_C10CR_PL          (0x3UL << 6) 
#define MDMA_MDMA_C10CR_PL_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define MDMA_MDMA_C10CR_BEX          (0x1UL << 12) 
#define MDMA_MDMA_C10CR_BEX_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define MDMA_MDMA_C10CR_HEX          (0x1UL << 13) 
#define MDMA_MDMA_C10CR_HEX_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define MDMA_MDMA_C10CR_WEX          (0x1UL << 14) 
#define MDMA_MDMA_C10CR_WEX_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define MDMA_MDMA_C10CR_SWRQ          (0x1UL << 16) 
#define MDMA_MDMA_C10CR_SWRQ_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define MDMA_MDMA_C10TCR_SINC          (0x3UL << 0) 
#define MDMA_MDMA_C10TCR_SINC_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define MDMA_MDMA_C10TCR_DINC          (0x3UL << 2) 
#define MDMA_MDMA_C10TCR_DINC_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define MDMA_MDMA_C10TCR_SSIZE          (0x3UL << 4) 
#define MDMA_MDMA_C10TCR_SSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 4)
#define MDMA_MDMA_C10TCR_DSIZE          (0x3UL << 6) 
#define MDMA_MDMA_C10TCR_DSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define MDMA_MDMA_C10TCR_SINCOS          (0x3UL << 8) 
#define MDMA_MDMA_C10TCR_SINCOS_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define MDMA_MDMA_C10TCR_DINCOS          (0x3UL << 10) 
#define MDMA_MDMA_C10TCR_DINCOS_VAL(X) (((uint32_t)(X) & 0x3UL) << 10)
#define MDMA_MDMA_C10TCR_SBURST          (0x7UL << 12) 
#define MDMA_MDMA_C10TCR_SBURST_VAL(X) (((uint32_t)(X) & 0x7UL) << 12)
#define MDMA_MDMA_C10TCR_DBURST          (0x7UL << 15) 
#define MDMA_MDMA_C10TCR_DBURST_VAL(X) (((uint32_t)(X) & 0x7UL) << 15)
#define MDMA_MDMA_C10TCR_TLEN          (0x7FUL << 18) 
#define MDMA_MDMA_C10TCR_TLEN_VAL(X) (((uint32_t)(X) & 0x7FUL) << 18)
#define MDMA_MDMA_C10TCR_PKE          (0x1UL << 25) 
#define MDMA_MDMA_C10TCR_PKE_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define MDMA_MDMA_C10TCR_PAM          (0x3UL << 26) 
#define MDMA_MDMA_C10TCR_PAM_VAL(X) (((uint32_t)(X) & 0x3UL) << 26)
#define MDMA_MDMA_C10TCR_TRGM          (0x3UL << 28) 
#define MDMA_MDMA_C10TCR_TRGM_VAL(X) (((uint32_t)(X) & 0x3UL) << 28)
#define MDMA_MDMA_C10TCR_SWRM          (0x1UL << 30) 
#define MDMA_MDMA_C10TCR_SWRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define MDMA_MDMA_C10TCR_BWM          (0x1UL << 31) 
#define MDMA_MDMA_C10TCR_BWM_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define MDMA_MDMA_C10BNDTR_BNDT          (0x1FFFFUL << 0) 
#define MDMA_MDMA_C10BNDTR_BNDT_VAL(X) (((uint32_t)(X) & 0x1FFFFUL) << 0)
#define MDMA_MDMA_C10BNDTR_BRSUM          (0x1UL << 18) 
#define MDMA_MDMA_C10BNDTR_BRSUM_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define MDMA_MDMA_C10BNDTR_BRDUM          (0x1UL << 19) 
#define MDMA_MDMA_C10BNDTR_BRDUM_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define MDMA_MDMA_C10BNDTR_BRC          (0xFFFUL << 20) 
#define MDMA_MDMA_C10BNDTR_BRC_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 20)
#define MDMA_MDMA_C10SAR_SAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C10SAR_SAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C10DAR_DAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C10DAR_DAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C10BRUR_SUV          (0xFFFFUL << 0) 
#define MDMA_MDMA_C10BRUR_SUV_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDMA_MDMA_C10BRUR_DUV          (0xFFFFUL << 16) 
#define MDMA_MDMA_C10BRUR_DUV_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define MDMA_MDMA_C10LAR_LAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C10LAR_LAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C10TBR_TSEL          (0x3FUL << 0) 
#define MDMA_MDMA_C10TBR_TSEL_VAL(X) (((uint32_t)(X) & 0x3FUL) << 0)
#define MDMA_MDMA_C10TBR_SBUS          (0x1UL << 16) 
#define MDMA_MDMA_C10TBR_SBUS_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define MDMA_MDMA_C10TBR_DBUS          (0x1UL << 17) 
#define MDMA_MDMA_C10TBR_DBUS_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define MDMA_MDMA_C10MAR_MAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C10MAR_MAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C10MDR_MDR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C10MDR_MDR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C11ISR_TEIF11          (0x1UL << 0) 
#define MDMA_MDMA_C11ISR_TEIF11_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MDMA_MDMA_C11ISR_CTCIF11          (0x1UL << 1) 
#define MDMA_MDMA_C11ISR_CTCIF11_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define MDMA_MDMA_C11ISR_BRTIF11          (0x1UL << 2) 
#define MDMA_MDMA_C11ISR_BRTIF11_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define MDMA_MDMA_C11ISR_BTIF11          (0x1UL << 3) 
#define MDMA_MDMA_C11ISR_BTIF11_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define MDMA_MDMA_C11ISR_TCIF11          (0x1UL << 4) 
#define MDMA_MDMA_C11ISR_TCIF11_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define MDMA_MDMA_C11ISR_CRQA11          (0x1UL << 16) 
#define MDMA_MDMA_C11ISR_CRQA11_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define MDMA_MDMA_C11IFCR_CTEIF11          (0x1UL << 0) 
#define MDMA_MDMA_C11IFCR_CTEIF11_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MDMA_MDMA_C11IFCR_CCTCIF11          (0x1UL << 1) 
#define MDMA_MDMA_C11IFCR_CCTCIF11_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define MDMA_MDMA_C11IFCR_CBRTIF11          (0x1UL << 2) 
#define MDMA_MDMA_C11IFCR_CBRTIF11_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define MDMA_MDMA_C11IFCR_CBTIF11          (0x1UL << 3) 
#define MDMA_MDMA_C11IFCR_CBTIF11_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define MDMA_MDMA_C11IFCR_CLTCIF11          (0x1UL << 4) 
#define MDMA_MDMA_C11IFCR_CLTCIF11_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define MDMA_MDMA_C11ESR_TEA          (0x7FUL << 0) 
#define MDMA_MDMA_C11ESR_TEA_VAL(X) (((uint32_t)(X) & 0x7FUL) << 0)
#define MDMA_MDMA_C11ESR_TED          (0x1UL << 7) 
#define MDMA_MDMA_C11ESR_TED_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define MDMA_MDMA_C11ESR_TELD          (0x1UL << 8) 
#define MDMA_MDMA_C11ESR_TELD_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define MDMA_MDMA_C11ESR_TEMD          (0x1UL << 9) 
#define MDMA_MDMA_C11ESR_TEMD_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define MDMA_MDMA_C11ESR_ASE          (0x1UL << 10) 
#define MDMA_MDMA_C11ESR_ASE_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define MDMA_MDMA_C11ESR_BSE          (0x1UL << 11) 
#define MDMA_MDMA_C11ESR_BSE_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define MDMA_MDMA_C11CR_EN          (0x1UL << 0) 
#define MDMA_MDMA_C11CR_EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MDMA_MDMA_C11CR_TEIE          (0x1UL << 1) 
#define MDMA_MDMA_C11CR_TEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define MDMA_MDMA_C11CR_CTCIE          (0x1UL << 2) 
#define MDMA_MDMA_C11CR_CTCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define MDMA_MDMA_C11CR_BRTIE          (0x1UL << 3) 
#define MDMA_MDMA_C11CR_BRTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define MDMA_MDMA_C11CR_BTIE          (0x1UL << 4) 
#define MDMA_MDMA_C11CR_BTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define MDMA_MDMA_C11CR_TCIE          (0x1UL << 5) 
#define MDMA_MDMA_C11CR_TCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define MDMA_MDMA_C11CR_PL          (0x3UL << 6) 
#define MDMA_MDMA_C11CR_PL_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define MDMA_MDMA_C11CR_BEX          (0x1UL << 12) 
#define MDMA_MDMA_C11CR_BEX_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define MDMA_MDMA_C11CR_HEX          (0x1UL << 13) 
#define MDMA_MDMA_C11CR_HEX_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define MDMA_MDMA_C11CR_WEX          (0x1UL << 14) 
#define MDMA_MDMA_C11CR_WEX_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define MDMA_MDMA_C11CR_SWRQ          (0x1UL << 16) 
#define MDMA_MDMA_C11CR_SWRQ_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define MDMA_MDMA_C11TCR_SINC          (0x3UL << 0) 
#define MDMA_MDMA_C11TCR_SINC_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define MDMA_MDMA_C11TCR_DINC          (0x3UL << 2) 
#define MDMA_MDMA_C11TCR_DINC_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define MDMA_MDMA_C11TCR_SSIZE          (0x3UL << 4) 
#define MDMA_MDMA_C11TCR_SSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 4)
#define MDMA_MDMA_C11TCR_DSIZE          (0x3UL << 6) 
#define MDMA_MDMA_C11TCR_DSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define MDMA_MDMA_C11TCR_SINCOS          (0x3UL << 8) 
#define MDMA_MDMA_C11TCR_SINCOS_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define MDMA_MDMA_C11TCR_DINCOS          (0x3UL << 10) 
#define MDMA_MDMA_C11TCR_DINCOS_VAL(X) (((uint32_t)(X) & 0x3UL) << 10)
#define MDMA_MDMA_C11TCR_SBURST          (0x7UL << 12) 
#define MDMA_MDMA_C11TCR_SBURST_VAL(X) (((uint32_t)(X) & 0x7UL) << 12)
#define MDMA_MDMA_C11TCR_DBURST          (0x7UL << 15) 
#define MDMA_MDMA_C11TCR_DBURST_VAL(X) (((uint32_t)(X) & 0x7UL) << 15)
#define MDMA_MDMA_C11TCR_TLEN          (0x7FUL << 18) 
#define MDMA_MDMA_C11TCR_TLEN_VAL(X) (((uint32_t)(X) & 0x7FUL) << 18)
#define MDMA_MDMA_C11TCR_PKE          (0x1UL << 25) 
#define MDMA_MDMA_C11TCR_PKE_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define MDMA_MDMA_C11TCR_PAM          (0x3UL << 26) 
#define MDMA_MDMA_C11TCR_PAM_VAL(X) (((uint32_t)(X) & 0x3UL) << 26)
#define MDMA_MDMA_C11TCR_TRGM          (0x3UL << 28) 
#define MDMA_MDMA_C11TCR_TRGM_VAL(X) (((uint32_t)(X) & 0x3UL) << 28)
#define MDMA_MDMA_C11TCR_SWRM          (0x1UL << 30) 
#define MDMA_MDMA_C11TCR_SWRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define MDMA_MDMA_C11TCR_BWM          (0x1UL << 31) 
#define MDMA_MDMA_C11TCR_BWM_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define MDMA_MDMA_C11BNDTR_BNDT          (0x1FFFFUL << 0) 
#define MDMA_MDMA_C11BNDTR_BNDT_VAL(X) (((uint32_t)(X) & 0x1FFFFUL) << 0)
#define MDMA_MDMA_C11BNDTR_BRSUM          (0x1UL << 18) 
#define MDMA_MDMA_C11BNDTR_BRSUM_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define MDMA_MDMA_C11BNDTR_BRDUM          (0x1UL << 19) 
#define MDMA_MDMA_C11BNDTR_BRDUM_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define MDMA_MDMA_C11BNDTR_BRC          (0xFFFUL << 20) 
#define MDMA_MDMA_C11BNDTR_BRC_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 20)
#define MDMA_MDMA_C11SAR_SAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C11SAR_SAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C11DAR_DAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C11DAR_DAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C11BRUR_SUV          (0xFFFFUL << 0) 
#define MDMA_MDMA_C11BRUR_SUV_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDMA_MDMA_C11BRUR_DUV          (0xFFFFUL << 16) 
#define MDMA_MDMA_C11BRUR_DUV_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define MDMA_MDMA_C11LAR_LAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C11LAR_LAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C11TBR_TSEL          (0x3FUL << 0) 
#define MDMA_MDMA_C11TBR_TSEL_VAL(X) (((uint32_t)(X) & 0x3FUL) << 0)
#define MDMA_MDMA_C11TBR_SBUS          (0x1UL << 16) 
#define MDMA_MDMA_C11TBR_SBUS_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define MDMA_MDMA_C11TBR_DBUS          (0x1UL << 17) 
#define MDMA_MDMA_C11TBR_DBUS_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define MDMA_MDMA_C11MAR_MAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C11MAR_MAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C11MDR_MDR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C11MDR_MDR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C12ISR_TEIF12          (0x1UL << 0) 
#define MDMA_MDMA_C12ISR_TEIF12_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MDMA_MDMA_C12ISR_CTCIF12          (0x1UL << 1) 
#define MDMA_MDMA_C12ISR_CTCIF12_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define MDMA_MDMA_C12ISR_BRTIF12          (0x1UL << 2) 
#define MDMA_MDMA_C12ISR_BRTIF12_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define MDMA_MDMA_C12ISR_BTIF12          (0x1UL << 3) 
#define MDMA_MDMA_C12ISR_BTIF12_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define MDMA_MDMA_C12ISR_TCIF12          (0x1UL << 4) 
#define MDMA_MDMA_C12ISR_TCIF12_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define MDMA_MDMA_C12ISR_CRQA12          (0x1UL << 16) 
#define MDMA_MDMA_C12ISR_CRQA12_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define MDMA_MDMA_C12IFCR_CTEIF12          (0x1UL << 0) 
#define MDMA_MDMA_C12IFCR_CTEIF12_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MDMA_MDMA_C12IFCR_CCTCIF12          (0x1UL << 1) 
#define MDMA_MDMA_C12IFCR_CCTCIF12_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define MDMA_MDMA_C12IFCR_CBRTIF12          (0x1UL << 2) 
#define MDMA_MDMA_C12IFCR_CBRTIF12_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define MDMA_MDMA_C12IFCR_CBTIF12          (0x1UL << 3) 
#define MDMA_MDMA_C12IFCR_CBTIF12_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define MDMA_MDMA_C12IFCR_CLTCIF12          (0x1UL << 4) 
#define MDMA_MDMA_C12IFCR_CLTCIF12_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define MDMA_MDMA_C12ESR_TEA          (0x7FUL << 0) 
#define MDMA_MDMA_C12ESR_TEA_VAL(X) (((uint32_t)(X) & 0x7FUL) << 0)
#define MDMA_MDMA_C12ESR_TED          (0x1UL << 7) 
#define MDMA_MDMA_C12ESR_TED_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define MDMA_MDMA_C12ESR_TELD          (0x1UL << 8) 
#define MDMA_MDMA_C12ESR_TELD_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define MDMA_MDMA_C12ESR_TEMD          (0x1UL << 9) 
#define MDMA_MDMA_C12ESR_TEMD_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define MDMA_MDMA_C12ESR_ASE          (0x1UL << 10) 
#define MDMA_MDMA_C12ESR_ASE_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define MDMA_MDMA_C12ESR_BSE          (0x1UL << 11) 
#define MDMA_MDMA_C12ESR_BSE_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define MDMA_MDMA_C12CR_EN          (0x1UL << 0) 
#define MDMA_MDMA_C12CR_EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MDMA_MDMA_C12CR_TEIE          (0x1UL << 1) 
#define MDMA_MDMA_C12CR_TEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define MDMA_MDMA_C12CR_CTCIE          (0x1UL << 2) 
#define MDMA_MDMA_C12CR_CTCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define MDMA_MDMA_C12CR_BRTIE          (0x1UL << 3) 
#define MDMA_MDMA_C12CR_BRTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define MDMA_MDMA_C12CR_BTIE          (0x1UL << 4) 
#define MDMA_MDMA_C12CR_BTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define MDMA_MDMA_C12CR_TCIE          (0x1UL << 5) 
#define MDMA_MDMA_C12CR_TCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define MDMA_MDMA_C12CR_PL          (0x3UL << 6) 
#define MDMA_MDMA_C12CR_PL_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define MDMA_MDMA_C12CR_BEX          (0x1UL << 12) 
#define MDMA_MDMA_C12CR_BEX_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define MDMA_MDMA_C12CR_HEX          (0x1UL << 13) 
#define MDMA_MDMA_C12CR_HEX_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define MDMA_MDMA_C12CR_WEX          (0x1UL << 14) 
#define MDMA_MDMA_C12CR_WEX_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define MDMA_MDMA_C12CR_SWRQ          (0x1UL << 16) 
#define MDMA_MDMA_C12CR_SWRQ_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define MDMA_MDMA_C12TCR_SINC          (0x3UL << 0) 
#define MDMA_MDMA_C12TCR_SINC_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define MDMA_MDMA_C12TCR_DINC          (0x3UL << 2) 
#define MDMA_MDMA_C12TCR_DINC_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define MDMA_MDMA_C12TCR_SSIZE          (0x3UL << 4) 
#define MDMA_MDMA_C12TCR_SSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 4)
#define MDMA_MDMA_C12TCR_DSIZE          (0x3UL << 6) 
#define MDMA_MDMA_C12TCR_DSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define MDMA_MDMA_C12TCR_SINCOS          (0x3UL << 8) 
#define MDMA_MDMA_C12TCR_SINCOS_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define MDMA_MDMA_C12TCR_DINCOS          (0x3UL << 10) 
#define MDMA_MDMA_C12TCR_DINCOS_VAL(X) (((uint32_t)(X) & 0x3UL) << 10)
#define MDMA_MDMA_C12TCR_SBURST          (0x7UL << 12) 
#define MDMA_MDMA_C12TCR_SBURST_VAL(X) (((uint32_t)(X) & 0x7UL) << 12)
#define MDMA_MDMA_C12TCR_DBURST          (0x7UL << 15) 
#define MDMA_MDMA_C12TCR_DBURST_VAL(X) (((uint32_t)(X) & 0x7UL) << 15)
#define MDMA_MDMA_C12TCR_TLEN          (0x7FUL << 18) 
#define MDMA_MDMA_C12TCR_TLEN_VAL(X) (((uint32_t)(X) & 0x7FUL) << 18)
#define MDMA_MDMA_C12TCR_PKE          (0x1UL << 25) 
#define MDMA_MDMA_C12TCR_PKE_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define MDMA_MDMA_C12TCR_PAM          (0x3UL << 26) 
#define MDMA_MDMA_C12TCR_PAM_VAL(X) (((uint32_t)(X) & 0x3UL) << 26)
#define MDMA_MDMA_C12TCR_TRGM          (0x3UL << 28) 
#define MDMA_MDMA_C12TCR_TRGM_VAL(X) (((uint32_t)(X) & 0x3UL) << 28)
#define MDMA_MDMA_C12TCR_SWRM          (0x1UL << 30) 
#define MDMA_MDMA_C12TCR_SWRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define MDMA_MDMA_C12TCR_BWM          (0x1UL << 31) 
#define MDMA_MDMA_C12TCR_BWM_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define MDMA_MDMA_C12BNDTR_BNDT          (0x1FFFFUL << 0) 
#define MDMA_MDMA_C12BNDTR_BNDT_VAL(X) (((uint32_t)(X) & 0x1FFFFUL) << 0)
#define MDMA_MDMA_C12BNDTR_BRSUM          (0x1UL << 18) 
#define MDMA_MDMA_C12BNDTR_BRSUM_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define MDMA_MDMA_C12BNDTR_BRDUM          (0x1UL << 19) 
#define MDMA_MDMA_C12BNDTR_BRDUM_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define MDMA_MDMA_C12BNDTR_BRC          (0xFFFUL << 20) 
#define MDMA_MDMA_C12BNDTR_BRC_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 20)
#define MDMA_MDMA_C12SAR_SAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C12SAR_SAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C12DAR_DAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C12DAR_DAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C12BRUR_SUV          (0xFFFFUL << 0) 
#define MDMA_MDMA_C12BRUR_SUV_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDMA_MDMA_C12BRUR_DUV          (0xFFFFUL << 16) 
#define MDMA_MDMA_C12BRUR_DUV_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define MDMA_MDMA_C12LAR_LAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C12LAR_LAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C12TBR_TSEL          (0x3FUL << 0) 
#define MDMA_MDMA_C12TBR_TSEL_VAL(X) (((uint32_t)(X) & 0x3FUL) << 0)
#define MDMA_MDMA_C12TBR_SBUS          (0x1UL << 16) 
#define MDMA_MDMA_C12TBR_SBUS_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define MDMA_MDMA_C12TBR_DBUS          (0x1UL << 17) 
#define MDMA_MDMA_C12TBR_DBUS_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define MDMA_MDMA_C12MAR_MAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C12MAR_MAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C12MDR_MDR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C12MDR_MDR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C13ISR_TEIF13          (0x1UL << 0) 
#define MDMA_MDMA_C13ISR_TEIF13_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MDMA_MDMA_C13ISR_CTCIF13          (0x1UL << 1) 
#define MDMA_MDMA_C13ISR_CTCIF13_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define MDMA_MDMA_C13ISR_BRTIF13          (0x1UL << 2) 
#define MDMA_MDMA_C13ISR_BRTIF13_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define MDMA_MDMA_C13ISR_BTIF13          (0x1UL << 3) 
#define MDMA_MDMA_C13ISR_BTIF13_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define MDMA_MDMA_C13ISR_TCIF13          (0x1UL << 4) 
#define MDMA_MDMA_C13ISR_TCIF13_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define MDMA_MDMA_C13ISR_CRQA13          (0x1UL << 16) 
#define MDMA_MDMA_C13ISR_CRQA13_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define MDMA_MDMA_C13IFCR_CTEIF13          (0x1UL << 0) 
#define MDMA_MDMA_C13IFCR_CTEIF13_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MDMA_MDMA_C13IFCR_CCTCIF13          (0x1UL << 1) 
#define MDMA_MDMA_C13IFCR_CCTCIF13_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define MDMA_MDMA_C13IFCR_CBRTIF13          (0x1UL << 2) 
#define MDMA_MDMA_C13IFCR_CBRTIF13_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define MDMA_MDMA_C13IFCR_CBTIF13          (0x1UL << 3) 
#define MDMA_MDMA_C13IFCR_CBTIF13_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define MDMA_MDMA_C13IFCR_CLTCIF13          (0x1UL << 4) 
#define MDMA_MDMA_C13IFCR_CLTCIF13_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define MDMA_MDMA_C13ESR_TEA          (0x7FUL << 0) 
#define MDMA_MDMA_C13ESR_TEA_VAL(X) (((uint32_t)(X) & 0x7FUL) << 0)
#define MDMA_MDMA_C13ESR_TED          (0x1UL << 7) 
#define MDMA_MDMA_C13ESR_TED_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define MDMA_MDMA_C13ESR_TELD          (0x1UL << 8) 
#define MDMA_MDMA_C13ESR_TELD_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define MDMA_MDMA_C13ESR_TEMD          (0x1UL << 9) 
#define MDMA_MDMA_C13ESR_TEMD_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define MDMA_MDMA_C13ESR_ASE          (0x1UL << 10) 
#define MDMA_MDMA_C13ESR_ASE_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define MDMA_MDMA_C13ESR_BSE          (0x1UL << 11) 
#define MDMA_MDMA_C13ESR_BSE_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define MDMA_MDMA_C13CR_EN          (0x1UL << 0) 
#define MDMA_MDMA_C13CR_EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MDMA_MDMA_C13CR_TEIE          (0x1UL << 1) 
#define MDMA_MDMA_C13CR_TEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define MDMA_MDMA_C13CR_CTCIE          (0x1UL << 2) 
#define MDMA_MDMA_C13CR_CTCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define MDMA_MDMA_C13CR_BRTIE          (0x1UL << 3) 
#define MDMA_MDMA_C13CR_BRTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define MDMA_MDMA_C13CR_BTIE          (0x1UL << 4) 
#define MDMA_MDMA_C13CR_BTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define MDMA_MDMA_C13CR_TCIE          (0x1UL << 5) 
#define MDMA_MDMA_C13CR_TCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define MDMA_MDMA_C13CR_PL          (0x3UL << 6) 
#define MDMA_MDMA_C13CR_PL_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define MDMA_MDMA_C13CR_BEX          (0x1UL << 12) 
#define MDMA_MDMA_C13CR_BEX_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define MDMA_MDMA_C13CR_HEX          (0x1UL << 13) 
#define MDMA_MDMA_C13CR_HEX_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define MDMA_MDMA_C13CR_WEX          (0x1UL << 14) 
#define MDMA_MDMA_C13CR_WEX_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define MDMA_MDMA_C13CR_SWRQ          (0x1UL << 16) 
#define MDMA_MDMA_C13CR_SWRQ_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define MDMA_MDMA_C13TCR_SINC          (0x3UL << 0) 
#define MDMA_MDMA_C13TCR_SINC_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define MDMA_MDMA_C13TCR_DINC          (0x3UL << 2) 
#define MDMA_MDMA_C13TCR_DINC_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define MDMA_MDMA_C13TCR_SSIZE          (0x3UL << 4) 
#define MDMA_MDMA_C13TCR_SSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 4)
#define MDMA_MDMA_C13TCR_DSIZE          (0x3UL << 6) 
#define MDMA_MDMA_C13TCR_DSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define MDMA_MDMA_C13TCR_SINCOS          (0x3UL << 8) 
#define MDMA_MDMA_C13TCR_SINCOS_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define MDMA_MDMA_C13TCR_DINCOS          (0x3UL << 10) 
#define MDMA_MDMA_C13TCR_DINCOS_VAL(X) (((uint32_t)(X) & 0x3UL) << 10)
#define MDMA_MDMA_C13TCR_SBURST          (0x7UL << 12) 
#define MDMA_MDMA_C13TCR_SBURST_VAL(X) (((uint32_t)(X) & 0x7UL) << 12)
#define MDMA_MDMA_C13TCR_DBURST          (0x7UL << 15) 
#define MDMA_MDMA_C13TCR_DBURST_VAL(X) (((uint32_t)(X) & 0x7UL) << 15)
#define MDMA_MDMA_C13TCR_TLEN          (0x7FUL << 18) 
#define MDMA_MDMA_C13TCR_TLEN_VAL(X) (((uint32_t)(X) & 0x7FUL) << 18)
#define MDMA_MDMA_C13TCR_PKE          (0x1UL << 25) 
