via/viaems/src/platforms/stm32h743/device.h
#define MDMA_MDMA_C13TCR_PKE_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define MDMA_MDMA_C13TCR_PAM          (0x3UL << 26) 
#define MDMA_MDMA_C13TCR_PAM_VAL(X) (((uint32_t)(X) & 0x3UL) << 26)
#define MDMA_MDMA_C13TCR_TRGM          (0x3UL << 28) 
#define MDMA_MDMA_C13TCR_TRGM_VAL(X) (((uint32_t)(X) & 0x3UL) << 28)
#define MDMA_MDMA_C13TCR_SWRM          (0x1UL << 30) 
#define MDMA_MDMA_C13TCR_SWRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define MDMA_MDMA_C13TCR_BWM          (0x1UL << 31) 
#define MDMA_MDMA_C13TCR_BWM_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define MDMA_MDMA_C13BNDTR_BNDT          (0x1FFFFUL << 0) 
#define MDMA_MDMA_C13BNDTR_BNDT_VAL(X) (((uint32_t)(X) & 0x1FFFFUL) << 0)
#define MDMA_MDMA_C13BNDTR_BRSUM          (0x1UL << 18) 
#define MDMA_MDMA_C13BNDTR_BRSUM_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define MDMA_MDMA_C13BNDTR_BRDUM          (0x1UL << 19) 
#define MDMA_MDMA_C13BNDTR_BRDUM_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define MDMA_MDMA_C13BNDTR_BRC          (0xFFFUL << 20) 
#define MDMA_MDMA_C13BNDTR_BRC_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 20)
#define MDMA_MDMA_C13SAR_SAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C13SAR_SAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C13DAR_DAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C13DAR_DAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C13BRUR_SUV          (0xFFFFUL << 0) 
#define MDMA_MDMA_C13BRUR_SUV_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDMA_MDMA_C13BRUR_DUV          (0xFFFFUL << 16) 
#define MDMA_MDMA_C13BRUR_DUV_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define MDMA_MDMA_C13LAR_LAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C13LAR_LAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C13TBR_TSEL          (0x3FUL << 0) 
#define MDMA_MDMA_C13TBR_TSEL_VAL(X) (((uint32_t)(X) & 0x3FUL) << 0)
#define MDMA_MDMA_C13TBR_SBUS          (0x1UL << 16) 
#define MDMA_MDMA_C13TBR_SBUS_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define MDMA_MDMA_C13TBR_DBUS          (0x1UL << 17) 
#define MDMA_MDMA_C13TBR_DBUS_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define MDMA_MDMA_C13MAR_MAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C13MAR_MAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C13MDR_MDR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C13MDR_MDR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C14ISR_TEIF14          (0x1UL << 0) 
#define MDMA_MDMA_C14ISR_TEIF14_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MDMA_MDMA_C14ISR_CTCIF14          (0x1UL << 1) 
#define MDMA_MDMA_C14ISR_CTCIF14_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define MDMA_MDMA_C14ISR_BRTIF14          (0x1UL << 2) 
#define MDMA_MDMA_C14ISR_BRTIF14_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define MDMA_MDMA_C14ISR_BTIF14          (0x1UL << 3) 
#define MDMA_MDMA_C14ISR_BTIF14_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define MDMA_MDMA_C14ISR_TCIF14          (0x1UL << 4) 
#define MDMA_MDMA_C14ISR_TCIF14_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define MDMA_MDMA_C14ISR_CRQA14          (0x1UL << 16) 
#define MDMA_MDMA_C14ISR_CRQA14_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define MDMA_MDMA_C14IFCR_CTEIF14          (0x1UL << 0) 
#define MDMA_MDMA_C14IFCR_CTEIF14_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MDMA_MDMA_C14IFCR_CCTCIF14          (0x1UL << 1) 
#define MDMA_MDMA_C14IFCR_CCTCIF14_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define MDMA_MDMA_C14IFCR_CBRTIF14          (0x1UL << 2) 
#define MDMA_MDMA_C14IFCR_CBRTIF14_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define MDMA_MDMA_C14IFCR_CBTIF14          (0x1UL << 3) 
#define MDMA_MDMA_C14IFCR_CBTIF14_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define MDMA_MDMA_C14IFCR_CLTCIF14          (0x1UL << 4) 
#define MDMA_MDMA_C14IFCR_CLTCIF14_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define MDMA_MDMA_C14ESR_TEA          (0x7FUL << 0) 
#define MDMA_MDMA_C14ESR_TEA_VAL(X) (((uint32_t)(X) & 0x7FUL) << 0)
#define MDMA_MDMA_C14ESR_TED          (0x1UL << 7) 
#define MDMA_MDMA_C14ESR_TED_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define MDMA_MDMA_C14ESR_TELD          (0x1UL << 8) 
#define MDMA_MDMA_C14ESR_TELD_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define MDMA_MDMA_C14ESR_TEMD          (0x1UL << 9) 
#define MDMA_MDMA_C14ESR_TEMD_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define MDMA_MDMA_C14ESR_ASE          (0x1UL << 10) 
#define MDMA_MDMA_C14ESR_ASE_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define MDMA_MDMA_C14ESR_BSE          (0x1UL << 11) 
#define MDMA_MDMA_C14ESR_BSE_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define MDMA_MDMA_C14CR_EN          (0x1UL << 0) 
#define MDMA_MDMA_C14CR_EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MDMA_MDMA_C14CR_TEIE          (0x1UL << 1) 
#define MDMA_MDMA_C14CR_TEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define MDMA_MDMA_C14CR_CTCIE          (0x1UL << 2) 
#define MDMA_MDMA_C14CR_CTCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define MDMA_MDMA_C14CR_BRTIE          (0x1UL << 3) 
#define MDMA_MDMA_C14CR_BRTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define MDMA_MDMA_C14CR_BTIE          (0x1UL << 4) 
#define MDMA_MDMA_C14CR_BTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define MDMA_MDMA_C14CR_TCIE          (0x1UL << 5) 
#define MDMA_MDMA_C14CR_TCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define MDMA_MDMA_C14CR_PL          (0x3UL << 6) 
#define MDMA_MDMA_C14CR_PL_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define MDMA_MDMA_C14CR_BEX          (0x1UL << 12) 
#define MDMA_MDMA_C14CR_BEX_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define MDMA_MDMA_C14CR_HEX          (0x1UL << 13) 
#define MDMA_MDMA_C14CR_HEX_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define MDMA_MDMA_C14CR_WEX          (0x1UL << 14) 
#define MDMA_MDMA_C14CR_WEX_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define MDMA_MDMA_C14CR_SWRQ          (0x1UL << 16) 
#define MDMA_MDMA_C14CR_SWRQ_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define MDMA_MDMA_C14TCR_SINC          (0x3UL << 0) 
#define MDMA_MDMA_C14TCR_SINC_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define MDMA_MDMA_C14TCR_DINC          (0x3UL << 2) 
#define MDMA_MDMA_C14TCR_DINC_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define MDMA_MDMA_C14TCR_SSIZE          (0x3UL << 4) 
#define MDMA_MDMA_C14TCR_SSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 4)
#define MDMA_MDMA_C14TCR_DSIZE          (0x3UL << 6) 
#define MDMA_MDMA_C14TCR_DSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define MDMA_MDMA_C14TCR_SINCOS          (0x3UL << 8) 
#define MDMA_MDMA_C14TCR_SINCOS_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define MDMA_MDMA_C14TCR_DINCOS          (0x3UL << 10) 
#define MDMA_MDMA_C14TCR_DINCOS_VAL(X) (((uint32_t)(X) & 0x3UL) << 10)
#define MDMA_MDMA_C14TCR_SBURST          (0x7UL << 12) 
#define MDMA_MDMA_C14TCR_SBURST_VAL(X) (((uint32_t)(X) & 0x7UL) << 12)
#define MDMA_MDMA_C14TCR_DBURST          (0x7UL << 15) 
#define MDMA_MDMA_C14TCR_DBURST_VAL(X) (((uint32_t)(X) & 0x7UL) << 15)
#define MDMA_MDMA_C14TCR_TLEN          (0x7FUL << 18) 
#define MDMA_MDMA_C14TCR_TLEN_VAL(X) (((uint32_t)(X) & 0x7FUL) << 18)
#define MDMA_MDMA_C14TCR_PKE          (0x1UL << 25) 
#define MDMA_MDMA_C14TCR_PKE_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define MDMA_MDMA_C14TCR_PAM          (0x3UL << 26) 
#define MDMA_MDMA_C14TCR_PAM_VAL(X) (((uint32_t)(X) & 0x3UL) << 26)
#define MDMA_MDMA_C14TCR_TRGM          (0x3UL << 28) 
#define MDMA_MDMA_C14TCR_TRGM_VAL(X) (((uint32_t)(X) & 0x3UL) << 28)
#define MDMA_MDMA_C14TCR_SWRM          (0x1UL << 30) 
#define MDMA_MDMA_C14TCR_SWRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define MDMA_MDMA_C14TCR_BWM          (0x1UL << 31) 
#define MDMA_MDMA_C14TCR_BWM_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define MDMA_MDMA_C14BNDTR_BNDT          (0x1FFFFUL << 0) 
#define MDMA_MDMA_C14BNDTR_BNDT_VAL(X) (((uint32_t)(X) & 0x1FFFFUL) << 0)
#define MDMA_MDMA_C14BNDTR_BRSUM          (0x1UL << 18) 
#define MDMA_MDMA_C14BNDTR_BRSUM_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define MDMA_MDMA_C14BNDTR_BRDUM          (0x1UL << 19) 
#define MDMA_MDMA_C14BNDTR_BRDUM_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define MDMA_MDMA_C14BNDTR_BRC          (0xFFFUL << 20) 
#define MDMA_MDMA_C14BNDTR_BRC_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 20)
#define MDMA_MDMA_C14SAR_SAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C14SAR_SAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C14DAR_DAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C14DAR_DAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C14BRUR_SUV          (0xFFFFUL << 0) 
#define MDMA_MDMA_C14BRUR_SUV_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDMA_MDMA_C14BRUR_DUV          (0xFFFFUL << 16) 
#define MDMA_MDMA_C14BRUR_DUV_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define MDMA_MDMA_C14LAR_LAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C14LAR_LAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C14TBR_TSEL          (0x3FUL << 0) 
#define MDMA_MDMA_C14TBR_TSEL_VAL(X) (((uint32_t)(X) & 0x3FUL) << 0)
#define MDMA_MDMA_C14TBR_SBUS          (0x1UL << 16) 
#define MDMA_MDMA_C14TBR_SBUS_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define MDMA_MDMA_C14TBR_DBUS          (0x1UL << 17) 
#define MDMA_MDMA_C14TBR_DBUS_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define MDMA_MDMA_C14MAR_MAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C14MAR_MAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C14MDR_MDR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C14MDR_MDR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C15ISR_TEIF15          (0x1UL << 0) 
#define MDMA_MDMA_C15ISR_TEIF15_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MDMA_MDMA_C15ISR_CTCIF15          (0x1UL << 1) 
#define MDMA_MDMA_C15ISR_CTCIF15_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define MDMA_MDMA_C15ISR_BRTIF15          (0x1UL << 2) 
#define MDMA_MDMA_C15ISR_BRTIF15_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define MDMA_MDMA_C15ISR_BTIF15          (0x1UL << 3) 
#define MDMA_MDMA_C15ISR_BTIF15_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define MDMA_MDMA_C15ISR_TCIF15          (0x1UL << 4) 
#define MDMA_MDMA_C15ISR_TCIF15_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define MDMA_MDMA_C15ISR_CRQA15          (0x1UL << 16) 
#define MDMA_MDMA_C15ISR_CRQA15_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define MDMA_MDMA_C15IFCR_CTEIF15          (0x1UL << 0) 
#define MDMA_MDMA_C15IFCR_CTEIF15_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MDMA_MDMA_C15IFCR_CCTCIF15          (0x1UL << 1) 
#define MDMA_MDMA_C15IFCR_CCTCIF15_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define MDMA_MDMA_C15IFCR_CBRTIF15          (0x1UL << 2) 
#define MDMA_MDMA_C15IFCR_CBRTIF15_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define MDMA_MDMA_C15IFCR_CBTIF15          (0x1UL << 3) 
#define MDMA_MDMA_C15IFCR_CBTIF15_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define MDMA_MDMA_C15IFCR_CLTCIF15          (0x1UL << 4) 
#define MDMA_MDMA_C15IFCR_CLTCIF15_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define MDMA_MDMA_C15ESR_TEA          (0x7FUL << 0) 
#define MDMA_MDMA_C15ESR_TEA_VAL(X) (((uint32_t)(X) & 0x7FUL) << 0)
#define MDMA_MDMA_C15ESR_TED          (0x1UL << 7) 
#define MDMA_MDMA_C15ESR_TED_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define MDMA_MDMA_C15ESR_TELD          (0x1UL << 8) 
#define MDMA_MDMA_C15ESR_TELD_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define MDMA_MDMA_C15ESR_TEMD          (0x1UL << 9) 
#define MDMA_MDMA_C15ESR_TEMD_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define MDMA_MDMA_C15ESR_ASE          (0x1UL << 10) 
#define MDMA_MDMA_C15ESR_ASE_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define MDMA_MDMA_C15ESR_BSE          (0x1UL << 11) 
#define MDMA_MDMA_C15ESR_BSE_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define MDMA_MDMA_C15CR_EN          (0x1UL << 0) 
#define MDMA_MDMA_C15CR_EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MDMA_MDMA_C15CR_TEIE          (0x1UL << 1) 
#define MDMA_MDMA_C15CR_TEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define MDMA_MDMA_C15CR_CTCIE          (0x1UL << 2) 
#define MDMA_MDMA_C15CR_CTCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define MDMA_MDMA_C15CR_BRTIE          (0x1UL << 3) 
#define MDMA_MDMA_C15CR_BRTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define MDMA_MDMA_C15CR_BTIE          (0x1UL << 4) 
#define MDMA_MDMA_C15CR_BTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define MDMA_MDMA_C15CR_TCIE          (0x1UL << 5) 
#define MDMA_MDMA_C15CR_TCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define MDMA_MDMA_C15CR_PL          (0x3UL << 6) 
#define MDMA_MDMA_C15CR_PL_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define MDMA_MDMA_C15CR_BEX          (0x1UL << 12) 
#define MDMA_MDMA_C15CR_BEX_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define MDMA_MDMA_C15CR_HEX          (0x1UL << 13) 
#define MDMA_MDMA_C15CR_HEX_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define MDMA_MDMA_C15CR_WEX          (0x1UL << 14) 
#define MDMA_MDMA_C15CR_WEX_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define MDMA_MDMA_C15CR_SWRQ          (0x1UL << 16) 
#define MDMA_MDMA_C15CR_SWRQ_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define MDMA_MDMA_C15TCR_SINC          (0x3UL << 0) 
#define MDMA_MDMA_C15TCR_SINC_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define MDMA_MDMA_C15TCR_DINC          (0x3UL << 2) 
#define MDMA_MDMA_C15TCR_DINC_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define MDMA_MDMA_C15TCR_SSIZE          (0x3UL << 4) 
#define MDMA_MDMA_C15TCR_SSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 4)
#define MDMA_MDMA_C15TCR_DSIZE          (0x3UL << 6) 
#define MDMA_MDMA_C15TCR_DSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define MDMA_MDMA_C15TCR_SINCOS          (0x3UL << 8) 
#define MDMA_MDMA_C15TCR_SINCOS_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define MDMA_MDMA_C15TCR_DINCOS          (0x3UL << 10) 
#define MDMA_MDMA_C15TCR_DINCOS_VAL(X) (((uint32_t)(X) & 0x3UL) << 10)
#define MDMA_MDMA_C15TCR_SBURST          (0x7UL << 12) 
#define MDMA_MDMA_C15TCR_SBURST_VAL(X) (((uint32_t)(X) & 0x7UL) << 12)
#define MDMA_MDMA_C15TCR_DBURST          (0x7UL << 15) 
#define MDMA_MDMA_C15TCR_DBURST_VAL(X) (((uint32_t)(X) & 0x7UL) << 15)
#define MDMA_MDMA_C15TCR_TLEN          (0x7FUL << 18) 
#define MDMA_MDMA_C15TCR_TLEN_VAL(X) (((uint32_t)(X) & 0x7FUL) << 18)
#define MDMA_MDMA_C15TCR_PKE          (0x1UL << 25) 
#define MDMA_MDMA_C15TCR_PKE_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define MDMA_MDMA_C15TCR_PAM          (0x3UL << 26) 
#define MDMA_MDMA_C15TCR_PAM_VAL(X) (((uint32_t)(X) & 0x3UL) << 26)
#define MDMA_MDMA_C15TCR_TRGM          (0x3UL << 28) 
#define MDMA_MDMA_C15TCR_TRGM_VAL(X) (((uint32_t)(X) & 0x3UL) << 28)
#define MDMA_MDMA_C15TCR_SWRM          (0x1UL << 30) 
#define MDMA_MDMA_C15TCR_SWRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define MDMA_MDMA_C15TCR_BWM          (0x1UL << 31) 
#define MDMA_MDMA_C15TCR_BWM_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define MDMA_MDMA_C15BNDTR_BNDT          (0x1FFFFUL << 0) 
#define MDMA_MDMA_C15BNDTR_BNDT_VAL(X) (((uint32_t)(X) & 0x1FFFFUL) << 0)
#define MDMA_MDMA_C15BNDTR_BRSUM          (0x1UL << 18) 
#define MDMA_MDMA_C15BNDTR_BRSUM_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define MDMA_MDMA_C15BNDTR_BRDUM          (0x1UL << 19) 
#define MDMA_MDMA_C15BNDTR_BRDUM_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define MDMA_MDMA_C15BNDTR_BRC          (0xFFFUL << 20) 
#define MDMA_MDMA_C15BNDTR_BRC_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 20)
#define MDMA_MDMA_C15SAR_SAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C15SAR_SAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C15DAR_DAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C15DAR_DAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C15BRUR_SUV          (0xFFFFUL << 0) 
#define MDMA_MDMA_C15BRUR_SUV_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDMA_MDMA_C15BRUR_DUV          (0xFFFFUL << 16) 
#define MDMA_MDMA_C15BRUR_DUV_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define MDMA_MDMA_C15LAR_LAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C15LAR_LAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C15TBR_TSEL          (0x3FUL << 0) 
#define MDMA_MDMA_C15TBR_TSEL_VAL(X) (((uint32_t)(X) & 0x3FUL) << 0)
#define MDMA_MDMA_C15TBR_SBUS          (0x1UL << 16) 
#define MDMA_MDMA_C15TBR_SBUS_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define MDMA_MDMA_C15TBR_DBUS          (0x1UL << 17) 
#define MDMA_MDMA_C15TBR_DBUS_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define MDMA_MDMA_C15MAR_MAR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C15MAR_MAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDMA_MDMA_C15MDR_MDR          (0xFFFFFFFFUL << 0) 
#define MDMA_MDMA_C15MDR_MDR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)

