via/viaems/src/platforms/stm32h743/device.h
#define MDMA  ((struct MDMA*)(0x52000000UL))
struct QUADSPI {
  volatile uint32_t CR;
  volatile uint32_t DCR;
  volatile const uint32_t SR;
  volatile uint32_t FCR;
  volatile uint32_t DLR;
  volatile uint32_t CCR;
  volatile uint32_t AR;
  volatile uint32_t ABR;
  volatile uint32_t DR;
  volatile uint32_t PSMKR;
  volatile uint32_t PSMAR;
  volatile uint32_t PIR;
  volatile uint32_t LPTR;
};
#define QUADSPI_CR_EN          (0x1UL << 0) 
#define QUADSPI_CR_EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define QUADSPI_CR_ABORT          (0x1UL << 1) 
#define QUADSPI_CR_ABORT_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define QUADSPI_CR_DMAEN          (0x1UL << 2) 
#define QUADSPI_CR_DMAEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define QUADSPI_CR_TCEN          (0x1UL << 3) 
#define QUADSPI_CR_TCEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define QUADSPI_CR_SSHIFT          (0x1UL << 4) 
#define QUADSPI_CR_SSHIFT_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define QUADSPI_CR_DFM          (0x1UL << 6) 
#define QUADSPI_CR_DFM_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define QUADSPI_CR_FSEL          (0x1UL << 7) 
#define QUADSPI_CR_FSEL_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define QUADSPI_CR_FTHRES          (0x1FUL << 8) 
#define QUADSPI_CR_FTHRES_VAL(X) (((uint32_t)(X) & 0x1FUL) << 8)
#define QUADSPI_CR_TEIE          (0x1UL << 16) 
#define QUADSPI_CR_TEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define QUADSPI_CR_TCIE          (0x1UL << 17) 
#define QUADSPI_CR_TCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define QUADSPI_CR_FTIE          (0x1UL << 18) 
#define QUADSPI_CR_FTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define QUADSPI_CR_SMIE          (0x1UL << 19) 
#define QUADSPI_CR_SMIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define QUADSPI_CR_TOIE          (0x1UL << 20) 
#define QUADSPI_CR_TOIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define QUADSPI_CR_APMS          (0x1UL << 22) 
#define QUADSPI_CR_APMS_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define QUADSPI_CR_PMM          (0x1UL << 23) 
#define QUADSPI_CR_PMM_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define QUADSPI_CR_PRESCALER          (0xFFUL << 24) 
#define QUADSPI_CR_PRESCALER_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define QUADSPI_DCR_CKMODE          (0x1UL << 0) 
#define QUADSPI_DCR_CKMODE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define QUADSPI_DCR_CSHT          (0x7UL << 8) 
#define QUADSPI_DCR_CSHT_VAL(X) (((uint32_t)(X) & 0x7UL) << 8)
#define QUADSPI_DCR_FSIZE          (0x1FUL << 16) 
#define QUADSPI_DCR_FSIZE_VAL(X) (((uint32_t)(X) & 0x1FUL) << 16)
#define QUADSPI_SR_TEF          (0x1UL << 0) 
#define QUADSPI_SR_TEF_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define QUADSPI_SR_TCF          (0x1UL << 1) 
#define QUADSPI_SR_TCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define QUADSPI_SR_FTF          (0x1UL << 2) 
#define QUADSPI_SR_FTF_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define QUADSPI_SR_SMF          (0x1UL << 3) 
#define QUADSPI_SR_SMF_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define QUADSPI_SR_TOF          (0x1UL << 4) 
#define QUADSPI_SR_TOF_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define QUADSPI_SR_BUSY          (0x1UL << 5) 
#define QUADSPI_SR_BUSY_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define QUADSPI_SR_FLEVEL          (0x3FUL << 8) 
#define QUADSPI_SR_FLEVEL_VAL(X) (((uint32_t)(X) & 0x3FUL) << 8)
#define QUADSPI_FCR_CTEF          (0x1UL << 0) 
#define QUADSPI_FCR_CTEF_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define QUADSPI_FCR_CTCF          (0x1UL << 1) 
#define QUADSPI_FCR_CTCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define QUADSPI_FCR_CSMF          (0x1UL << 3) 
#define QUADSPI_FCR_CSMF_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define QUADSPI_FCR_CTOF          (0x1UL << 4) 
#define QUADSPI_FCR_CTOF_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define QUADSPI_DLR_DL          (0xFFFFFFFFUL << 0) 
#define QUADSPI_DLR_DL_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define QUADSPI_CCR_INSTRUCTION          (0xFFUL << 0) 
#define QUADSPI_CCR_INSTRUCTION_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define QUADSPI_CCR_IMODE          (0x3UL << 8) 
#define QUADSPI_CCR_IMODE_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define QUADSPI_CCR_ADMODE          (0x3UL << 10) 
#define QUADSPI_CCR_ADMODE_VAL(X) (((uint32_t)(X) & 0x3UL) << 10)
#define QUADSPI_CCR_ADSIZE          (0x3UL << 12) 
#define QUADSPI_CCR_ADSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 12)
#define QUADSPI_CCR_ABMODE          (0x3UL << 14) 
#define QUADSPI_CCR_ABMODE_VAL(X) (((uint32_t)(X) & 0x3UL) << 14)
#define QUADSPI_CCR_ABSIZE          (0x3UL << 16) 
#define QUADSPI_CCR_ABSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 16)
#define QUADSPI_CCR_DCYC          (0x1FUL << 18) 
#define QUADSPI_CCR_DCYC_VAL(X) (((uint32_t)(X) & 0x1FUL) << 18)
#define QUADSPI_CCR_DMODE          (0x3UL << 24) 
#define QUADSPI_CCR_DMODE_VAL(X) (((uint32_t)(X) & 0x3UL) << 24)
#define QUADSPI_CCR_FMODE          (0x3UL << 26) 
#define QUADSPI_CCR_FMODE_VAL(X) (((uint32_t)(X) & 0x3UL) << 26)
#define QUADSPI_CCR_SIOO          (0x1UL << 28) 
#define QUADSPI_CCR_SIOO_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define QUADSPI_CCR_DHHC          (0x1UL << 30) 
#define QUADSPI_CCR_DHHC_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define QUADSPI_CCR_DDRM          (0x1UL << 31) 
#define QUADSPI_CCR_DDRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define QUADSPI_AR_ADDRESS          (0xFFFFFFFFUL << 0) 
#define QUADSPI_AR_ADDRESS_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define QUADSPI_ABR_ALTERNATE          (0xFFFFFFFFUL << 0) 
#define QUADSPI_ABR_ALTERNATE_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define QUADSPI_DR_DATA          (0xFFFFFFFFUL << 0) 
#define QUADSPI_DR_DATA_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define QUADSPI_PSMKR_MASK          (0xFFFFFFFFUL << 0) 
#define QUADSPI_PSMKR_MASK_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define QUADSPI_PSMAR_MATCH          (0xFFFFFFFFUL << 0) 
#define QUADSPI_PSMAR_MATCH_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define QUADSPI_PIR_INTERVAL          (0xFFFFUL << 0) 
#define QUADSPI_PIR_INTERVAL_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define QUADSPI_LPTR_TIMEOUT          (0xFFFFUL << 0) 
#define QUADSPI_LPTR_TIMEOUT_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)

#define QUADSPI  ((struct QUADSPI*)(0x52005000UL))
struct RNG {
  volatile uint32_t CR;
  volatile uint32_t SR;
  volatile const uint32_t DR;
};
#define RNG_CR_RNGEN          (0x1UL << 2) 
#define RNG_CR_RNGEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define RNG_CR_IE          (0x1UL << 3) 
#define RNG_CR_IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define RNG_CR_CED          (0x1UL << 5) 
#define RNG_CR_CED_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define RNG_SR_DRDY          (0x1UL << 0) 
#define RNG_SR_DRDY_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define RNG_SR_CECS          (0x1UL << 1) 
#define RNG_SR_CECS_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define RNG_SR_SECS          (0x1UL << 2) 
#define RNG_SR_SECS_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define RNG_SR_CEIS          (0x1UL << 5) 
#define RNG_SR_CEIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define RNG_SR_SEIS          (0x1UL << 6) 
#define RNG_SR_SEIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define RNG_DR_RNDATA          (0xFFFFFFFFUL << 0) 
#define RNG_DR_RNDATA_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)

#define RNG  ((struct RNG*)(0x48021800UL))
struct RTC {
  volatile uint32_t RTC_TR;
  volatile uint32_t RTC_DR;
  volatile uint32_t RTC_CR;
  volatile uint32_t RTC_ISR;
  volatile uint32_t RTC_PRER;
  volatile uint32_t RTC_WUTR;
  const volatile uint32_t RESERVED28[1];
  volatile uint32_t RTC_ALRMAR;
  volatile uint32_t RTC_ALRMBR;
  volatile uint32_t RTC_WPR;
  volatile const uint32_t RTC_SSR;
  volatile uint32_t RTC_SHIFTR;
  volatile const uint32_t RTC_TSTR;
  volatile const uint32_t RTC_TSDR;
  volatile const uint32_t RTC_TSSSR;
  volatile uint32_t RTC_CALR;
  volatile uint32_t RTC_TAMPCR;
  volatile uint32_t RTC_ALRMASSR;
  volatile uint32_t RTC_ALRMBSSR;
  volatile uint32_t RTC_OR;
  volatile uint32_t RTC_BKP0R;
  volatile uint32_t RTC_BKP1R;
  volatile uint32_t RTC_BKP2R;
  volatile uint32_t RTC_BKP3R;
  volatile uint32_t RTC_BKP4R;
  volatile uint32_t RTC_BKP5R;
  volatile uint32_t RTC_BKP6R;
  volatile uint32_t RTC_BKP7R;
  volatile uint32_t RTC_BKP8R;
  volatile uint32_t RTC_BKP9R;
  volatile uint32_t RTC_BKP10R;
  volatile uint32_t RTC_BKP11R;
  volatile uint32_t RTC_BKP12R;
  volatile uint32_t RTC_BKP13R;
  volatile uint32_t RTC_BKP14R;
  volatile uint32_t RTC_BKP15R;
  volatile uint32_t RTC_BKP16R;
  volatile uint32_t RTC_BKP17R;
  volatile uint32_t RTC_BKP18R;
  volatile uint32_t RTC_BKP19R;
  volatile uint32_t RTC_BKP20R;
  volatile uint32_t RTC_BKP21R;
  volatile uint32_t RTC_BKP22R;
  volatile uint32_t RTC_BKP23R;
  volatile uint32_t RTC_BKP24R;
  volatile uint32_t RTC_BKP25R;
  volatile uint32_t RTC_BKP26R;
  volatile uint32_t RTC_BKP27R;
  volatile uint32_t RTC_BKP28R;
  volatile uint32_t RTC_BKP29R;
  volatile uint32_t RTC_BKP30R;
  volatile uint32_t RTC_BKP31R;
};
