via/viaems/src/platforms/stm32h743/device.h
#define RTC_RTC_TR_SU          (0xFUL << 0) 
#define RTC_RTC_TR_SU_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define RTC_RTC_TR_ST          (0x7UL << 4) 
#define RTC_RTC_TR_ST_VAL(X) (((uint32_t)(X) & 0x7UL) << 4)
#define RTC_RTC_TR_MNU          (0xFUL << 8) 
#define RTC_RTC_TR_MNU_VAL(X) (((uint32_t)(X) & 0xFUL) << 8)
#define RTC_RTC_TR_MNT          (0x7UL << 12) 
#define RTC_RTC_TR_MNT_VAL(X) (((uint32_t)(X) & 0x7UL) << 12)
#define RTC_RTC_TR_HU          (0xFUL << 16) 
#define RTC_RTC_TR_HU_VAL(X) (((uint32_t)(X) & 0xFUL) << 16)
#define RTC_RTC_TR_HT          (0x3UL << 20) 
#define RTC_RTC_TR_HT_VAL(X) (((uint32_t)(X) & 0x3UL) << 20)
#define RTC_RTC_TR_PM          (0x1UL << 22) 
#define RTC_RTC_TR_PM_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define RTC_RTC_DR_DU          (0xFUL << 0) 
#define RTC_RTC_DR_DU_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define RTC_RTC_DR_DT          (0x3UL << 4) 
#define RTC_RTC_DR_DT_VAL(X) (((uint32_t)(X) & 0x3UL) << 4)
#define RTC_RTC_DR_MU          (0xFUL << 8) 
#define RTC_RTC_DR_MU_VAL(X) (((uint32_t)(X) & 0xFUL) << 8)
#define RTC_RTC_DR_MT          (0x1UL << 12) 
#define RTC_RTC_DR_MT_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define RTC_RTC_DR_WDU          (0x7UL << 13) 
#define RTC_RTC_DR_WDU_VAL(X) (((uint32_t)(X) & 0x7UL) << 13)
#define RTC_RTC_DR_YU          (0xFUL << 16) 
#define RTC_RTC_DR_YU_VAL(X) (((uint32_t)(X) & 0xFUL) << 16)
#define RTC_RTC_DR_YT          (0xFUL << 20) 
#define RTC_RTC_DR_YT_VAL(X) (((uint32_t)(X) & 0xFUL) << 20)
#define RTC_RTC_CR_WUCKSEL          (0x7UL << 0) 
#define RTC_RTC_CR_WUCKSEL_VAL(X) (((uint32_t)(X) & 0x7UL) << 0)
#define RTC_RTC_CR_TSEDGE          (0x1UL << 3) 
#define RTC_RTC_CR_TSEDGE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define RTC_RTC_CR_REFCKON          (0x1UL << 4) 
#define RTC_RTC_CR_REFCKON_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define RTC_RTC_CR_BYPSHAD          (0x1UL << 5) 
#define RTC_RTC_CR_BYPSHAD_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define RTC_RTC_CR_FMT          (0x1UL << 6) 
#define RTC_RTC_CR_FMT_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define RTC_RTC_CR_ALRAE          (0x1UL << 8) 
#define RTC_RTC_CR_ALRAE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define RTC_RTC_CR_ALRBE          (0x1UL << 9) 
#define RTC_RTC_CR_ALRBE_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define RTC_RTC_CR_WUTE          (0x1UL << 10) 
#define RTC_RTC_CR_WUTE_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define RTC_RTC_CR_TSE          (0x1UL << 11) 
#define RTC_RTC_CR_TSE_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define RTC_RTC_CR_ALRAIE          (0x1UL << 12) 
#define RTC_RTC_CR_ALRAIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define RTC_RTC_CR_ALRBIE          (0x1UL << 13) 
#define RTC_RTC_CR_ALRBIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define RTC_RTC_CR_WUTIE          (0x1UL << 14) 
#define RTC_RTC_CR_WUTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define RTC_RTC_CR_TSIE          (0x1UL << 15) 
#define RTC_RTC_CR_TSIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define RTC_RTC_CR_ADD1H          (0x1UL << 16) 
#define RTC_RTC_CR_ADD1H_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define RTC_RTC_CR_SUB1H          (0x1UL << 17) 
#define RTC_RTC_CR_SUB1H_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define RTC_RTC_CR_BKP          (0x1UL << 18) 
#define RTC_RTC_CR_BKP_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define RTC_RTC_CR_COSEL          (0x1UL << 19) 
#define RTC_RTC_CR_COSEL_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define RTC_RTC_CR_POL          (0x1UL << 20) 
#define RTC_RTC_CR_POL_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define RTC_RTC_CR_OSEL          (0x3UL << 21) 
#define RTC_RTC_CR_OSEL_VAL(X) (((uint32_t)(X) & 0x3UL) << 21)
#define RTC_RTC_CR_COE          (0x1UL << 23) 
#define RTC_RTC_CR_COE_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define RTC_RTC_CR_ITSE          (0x1UL << 24) 
#define RTC_RTC_CR_ITSE_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define RTC_RTC_ISR_ALRAWF          (0x1UL << 0) 
#define RTC_RTC_ISR_ALRAWF_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define RTC_RTC_ISR_ALRBWF          (0x1UL << 1) 
#define RTC_RTC_ISR_ALRBWF_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define RTC_RTC_ISR_WUTWF          (0x1UL << 2) 
#define RTC_RTC_ISR_WUTWF_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define RTC_RTC_ISR_SHPF          (0x1UL << 3) 
#define RTC_RTC_ISR_SHPF_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define RTC_RTC_ISR_INITS          (0x1UL << 4) 
#define RTC_RTC_ISR_INITS_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define RTC_RTC_ISR_RSF          (0x1UL << 5) 
#define RTC_RTC_ISR_RSF_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define RTC_RTC_ISR_INITF          (0x1UL << 6) 
#define RTC_RTC_ISR_INITF_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define RTC_RTC_ISR_INIT          (0x1UL << 7) 
#define RTC_RTC_ISR_INIT_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define RTC_RTC_ISR_ALRAF          (0x1UL << 8) 
#define RTC_RTC_ISR_ALRAF_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define RTC_RTC_ISR_ALRBF          (0x1UL << 9) 
#define RTC_RTC_ISR_ALRBF_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define RTC_RTC_ISR_WUTF          (0x1UL << 10) 
#define RTC_RTC_ISR_WUTF_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define RTC_RTC_ISR_TSF          (0x1UL << 11) 
#define RTC_RTC_ISR_TSF_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define RTC_RTC_ISR_TSOVF          (0x1UL << 12) 
#define RTC_RTC_ISR_TSOVF_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define RTC_RTC_ISR_TAMP1F          (0x1UL << 13) 
#define RTC_RTC_ISR_TAMP1F_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define RTC_RTC_ISR_TAMP2F          (0x1UL << 14) 
#define RTC_RTC_ISR_TAMP2F_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define RTC_RTC_ISR_TAMP3F          (0x1UL << 15) 
#define RTC_RTC_ISR_TAMP3F_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define RTC_RTC_ISR_RECALPF          (0x1UL << 16) 
#define RTC_RTC_ISR_RECALPF_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define RTC_RTC_ISR_ITSF          (0x1UL << 17) 
#define RTC_RTC_ISR_ITSF_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define RTC_RTC_PRER_PREDIV_S          (0x7FFFUL << 0) 
#define RTC_RTC_PRER_PREDIV_S_VAL(X) (((uint32_t)(X) & 0x7FFFUL) << 0)
#define RTC_RTC_PRER_PREDIV_A          (0x7FUL << 16) 
#define RTC_RTC_PRER_PREDIV_A_VAL(X) (((uint32_t)(X) & 0x7FUL) << 16)
#define RTC_RTC_WUTR_WUT          (0xFFFFUL << 0) 
#define RTC_RTC_WUTR_WUT_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define RTC_RTC_ALRMAR_SU          (0xFUL << 0) 
#define RTC_RTC_ALRMAR_SU_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define RTC_RTC_ALRMAR_ST          (0x7UL << 4) 
#define RTC_RTC_ALRMAR_ST_VAL(X) (((uint32_t)(X) & 0x7UL) << 4)
#define RTC_RTC_ALRMAR_MSK1          (0x1UL << 7) 
#define RTC_RTC_ALRMAR_MSK1_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define RTC_RTC_ALRMAR_MNU          (0xFUL << 8) 
#define RTC_RTC_ALRMAR_MNU_VAL(X) (((uint32_t)(X) & 0xFUL) << 8)
#define RTC_RTC_ALRMAR_MNT          (0x7UL << 12) 
#define RTC_RTC_ALRMAR_MNT_VAL(X) (((uint32_t)(X) & 0x7UL) << 12)
#define RTC_RTC_ALRMAR_MSK2          (0x1UL << 15) 
#define RTC_RTC_ALRMAR_MSK2_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define RTC_RTC_ALRMAR_HU          (0xFUL << 16) 
#define RTC_RTC_ALRMAR_HU_VAL(X) (((uint32_t)(X) & 0xFUL) << 16)
#define RTC_RTC_ALRMAR_HT          (0x3UL << 20) 
#define RTC_RTC_ALRMAR_HT_VAL(X) (((uint32_t)(X) & 0x3UL) << 20)
#define RTC_RTC_ALRMAR_PM          (0x1UL << 22) 
#define RTC_RTC_ALRMAR_PM_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define RTC_RTC_ALRMAR_MSK3          (0x1UL << 23) 
#define RTC_RTC_ALRMAR_MSK3_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define RTC_RTC_ALRMAR_DU          (0xFUL << 24) 
#define RTC_RTC_ALRMAR_DU_VAL(X) (((uint32_t)(X) & 0xFUL) << 24)
#define RTC_RTC_ALRMAR_DT          (0x3UL << 28) 
#define RTC_RTC_ALRMAR_DT_VAL(X) (((uint32_t)(X) & 0x3UL) << 28)
#define RTC_RTC_ALRMAR_WDSEL          (0x1UL << 30) 
#define RTC_RTC_ALRMAR_WDSEL_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define RTC_RTC_ALRMAR_MSK4          (0x1UL << 31) 
#define RTC_RTC_ALRMAR_MSK4_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define RTC_RTC_ALRMBR_SU          (0xFUL << 0) 
#define RTC_RTC_ALRMBR_SU_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define RTC_RTC_ALRMBR_ST          (0x7UL << 4) 
#define RTC_RTC_ALRMBR_ST_VAL(X) (((uint32_t)(X) & 0x7UL) << 4)
#define RTC_RTC_ALRMBR_MSK1          (0x1UL << 7) 
#define RTC_RTC_ALRMBR_MSK1_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define RTC_RTC_ALRMBR_MNU          (0xFUL << 8) 
#define RTC_RTC_ALRMBR_MNU_VAL(X) (((uint32_t)(X) & 0xFUL) << 8)
#define RTC_RTC_ALRMBR_MNT          (0x7UL << 12) 
#define RTC_RTC_ALRMBR_MNT_VAL(X) (((uint32_t)(X) & 0x7UL) << 12)
#define RTC_RTC_ALRMBR_MSK2          (0x1UL << 15) 
#define RTC_RTC_ALRMBR_MSK2_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define RTC_RTC_ALRMBR_HU          (0xFUL << 16) 
#define RTC_RTC_ALRMBR_HU_VAL(X) (((uint32_t)(X) & 0xFUL) << 16)
#define RTC_RTC_ALRMBR_HT          (0x3UL << 20) 
#define RTC_RTC_ALRMBR_HT_VAL(X) (((uint32_t)(X) & 0x3UL) << 20)
#define RTC_RTC_ALRMBR_PM          (0x1UL << 22) 
#define RTC_RTC_ALRMBR_PM_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define RTC_RTC_ALRMBR_MSK3          (0x1UL << 23) 
#define RTC_RTC_ALRMBR_MSK3_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define RTC_RTC_ALRMBR_DU          (0xFUL << 24) 
#define RTC_RTC_ALRMBR_DU_VAL(X) (((uint32_t)(X) & 0xFUL) << 24)
#define RTC_RTC_ALRMBR_DT          (0x3UL << 28) 
#define RTC_RTC_ALRMBR_DT_VAL(X) (((uint32_t)(X) & 0x3UL) << 28)
#define RTC_RTC_ALRMBR_WDSEL          (0x1UL << 30) 
#define RTC_RTC_ALRMBR_WDSEL_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define RTC_RTC_ALRMBR_MSK4          (0x1UL << 31) 
#define RTC_RTC_ALRMBR_MSK4_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define RTC_RTC_WPR_KEY          (0xFFUL << 0) 
#define RTC_RTC_WPR_KEY_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define RTC_RTC_SSR_SS          (0xFFFFUL << 0) 
#define RTC_RTC_SSR_SS_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define RTC_RTC_SHIFTR_SUBFS          (0x7FFFUL << 0) 
#define RTC_RTC_SHIFTR_SUBFS_VAL(X) (((uint32_t)(X) & 0x7FFFUL) << 0)
#define RTC_RTC_SHIFTR_ADD1S          (0x1UL << 31) 
#define RTC_RTC_SHIFTR_ADD1S_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define RTC_RTC_TSTR_SU          (0xFUL << 0) 
#define RTC_RTC_TSTR_SU_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define RTC_RTC_TSTR_ST          (0x7UL << 4) 
#define RTC_RTC_TSTR_ST_VAL(X) (((uint32_t)(X) & 0x7UL) << 4)
#define RTC_RTC_TSTR_MNU          (0xFUL << 8) 
#define RTC_RTC_TSTR_MNU_VAL(X) (((uint32_t)(X) & 0xFUL) << 8)
#define RTC_RTC_TSTR_MNT          (0x7UL << 12) 
#define RTC_RTC_TSTR_MNT_VAL(X) (((uint32_t)(X) & 0x7UL) << 12)
#define RTC_RTC_TSTR_HU          (0xFUL << 16) 
#define RTC_RTC_TSTR_HU_VAL(X) (((uint32_t)(X) & 0xFUL) << 16)
#define RTC_RTC_TSTR_HT          (0x3UL << 20) 
#define RTC_RTC_TSTR_HT_VAL(X) (((uint32_t)(X) & 0x3UL) << 20)
#define RTC_RTC_TSTR_PM          (0x1UL << 22) 
#define RTC_RTC_TSTR_PM_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define RTC_RTC_TSDR_DU          (0xFUL << 0) 
#define RTC_RTC_TSDR_DU_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define RTC_RTC_TSDR_DT          (0x3UL << 4) 
#define RTC_RTC_TSDR_DT_VAL(X) (((uint32_t)(X) & 0x3UL) << 4)
#define RTC_RTC_TSDR_MU          (0xFUL << 8) 
#define RTC_RTC_TSDR_MU_VAL(X) (((uint32_t)(X) & 0xFUL) << 8)
#define RTC_RTC_TSDR_MT          (0x1UL << 12) 
#define RTC_RTC_TSDR_MT_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define RTC_RTC_TSDR_WDU          (0x7UL << 13) 
#define RTC_RTC_TSDR_WDU_VAL(X) (((uint32_t)(X) & 0x7UL) << 13)
#define RTC_RTC_TSSSR_SS          (0xFFFFUL << 0) 
#define RTC_RTC_TSSSR_SS_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define RTC_RTC_CALR_CALM          (0x1FFUL << 0) 
#define RTC_RTC_CALR_CALM_VAL(X) (((uint32_t)(X) & 0x1FFUL) << 0)
#define RTC_RTC_CALR_CALW16          (0x1UL << 13) 
#define RTC_RTC_CALR_CALW16_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define RTC_RTC_CALR_CALW8          (0x1UL << 14) 
#define RTC_RTC_CALR_CALW8_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define RTC_RTC_CALR_CALP          (0x1UL << 15) 
#define RTC_RTC_CALR_CALP_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define RTC_RTC_TAMPCR_TAMP1E          (0x1UL << 0) 
#define RTC_RTC_TAMPCR_TAMP1E_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define RTC_RTC_TAMPCR_TAMP1TRG          (0x1UL << 1) 
#define RTC_RTC_TAMPCR_TAMP1TRG_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define RTC_RTC_TAMPCR_TAMPIE          (0x1UL << 2) 
#define RTC_RTC_TAMPCR_TAMPIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define RTC_RTC_TAMPCR_TAMP2E          (0x1UL << 3) 
#define RTC_RTC_TAMPCR_TAMP2E_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define RTC_RTC_TAMPCR_TAMP2TRG          (0x1UL << 4) 
#define RTC_RTC_TAMPCR_TAMP2TRG_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define RTC_RTC_TAMPCR_TAMP3E          (0x1UL << 5) 
#define RTC_RTC_TAMPCR_TAMP3E_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define RTC_RTC_TAMPCR_TAMP3TRG          (0x1UL << 6) 
#define RTC_RTC_TAMPCR_TAMP3TRG_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define RTC_RTC_TAMPCR_TAMPTS          (0x1UL << 7) 
#define RTC_RTC_TAMPCR_TAMPTS_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define RTC_RTC_TAMPCR_TAMPFREQ          (0x7UL << 8) 
#define RTC_RTC_TAMPCR_TAMPFREQ_VAL(X) (((uint32_t)(X) & 0x7UL) << 8)
#define RTC_RTC_TAMPCR_TAMPFLT          (0x3UL << 11) 
#define RTC_RTC_TAMPCR_TAMPFLT_VAL(X) (((uint32_t)(X) & 0x3UL) << 11)
#define RTC_RTC_TAMPCR_TAMPPRCH          (0x3UL << 13) 
#define RTC_RTC_TAMPCR_TAMPPRCH_VAL(X) (((uint32_t)(X) & 0x3UL) << 13)
#define RTC_RTC_TAMPCR_TAMPPUDIS          (0x1UL << 15) 
#define RTC_RTC_TAMPCR_TAMPPUDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define RTC_RTC_TAMPCR_TAMP1IE          (0x1UL << 16) 
#define RTC_RTC_TAMPCR_TAMP1IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define RTC_RTC_TAMPCR_TAMP1NOERASE          (0x1UL << 17) 
#define RTC_RTC_TAMPCR_TAMP1NOERASE_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define RTC_RTC_TAMPCR_TAMP1MF          (0x1UL << 18) 
#define RTC_RTC_TAMPCR_TAMP1MF_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define RTC_RTC_TAMPCR_TAMP2IE          (0x1UL << 19) 
#define RTC_RTC_TAMPCR_TAMP2IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define RTC_RTC_TAMPCR_TAMP2NOERASE          (0x1UL << 20) 
#define RTC_RTC_TAMPCR_TAMP2NOERASE_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define RTC_RTC_TAMPCR_TAMP2MF          (0x1UL << 21) 
#define RTC_RTC_TAMPCR_TAMP2MF_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define RTC_RTC_TAMPCR_TAMP3IE          (0x1UL << 22) 
#define RTC_RTC_TAMPCR_TAMP3IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define RTC_RTC_TAMPCR_TAMP3NOERASE          (0x1UL << 23) 
#define RTC_RTC_TAMPCR_TAMP3NOERASE_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define RTC_RTC_TAMPCR_TAMP3MF          (0x1UL << 24) 
#define RTC_RTC_TAMPCR_TAMP3MF_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define RTC_RTC_ALRMASSR_SS          (0x7FFFUL << 0) 
#define RTC_RTC_ALRMASSR_SS_VAL(X) (((uint32_t)(X) & 0x7FFFUL) << 0)
#define RTC_RTC_ALRMASSR_MASKSS          (0xFUL << 24) 
#define RTC_RTC_ALRMASSR_MASKSS_VAL(X) (((uint32_t)(X) & 0xFUL) << 24)
#define RTC_RTC_ALRMBSSR_SS          (0x7FFFUL << 0) 
#define RTC_RTC_ALRMBSSR_SS_VAL(X) (((uint32_t)(X) & 0x7FFFUL) << 0)
#define RTC_RTC_ALRMBSSR_MASKSS          (0xFUL << 24) 
#define RTC_RTC_ALRMBSSR_MASKSS_VAL(X) (((uint32_t)(X) & 0xFUL) << 24)
#define RTC_RTC_BKP0R_BKP          (0xFFFFFFFFUL << 0) 
#define RTC_RTC_BKP0R_BKP_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define RTC_RTC_BKP1R_BKP          (0xFFFFFFFFUL << 0) 
#define RTC_RTC_BKP1R_BKP_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define RTC_RTC_BKP2R_BKP          (0xFFFFFFFFUL << 0) 
#define RTC_RTC_BKP2R_BKP_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define RTC_RTC_BKP3R_BKP          (0xFFFFFFFFUL << 0) 
#define RTC_RTC_BKP3R_BKP_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define RTC_RTC_BKP4R_BKP          (0xFFFFFFFFUL << 0) 
#define RTC_RTC_BKP4R_BKP_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define RTC_RTC_BKP5R_BKP          (0xFFFFFFFFUL << 0) 
#define RTC_RTC_BKP5R_BKP_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define RTC_RTC_BKP6R_BKP          (0xFFFFFFFFUL << 0) 
#define RTC_RTC_BKP6R_BKP_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define RTC_RTC_BKP7R_BKP          (0xFFFFFFFFUL << 0) 
#define RTC_RTC_BKP7R_BKP_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define RTC_RTC_BKP8R_BKP          (0xFFFFFFFFUL << 0) 
#define RTC_RTC_BKP8R_BKP_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define RTC_RTC_BKP9R_BKP          (0xFFFFFFFFUL << 0) 
#define RTC_RTC_BKP9R_BKP_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define RTC_RTC_BKP10R_BKP          (0xFFFFFFFFUL << 0) 
#define RTC_RTC_BKP10R_BKP_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define RTC_RTC_BKP11R_BKP          (0xFFFFFFFFUL << 0) 
#define RTC_RTC_BKP11R_BKP_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define RTC_RTC_BKP12R_BKP          (0xFFFFFFFFUL << 0) 
#define RTC_RTC_BKP12R_BKP_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define RTC_RTC_BKP13R_BKP          (0xFFFFFFFFUL << 0) 
#define RTC_RTC_BKP13R_BKP_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define RTC_RTC_BKP14R_BKP          (0xFFFFFFFFUL << 0) 
#define RTC_RTC_BKP14R_BKP_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define RTC_RTC_BKP15R_BKP          (0xFFFFFFFFUL << 0) 
#define RTC_RTC_BKP15R_BKP_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define RTC_RTC_OR_RTC_ALARM_TYPE          (0x1UL << 0) 
#define RTC_RTC_OR_RTC_ALARM_TYPE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define RTC_RTC_OR_RTC_OUT_RMP          (0x1UL << 1) 
#define RTC_RTC_OR_RTC_OUT_RMP_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define RTC_RTC_BKP16R_BKP          (0xFFFFFFFFUL << 0) 
#define RTC_RTC_BKP16R_BKP_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define RTC_RTC_BKP17R_BKP          (0xFFFFFFFFUL << 0) 
#define RTC_RTC_BKP17R_BKP_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define RTC_RTC_BKP18R_BKP          (0xFFFFFFFFUL << 0) 
#define RTC_RTC_BKP18R_BKP_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define RTC_RTC_BKP19R_BKP          (0xFFFFFFFFUL << 0) 
#define RTC_RTC_BKP19R_BKP_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define RTC_RTC_BKP20R_BKP          (0xFFFFFFFFUL << 0) 
#define RTC_RTC_BKP20R_BKP_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define RTC_RTC_BKP21R_BKP          (0xFFFFFFFFUL << 0) 
#define RTC_RTC_BKP21R_BKP_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define RTC_RTC_BKP22R_BKP          (0xFFFFFFFFUL << 0) 
#define RTC_RTC_BKP22R_BKP_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define RTC_RTC_BKP23R_BKP          (0xFFFFFFFFUL << 0) 
#define RTC_RTC_BKP23R_BKP_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define RTC_RTC_BKP24R_BKP          (0xFFFFFFFFUL << 0) 
#define RTC_RTC_BKP24R_BKP_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define RTC_RTC_BKP25R_BKP          (0xFFFFFFFFUL << 0) 
#define RTC_RTC_BKP25R_BKP_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define RTC_RTC_BKP26R_BKP          (0xFFFFFFFFUL << 0) 
#define RTC_RTC_BKP26R_BKP_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define RTC_RTC_BKP27R_BKP          (0xFFFFFFFFUL << 0) 
#define RTC_RTC_BKP27R_BKP_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define RTC_RTC_BKP28R_BKP          (0xFFFFFFFFUL << 0) 
#define RTC_RTC_BKP28R_BKP_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define RTC_RTC_BKP29R_BKP          (0xFFFFFFFFUL << 0) 
#define RTC_RTC_BKP29R_BKP_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define RTC_RTC_BKP30R_BKP          (0xFFFFFFFFUL << 0) 
#define RTC_RTC_BKP30R_BKP_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define RTC_RTC_BKP31R_BKP          (0xFFFFFFFFUL << 0) 
#define RTC_RTC_BKP31R_BKP_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)

#define RTC  ((struct RTC*)(0x58004000UL))
struct SAI4 {
  volatile uint32_t SAI_GCR;
  volatile uint32_t SAI_ACR1;
  volatile uint32_t SAI_ACR2;
  volatile uint32_t SAI_AFRCR;
  volatile uint32_t SAI_ASLOTR;
  volatile uint32_t SAI_AIM;
  volatile const uint32_t SAI_ASR;
  volatile uint32_t SAI_ACLRFR;
  volatile uint32_t SAI_ADR;
  volatile uint32_t SAI_BCR1;
  volatile uint32_t SAI_BCR2;
  volatile uint32_t SAI_BFRCR;
  volatile uint32_t SAI_BSLOTR;
  volatile uint32_t SAI_BIM;
  volatile const uint32_t SAI_BSR;
  volatile uint32_t SAI_BCLRFR;
  volatile uint32_t SAI_BDR;
  volatile uint32_t SAI_PDMCR;
  volatile uint32_t SAI_PDMDLY;
};
