via/viaems/src/platforms/stm32h743/device.h
#define SAI2  ((struct SAI2*)(0x40015C00UL))
struct SAI3 {
  volatile uint32_t SAI_GCR;
  volatile uint32_t SAI_ACR1;
  volatile uint32_t SAI_ACR2;
  volatile uint32_t SAI_AFRCR;
  volatile uint32_t SAI_ASLOTR;
  volatile uint32_t SAI_AIM;
  volatile const uint32_t SAI_ASR;
  volatile uint32_t SAI_ACLRFR;
  volatile uint32_t SAI_ADR;
  volatile uint32_t SAI_BCR1;
  volatile uint32_t SAI_BCR2;
  volatile uint32_t SAI_BFRCR;
  volatile uint32_t SAI_BSLOTR;
  volatile uint32_t SAI_BIM;
  volatile const uint32_t SAI_BSR;
  volatile uint32_t SAI_BCLRFR;
  volatile uint32_t SAI_BDR;
  volatile uint32_t SAI_PDMCR;
  volatile uint32_t SAI_PDMDLY;
};
#define SAI3_SAI_GCR_SYNCOUT          (0x3UL << 4) 
#define SAI3_SAI_GCR_SYNCOUT_VAL(X) (((uint32_t)(X) & 0x3UL) << 4)
#define SAI3_SAI_GCR_SYNCIN          (0x3UL << 0) 
#define SAI3_SAI_GCR_SYNCIN_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define SAI3_SAI_ACR1_MODE          (0x3UL << 0) 
#define SAI3_SAI_ACR1_MODE_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define SAI3_SAI_ACR1_PRTCFG          (0x3UL << 2) 
#define SAI3_SAI_ACR1_PRTCFG_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define SAI3_SAI_ACR1_DS          (0x7UL << 5) 
#define SAI3_SAI_ACR1_DS_VAL(X) (((uint32_t)(X) & 0x7UL) << 5)
#define SAI3_SAI_ACR1_LSBFIRST          (0x1UL << 8) 
#define SAI3_SAI_ACR1_LSBFIRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define SAI3_SAI_ACR1_CKSTR          (0x1UL << 9) 
#define SAI3_SAI_ACR1_CKSTR_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define SAI3_SAI_ACR1_SYNCEN          (0x3UL << 10) 
#define SAI3_SAI_ACR1_SYNCEN_VAL(X) (((uint32_t)(X) & 0x3UL) << 10)
#define SAI3_SAI_ACR1_MONO          (0x1UL << 12) 
#define SAI3_SAI_ACR1_MONO_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define SAI3_SAI_ACR1_OUTDRIV          (0x1UL << 13) 
#define SAI3_SAI_ACR1_OUTDRIV_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define SAI3_SAI_ACR1_SAIXEN          (0x1UL << 16) 
#define SAI3_SAI_ACR1_SAIXEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define SAI3_SAI_ACR1_DMAEN          (0x1UL << 17) 
#define SAI3_SAI_ACR1_DMAEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define SAI3_SAI_ACR1_NOMCK          (0x1UL << 19) 
#define SAI3_SAI_ACR1_NOMCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define SAI3_SAI_ACR1_MCKDIV          (0xFUL << 20) 
#define SAI3_SAI_ACR1_MCKDIV_VAL(X) (((uint32_t)(X) & 0xFUL) << 20)
#define SAI3_SAI_ACR1_OSR          (0x1UL << 26) 
#define SAI3_SAI_ACR1_OSR_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define SAI3_SAI_ACR2_FTH          (0x7UL << 0) 
#define SAI3_SAI_ACR2_FTH_VAL(X) (((uint32_t)(X) & 0x7UL) << 0)
#define SAI3_SAI_ACR2_FFLUSH          (0x1UL << 3) 
#define SAI3_SAI_ACR2_FFLUSH_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define SAI3_SAI_ACR2_TRIS          (0x1UL << 4) 
#define SAI3_SAI_ACR2_TRIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define SAI3_SAI_ACR2_MUTE          (0x1UL << 5) 
#define SAI3_SAI_ACR2_MUTE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define SAI3_SAI_ACR2_MUTEVAL          (0x1UL << 6) 
#define SAI3_SAI_ACR2_MUTEVAL_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define SAI3_SAI_ACR2_MUTECNT          (0x3FUL << 7) 
#define SAI3_SAI_ACR2_MUTECNT_VAL(X) (((uint32_t)(X) & 0x3FUL) << 7)
#define SAI3_SAI_ACR2_CPL          (0x1UL << 13) 
#define SAI3_SAI_ACR2_CPL_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define SAI3_SAI_ACR2_COMP          (0x3UL << 14) 
#define SAI3_SAI_ACR2_COMP_VAL(X) (((uint32_t)(X) & 0x3UL) << 14)
#define SAI3_SAI_AFRCR_FRL          (0xFFUL << 0) 
#define SAI3_SAI_AFRCR_FRL_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define SAI3_SAI_AFRCR_FSALL          (0x7FUL << 8) 
#define SAI3_SAI_AFRCR_FSALL_VAL(X) (((uint32_t)(X) & 0x7FUL) << 8)
#define SAI3_SAI_AFRCR_FSDEF          (0x1UL << 16) 
#define SAI3_SAI_AFRCR_FSDEF_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define SAI3_SAI_AFRCR_FSPOL          (0x1UL << 17) 
#define SAI3_SAI_AFRCR_FSPOL_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define SAI3_SAI_AFRCR_FSOFF          (0x1UL << 18) 
#define SAI3_SAI_AFRCR_FSOFF_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define SAI3_SAI_ASLOTR_FBOFF          (0x1FUL << 0) 
#define SAI3_SAI_ASLOTR_FBOFF_VAL(X) (((uint32_t)(X) & 0x1FUL) << 0)
#define SAI3_SAI_ASLOTR_SLOTSZ          (0x3UL << 6) 
#define SAI3_SAI_ASLOTR_SLOTSZ_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define SAI3_SAI_ASLOTR_NBSLOT          (0xFUL << 8) 
#define SAI3_SAI_ASLOTR_NBSLOT_VAL(X) (((uint32_t)(X) & 0xFUL) << 8)
#define SAI3_SAI_ASLOTR_SLOTEN          (0xFFFFUL << 16) 
#define SAI3_SAI_ASLOTR_SLOTEN_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define SAI3_SAI_AIM_OVRUDRIE          (0x1UL << 0) 
#define SAI3_SAI_AIM_OVRUDRIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define SAI3_SAI_AIM_MUTEDETIE          (0x1UL << 1) 
#define SAI3_SAI_AIM_MUTEDETIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define SAI3_SAI_AIM_WCKCFGIE          (0x1UL << 2) 
#define SAI3_SAI_AIM_WCKCFGIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define SAI3_SAI_AIM_FREQIE          (0x1UL << 3) 
#define SAI3_SAI_AIM_FREQIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define SAI3_SAI_AIM_CNRDYIE          (0x1UL << 4) 
#define SAI3_SAI_AIM_CNRDYIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define SAI3_SAI_AIM_AFSDETIE          (0x1UL << 5) 
#define SAI3_SAI_AIM_AFSDETIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define SAI3_SAI_AIM_LFSDETIE          (0x1UL << 6) 
#define SAI3_SAI_AIM_LFSDETIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define SAI3_SAI_ASR_OVRUDR          (0x1UL << 0) 
#define SAI3_SAI_ASR_OVRUDR_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define SAI3_SAI_ASR_MUTEDET          (0x1UL << 1) 
#define SAI3_SAI_ASR_MUTEDET_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define SAI3_SAI_ASR_WCKCFG          (0x1UL << 2) 
#define SAI3_SAI_ASR_WCKCFG_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define SAI3_SAI_ASR_FREQ          (0x1UL << 3) 
#define SAI3_SAI_ASR_FREQ_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define SAI3_SAI_ASR_CNRDY          (0x1UL << 4) 
#define SAI3_SAI_ASR_CNRDY_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define SAI3_SAI_ASR_AFSDET          (0x1UL << 5) 
#define SAI3_SAI_ASR_AFSDET_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define SAI3_SAI_ASR_LFSDET          (0x1UL << 6) 
#define SAI3_SAI_ASR_LFSDET_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define SAI3_SAI_ASR_FLVL          (0x7UL << 16) 
#define SAI3_SAI_ASR_FLVL_VAL(X) (((uint32_t)(X) & 0x7UL) << 16)
#define SAI3_SAI_ACLRFR_COVRUDR          (0x1UL << 0) 
#define SAI3_SAI_ACLRFR_COVRUDR_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define SAI3_SAI_ACLRFR_CMUTEDET          (0x1UL << 1) 
#define SAI3_SAI_ACLRFR_CMUTEDET_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define SAI3_SAI_ACLRFR_CWCKCFG          (0x1UL << 2) 
#define SAI3_SAI_ACLRFR_CWCKCFG_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define SAI3_SAI_ACLRFR_CCNRDY          (0x1UL << 4) 
#define SAI3_SAI_ACLRFR_CCNRDY_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define SAI3_SAI_ACLRFR_CAFSDET          (0x1UL << 5) 
#define SAI3_SAI_ACLRFR_CAFSDET_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define SAI3_SAI_ACLRFR_CLFSDET          (0x1UL << 6) 
#define SAI3_SAI_ACLRFR_CLFSDET_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define SAI3_SAI_ADR_DATA          (0xFFFFFFFFUL << 0) 
#define SAI3_SAI_ADR_DATA_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define SAI3_SAI_BCR1_MODE          (0x3UL << 0) 
#define SAI3_SAI_BCR1_MODE_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define SAI3_SAI_BCR1_PRTCFG          (0x3UL << 2) 
#define SAI3_SAI_BCR1_PRTCFG_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define SAI3_SAI_BCR1_DS          (0x7UL << 5) 
#define SAI3_SAI_BCR1_DS_VAL(X) (((uint32_t)(X) & 0x7UL) << 5)
#define SAI3_SAI_BCR1_LSBFIRST          (0x1UL << 8) 
#define SAI3_SAI_BCR1_LSBFIRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define SAI3_SAI_BCR1_CKSTR          (0x1UL << 9) 
#define SAI3_SAI_BCR1_CKSTR_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define SAI3_SAI_BCR1_SYNCEN          (0x3UL << 10) 
#define SAI3_SAI_BCR1_SYNCEN_VAL(X) (((uint32_t)(X) & 0x3UL) << 10)
#define SAI3_SAI_BCR1_MONO          (0x1UL << 12) 
#define SAI3_SAI_BCR1_MONO_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define SAI3_SAI_BCR1_OUTDRIV          (0x1UL << 13) 
#define SAI3_SAI_BCR1_OUTDRIV_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define SAI3_SAI_BCR1_SAIXEN          (0x1UL << 16) 
#define SAI3_SAI_BCR1_SAIXEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define SAI3_SAI_BCR1_DMAEN          (0x1UL << 17) 
#define SAI3_SAI_BCR1_DMAEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define SAI3_SAI_BCR1_NOMCK          (0x1UL << 19) 
#define SAI3_SAI_BCR1_NOMCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define SAI3_SAI_BCR1_MCKDIV          (0xFUL << 20) 
#define SAI3_SAI_BCR1_MCKDIV_VAL(X) (((uint32_t)(X) & 0xFUL) << 20)
#define SAI3_SAI_BCR1_OSR          (0x1UL << 26) 
#define SAI3_SAI_BCR1_OSR_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define SAI3_SAI_BCR2_FTH          (0x7UL << 0) 
#define SAI3_SAI_BCR2_FTH_VAL(X) (((uint32_t)(X) & 0x7UL) << 0)
#define SAI3_SAI_BCR2_FFLUSH          (0x1UL << 3) 
#define SAI3_SAI_BCR2_FFLUSH_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define SAI3_SAI_BCR2_TRIS          (0x1UL << 4) 
#define SAI3_SAI_BCR2_TRIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define SAI3_SAI_BCR2_MUTE          (0x1UL << 5) 
#define SAI3_SAI_BCR2_MUTE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define SAI3_SAI_BCR2_MUTEVAL          (0x1UL << 6) 
#define SAI3_SAI_BCR2_MUTEVAL_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define SAI3_SAI_BCR2_MUTECNT          (0x3FUL << 7) 
#define SAI3_SAI_BCR2_MUTECNT_VAL(X) (((uint32_t)(X) & 0x3FUL) << 7)
#define SAI3_SAI_BCR2_CPL          (0x1UL << 13) 
#define SAI3_SAI_BCR2_CPL_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define SAI3_SAI_BCR2_COMP          (0x3UL << 14) 
#define SAI3_SAI_BCR2_COMP_VAL(X) (((uint32_t)(X) & 0x3UL) << 14)
#define SAI3_SAI_BFRCR_FRL          (0xFFUL << 0) 
#define SAI3_SAI_BFRCR_FRL_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define SAI3_SAI_BFRCR_FSALL          (0x7FUL << 8) 
#define SAI3_SAI_BFRCR_FSALL_VAL(X) (((uint32_t)(X) & 0x7FUL) << 8)
#define SAI3_SAI_BFRCR_FSDEF          (0x1UL << 16) 
#define SAI3_SAI_BFRCR_FSDEF_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define SAI3_SAI_BFRCR_FSPOL          (0x1UL << 17) 
#define SAI3_SAI_BFRCR_FSPOL_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define SAI3_SAI_BFRCR_FSOFF          (0x1UL << 18) 
#define SAI3_SAI_BFRCR_FSOFF_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define SAI3_SAI_BSLOTR_FBOFF          (0x1FUL << 0) 
#define SAI3_SAI_BSLOTR_FBOFF_VAL(X) (((uint32_t)(X) & 0x1FUL) << 0)
#define SAI3_SAI_BSLOTR_SLOTSZ          (0x3UL << 6) 
#define SAI3_SAI_BSLOTR_SLOTSZ_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define SAI3_SAI_BSLOTR_NBSLOT          (0xFUL << 8) 
#define SAI3_SAI_BSLOTR_NBSLOT_VAL(X) (((uint32_t)(X) & 0xFUL) << 8)
#define SAI3_SAI_BSLOTR_SLOTEN          (0xFFFFUL << 16) 
#define SAI3_SAI_BSLOTR_SLOTEN_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define SAI3_SAI_BIM_OVRUDRIE          (0x1UL << 0) 
#define SAI3_SAI_BIM_OVRUDRIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define SAI3_SAI_BIM_MUTEDETIE          (0x1UL << 1) 
#define SAI3_SAI_BIM_MUTEDETIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define SAI3_SAI_BIM_WCKCFGIE          (0x1UL << 2) 
#define SAI3_SAI_BIM_WCKCFGIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define SAI3_SAI_BIM_FREQIE          (0x1UL << 3) 
#define SAI3_SAI_BIM_FREQIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define SAI3_SAI_BIM_CNRDYIE          (0x1UL << 4) 
#define SAI3_SAI_BIM_CNRDYIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define SAI3_SAI_BIM_AFSDETIE          (0x1UL << 5) 
#define SAI3_SAI_BIM_AFSDETIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define SAI3_SAI_BIM_LFSDETIE          (0x1UL << 6) 
#define SAI3_SAI_BIM_LFSDETIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define SAI3_SAI_BSR_OVRUDR          (0x1UL << 0) 
#define SAI3_SAI_BSR_OVRUDR_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define SAI3_SAI_BSR_MUTEDET          (0x1UL << 1) 
#define SAI3_SAI_BSR_MUTEDET_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define SAI3_SAI_BSR_WCKCFG          (0x1UL << 2) 
#define SAI3_SAI_BSR_WCKCFG_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define SAI3_SAI_BSR_FREQ          (0x1UL << 3) 
#define SAI3_SAI_BSR_FREQ_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define SAI3_SAI_BSR_CNRDY          (0x1UL << 4) 
#define SAI3_SAI_BSR_CNRDY_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define SAI3_SAI_BSR_AFSDET          (0x1UL << 5) 
#define SAI3_SAI_BSR_AFSDET_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define SAI3_SAI_BSR_LFSDET          (0x1UL << 6) 
#define SAI3_SAI_BSR_LFSDET_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define SAI3_SAI_BSR_FLVL          (0x7UL << 16) 
#define SAI3_SAI_BSR_FLVL_VAL(X) (((uint32_t)(X) & 0x7UL) << 16)
#define SAI3_SAI_BCLRFR_COVRUDR          (0x1UL << 0) 
#define SAI3_SAI_BCLRFR_COVRUDR_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define SAI3_SAI_BCLRFR_CMUTEDET          (0x1UL << 1) 
#define SAI3_SAI_BCLRFR_CMUTEDET_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define SAI3_SAI_BCLRFR_CWCKCFG          (0x1UL << 2) 
#define SAI3_SAI_BCLRFR_CWCKCFG_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define SAI3_SAI_BCLRFR_CCNRDY          (0x1UL << 4) 
#define SAI3_SAI_BCLRFR_CCNRDY_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define SAI3_SAI_BCLRFR_CAFSDET          (0x1UL << 5) 
#define SAI3_SAI_BCLRFR_CAFSDET_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define SAI3_SAI_BCLRFR_CLFSDET          (0x1UL << 6) 
#define SAI3_SAI_BCLRFR_CLFSDET_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define SAI3_SAI_BDR_DATA          (0xFFFFFFFFUL << 0) 
#define SAI3_SAI_BDR_DATA_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define SAI3_SAI_PDMCR_PDMEN          (0x1UL << 0) 
#define SAI3_SAI_PDMCR_PDMEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define SAI3_SAI_PDMCR_MICNBR          (0x3UL << 4) 
#define SAI3_SAI_PDMCR_MICNBR_VAL(X) (((uint32_t)(X) & 0x3UL) << 4)
#define SAI3_SAI_PDMCR_CKEN1          (0x1UL << 8) 
#define SAI3_SAI_PDMCR_CKEN1_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define SAI3_SAI_PDMCR_CKEN2          (0x1UL << 9) 
#define SAI3_SAI_PDMCR_CKEN2_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define SAI3_SAI_PDMCR_CKEN3          (0x1UL << 10) 
#define SAI3_SAI_PDMCR_CKEN3_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define SAI3_SAI_PDMCR_CKEN4          (0x1UL << 11) 
#define SAI3_SAI_PDMCR_CKEN4_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define SAI3_SAI_PDMDLY_DLYM1L          (0x7UL << 0) 
#define SAI3_SAI_PDMDLY_DLYM1L_VAL(X) (((uint32_t)(X) & 0x7UL) << 0)
#define SAI3_SAI_PDMDLY_DLYM1R          (0x7UL << 4) 
#define SAI3_SAI_PDMDLY_DLYM1R_VAL(X) (((uint32_t)(X) & 0x7UL) << 4)
#define SAI3_SAI_PDMDLY_DLYM2L          (0x7UL << 8) 
#define SAI3_SAI_PDMDLY_DLYM2L_VAL(X) (((uint32_t)(X) & 0x7UL) << 8)
#define SAI3_SAI_PDMDLY_DLYM2R          (0x7UL << 12) 
#define SAI3_SAI_PDMDLY_DLYM2R_VAL(X) (((uint32_t)(X) & 0x7UL) << 12)
#define SAI3_SAI_PDMDLY_DLYM3L          (0x7UL << 16) 
#define SAI3_SAI_PDMDLY_DLYM3L_VAL(X) (((uint32_t)(X) & 0x7UL) << 16)
#define SAI3_SAI_PDMDLY_DLYM3R          (0x7UL << 20) 
#define SAI3_SAI_PDMDLY_DLYM3R_VAL(X) (((uint32_t)(X) & 0x7UL) << 20)
#define SAI3_SAI_PDMDLY_DLYM4L          (0x7UL << 24) 
#define SAI3_SAI_PDMDLY_DLYM4L_VAL(X) (((uint32_t)(X) & 0x7UL) << 24)
#define SAI3_SAI_PDMDLY_DLYM4R          (0x7UL << 28) 
#define SAI3_SAI_PDMDLY_DLYM4R_VAL(X) (((uint32_t)(X) & 0x7UL) << 28)

#define SAI3  ((struct SAI3*)(0x40016000UL))
struct SDMMC1 {
  volatile uint32_t POWER;
  volatile uint32_t CLKCR;
  volatile uint32_t ARGR;
  volatile uint32_t CMDR;
  volatile const uint32_t RESPCMDR;
  volatile const uint32_t RESP1R;
  volatile const uint32_t RESP2R;
  volatile const uint32_t RESP3R;
  volatile const uint32_t RESP4R;
  volatile uint32_t DTIMER;
  volatile uint32_t DLENR;
  volatile uint32_t DCTRL;
  volatile const uint32_t DCNTR;
  volatile const uint32_t STAR;
  volatile uint32_t ICR;
  volatile uint32_t MASKR;
  volatile uint32_t ACKTIMER;
  const volatile uint32_t RESERVED80[3];
  volatile uint32_t IDMACTRLR;
  volatile uint32_t IDMABSIZER;
  volatile uint32_t IDMABASE0R;
  volatile uint32_t IDMABASE1R;
  const volatile uint32_t RESERVED128[8];
  volatile uint32_t FIFOR;
  const volatile uint32_t RESERVED1012[220];
  volatile const uint32_t VER;
  volatile const uint32_t ID;
};
