via/viaems/src/platforms/stm32h743/device.h
#define SDMMC1_POWER_PWRCTRL          (0x3UL << 0) 
#define SDMMC1_POWER_PWRCTRL_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define SDMMC1_POWER_VSWITCH          (0x1UL << 2) 
#define SDMMC1_POWER_VSWITCH_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define SDMMC1_POWER_VSWITCHEN          (0x1UL << 3) 
#define SDMMC1_POWER_VSWITCHEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define SDMMC1_POWER_DIRPOL          (0x1UL << 4) 
#define SDMMC1_POWER_DIRPOL_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define SDMMC1_CLKCR_CLKDIV          (0x3FFUL << 0) 
#define SDMMC1_CLKCR_CLKDIV_VAL(X) (((uint32_t)(X) & 0x3FFUL) << 0)
#define SDMMC1_CLKCR_PWRSAV          (0x1UL << 12) 
#define SDMMC1_CLKCR_PWRSAV_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define SDMMC1_CLKCR_WIDBUS          (0x3UL << 14) 
#define SDMMC1_CLKCR_WIDBUS_VAL(X) (((uint32_t)(X) & 0x3UL) << 14)
#define SDMMC1_CLKCR_NEGEDGE          (0x1UL << 16) 
#define SDMMC1_CLKCR_NEGEDGE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define SDMMC1_CLKCR_HWFC_EN          (0x1UL << 17) 
#define SDMMC1_CLKCR_HWFC_EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define SDMMC1_CLKCR_DDR          (0x1UL << 18) 
#define SDMMC1_CLKCR_DDR_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define SDMMC1_CLKCR_BUSSPEED          (0x1UL << 19) 
#define SDMMC1_CLKCR_BUSSPEED_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define SDMMC1_CLKCR_SELCLKRX          (0x3UL << 20) 
#define SDMMC1_CLKCR_SELCLKRX_VAL(X) (((uint32_t)(X) & 0x3UL) << 20)
#define SDMMC1_ARGR_CMDARG          (0xFFFFFFFFUL << 0) 
#define SDMMC1_ARGR_CMDARG_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define SDMMC1_CMDR_CMDINDEX          (0x3FUL << 0) 
#define SDMMC1_CMDR_CMDINDEX_VAL(X) (((uint32_t)(X) & 0x3FUL) << 0)
#define SDMMC1_CMDR_CMDTRANS          (0x1UL << 6) 
#define SDMMC1_CMDR_CMDTRANS_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define SDMMC1_CMDR_CMDSTOP          (0x1UL << 7) 
#define SDMMC1_CMDR_CMDSTOP_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define SDMMC1_CMDR_WAITRESP          (0x3UL << 8) 
#define SDMMC1_CMDR_WAITRESP_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define SDMMC1_CMDR_WAITINT          (0x1UL << 10) 
#define SDMMC1_CMDR_WAITINT_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define SDMMC1_CMDR_WAITPEND          (0x1UL << 11) 
#define SDMMC1_CMDR_WAITPEND_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define SDMMC1_CMDR_CPSMEN          (0x1UL << 12) 
#define SDMMC1_CMDR_CPSMEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define SDMMC1_CMDR_DTHOLD          (0x1UL << 13) 
#define SDMMC1_CMDR_DTHOLD_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define SDMMC1_CMDR_BOOTMODE          (0x1UL << 14) 
#define SDMMC1_CMDR_BOOTMODE_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define SDMMC1_CMDR_BOOTEN          (0x1UL << 15) 
#define SDMMC1_CMDR_BOOTEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define SDMMC1_CMDR_CMDSUSPEND          (0x1UL << 16) 
#define SDMMC1_CMDR_CMDSUSPEND_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define SDMMC1_RESP1R_CARDSTATUS1          (0xFFFFFFFFUL << 0) 
#define SDMMC1_RESP1R_CARDSTATUS1_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define SDMMC1_RESP2R_CARDSTATUS2          (0xFFFFFFFFUL << 0) 
#define SDMMC1_RESP2R_CARDSTATUS2_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define SDMMC1_RESP3R_CARDSTATUS3          (0xFFFFFFFFUL << 0) 
#define SDMMC1_RESP3R_CARDSTATUS3_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define SDMMC1_RESP4R_CARDSTATUS4          (0xFFFFFFFFUL << 0) 
#define SDMMC1_RESP4R_CARDSTATUS4_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define SDMMC1_DTIMER_DATATIME          (0xFFFFFFFFUL << 0) 
#define SDMMC1_DTIMER_DATATIME_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define SDMMC1_DLENR_DATALENGTH          (0x1FFFFFFUL << 0) 
#define SDMMC1_DLENR_DATALENGTH_VAL(X) (((uint32_t)(X) & 0x1FFFFFFUL) << 0)
#define SDMMC1_DCTRL_DTEN          (0x1UL << 0) 
#define SDMMC1_DCTRL_DTEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define SDMMC1_DCTRL_DTDIR          (0x1UL << 1) 
#define SDMMC1_DCTRL_DTDIR_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define SDMMC1_DCTRL_DTMODE          (0x3UL << 2) 
#define SDMMC1_DCTRL_DTMODE_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define SDMMC1_DCTRL_DBLOCKSIZE          (0xFUL << 4) 
#define SDMMC1_DCTRL_DBLOCKSIZE_VAL(X) (((uint32_t)(X) & 0xFUL) << 4)
#define SDMMC1_DCTRL_RWSTART          (0x1UL << 8) 
#define SDMMC1_DCTRL_RWSTART_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define SDMMC1_DCTRL_RWSTOP          (0x1UL << 9) 
#define SDMMC1_DCTRL_RWSTOP_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define SDMMC1_DCTRL_RWMOD          (0x1UL << 10) 
#define SDMMC1_DCTRL_RWMOD_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define SDMMC1_DCTRL_SDIOEN          (0x1UL << 11) 
#define SDMMC1_DCTRL_SDIOEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define SDMMC1_DCTRL_BOOTACKEN          (0x1UL << 12) 
#define SDMMC1_DCTRL_BOOTACKEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define SDMMC1_DCTRL_FIFORST          (0x1UL << 13) 
#define SDMMC1_DCTRL_FIFORST_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define SDMMC1_DCNTR_DATACOUNT          (0x1FFFFFFUL << 0) 
#define SDMMC1_DCNTR_DATACOUNT_VAL(X) (((uint32_t)(X) & 0x1FFFFFFUL) << 0)
#define SDMMC1_STAR_CCRCFAIL          (0x1UL << 0) 
#define SDMMC1_STAR_CCRCFAIL_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define SDMMC1_STAR_DCRCFAIL          (0x1UL << 1) 
#define SDMMC1_STAR_DCRCFAIL_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define SDMMC1_STAR_CTIMEOUT          (0x1UL << 2) 
#define SDMMC1_STAR_CTIMEOUT_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define SDMMC1_STAR_DTIMEOUT          (0x1UL << 3) 
#define SDMMC1_STAR_DTIMEOUT_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define SDMMC1_STAR_TXUNDERR          (0x1UL << 4) 
#define SDMMC1_STAR_TXUNDERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define SDMMC1_STAR_RXOVERR          (0x1UL << 5) 
#define SDMMC1_STAR_RXOVERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define SDMMC1_STAR_CMDREND          (0x1UL << 6) 
#define SDMMC1_STAR_CMDREND_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define SDMMC1_STAR_CMDSENT          (0x1UL << 7) 
#define SDMMC1_STAR_CMDSENT_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define SDMMC1_STAR_DATAEND          (0x1UL << 8) 
#define SDMMC1_STAR_DATAEND_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define SDMMC1_STAR_DHOLD          (0x1UL << 9) 
#define SDMMC1_STAR_DHOLD_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define SDMMC1_STAR_DBCKEND          (0x1UL << 10) 
#define SDMMC1_STAR_DBCKEND_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define SDMMC1_STAR_DABORT          (0x1UL << 11) 
#define SDMMC1_STAR_DABORT_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define SDMMC1_STAR_DPSMACT          (0x1UL << 12) 
#define SDMMC1_STAR_DPSMACT_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define SDMMC1_STAR_CPSMACT          (0x1UL << 13) 
#define SDMMC1_STAR_CPSMACT_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define SDMMC1_STAR_TXFIFOHE          (0x1UL << 14) 
#define SDMMC1_STAR_TXFIFOHE_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define SDMMC1_STAR_RXFIFOHF          (0x1UL << 15) 
#define SDMMC1_STAR_RXFIFOHF_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define SDMMC1_STAR_TXFIFOF          (0x1UL << 16) 
#define SDMMC1_STAR_TXFIFOF_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define SDMMC1_STAR_RXFIFOF          (0x1UL << 17) 
#define SDMMC1_STAR_RXFIFOF_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define SDMMC1_STAR_TXFIFOE          (0x1UL << 18) 
#define SDMMC1_STAR_TXFIFOE_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define SDMMC1_STAR_RXFIFOE          (0x1UL << 19) 
#define SDMMC1_STAR_RXFIFOE_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define SDMMC1_STAR_BUSYD0          (0x1UL << 20) 
#define SDMMC1_STAR_BUSYD0_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define SDMMC1_STAR_BUSYD0END          (0x1UL << 21) 
#define SDMMC1_STAR_BUSYD0END_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define SDMMC1_STAR_SDIOIT          (0x1UL << 22) 
#define SDMMC1_STAR_SDIOIT_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define SDMMC1_STAR_ACKFAIL          (0x1UL << 23) 
#define SDMMC1_STAR_ACKFAIL_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define SDMMC1_STAR_ACKTIMEOUT          (0x1UL << 24) 
#define SDMMC1_STAR_ACKTIMEOUT_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define SDMMC1_STAR_VSWEND          (0x1UL << 25) 
#define SDMMC1_STAR_VSWEND_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define SDMMC1_STAR_CKSTOP          (0x1UL << 26) 
#define SDMMC1_STAR_CKSTOP_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define SDMMC1_STAR_IDMATE          (0x1UL << 27) 
#define SDMMC1_STAR_IDMATE_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define SDMMC1_STAR_IDMABTC          (0x1UL << 28) 
#define SDMMC1_STAR_IDMABTC_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define SDMMC1_ICR_CCRCFAILC          (0x1UL << 0) 
#define SDMMC1_ICR_CCRCFAILC_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define SDMMC1_ICR_DCRCFAILC          (0x1UL << 1) 
#define SDMMC1_ICR_DCRCFAILC_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define SDMMC1_ICR_CTIMEOUTC          (0x1UL << 2) 
#define SDMMC1_ICR_CTIMEOUTC_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define SDMMC1_ICR_DTIMEOUTC          (0x1UL << 3) 
#define SDMMC1_ICR_DTIMEOUTC_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define SDMMC1_ICR_TXUNDERRC          (0x1UL << 4) 
#define SDMMC1_ICR_TXUNDERRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define SDMMC1_ICR_RXOVERRC          (0x1UL << 5) 
#define SDMMC1_ICR_RXOVERRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define SDMMC1_ICR_CMDRENDC          (0x1UL << 6) 
#define SDMMC1_ICR_CMDRENDC_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define SDMMC1_ICR_CMDSENTC          (0x1UL << 7) 
#define SDMMC1_ICR_CMDSENTC_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define SDMMC1_ICR_DATAENDC          (0x1UL << 8) 
#define SDMMC1_ICR_DATAENDC_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define SDMMC1_ICR_DHOLDC          (0x1UL << 9) 
#define SDMMC1_ICR_DHOLDC_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define SDMMC1_ICR_DBCKENDC          (0x1UL << 10) 
#define SDMMC1_ICR_DBCKENDC_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define SDMMC1_ICR_DABORTC          (0x1UL << 11) 
#define SDMMC1_ICR_DABORTC_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define SDMMC1_ICR_BUSYD0ENDC          (0x1UL << 21) 
#define SDMMC1_ICR_BUSYD0ENDC_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define SDMMC1_ICR_SDIOITC          (0x1UL << 22) 
#define SDMMC1_ICR_SDIOITC_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define SDMMC1_ICR_ACKFAILC          (0x1UL << 23) 
#define SDMMC1_ICR_ACKFAILC_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define SDMMC1_ICR_ACKTIMEOUTC          (0x1UL << 24) 
#define SDMMC1_ICR_ACKTIMEOUTC_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define SDMMC1_ICR_VSWENDC          (0x1UL << 25) 
#define SDMMC1_ICR_VSWENDC_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define SDMMC1_ICR_CKSTOPC          (0x1UL << 26) 
#define SDMMC1_ICR_CKSTOPC_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define SDMMC1_ICR_IDMATEC          (0x1UL << 27) 
#define SDMMC1_ICR_IDMATEC_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define SDMMC1_ICR_IDMABTCC          (0x1UL << 28) 
#define SDMMC1_ICR_IDMABTCC_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define SDMMC1_MASKR_CCRCFAILIE          (0x1UL << 0) 
#define SDMMC1_MASKR_CCRCFAILIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define SDMMC1_MASKR_DCRCFAILIE          (0x1UL << 1) 
#define SDMMC1_MASKR_DCRCFAILIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define SDMMC1_MASKR_CTIMEOUTIE          (0x1UL << 2) 
#define SDMMC1_MASKR_CTIMEOUTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define SDMMC1_MASKR_DTIMEOUTIE          (0x1UL << 3) 
#define SDMMC1_MASKR_DTIMEOUTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define SDMMC1_MASKR_TXUNDERRIE          (0x1UL << 4) 
#define SDMMC1_MASKR_TXUNDERRIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define SDMMC1_MASKR_RXOVERRIE          (0x1UL << 5) 
#define SDMMC1_MASKR_RXOVERRIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define SDMMC1_MASKR_CMDRENDIE          (0x1UL << 6) 
#define SDMMC1_MASKR_CMDRENDIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define SDMMC1_MASKR_CMDSENTIE          (0x1UL << 7) 
#define SDMMC1_MASKR_CMDSENTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define SDMMC1_MASKR_DATAENDIE          (0x1UL << 8) 
#define SDMMC1_MASKR_DATAENDIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define SDMMC1_MASKR_DHOLDIE          (0x1UL << 9) 
#define SDMMC1_MASKR_DHOLDIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define SDMMC1_MASKR_DBCKENDIE          (0x1UL << 10) 
#define SDMMC1_MASKR_DBCKENDIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define SDMMC1_MASKR_DABORTIE          (0x1UL << 11) 
#define SDMMC1_MASKR_DABORTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define SDMMC1_MASKR_TXFIFOHEIE          (0x1UL << 14) 
#define SDMMC1_MASKR_TXFIFOHEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define SDMMC1_MASKR_RXFIFOHFIE          (0x1UL << 15) 
#define SDMMC1_MASKR_RXFIFOHFIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define SDMMC1_MASKR_RXFIFOFIE          (0x1UL << 17) 
#define SDMMC1_MASKR_RXFIFOFIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define SDMMC1_MASKR_TXFIFOEIE          (0x1UL << 18) 
#define SDMMC1_MASKR_TXFIFOEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define SDMMC1_MASKR_BUSYD0ENDIE          (0x1UL << 21) 
#define SDMMC1_MASKR_BUSYD0ENDIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define SDMMC1_MASKR_SDIOITIE          (0x1UL << 22) 
#define SDMMC1_MASKR_SDIOITIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define SDMMC1_MASKR_ACKFAILIE          (0x1UL << 23) 
#define SDMMC1_MASKR_ACKFAILIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define SDMMC1_MASKR_ACKTIMEOUTIE          (0x1UL << 24) 
#define SDMMC1_MASKR_ACKTIMEOUTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define SDMMC1_MASKR_VSWENDIE          (0x1UL << 25) 
#define SDMMC1_MASKR_VSWENDIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define SDMMC1_MASKR_CKSTOPIE          (0x1UL << 26) 
#define SDMMC1_MASKR_CKSTOPIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define SDMMC1_MASKR_IDMABTCIE          (0x1UL << 28) 
#define SDMMC1_MASKR_IDMABTCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define SDMMC1_ACKTIMER_ACKTIME          (0x1FFFFFFUL << 0) 
#define SDMMC1_ACKTIMER_ACKTIME_VAL(X) (((uint32_t)(X) & 0x1FFFFFFUL) << 0)
#define SDMMC1_IDMACTRLR_IDMAEN          (0x1UL << 0) 
#define SDMMC1_IDMACTRLR_IDMAEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define SDMMC1_IDMACTRLR_IDMABMODE          (0x1UL << 1) 
#define SDMMC1_IDMACTRLR_IDMABMODE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define SDMMC1_IDMACTRLR_IDMABACT          (0x1UL << 2) 
#define SDMMC1_IDMACTRLR_IDMABACT_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define SDMMC1_IDMABSIZER_IDMABNDT          (0xFFUL << 5) 
#define SDMMC1_IDMABSIZER_IDMABNDT_VAL(X) (((uint32_t)(X) & 0xFFUL) << 5)
#define SDMMC1_IDMABASE0R_IDMABASE0          (0xFFFFFFFFUL << 0) 
#define SDMMC1_IDMABASE0R_IDMABASE0_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define SDMMC1_IDMABASE1R_IDMABASE1          (0xFFFFFFFFUL << 0) 
#define SDMMC1_IDMABASE1R_IDMABASE1_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define SDMMC1_FIFOR_FIFODATA          (0xFFFFFFFFUL << 0) 
#define SDMMC1_FIFOR_FIFODATA_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define SDMMC1_VER_MINREV          (0xFUL << 0) 
#define SDMMC1_VER_MINREV_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define SDMMC1_VER_MAJREV          (0xFUL << 4) 
#define SDMMC1_VER_MAJREV_VAL(X) (((uint32_t)(X) & 0xFUL) << 4)
#define SDMMC1_ID_IP_ID          (0xFFFFFFFFUL << 0) 
#define SDMMC1_ID_IP_ID_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define SDMMC1_RESPCMDR_RESPCMD          (0x3FUL << 0) 
#define SDMMC1_RESPCMDR_RESPCMD_VAL(X) (((uint32_t)(X) & 0x3FUL) << 0)

#define SDMMC1  ((struct SDMMC1*)(0x52007000UL))
struct SDMMC2 {
  volatile uint32_t POWER;
  volatile uint32_t CLKCR;
  volatile uint32_t ARGR;
  volatile uint32_t CMDR;
  volatile const uint32_t RESPCMDR;
  volatile const uint32_t RESP1R;
  volatile const uint32_t RESP2R;
  volatile const uint32_t RESP3R;
  volatile const uint32_t RESP4R;
  volatile uint32_t DTIMER;
  volatile uint32_t DLENR;
  volatile uint32_t DCTRL;
  volatile const uint32_t DCNTR;
  volatile const uint32_t STAR;
  volatile uint32_t ICR;
  volatile uint32_t MASKR;
  volatile uint32_t ACKTIMER;
  const volatile uint32_t RESERVED80[3];
  volatile uint32_t IDMACTRLR;
  volatile uint32_t IDMABSIZER;
  volatile uint32_t IDMABASE0R;
  volatile uint32_t IDMABASE1R;
  const volatile uint32_t RESERVED128[8];
  volatile uint32_t FIFOR;
  const volatile uint32_t RESERVED1012[220];
  volatile const uint32_t VER;
  volatile const uint32_t ID;
};
