via/viaems/src/platforms/stm32h743/device.h
#define VREFBUF  ((struct VREFBUF*)(0x58003C00UL))
struct IWDG {
  volatile uint32_t KR;
  volatile uint32_t PR;
  volatile uint32_t RLR;
  volatile const uint32_t SR;
  volatile uint32_t WINR;
};
#define IWDG_KR_KEY          (0xFFFFUL << 0) 
#define IWDG_KR_KEY_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define IWDG_PR_PR          (0x7UL << 0) 
#define IWDG_PR_PR_VAL(X) (((uint32_t)(X) & 0x7UL) << 0)
#define IWDG_RLR_RL          (0xFFFUL << 0) 
#define IWDG_RLR_RL_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 0)
#define IWDG_SR_PVU          (0x1UL << 0) 
#define IWDG_SR_PVU_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define IWDG_SR_RVU          (0x1UL << 1) 
#define IWDG_SR_RVU_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define IWDG_SR_WVU          (0x1UL << 2) 
#define IWDG_SR_WVU_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define IWDG_WINR_WIN          (0xFFFUL << 0) 
#define IWDG_WINR_WIN_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 0)

#define IWDG  ((struct IWDG*)(0x58004800UL))
struct WWDG {
  volatile uint32_t CR;
  volatile uint32_t CFR;
  volatile uint32_t SR;
};
#define WWDG_CR_T          (0x7FUL << 0) 
#define WWDG_CR_T_VAL(X) (((uint32_t)(X) & 0x7FUL) << 0)
#define WWDG_CR_WDGA          (0x1UL << 7) 
#define WWDG_CR_WDGA_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define WWDG_CFR_W          (0x7FUL << 0) 
#define WWDG_CFR_W_VAL(X) (((uint32_t)(X) & 0x7FUL) << 0)
#define WWDG_CFR_WDGTB          (0x3UL << 11) 
#define WWDG_CFR_WDGTB_VAL(X) (((uint32_t)(X) & 0x3UL) << 11)
#define WWDG_CFR_EWI          (0x1UL << 9) 
#define WWDG_CFR_EWI_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define WWDG_SR_EWIF          (0x1UL << 0) 
#define WWDG_SR_EWIF_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)

#define WWDG  ((struct WWDG*)(0x50003000UL))
struct PWR {
  volatile uint32_t CR1;
  volatile const uint32_t CSR1;
  volatile uint32_t CR2;
  volatile uint32_t CR3;
  volatile uint32_t CPUCR;
  const volatile uint32_t RESERVED24[1];
  volatile uint32_t D3CR;
  const volatile uint32_t RESERVED32[1];
  volatile uint32_t WKUPCR;
  volatile uint32_t WKUPFR;
  volatile uint32_t WKUPEPR;
};
#define PWR_CR1_LPDS          (0x1UL << 0) 
#define PWR_CR1_LPDS_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define PWR_CR1_PVDE          (0x1UL << 4) 
#define PWR_CR1_PVDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define PWR_CR1_PLS          (0x7UL << 5) 
#define PWR_CR1_PLS_VAL(X) (((uint32_t)(X) & 0x7UL) << 5)
#define PWR_CR1_DBP          (0x1UL << 8) 
#define PWR_CR1_DBP_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define PWR_CR1_FLPS          (0x1UL << 9) 
#define PWR_CR1_FLPS_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define PWR_CR1_SVOS          (0x3UL << 14) 
#define PWR_CR1_SVOS_VAL(X) (((uint32_t)(X) & 0x3UL) << 14)
#define PWR_CR1_AVDEN          (0x1UL << 16) 
#define PWR_CR1_AVDEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define PWR_CR1_ALS          (0x3UL << 17) 
#define PWR_CR1_ALS_VAL(X) (((uint32_t)(X) & 0x3UL) << 17)
#define PWR_CSR1_PVDO          (0x1UL << 4) 
#define PWR_CSR1_PVDO_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define PWR_CSR1_ACTVOSRDY          (0x1UL << 13) 
#define PWR_CSR1_ACTVOSRDY_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define PWR_CSR1_ACTVOS          (0x3UL << 14) 
#define PWR_CSR1_ACTVOS_VAL(X) (((uint32_t)(X) & 0x3UL) << 14)
#define PWR_CSR1_AVDO          (0x1UL << 16) 
#define PWR_CSR1_AVDO_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define PWR_CR2_BREN          (0x1UL << 0) 
#define PWR_CR2_BREN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define PWR_CR2_MONEN          (0x1UL << 4) 
#define PWR_CR2_MONEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define PWR_CR2_BRRDY          (0x1UL << 16) 
#define PWR_CR2_BRRDY_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define PWR_CR2_VBATL          (0x1UL << 20) 
#define PWR_CR2_VBATL_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define PWR_CR2_VBATH          (0x1UL << 21) 
#define PWR_CR2_VBATH_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define PWR_CR2_TEMPL          (0x1UL << 22) 
#define PWR_CR2_TEMPL_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define PWR_CR2_TEMPH          (0x1UL << 23) 
#define PWR_CR2_TEMPH_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define PWR_CR3_BYPASS          (0x1UL << 0) 
#define PWR_CR3_BYPASS_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define PWR_CR3_LDOEN          (0x1UL << 1) 
#define PWR_CR3_LDOEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define PWR_CR3_SCUEN          (0x1UL << 2) 
#define PWR_CR3_SCUEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define PWR_CR3_VBE          (0x1UL << 8) 
#define PWR_CR3_VBE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define PWR_CR3_VBRS          (0x1UL << 9) 
#define PWR_CR3_VBRS_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define PWR_CR3_USB33DEN          (0x1UL << 24) 
#define PWR_CR3_USB33DEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define PWR_CR3_USBREGEN          (0x1UL << 25) 
#define PWR_CR3_USBREGEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define PWR_CR3_USB33RDY          (0x1UL << 26) 
#define PWR_CR3_USB33RDY_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define PWR_CPUCR_PDDS_D1          (0x1UL << 0) 
#define PWR_CPUCR_PDDS_D1_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define PWR_CPUCR_PDDS_D2          (0x1UL << 1) 
#define PWR_CPUCR_PDDS_D2_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define PWR_CPUCR_PDDS_D3          (0x1UL << 2) 
#define PWR_CPUCR_PDDS_D3_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define PWR_CPUCR_STOPF          (0x1UL << 5) 
#define PWR_CPUCR_STOPF_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define PWR_CPUCR_SBF          (0x1UL << 6) 
#define PWR_CPUCR_SBF_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define PWR_CPUCR_SBF_D1          (0x1UL << 7) 
#define PWR_CPUCR_SBF_D1_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define PWR_CPUCR_SBF_D2          (0x1UL << 8) 
#define PWR_CPUCR_SBF_D2_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define PWR_CPUCR_CSSF          (0x1UL << 9) 
#define PWR_CPUCR_CSSF_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define PWR_CPUCR_RUN_D3          (0x1UL << 11) 
#define PWR_CPUCR_RUN_D3_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define PWR_D3CR_VOSRDY          (0x1UL << 13) 
#define PWR_D3CR_VOSRDY_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define PWR_D3CR_VOS          (0x3UL << 14) 
#define PWR_D3CR_VOS_VAL(X) (((uint32_t)(X) & 0x3UL) << 14)
#define PWR_WKUPCR_WKUPC          (0x3FUL << 0) 
#define PWR_WKUPCR_WKUPC_VAL(X) (((uint32_t)(X) & 0x3FUL) << 0)
#define PWR_WKUPFR_WKUPF1          (0x1UL << 0) 
#define PWR_WKUPFR_WKUPF1_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define PWR_WKUPFR_WKUPF2          (0x1UL << 1) 
#define PWR_WKUPFR_WKUPF2_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define PWR_WKUPFR_WKUPF3          (0x1UL << 2) 
#define PWR_WKUPFR_WKUPF3_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define PWR_WKUPFR_WKUPF4          (0x1UL << 3) 
#define PWR_WKUPFR_WKUPF4_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define PWR_WKUPFR_WKUPF5          (0x1UL << 4) 
#define PWR_WKUPFR_WKUPF5_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define PWR_WKUPFR_WKUPF6          (0x1UL << 5) 
#define PWR_WKUPFR_WKUPF6_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define PWR_WKUPEPR_WKUPEN1          (0x1UL << 0) 
#define PWR_WKUPEPR_WKUPEN1_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define PWR_WKUPEPR_WKUPEN2          (0x1UL << 1) 
#define PWR_WKUPEPR_WKUPEN2_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define PWR_WKUPEPR_WKUPEN3          (0x1UL << 2) 
#define PWR_WKUPEPR_WKUPEN3_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define PWR_WKUPEPR_WKUPEN4          (0x1UL << 3) 
#define PWR_WKUPEPR_WKUPEN4_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define PWR_WKUPEPR_WKUPEN5          (0x1UL << 4) 
#define PWR_WKUPEPR_WKUPEN5_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define PWR_WKUPEPR_WKUPEN6          (0x1UL << 5) 
#define PWR_WKUPEPR_WKUPEN6_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define PWR_WKUPEPR_WKUPP1          (0x1UL << 8) 
#define PWR_WKUPEPR_WKUPP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define PWR_WKUPEPR_WKUPP2          (0x1UL << 9) 
#define PWR_WKUPEPR_WKUPP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define PWR_WKUPEPR_WKUPP3          (0x1UL << 10) 
#define PWR_WKUPEPR_WKUPP3_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define PWR_WKUPEPR_WKUPP4          (0x1UL << 11) 
#define PWR_WKUPEPR_WKUPP4_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define PWR_WKUPEPR_WKUPP5          (0x1UL << 12) 
#define PWR_WKUPEPR_WKUPP5_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define PWR_WKUPEPR_WKUPP6          (0x1UL << 13) 
#define PWR_WKUPEPR_WKUPP6_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define PWR_WKUPEPR_WKUPPUPD1          (0x3UL << 16) 
#define PWR_WKUPEPR_WKUPPUPD1_VAL(X) (((uint32_t)(X) & 0x3UL) << 16)
#define PWR_WKUPEPR_WKUPPUPD2          (0x3UL << 18) 
#define PWR_WKUPEPR_WKUPPUPD2_VAL(X) (((uint32_t)(X) & 0x3UL) << 18)
#define PWR_WKUPEPR_WKUPPUPD3          (0x3UL << 20) 
#define PWR_WKUPEPR_WKUPPUPD3_VAL(X) (((uint32_t)(X) & 0x3UL) << 20)
#define PWR_WKUPEPR_WKUPPUPD4          (0x3UL << 22) 
#define PWR_WKUPEPR_WKUPPUPD4_VAL(X) (((uint32_t)(X) & 0x3UL) << 22)
#define PWR_WKUPEPR_WKUPPUPD5          (0x3UL << 24) 
#define PWR_WKUPEPR_WKUPPUPD5_VAL(X) (((uint32_t)(X) & 0x3UL) << 24)
#define PWR_WKUPEPR_WKUPPUPD6          (0x3UL << 26) 
#define PWR_WKUPEPR_WKUPPUPD6_VAL(X) (((uint32_t)(X) & 0x3UL) << 26)

