via/viaems/src/platforms/stm32h743/device.h
#define SPI5_CR1_IOLOCK          (0x1UL << 16) 
#define SPI5_CR1_IOLOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define SPI5_CR1_TCRCI          (0x1UL << 15) 
#define SPI5_CR1_TCRCI_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define SPI5_CR1_RCRCI          (0x1UL << 14) 
#define SPI5_CR1_RCRCI_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define SPI5_CR1_CRC33_17          (0x1UL << 13) 
#define SPI5_CR1_CRC33_17_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define SPI5_CR1_SSI          (0x1UL << 12) 
#define SPI5_CR1_SSI_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define SPI5_CR1_HDDIR          (0x1UL << 11) 
#define SPI5_CR1_HDDIR_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define SPI5_CR1_CSUSP          (0x1UL << 10) 
#define SPI5_CR1_CSUSP_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define SPI5_CR1_CSTART          (0x1UL << 9) 
#define SPI5_CR1_CSTART_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define SPI5_CR1_MASRX          (0x1UL << 8) 
#define SPI5_CR1_MASRX_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define SPI5_CR1_SPE          (0x1UL << 0) 
#define SPI5_CR1_SPE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define SPI5_CR2_TSER          (0xFFFFUL << 16) 
#define SPI5_CR2_TSER_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define SPI5_CR2_TSIZE          (0xFFFFUL << 0) 
#define SPI5_CR2_TSIZE_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define SPI5_CFG1_MBR          (0x7UL << 28) 
#define SPI5_CFG1_MBR_VAL(X) (((uint32_t)(X) & 0x7UL) << 28)
#define SPI5_CFG1_CRCEN          (0x1UL << 22) 
#define SPI5_CFG1_CRCEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define SPI5_CFG1_CRCSIZE          (0x1FUL << 16) 
#define SPI5_CFG1_CRCSIZE_VAL(X) (((uint32_t)(X) & 0x1FUL) << 16)
#define SPI5_CFG1_TXDMAEN          (0x1UL << 15) 
#define SPI5_CFG1_TXDMAEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define SPI5_CFG1_RXDMAEN          (0x1UL << 14) 
#define SPI5_CFG1_RXDMAEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define SPI5_CFG1_UDRDET          (0x3UL << 11) 
#define SPI5_CFG1_UDRDET_VAL(X) (((uint32_t)(X) & 0x3UL) << 11)
#define SPI5_CFG1_UDRCFG          (0x3UL << 9) 
#define SPI5_CFG1_UDRCFG_VAL(X) (((uint32_t)(X) & 0x3UL) << 9)
#define SPI5_CFG1_FTHVL          (0xFUL << 5) 
#define SPI5_CFG1_FTHVL_VAL(X) (((uint32_t)(X) & 0xFUL) << 5)
#define SPI5_CFG1_DSIZE          (0x1FUL << 0) 
#define SPI5_CFG1_DSIZE_VAL(X) (((uint32_t)(X) & 0x1FUL) << 0)
#define SPI5_CFG2_AFCNTR          (0x1UL << 31) 
#define SPI5_CFG2_AFCNTR_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define SPI5_CFG2_SSOM          (0x1UL << 30) 
#define SPI5_CFG2_SSOM_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define SPI5_CFG2_SSOE          (0x1UL << 29) 
#define SPI5_CFG2_SSOE_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define SPI5_CFG2_SSIOP          (0x1UL << 28) 
#define SPI5_CFG2_SSIOP_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define SPI5_CFG2_SSM          (0x1UL << 26) 
#define SPI5_CFG2_SSM_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define SPI5_CFG2_CPOL          (0x1UL << 25) 
#define SPI5_CFG2_CPOL_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define SPI5_CFG2_CPHA          (0x1UL << 24) 
#define SPI5_CFG2_CPHA_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define SPI5_CFG2_LSBFRST          (0x1UL << 23) 
#define SPI5_CFG2_LSBFRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define SPI5_CFG2_MASTER          (0x1UL << 22) 
#define SPI5_CFG2_MASTER_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define SPI5_CFG2_SP          (0x7UL << 19) 
#define SPI5_CFG2_SP_VAL(X) (((uint32_t)(X) & 0x7UL) << 19)
#define SPI5_CFG2_COMM          (0x3UL << 17) 
#define SPI5_CFG2_COMM_VAL(X) (((uint32_t)(X) & 0x3UL) << 17)
#define SPI5_CFG2_IOSWP          (0x1UL << 15) 
#define SPI5_CFG2_IOSWP_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define SPI5_CFG2_MIDI          (0xFUL << 4) 
#define SPI5_CFG2_MIDI_VAL(X) (((uint32_t)(X) & 0xFUL) << 4)
#define SPI5_CFG2_MSSI          (0xFUL << 0) 
#define SPI5_CFG2_MSSI_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define SPI5_IER_TSERFIE          (0x1UL << 10) 
#define SPI5_IER_TSERFIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define SPI5_IER_MODFIE          (0x1UL << 9) 
#define SPI5_IER_MODFIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define SPI5_IER_TIFREIE          (0x1UL << 8) 
#define SPI5_IER_TIFREIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define SPI5_IER_CRCEIE          (0x1UL << 7) 
#define SPI5_IER_CRCEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define SPI5_IER_OVRIE          (0x1UL << 6) 
#define SPI5_IER_OVRIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define SPI5_IER_UDRIE          (0x1UL << 5) 
#define SPI5_IER_UDRIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define SPI5_IER_TXTFIE          (0x1UL << 4) 
#define SPI5_IER_TXTFIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define SPI5_IER_EOTIE          (0x1UL << 3) 
#define SPI5_IER_EOTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define SPI5_IER_DPXPIE          (0x1UL << 2) 
#define SPI5_IER_DPXPIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define SPI5_IER_TXPIE          (0x1UL << 1) 
#define SPI5_IER_TXPIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define SPI5_IER_RXPIE          (0x1UL << 0) 
#define SPI5_IER_RXPIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define SPI5_SR_CTSIZE          (0xFFFFUL << 16) 
#define SPI5_SR_CTSIZE_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define SPI5_SR_RXWNE          (0x1UL << 15) 
#define SPI5_SR_RXWNE_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define SPI5_SR_RXPLVL          (0x3UL << 13) 
#define SPI5_SR_RXPLVL_VAL(X) (((uint32_t)(X) & 0x3UL) << 13)
#define SPI5_SR_TXC          (0x1UL << 12) 
#define SPI5_SR_TXC_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define SPI5_SR_SUSP          (0x1UL << 11) 
#define SPI5_SR_SUSP_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define SPI5_SR_TSERF          (0x1UL << 10) 
#define SPI5_SR_TSERF_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define SPI5_SR_MODF          (0x1UL << 9) 
#define SPI5_SR_MODF_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define SPI5_SR_TIFRE          (0x1UL << 8) 
#define SPI5_SR_TIFRE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define SPI5_SR_CRCE          (0x1UL << 7) 
#define SPI5_SR_CRCE_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define SPI5_SR_OVR          (0x1UL << 6) 
#define SPI5_SR_OVR_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define SPI5_SR_UDR          (0x1UL << 5) 
#define SPI5_SR_UDR_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define SPI5_SR_TXTF          (0x1UL << 4) 
#define SPI5_SR_TXTF_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define SPI5_SR_EOT          (0x1UL << 3) 
#define SPI5_SR_EOT_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define SPI5_SR_DXP          (0x1UL << 2) 
#define SPI5_SR_DXP_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define SPI5_SR_TXP          (0x1UL << 1) 
#define SPI5_SR_TXP_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define SPI5_SR_RXP          (0x1UL << 0) 
#define SPI5_SR_RXP_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define SPI5_IFCR_SUSPC          (0x1UL << 11) 
#define SPI5_IFCR_SUSPC_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define SPI5_IFCR_TSERFC          (0x1UL << 10) 
#define SPI5_IFCR_TSERFC_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define SPI5_IFCR_MODFC          (0x1UL << 9) 
#define SPI5_IFCR_MODFC_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define SPI5_IFCR_TIFREC          (0x1UL << 8) 
#define SPI5_IFCR_TIFREC_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define SPI5_IFCR_CRCEC          (0x1UL << 7) 
#define SPI5_IFCR_CRCEC_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define SPI5_IFCR_OVRC          (0x1UL << 6) 
#define SPI5_IFCR_OVRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define SPI5_IFCR_UDRC          (0x1UL << 5) 
#define SPI5_IFCR_UDRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define SPI5_IFCR_TXTFC          (0x1UL << 4) 
#define SPI5_IFCR_TXTFC_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define SPI5_IFCR_EOTC          (0x1UL << 3) 
#define SPI5_IFCR_EOTC_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define SPI5_TXDR_TXDR          (0xFFFFFFFFUL << 0) 
#define SPI5_TXDR_TXDR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define SPI5_RXDR_RXDR          (0xFFFFFFFFUL << 0) 
#define SPI5_RXDR_RXDR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define SPI5_CRCPOLY_CRCPOLY          (0xFFFFFFFFUL << 0) 
#define SPI5_CRCPOLY_CRCPOLY_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define SPI5_TXCRC_TXCRC          (0xFFFFFFFFUL << 0) 
#define SPI5_TXCRC_TXCRC_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define SPI5_RXCRC_RXCRC          (0xFFFFFFFFUL << 0) 
#define SPI5_RXCRC_RXCRC_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define SPI5_UDRDR_UDRDR          (0xFFFFFFFFUL << 0) 
#define SPI5_UDRDR_UDRDR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define SPI5_CGFR_MCKOE          (0x1UL << 25) 
#define SPI5_CGFR_MCKOE_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define SPI5_CGFR_ODD          (0x1UL << 24) 
#define SPI5_CGFR_ODD_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define SPI5_CGFR_I2SDIV          (0xFFUL << 16) 
#define SPI5_CGFR_I2SDIV_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define SPI5_CGFR_DATFMT          (0x1UL << 14) 
#define SPI5_CGFR_DATFMT_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define SPI5_CGFR_WSINV          (0x1UL << 13) 
#define SPI5_CGFR_WSINV_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define SPI5_CGFR_FIXCH          (0x1UL << 12) 
#define SPI5_CGFR_FIXCH_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define SPI5_CGFR_CKPOL          (0x1UL << 11) 
#define SPI5_CGFR_CKPOL_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define SPI5_CGFR_CHLEN          (0x1UL << 10) 
#define SPI5_CGFR_CHLEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define SPI5_CGFR_DATLEN          (0x3UL << 8) 
#define SPI5_CGFR_DATLEN_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define SPI5_CGFR_PCMSYNC          (0x1UL << 7) 
#define SPI5_CGFR_PCMSYNC_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define SPI5_CGFR_I2SSTD          (0x3UL << 4) 
#define SPI5_CGFR_I2SSTD_VAL(X) (((uint32_t)(X) & 0x3UL) << 4)
#define SPI5_CGFR_I2SCFG          (0x7UL << 1) 
#define SPI5_CGFR_I2SCFG_VAL(X) (((uint32_t)(X) & 0x7UL) << 1)
#define SPI5_CGFR_I2SMOD          (0x1UL << 0) 
#define SPI5_CGFR_I2SMOD_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)

#define SPI5  ((struct SPI5*)(0x40015000UL))
struct SPI6 {
  volatile uint32_t CR1;
  volatile uint32_t CR2;
  volatile uint32_t CFG1;
  volatile uint32_t CFG2;
  volatile uint32_t IER;
  volatile const uint32_t SR;
  volatile uint32_t IFCR;
  const volatile uint32_t RESERVED32[1];
  volatile uint32_t TXDR;
  const volatile uint32_t RESERVED48[3];
  volatile const uint32_t RXDR;
  const volatile uint32_t RESERVED64[3];
  volatile uint32_t CRCPOLY;
  volatile uint32_t TXCRC;
  volatile uint32_t RXCRC;
  volatile uint32_t UDRDR;
  volatile uint32_t CGFR;
};
