via/viaems/src/platforms/stm32h743/device.h
#define SPI6  ((struct SPI6*)(0x58001400UL))
struct LTDC {
  volatile uint32_t SSCR;
  volatile uint32_t BPCR;
  volatile uint32_t AWCR;
  volatile uint32_t TWCR;
  volatile uint32_t GCR;
  const volatile uint32_t RESERVED36[2];
  volatile uint32_t SRCR;
  const volatile uint32_t RESERVED44[1];
  volatile uint32_t BCCR;
  const volatile uint32_t RESERVED52[1];
  volatile uint32_t IER;
  volatile const uint32_t ISR;
  volatile uint32_t ICR;
  volatile uint32_t LIPCR;
  volatile const uint32_t CPSR;
  volatile const uint32_t CDSR;
  const volatile uint32_t RESERVED132[14];
  volatile uint32_t L1CR;
  volatile uint32_t L1WHPCR;
  volatile uint32_t L1WVPCR;
  volatile uint32_t L1CKCR;
  volatile uint32_t L1PFCR;
  volatile uint32_t L1CACR;
  volatile uint32_t L1DCCR;
  volatile uint32_t L1BFCR;
  const volatile uint32_t RESERVED172[2];
  volatile uint32_t L1CFBAR;
  volatile uint32_t L1CFBLR;
  volatile uint32_t L1CFBLNR;
  const volatile uint32_t RESERVED196[3];
  volatile uint32_t L1CLUTWR;
  const volatile uint32_t RESERVED260[15];
  volatile uint32_t L2CR;
  volatile uint32_t L2WHPCR;
  volatile uint32_t L2WVPCR;
  volatile uint32_t L2CKCR;
  volatile uint32_t L2PFCR;
  volatile uint32_t L2CACR;
  volatile uint32_t L2DCCR;
  volatile uint32_t L2BFCR;
  const volatile uint32_t RESERVED300[2];
  volatile uint32_t L2CFBAR;
  volatile uint32_t L2CFBLR;
  volatile uint32_t L2CFBLNR;
  const volatile uint32_t RESERVED324[3];
  volatile uint32_t L2CLUTWR;
};
#define LTDC_SSCR_HSW          (0x3FFUL << 16) 
#define LTDC_SSCR_HSW_VAL(X) (((uint32_t)(X) & 0x3FFUL) << 16)
#define LTDC_SSCR_VSH          (0x7FFUL << 0) 
#define LTDC_SSCR_VSH_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 0)
#define LTDC_BPCR_AHBP          (0xFFFUL << 16) 
#define LTDC_BPCR_AHBP_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 16)
#define LTDC_BPCR_AVBP          (0x7FFUL << 0) 
#define LTDC_BPCR_AVBP_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 0)
#define LTDC_AWCR_AAV          (0xFFFUL << 16) 
#define LTDC_AWCR_AAV_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 16)
#define LTDC_AWCR_AAH          (0x7FFUL << 0) 
#define LTDC_AWCR_AAH_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 0)
#define LTDC_TWCR_TOTALW          (0xFFFUL << 16) 
#define LTDC_TWCR_TOTALW_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 16)
#define LTDC_TWCR_TOTALH          (0x7FFUL << 0) 
#define LTDC_TWCR_TOTALH_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 0)
#define LTDC_GCR_HSPOL          (0x1UL << 31) 
#define LTDC_GCR_HSPOL_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define LTDC_GCR_VSPOL          (0x1UL << 30) 
#define LTDC_GCR_VSPOL_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define LTDC_GCR_DEPOL          (0x1UL << 29) 
#define LTDC_GCR_DEPOL_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define LTDC_GCR_PCPOL          (0x1UL << 28) 
#define LTDC_GCR_PCPOL_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define LTDC_GCR_DEN          (0x1UL << 16) 
#define LTDC_GCR_DEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define LTDC_GCR_DRW          (0x7UL << 12) 
#define LTDC_GCR_DRW_VAL(X) (((uint32_t)(X) & 0x7UL) << 12)
#define LTDC_GCR_DGW          (0x7UL << 8) 
#define LTDC_GCR_DGW_VAL(X) (((uint32_t)(X) & 0x7UL) << 8)
#define LTDC_GCR_DBW          (0x7UL << 4) 
#define LTDC_GCR_DBW_VAL(X) (((uint32_t)(X) & 0x7UL) << 4)
#define LTDC_GCR_LTDCEN          (0x1UL << 0) 
#define LTDC_GCR_LTDCEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define LTDC_SRCR_VBR          (0x1UL << 1) 
#define LTDC_SRCR_VBR_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define LTDC_SRCR_IMR          (0x1UL << 0) 
#define LTDC_SRCR_IMR_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define LTDC_BCCR_BCBLUE          (0xFFUL << 0) 
#define LTDC_BCCR_BCBLUE_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define LTDC_BCCR_BCGREEN          (0xFFUL << 8) 
#define LTDC_BCCR_BCGREEN_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define LTDC_BCCR_BCRED          (0xFFUL << 16) 
#define LTDC_BCCR_BCRED_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define LTDC_IER_RRIE          (0x1UL << 3) 
#define LTDC_IER_RRIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define LTDC_IER_TERRIE          (0x1UL << 2) 
#define LTDC_IER_TERRIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define LTDC_IER_FUIE          (0x1UL << 1) 
#define LTDC_IER_FUIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define LTDC_IER_LIE          (0x1UL << 0) 
#define LTDC_IER_LIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define LTDC_ISR_RRIF          (0x1UL << 3) 
#define LTDC_ISR_RRIF_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define LTDC_ISR_TERRIF          (0x1UL << 2) 
#define LTDC_ISR_TERRIF_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define LTDC_ISR_FUIF          (0x1UL << 1) 
#define LTDC_ISR_FUIF_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define LTDC_ISR_LIF          (0x1UL << 0) 
#define LTDC_ISR_LIF_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define LTDC_ICR_CRRIF          (0x1UL << 3) 
#define LTDC_ICR_CRRIF_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define LTDC_ICR_CTERRIF          (0x1UL << 2) 
#define LTDC_ICR_CTERRIF_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define LTDC_ICR_CFUIF          (0x1UL << 1) 
#define LTDC_ICR_CFUIF_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define LTDC_ICR_CLIF          (0x1UL << 0) 
#define LTDC_ICR_CLIF_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define LTDC_LIPCR_LIPOS          (0x7FFUL << 0) 
#define LTDC_LIPCR_LIPOS_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 0)
#define LTDC_CPSR_CXPOS          (0xFFFFUL << 16) 
#define LTDC_CPSR_CXPOS_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define LTDC_CPSR_CYPOS          (0xFFFFUL << 0) 
#define LTDC_CPSR_CYPOS_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define LTDC_CDSR_HSYNCS          (0x1UL << 3) 
#define LTDC_CDSR_HSYNCS_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define LTDC_CDSR_VSYNCS          (0x1UL << 2) 
#define LTDC_CDSR_VSYNCS_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define LTDC_CDSR_HDES          (0x1UL << 1) 
#define LTDC_CDSR_HDES_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define LTDC_CDSR_VDES          (0x1UL << 0) 
#define LTDC_CDSR_VDES_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define LTDC_L1CR_CLUTEN          (0x1UL << 4) 
#define LTDC_L1CR_CLUTEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define LTDC_L1CR_COLKEN          (0x1UL << 1) 
#define LTDC_L1CR_COLKEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define LTDC_L1CR_LEN          (0x1UL << 0) 
#define LTDC_L1CR_LEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define LTDC_L1WHPCR_WHSPPOS          (0xFFFUL << 16) 
#define LTDC_L1WHPCR_WHSPPOS_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 16)
#define LTDC_L1WHPCR_WHSTPOS          (0xFFFUL << 0) 
#define LTDC_L1WHPCR_WHSTPOS_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 0)
#define LTDC_L1WVPCR_WVSPPOS          (0x7FFUL << 16) 
#define LTDC_L1WVPCR_WVSPPOS_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 16)
#define LTDC_L1WVPCR_WVSTPOS          (0x7FFUL << 0) 
#define LTDC_L1WVPCR_WVSTPOS_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 0)
#define LTDC_L1CKCR_CKRED          (0xFFUL << 16) 
#define LTDC_L1CKCR_CKRED_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define LTDC_L1CKCR_CKGREEN          (0xFFUL << 8) 
#define LTDC_L1CKCR_CKGREEN_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define LTDC_L1CKCR_CKBLUE          (0xFFUL << 0) 
#define LTDC_L1CKCR_CKBLUE_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define LTDC_L1PFCR_PF          (0x7UL << 0) 
#define LTDC_L1PFCR_PF_VAL(X) (((uint32_t)(X) & 0x7UL) << 0)
#define LTDC_L1CACR_CONSTA          (0xFFUL << 0) 
#define LTDC_L1CACR_CONSTA_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define LTDC_L1DCCR_DCALPHA          (0xFFUL << 24) 
#define LTDC_L1DCCR_DCALPHA_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define LTDC_L1DCCR_DCRED          (0xFFUL << 16) 
#define LTDC_L1DCCR_DCRED_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define LTDC_L1DCCR_DCGREEN          (0xFFUL << 8) 
#define LTDC_L1DCCR_DCGREEN_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define LTDC_L1DCCR_DCBLUE          (0xFFUL << 0) 
#define LTDC_L1DCCR_DCBLUE_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define LTDC_L1BFCR_BF1          (0x7UL << 8) 
#define LTDC_L1BFCR_BF1_VAL(X) (((uint32_t)(X) & 0x7UL) << 8)
#define LTDC_L1BFCR_BF2          (0x7UL << 0) 
#define LTDC_L1BFCR_BF2_VAL(X) (((uint32_t)(X) & 0x7UL) << 0)
#define LTDC_L1CFBAR_CFBADD          (0xFFFFFFFFUL << 0) 
#define LTDC_L1CFBAR_CFBADD_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define LTDC_L1CFBLR_CFBP          (0x1FFFUL << 16) 
#define LTDC_L1CFBLR_CFBP_VAL(X) (((uint32_t)(X) & 0x1FFFUL) << 16)
#define LTDC_L1CFBLR_CFBLL          (0x1FFFUL << 0) 
#define LTDC_L1CFBLR_CFBLL_VAL(X) (((uint32_t)(X) & 0x1FFFUL) << 0)
#define LTDC_L1CFBLNR_CFBLNBR          (0x7FFUL << 0) 
#define LTDC_L1CFBLNR_CFBLNBR_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 0)
#define LTDC_L1CLUTWR_CLUTADD          (0xFFUL << 24) 
#define LTDC_L1CLUTWR_CLUTADD_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define LTDC_L1CLUTWR_RED          (0xFFUL << 16) 
#define LTDC_L1CLUTWR_RED_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define LTDC_L1CLUTWR_GREEN          (0xFFUL << 8) 
#define LTDC_L1CLUTWR_GREEN_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define LTDC_L1CLUTWR_BLUE          (0xFFUL << 0) 
#define LTDC_L1CLUTWR_BLUE_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define LTDC_L2CR_CLUTEN          (0x1UL << 4) 
#define LTDC_L2CR_CLUTEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define LTDC_L2CR_COLKEN          (0x1UL << 1) 
#define LTDC_L2CR_COLKEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define LTDC_L2CR_LEN          (0x1UL << 0) 
#define LTDC_L2CR_LEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define LTDC_L2WHPCR_WHSPPOS          (0xFFFUL << 16) 
#define LTDC_L2WHPCR_WHSPPOS_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 16)
#define LTDC_L2WHPCR_WHSTPOS          (0xFFFUL << 0) 
#define LTDC_L2WHPCR_WHSTPOS_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 0)
#define LTDC_L2WVPCR_WVSPPOS          (0x7FFUL << 16) 
#define LTDC_L2WVPCR_WVSPPOS_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 16)
#define LTDC_L2WVPCR_WVSTPOS          (0x7FFUL << 0) 
#define LTDC_L2WVPCR_WVSTPOS_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 0)
#define LTDC_L2CKCR_CKRED          (0xFFUL << 16) 
#define LTDC_L2CKCR_CKRED_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define LTDC_L2CKCR_CKGREEN          (0xFFUL << 8) 
#define LTDC_L2CKCR_CKGREEN_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define LTDC_L2CKCR_CKBLUE          (0xFFUL << 0) 
#define LTDC_L2CKCR_CKBLUE_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define LTDC_L2PFCR_PF          (0x7UL << 0) 
#define LTDC_L2PFCR_PF_VAL(X) (((uint32_t)(X) & 0x7UL) << 0)
#define LTDC_L2CACR_CONSTA          (0xFFUL << 0) 
#define LTDC_L2CACR_CONSTA_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define LTDC_L2DCCR_DCALPHA          (0xFFUL << 24) 
#define LTDC_L2DCCR_DCALPHA_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define LTDC_L2DCCR_DCRED          (0xFFUL << 16) 
#define LTDC_L2DCCR_DCRED_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define LTDC_L2DCCR_DCGREEN          (0xFFUL << 8) 
#define LTDC_L2DCCR_DCGREEN_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define LTDC_L2DCCR_DCBLUE          (0xFFUL << 0) 
#define LTDC_L2DCCR_DCBLUE_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define LTDC_L2BFCR_BF1          (0x7UL << 8) 
#define LTDC_L2BFCR_BF1_VAL(X) (((uint32_t)(X) & 0x7UL) << 8)
#define LTDC_L2BFCR_BF2          (0x7UL << 0) 
#define LTDC_L2BFCR_BF2_VAL(X) (((uint32_t)(X) & 0x7UL) << 0)
#define LTDC_L2CFBAR_CFBADD          (0xFFFFFFFFUL << 0) 
#define LTDC_L2CFBAR_CFBADD_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define LTDC_L2CFBLR_CFBP          (0x1FFFUL << 16) 
#define LTDC_L2CFBLR_CFBP_VAL(X) (((uint32_t)(X) & 0x1FFFUL) << 16)
#define LTDC_L2CFBLR_CFBLL          (0x1FFFUL << 0) 
#define LTDC_L2CFBLR_CFBLL_VAL(X) (((uint32_t)(X) & 0x1FFFUL) << 0)
#define LTDC_L2CFBLNR_CFBLNBR          (0x7FFUL << 0) 
#define LTDC_L2CFBLNR_CFBLNBR_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 0)
#define LTDC_L2CLUTWR_CLUTADD          (0xFFUL << 24) 
#define LTDC_L2CLUTWR_CLUTADD_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define LTDC_L2CLUTWR_RED          (0xFFUL << 16) 
#define LTDC_L2CLUTWR_RED_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define LTDC_L2CLUTWR_GREEN          (0xFFUL << 8) 
#define LTDC_L2CLUTWR_GREEN_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define LTDC_L2CLUTWR_BLUE          (0xFFUL << 0) 
#define LTDC_L2CLUTWR_BLUE_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)

#define LTDC  ((struct LTDC*)(0x50001000UL))
struct SPDIFRX {
  volatile uint32_t CR;
  volatile uint32_t IMR;
  volatile const uint32_t SR;
  volatile uint32_t IFCR;
  volatile const uint32_t DR_00;
  volatile const uint32_t DR_01;
  volatile const uint32_t DR_10;
  volatile const uint32_t CSR;
  volatile const uint32_t DIR;
  const volatile uint32_t RESERVED1012[246];
  volatile const uint32_t VERR;
  volatile const uint32_t IDR;
  volatile const uint32_t SIDR;
};
#define SPDIFRX_CR_SPDIFRXEN          (0x3UL << 0) 
#define SPDIFRX_CR_SPDIFRXEN_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define SPDIFRX_CR_RXDMAEN          (0x1UL << 2) 
#define SPDIFRX_CR_RXDMAEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define SPDIFRX_CR_RXSTEO          (0x1UL << 3) 
#define SPDIFRX_CR_RXSTEO_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define SPDIFRX_CR_DRFMT          (0x3UL << 4) 
#define SPDIFRX_CR_DRFMT_VAL(X) (((uint32_t)(X) & 0x3UL) << 4)
#define SPDIFRX_CR_PMSK          (0x1UL << 6) 
#define SPDIFRX_CR_PMSK_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define SPDIFRX_CR_VMSK          (0x1UL << 7) 
#define SPDIFRX_CR_VMSK_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define SPDIFRX_CR_CUMSK          (0x1UL << 8) 
#define SPDIFRX_CR_CUMSK_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define SPDIFRX_CR_PTMSK          (0x1UL << 9) 
#define SPDIFRX_CR_PTMSK_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define SPDIFRX_CR_CBDMAEN          (0x1UL << 10) 
#define SPDIFRX_CR_CBDMAEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define SPDIFRX_CR_CHSEL          (0x1UL << 11) 
#define SPDIFRX_CR_CHSEL_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define SPDIFRX_CR_NBTR          (0x3UL << 12) 
#define SPDIFRX_CR_NBTR_VAL(X) (((uint32_t)(X) & 0x3UL) << 12)
#define SPDIFRX_CR_WFA          (0x1UL << 14) 
#define SPDIFRX_CR_WFA_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define SPDIFRX_CR_INSEL          (0x7UL << 16) 
#define SPDIFRX_CR_INSEL_VAL(X) (((uint32_t)(X) & 0x7UL) << 16)
#define SPDIFRX_CR_CKSEN          (0x1UL << 20) 
#define SPDIFRX_CR_CKSEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define SPDIFRX_CR_CKSBKPEN          (0x1UL << 21) 
#define SPDIFRX_CR_CKSBKPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define SPDIFRX_IMR_RXNEIE          (0x1UL << 0) 
#define SPDIFRX_IMR_RXNEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define SPDIFRX_IMR_CSRNEIE          (0x1UL << 1) 
#define SPDIFRX_IMR_CSRNEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define SPDIFRX_IMR_PERRIE          (0x1UL << 2) 
#define SPDIFRX_IMR_PERRIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define SPDIFRX_IMR_OVRIE          (0x1UL << 3) 
#define SPDIFRX_IMR_OVRIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define SPDIFRX_IMR_SBLKIE          (0x1UL << 4) 
#define SPDIFRX_IMR_SBLKIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define SPDIFRX_IMR_SYNCDIE          (0x1UL << 5) 
#define SPDIFRX_IMR_SYNCDIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define SPDIFRX_IMR_IFEIE          (0x1UL << 6) 
#define SPDIFRX_IMR_IFEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define SPDIFRX_SR_RXNE          (0x1UL << 0) 
#define SPDIFRX_SR_RXNE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define SPDIFRX_SR_CSRNE          (0x1UL << 1) 
#define SPDIFRX_SR_CSRNE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define SPDIFRX_SR_PERR          (0x1UL << 2) 
#define SPDIFRX_SR_PERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define SPDIFRX_SR_OVR          (0x1UL << 3) 
#define SPDIFRX_SR_OVR_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define SPDIFRX_SR_SBD          (0x1UL << 4) 
#define SPDIFRX_SR_SBD_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define SPDIFRX_SR_SYNCD          (0x1UL << 5) 
#define SPDIFRX_SR_SYNCD_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define SPDIFRX_SR_FERR          (0x1UL << 6) 
#define SPDIFRX_SR_FERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define SPDIFRX_SR_SERR          (0x1UL << 7) 
#define SPDIFRX_SR_SERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define SPDIFRX_SR_TERR          (0x1UL << 8) 
#define SPDIFRX_SR_TERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define SPDIFRX_SR_WIDTH5          (0x7FFFUL << 16) 
#define SPDIFRX_SR_WIDTH5_VAL(X) (((uint32_t)(X) & 0x7FFFUL) << 16)
#define SPDIFRX_IFCR_PERRCF          (0x1UL << 2) 
#define SPDIFRX_IFCR_PERRCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define SPDIFRX_IFCR_OVRCF          (0x1UL << 3) 
#define SPDIFRX_IFCR_OVRCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define SPDIFRX_IFCR_SBDCF          (0x1UL << 4) 
#define SPDIFRX_IFCR_SBDCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define SPDIFRX_IFCR_SYNCDCF          (0x1UL << 5) 
#define SPDIFRX_IFCR_SYNCDCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define SPDIFRX_DR_00_DR          (0xFFFFFFUL << 0) 
#define SPDIFRX_DR_00_DR_VAL(X) (((uint32_t)(X) & 0xFFFFFFUL) << 0)
#define SPDIFRX_DR_00_PE          (0x1UL << 24) 
#define SPDIFRX_DR_00_PE_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define SPDIFRX_DR_00_V          (0x1UL << 25) 
#define SPDIFRX_DR_00_V_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define SPDIFRX_DR_00_U          (0x1UL << 26) 
#define SPDIFRX_DR_00_U_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define SPDIFRX_DR_00_C          (0x1UL << 27) 
#define SPDIFRX_DR_00_C_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define SPDIFRX_DR_00_PT          (0x3UL << 28) 
#define SPDIFRX_DR_00_PT_VAL(X) (((uint32_t)(X) & 0x3UL) << 28)
#define SPDIFRX_CSR_USR          (0xFFFFUL << 0) 
#define SPDIFRX_CSR_USR_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define SPDIFRX_CSR_CS          (0xFFUL << 16) 
#define SPDIFRX_CSR_CS_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define SPDIFRX_CSR_SOB          (0x1UL << 24) 
#define SPDIFRX_CSR_SOB_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define SPDIFRX_DIR_THI          (0x1FFFUL << 0) 
#define SPDIFRX_DIR_THI_VAL(X) (((uint32_t)(X) & 0x1FFFUL) << 0)
#define SPDIFRX_DIR_TLO          (0x1FFFUL << 16) 
#define SPDIFRX_DIR_TLO_VAL(X) (((uint32_t)(X) & 0x1FFFUL) << 16)
#define SPDIFRX_VERR_MINREV          (0xFUL << 0) 
#define SPDIFRX_VERR_MINREV_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define SPDIFRX_VERR_MAJREV          (0xFUL << 4) 
#define SPDIFRX_VERR_MAJREV_VAL(X) (((uint32_t)(X) & 0xFUL) << 4)
#define SPDIFRX_IDR_ID          (0xFFFFFFFFUL << 0) 
#define SPDIFRX_IDR_ID_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define SPDIFRX_SIDR_SID          (0xFFFFFFFFUL << 0) 
#define SPDIFRX_SIDR_SID_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define SPDIFRX_DR_01_PE          (0x1UL << 0) 
#define SPDIFRX_DR_01_PE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define SPDIFRX_DR_01_V          (0x1UL << 1) 
#define SPDIFRX_DR_01_V_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define SPDIFRX_DR_01_U          (0x1UL << 2) 
#define SPDIFRX_DR_01_U_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define SPDIFRX_DR_01_C          (0x1UL << 3) 
#define SPDIFRX_DR_01_C_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define SPDIFRX_DR_01_PT          (0x3UL << 4) 
#define SPDIFRX_DR_01_PT_VAL(X) (((uint32_t)(X) & 0x3UL) << 4)
#define SPDIFRX_DR_01_DR          (0xFFFFFFUL << 8) 
#define SPDIFRX_DR_01_DR_VAL(X) (((uint32_t)(X) & 0xFFFFFFUL) << 8)
#define SPDIFRX_DR_10_DRNL1          (0xFFFFUL << 0) 
#define SPDIFRX_DR_10_DRNL1_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define SPDIFRX_DR_10_DRNL2          (0xFFFFUL << 16) 
#define SPDIFRX_DR_10_DRNL2_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)

#define SPDIFRX  ((struct SPDIFRX*)(0x40004000UL))
struct ADC3 {
  volatile uint32_t ISR;
  volatile uint32_t IER;
  volatile uint32_t CR;
  volatile uint32_t CFGR;
  volatile uint32_t CFGR2;
  volatile uint32_t SMPR1;
  volatile uint32_t SMPR2;
  volatile uint32_t PCSEL;
  volatile uint32_t LTR1;
  volatile uint32_t LHTR1;
  const volatile uint32_t RESERVED48[2];
  volatile uint32_t SQR1;
  volatile uint32_t SQR2;
  volatile uint32_t SQR3;
  volatile uint32_t SQR4;
  volatile const uint32_t DR;
  const volatile uint32_t RESERVED76[2];
  volatile uint32_t JSQR;
  const volatile uint32_t RESERVED96[4];
  volatile uint32_t OFR1;
  volatile uint32_t OFR2;
  volatile uint32_t OFR3;
  volatile uint32_t OFR4;
  const volatile uint32_t RESERVED128[4];
  volatile const uint32_t JDR1;
  volatile const uint32_t JDR2;
  volatile const uint32_t JDR3;
  volatile const uint32_t JDR4;
  const volatile uint32_t RESERVED160[4];
  volatile uint32_t AWD2CR;
  volatile uint32_t AWD3CR;
  const volatile uint32_t RESERVED176[2];
  volatile uint32_t LTR2;
  volatile uint32_t HTR2;
  volatile uint32_t LTR3;
  volatile uint32_t HTR3;
  volatile uint32_t DIFSEL;
  volatile uint32_t CALFACT;
  volatile uint32_t CALFACT2;
};
