via/viaems/src/platforms/stm32h743/device.h
#define ADC3_ISR_JQOVF          (0x1UL << 10) 
#define ADC3_ISR_JQOVF_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define ADC3_ISR_AWD3          (0x1UL << 9) 
#define ADC3_ISR_AWD3_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define ADC3_ISR_AWD2          (0x1UL << 8) 
#define ADC3_ISR_AWD2_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define ADC3_ISR_AWD1          (0x1UL << 7) 
#define ADC3_ISR_AWD1_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define ADC3_ISR_JEOS          (0x1UL << 6) 
#define ADC3_ISR_JEOS_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define ADC3_ISR_JEOC          (0x1UL << 5) 
#define ADC3_ISR_JEOC_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define ADC3_ISR_OVR          (0x1UL << 4) 
#define ADC3_ISR_OVR_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define ADC3_ISR_EOS          (0x1UL << 3) 
#define ADC3_ISR_EOS_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define ADC3_ISR_EOC          (0x1UL << 2) 
#define ADC3_ISR_EOC_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define ADC3_ISR_EOSMP          (0x1UL << 1) 
#define ADC3_ISR_EOSMP_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define ADC3_ISR_ADRDY          (0x1UL << 0) 
#define ADC3_ISR_ADRDY_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define ADC3_IER_JQOVFIE          (0x1UL << 10) 
#define ADC3_IER_JQOVFIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define ADC3_IER_AWD3IE          (0x1UL << 9) 
#define ADC3_IER_AWD3IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define ADC3_IER_AWD2IE          (0x1UL << 8) 
#define ADC3_IER_AWD2IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define ADC3_IER_AWD1IE          (0x1UL << 7) 
#define ADC3_IER_AWD1IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define ADC3_IER_JEOSIE          (0x1UL << 6) 
#define ADC3_IER_JEOSIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define ADC3_IER_JEOCIE          (0x1UL << 5) 
#define ADC3_IER_JEOCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define ADC3_IER_OVRIE          (0x1UL << 4) 
#define ADC3_IER_OVRIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define ADC3_IER_EOSIE          (0x1UL << 3) 
#define ADC3_IER_EOSIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define ADC3_IER_EOCIE          (0x1UL << 2) 
#define ADC3_IER_EOCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define ADC3_IER_EOSMPIE          (0x1UL << 1) 
#define ADC3_IER_EOSMPIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define ADC3_IER_ADRDYIE          (0x1UL << 0) 
#define ADC3_IER_ADRDYIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define ADC3_CR_ADCAL          (0x1UL << 31) 
#define ADC3_CR_ADCAL_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define ADC3_CR_ADCALDIF          (0x1UL << 30) 
#define ADC3_CR_ADCALDIF_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define ADC3_CR_DEEPPWD          (0x1UL << 29) 
#define ADC3_CR_DEEPPWD_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define ADC3_CR_ADVREGEN          (0x1UL << 28) 
#define ADC3_CR_ADVREGEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define ADC3_CR_LINCALRDYW6          (0x1UL << 27) 
#define ADC3_CR_LINCALRDYW6_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define ADC3_CR_LINCALRDYW5          (0x1UL << 26) 
#define ADC3_CR_LINCALRDYW5_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define ADC3_CR_LINCALRDYW4          (0x1UL << 25) 
#define ADC3_CR_LINCALRDYW4_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define ADC3_CR_LINCALRDYW3          (0x1UL << 24) 
#define ADC3_CR_LINCALRDYW3_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define ADC3_CR_LINCALRDYW2          (0x1UL << 23) 
#define ADC3_CR_LINCALRDYW2_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define ADC3_CR_LINCALRDYW1          (0x1UL << 22) 
#define ADC3_CR_LINCALRDYW1_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define ADC3_CR_ADCALLIN          (0x1UL << 16) 
#define ADC3_CR_ADCALLIN_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define ADC3_CR_BOOST          (0x1UL << 8) 
#define ADC3_CR_BOOST_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define ADC3_CR_JADSTP          (0x1UL << 5) 
#define ADC3_CR_JADSTP_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define ADC3_CR_ADSTP          (0x1UL << 4) 
#define ADC3_CR_ADSTP_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define ADC3_CR_JADSTART          (0x1UL << 3) 
#define ADC3_CR_JADSTART_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define ADC3_CR_ADSTART          (0x1UL << 2) 
#define ADC3_CR_ADSTART_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define ADC3_CR_ADDIS          (0x1UL << 1) 
#define ADC3_CR_ADDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define ADC3_CR_ADEN          (0x1UL << 0) 
#define ADC3_CR_ADEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define ADC3_CFGR_JQDIS          (0x1UL << 31) 
#define ADC3_CFGR_JQDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define ADC3_CFGR_AWDCH1CH          (0x1FUL << 26) 
#define ADC3_CFGR_AWDCH1CH_VAL(X) (((uint32_t)(X) & 0x1FUL) << 26)
#define ADC3_CFGR_JAUTO          (0x1UL << 25) 
#define ADC3_CFGR_JAUTO_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define ADC3_CFGR_JAWD1EN          (0x1UL << 24) 
#define ADC3_CFGR_JAWD1EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define ADC3_CFGR_AWD1EN          (0x1UL << 23) 
#define ADC3_CFGR_AWD1EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define ADC3_CFGR_AWD1SGL          (0x1UL << 22) 
#define ADC3_CFGR_AWD1SGL_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define ADC3_CFGR_JQM          (0x1UL << 21) 
#define ADC3_CFGR_JQM_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define ADC3_CFGR_JDISCEN          (0x1UL << 20) 
#define ADC3_CFGR_JDISCEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define ADC3_CFGR_DISCNUM          (0x7UL << 17) 
#define ADC3_CFGR_DISCNUM_VAL(X) (((uint32_t)(X) & 0x7UL) << 17)
#define ADC3_CFGR_DISCEN          (0x1UL << 16) 
#define ADC3_CFGR_DISCEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define ADC3_CFGR_AUTDLY          (0x1UL << 14) 
#define ADC3_CFGR_AUTDLY_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define ADC3_CFGR_CONT          (0x1UL << 13) 
#define ADC3_CFGR_CONT_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define ADC3_CFGR_OVRMOD          (0x1UL << 12) 
#define ADC3_CFGR_OVRMOD_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define ADC3_CFGR_EXTEN          (0x3UL << 10) 
#define ADC3_CFGR_EXTEN_VAL(X) (((uint32_t)(X) & 0x3UL) << 10)
#define ADC3_CFGR_EXTSEL          (0x1FUL << 5) 
#define ADC3_CFGR_EXTSEL_VAL(X) (((uint32_t)(X) & 0x1FUL) << 5)
#define ADC3_CFGR_RES          (0x7UL << 2) 
#define ADC3_CFGR_RES_VAL(X) (((uint32_t)(X) & 0x7UL) << 2)
#define ADC3_CFGR_DMNGT          (0x3UL << 0) 
#define ADC3_CFGR_DMNGT_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define ADC3_CFGR2_ROVSE          (0x1UL << 0) 
#define ADC3_CFGR2_ROVSE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define ADC3_CFGR2_JOVSE          (0x1UL << 1) 
#define ADC3_CFGR2_JOVSE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define ADC3_CFGR2_OVSS          (0xFUL << 5) 
#define ADC3_CFGR2_OVSS_VAL(X) (((uint32_t)(X) & 0xFUL) << 5)
#define ADC3_CFGR2_TROVS          (0x1UL << 9) 
#define ADC3_CFGR2_TROVS_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define ADC3_CFGR2_ROVSM          (0x1UL << 10) 
#define ADC3_CFGR2_ROVSM_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define ADC3_CFGR2_RSHIFT1          (0x1UL << 11) 
#define ADC3_CFGR2_RSHIFT1_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define ADC3_CFGR2_RSHIFT2          (0x1UL << 12) 
#define ADC3_CFGR2_RSHIFT2_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define ADC3_CFGR2_RSHIFT3          (0x1UL << 13) 
#define ADC3_CFGR2_RSHIFT3_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define ADC3_CFGR2_RSHIFT4          (0x1UL << 14) 
#define ADC3_CFGR2_RSHIFT4_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define ADC3_CFGR2_OSR          (0x3FFUL << 16) 
#define ADC3_CFGR2_OSR_VAL(X) (((uint32_t)(X) & 0x3FFUL) << 16)
#define ADC3_CFGR2_LSHIFT          (0xFUL << 28) 
#define ADC3_CFGR2_LSHIFT_VAL(X) (((uint32_t)(X) & 0xFUL) << 28)
#define ADC3_SMPR1_SMP9          (0x7UL << 27) 
#define ADC3_SMPR1_SMP9_VAL(X) (((uint32_t)(X) & 0x7UL) << 27)
#define ADC3_SMPR1_SMP8          (0x7UL << 24) 
#define ADC3_SMPR1_SMP8_VAL(X) (((uint32_t)(X) & 0x7UL) << 24)
#define ADC3_SMPR1_SMP7          (0x7UL << 21) 
#define ADC3_SMPR1_SMP7_VAL(X) (((uint32_t)(X) & 0x7UL) << 21)
#define ADC3_SMPR1_SMP6          (0x7UL << 18) 
#define ADC3_SMPR1_SMP6_VAL(X) (((uint32_t)(X) & 0x7UL) << 18)
#define ADC3_SMPR1_SMP5          (0x7UL << 15) 
#define ADC3_SMPR1_SMP5_VAL(X) (((uint32_t)(X) & 0x7UL) << 15)
#define ADC3_SMPR1_SMP4          (0x7UL << 12) 
#define ADC3_SMPR1_SMP4_VAL(X) (((uint32_t)(X) & 0x7UL) << 12)
#define ADC3_SMPR1_SMP3          (0x7UL << 9) 
#define ADC3_SMPR1_SMP3_VAL(X) (((uint32_t)(X) & 0x7UL) << 9)
#define ADC3_SMPR1_SMP2          (0x7UL << 6) 
#define ADC3_SMPR1_SMP2_VAL(X) (((uint32_t)(X) & 0x7UL) << 6)
#define ADC3_SMPR1_SMP1          (0x7UL << 3) 
#define ADC3_SMPR1_SMP1_VAL(X) (((uint32_t)(X) & 0x7UL) << 3)
#define ADC3_SMPR2_SMP19          (0x7UL << 27) 
#define ADC3_SMPR2_SMP19_VAL(X) (((uint32_t)(X) & 0x7UL) << 27)
#define ADC3_SMPR2_SMP18          (0x7UL << 24) 
#define ADC3_SMPR2_SMP18_VAL(X) (((uint32_t)(X) & 0x7UL) << 24)
#define ADC3_SMPR2_SMP17          (0x7UL << 21) 
#define ADC3_SMPR2_SMP17_VAL(X) (((uint32_t)(X) & 0x7UL) << 21)
#define ADC3_SMPR2_SMP16          (0x7UL << 18) 
#define ADC3_SMPR2_SMP16_VAL(X) (((uint32_t)(X) & 0x7UL) << 18)
#define ADC3_SMPR2_SMP15          (0x7UL << 15) 
#define ADC3_SMPR2_SMP15_VAL(X) (((uint32_t)(X) & 0x7UL) << 15)
#define ADC3_SMPR2_SMP14          (0x7UL << 12) 
#define ADC3_SMPR2_SMP14_VAL(X) (((uint32_t)(X) & 0x7UL) << 12)
#define ADC3_SMPR2_SMP13          (0x7UL << 9) 
#define ADC3_SMPR2_SMP13_VAL(X) (((uint32_t)(X) & 0x7UL) << 9)
#define ADC3_SMPR2_SMP12          (0x7UL << 6) 
#define ADC3_SMPR2_SMP12_VAL(X) (((uint32_t)(X) & 0x7UL) << 6)
#define ADC3_SMPR2_SMP11          (0x7UL << 3) 
#define ADC3_SMPR2_SMP11_VAL(X) (((uint32_t)(X) & 0x7UL) << 3)
#define ADC3_SMPR2_SMP10          (0x7UL << 0) 
#define ADC3_SMPR2_SMP10_VAL(X) (((uint32_t)(X) & 0x7UL) << 0)
#define ADC3_LTR1_LTR1          (0x3FFFFFFUL << 0) 
#define ADC3_LTR1_LTR1_VAL(X) (((uint32_t)(X) & 0x3FFFFFFUL) << 0)
#define ADC3_LHTR1_LHTR1          (0x3FFFFFFUL << 0) 
#define ADC3_LHTR1_LHTR1_VAL(X) (((uint32_t)(X) & 0x3FFFFFFUL) << 0)
#define ADC3_SQR1_SQ4          (0x1FUL << 24) 
#define ADC3_SQR1_SQ4_VAL(X) (((uint32_t)(X) & 0x1FUL) << 24)
#define ADC3_SQR1_SQ3          (0x1FUL << 18) 
#define ADC3_SQR1_SQ3_VAL(X) (((uint32_t)(X) & 0x1FUL) << 18)
#define ADC3_SQR1_SQ2          (0x1FUL << 12) 
#define ADC3_SQR1_SQ2_VAL(X) (((uint32_t)(X) & 0x1FUL) << 12)
#define ADC3_SQR1_SQ1          (0x1FUL << 6) 
#define ADC3_SQR1_SQ1_VAL(X) (((uint32_t)(X) & 0x1FUL) << 6)
#define ADC3_SQR1_L3          (0xFUL << 0) 
#define ADC3_SQR1_L3_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define ADC3_SQR2_SQ9          (0x1FUL << 24) 
#define ADC3_SQR2_SQ9_VAL(X) (((uint32_t)(X) & 0x1FUL) << 24)
#define ADC3_SQR2_SQ8          (0x1FUL << 18) 
#define ADC3_SQR2_SQ8_VAL(X) (((uint32_t)(X) & 0x1FUL) << 18)
#define ADC3_SQR2_SQ7          (0x1FUL << 12) 
#define ADC3_SQR2_SQ7_VAL(X) (((uint32_t)(X) & 0x1FUL) << 12)
#define ADC3_SQR2_SQ6          (0x1FUL << 6) 
#define ADC3_SQR2_SQ6_VAL(X) (((uint32_t)(X) & 0x1FUL) << 6)
#define ADC3_SQR2_SQ5          (0x1FUL << 0) 
#define ADC3_SQR2_SQ5_VAL(X) (((uint32_t)(X) & 0x1FUL) << 0)
#define ADC3_SQR3_SQ14          (0x1FUL << 24) 
#define ADC3_SQR3_SQ14_VAL(X) (((uint32_t)(X) & 0x1FUL) << 24)
#define ADC3_SQR3_SQ13          (0x1FUL << 18) 
#define ADC3_SQR3_SQ13_VAL(X) (((uint32_t)(X) & 0x1FUL) << 18)
#define ADC3_SQR3_SQ12          (0x1FUL << 12) 
#define ADC3_SQR3_SQ12_VAL(X) (((uint32_t)(X) & 0x1FUL) << 12)
#define ADC3_SQR3_SQ11          (0x1FUL << 6) 
#define ADC3_SQR3_SQ11_VAL(X) (((uint32_t)(X) & 0x1FUL) << 6)
#define ADC3_SQR3_SQ10          (0x1FUL << 0) 
#define ADC3_SQR3_SQ10_VAL(X) (((uint32_t)(X) & 0x1FUL) << 0)
#define ADC3_SQR4_SQ16          (0x1FUL << 6) 
#define ADC3_SQR4_SQ16_VAL(X) (((uint32_t)(X) & 0x1FUL) << 6)
#define ADC3_SQR4_SQ15          (0x1FUL << 0) 
#define ADC3_SQR4_SQ15_VAL(X) (((uint32_t)(X) & 0x1FUL) << 0)
#define ADC3_DR_RDATA          (0xFFFFUL << 0) 
#define ADC3_DR_RDATA_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define ADC3_JSQR_JSQ4          (0x1FUL << 27) 
#define ADC3_JSQR_JSQ4_VAL(X) (((uint32_t)(X) & 0x1FUL) << 27)
#define ADC3_JSQR_JSQ3          (0x1FUL << 21) 
#define ADC3_JSQR_JSQ3_VAL(X) (((uint32_t)(X) & 0x1FUL) << 21)
#define ADC3_JSQR_JSQ2          (0x1FUL << 15) 
#define ADC3_JSQR_JSQ2_VAL(X) (((uint32_t)(X) & 0x1FUL) << 15)
#define ADC3_JSQR_JSQ1          (0x1FUL << 9) 
#define ADC3_JSQR_JSQ1_VAL(X) (((uint32_t)(X) & 0x1FUL) << 9)
#define ADC3_JSQR_JEXTEN          (0x3UL << 7) 
#define ADC3_JSQR_JEXTEN_VAL(X) (((uint32_t)(X) & 0x3UL) << 7)
#define ADC3_JSQR_JEXTSEL          (0x1FUL << 2) 
#define ADC3_JSQR_JEXTSEL_VAL(X) (((uint32_t)(X) & 0x1FUL) << 2)
#define ADC3_JSQR_JL          (0x3UL << 0) 
#define ADC3_JSQR_JL_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define ADC3_OFR1_SSATE          (0x1UL << 31) 
#define ADC3_OFR1_SSATE_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define ADC3_OFR1_OFFSET1_CH          (0x1FUL << 26) 
#define ADC3_OFR1_OFFSET1_CH_VAL(X) (((uint32_t)(X) & 0x1FUL) << 26)
#define ADC3_OFR1_OFFSET1          (0x3FFFFFFUL << 0) 
#define ADC3_OFR1_OFFSET1_VAL(X) (((uint32_t)(X) & 0x3FFFFFFUL) << 0)
#define ADC3_OFR2_SSATE          (0x1UL << 31) 
#define ADC3_OFR2_SSATE_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define ADC3_OFR2_OFFSET1_CH          (0x1FUL << 26) 
#define ADC3_OFR2_OFFSET1_CH_VAL(X) (((uint32_t)(X) & 0x1FUL) << 26)
#define ADC3_OFR2_OFFSET1          (0x3FFFFFFUL << 0) 
#define ADC3_OFR2_OFFSET1_VAL(X) (((uint32_t)(X) & 0x3FFFFFFUL) << 0)
#define ADC3_OFR3_SSATE          (0x1UL << 31) 
#define ADC3_OFR3_SSATE_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define ADC3_OFR3_OFFSET1_CH          (0x1FUL << 26) 
#define ADC3_OFR3_OFFSET1_CH_VAL(X) (((uint32_t)(X) & 0x1FUL) << 26)
#define ADC3_OFR3_OFFSET1          (0x3FFFFFFUL << 0) 
#define ADC3_OFR3_OFFSET1_VAL(X) (((uint32_t)(X) & 0x3FFFFFFUL) << 0)
#define ADC3_OFR4_SSATE          (0x1UL << 31) 
#define ADC3_OFR4_SSATE_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define ADC3_OFR4_OFFSET1_CH          (0x1FUL << 26) 
#define ADC3_OFR4_OFFSET1_CH_VAL(X) (((uint32_t)(X) & 0x1FUL) << 26)
#define ADC3_OFR4_OFFSET1          (0x3FFFFFFUL << 0) 
#define ADC3_OFR4_OFFSET1_VAL(X) (((uint32_t)(X) & 0x3FFFFFFUL) << 0)
#define ADC3_JDR1_JDATA1          (0xFFFFFFFFUL << 0) 
#define ADC3_JDR1_JDATA1_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define ADC3_JDR2_JDATA2          (0xFFFFFFFFUL << 0) 
#define ADC3_JDR2_JDATA2_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define ADC3_JDR3_JDATA3          (0xFFFFFFFFUL << 0) 
#define ADC3_JDR3_JDATA3_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define ADC3_JDR4_JDATA4          (0xFFFFFFFFUL << 0) 
#define ADC3_JDR4_JDATA4_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define ADC3_AWD2CR_AWD2CH          (0xFFFFFUL << 0) 
#define ADC3_AWD2CR_AWD2CH_VAL(X) (((uint32_t)(X) & 0xFFFFFUL) << 0)
#define ADC3_AWD3CR_AWD3CH          (0xFFFFFUL << 1) 
#define ADC3_AWD3CR_AWD3CH_VAL(X) (((uint32_t)(X) & 0xFFFFFUL) << 1)
#define ADC3_DIFSEL_DIFSEL          (0xFFFFFUL << 0) 
#define ADC3_DIFSEL_DIFSEL_VAL(X) (((uint32_t)(X) & 0xFFFFFUL) << 0)
#define ADC3_CALFACT_CALFACT_D          (0x7FFUL << 16) 
#define ADC3_CALFACT_CALFACT_D_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 16)
#define ADC3_CALFACT_CALFACT_S          (0x7FFUL << 0) 
#define ADC3_CALFACT_CALFACT_S_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 0)
#define ADC3_PCSEL_PCSEL          (0xFFFFFUL << 0) 
#define ADC3_PCSEL_PCSEL_VAL(X) (((uint32_t)(X) & 0xFFFFFUL) << 0)
#define ADC3_LTR2_LTR2          (0x3FFFFFFUL << 0) 
#define ADC3_LTR2_LTR2_VAL(X) (((uint32_t)(X) & 0x3FFFFFFUL) << 0)
#define ADC3_HTR2_HTR2          (0x3FFFFFFUL << 0) 
#define ADC3_HTR2_HTR2_VAL(X) (((uint32_t)(X) & 0x3FFFFFFUL) << 0)
#define ADC3_LTR3_LTR3          (0x3FFFFFFUL << 0) 
#define ADC3_LTR3_LTR3_VAL(X) (((uint32_t)(X) & 0x3FFFFFFUL) << 0)
#define ADC3_HTR3_HTR3          (0x3FFFFFFUL << 0) 
#define ADC3_HTR3_HTR3_VAL(X) (((uint32_t)(X) & 0x3FFFFFFUL) << 0)
#define ADC3_CALFACT2_LINCALFACT          (0x3FFFFFFFUL << 0) 
#define ADC3_CALFACT2_LINCALFACT_VAL(X) (((uint32_t)(X) & 0x3FFFFFFFUL) << 0)

#define ADC3  ((struct ADC3*)(0x58026000UL))
struct ADC1 {
  volatile uint32_t ISR;
  volatile uint32_t IER;
  volatile uint32_t CR;
  volatile uint32_t CFGR;
  volatile uint32_t CFGR2;
  volatile uint32_t SMPR1;
  volatile uint32_t SMPR2;
  volatile uint32_t PCSEL;
  volatile uint32_t LTR1;
  volatile uint32_t LHTR1;
  const volatile uint32_t RESERVED48[2];
  volatile uint32_t SQR1;
  volatile uint32_t SQR2;
  volatile uint32_t SQR3;
  volatile uint32_t SQR4;
  volatile const uint32_t DR;
  const volatile uint32_t RESERVED76[2];
  volatile uint32_t JSQR;
  const volatile uint32_t RESERVED96[4];
  volatile uint32_t OFR1;
  volatile uint32_t OFR2;
  volatile uint32_t OFR3;
  volatile uint32_t OFR4;
  const volatile uint32_t RESERVED128[4];
  volatile const uint32_t JDR1;
  volatile const uint32_t JDR2;
  volatile const uint32_t JDR3;
  volatile const uint32_t JDR4;
  const volatile uint32_t RESERVED160[4];
  volatile uint32_t AWD2CR;
  volatile uint32_t AWD3CR;
  const volatile uint32_t RESERVED176[2];
  volatile uint32_t LTR2;
  volatile uint32_t HTR2;
  volatile uint32_t LTR3;
  volatile uint32_t HTR3;
  volatile uint32_t DIFSEL;
  volatile uint32_t CALFACT;
  volatile uint32_t CALFACT2;
};
