via/viaems/src/platforms/stm32h743/device.h
#define ADC2  ((struct ADC2*)(0x40022100UL))
struct ADC3_Common {
  volatile const uint32_t CSR;
  const volatile uint32_t RESERVED8[1];
  volatile uint32_t CCR;
  volatile const uint32_t CDR;
  volatile const uint32_t CDR2;
};
#define ADC3_Common_CSR_ADRDY_MST          (0x1UL << 0) 
#define ADC3_Common_CSR_ADRDY_MST_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define ADC3_Common_CSR_EOSMP_MST          (0x1UL << 1) 
#define ADC3_Common_CSR_EOSMP_MST_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define ADC3_Common_CSR_EOC_MST          (0x1UL << 2) 
#define ADC3_Common_CSR_EOC_MST_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define ADC3_Common_CSR_EOS_MST          (0x1UL << 3) 
#define ADC3_Common_CSR_EOS_MST_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define ADC3_Common_CSR_OVR_MST          (0x1UL << 4) 
#define ADC3_Common_CSR_OVR_MST_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define ADC3_Common_CSR_JEOC_MST          (0x1UL << 5) 
#define ADC3_Common_CSR_JEOC_MST_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define ADC3_Common_CSR_JEOS_MST          (0x1UL << 6) 
#define ADC3_Common_CSR_JEOS_MST_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define ADC3_Common_CSR_AWD1_MST          (0x1UL << 7) 
#define ADC3_Common_CSR_AWD1_MST_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define ADC3_Common_CSR_AWD2_MST          (0x1UL << 8) 
#define ADC3_Common_CSR_AWD2_MST_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define ADC3_Common_CSR_AWD3_MST          (0x1UL << 9) 
#define ADC3_Common_CSR_AWD3_MST_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define ADC3_Common_CSR_JQOVF_MST          (0x1UL << 10) 
#define ADC3_Common_CSR_JQOVF_MST_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define ADC3_Common_CSR_ADRDY_SLV          (0x1UL << 16) 
#define ADC3_Common_CSR_ADRDY_SLV_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define ADC3_Common_CSR_EOSMP_SLV          (0x1UL << 17) 
#define ADC3_Common_CSR_EOSMP_SLV_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define ADC3_Common_CSR_EOC_SLV          (0x1UL << 18) 
#define ADC3_Common_CSR_EOC_SLV_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define ADC3_Common_CSR_EOS_SLV          (0x1UL << 19) 
#define ADC3_Common_CSR_EOS_SLV_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define ADC3_Common_CSR_OVR_SLV          (0x1UL << 20) 
#define ADC3_Common_CSR_OVR_SLV_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define ADC3_Common_CSR_JEOC_SLV          (0x1UL << 21) 
#define ADC3_Common_CSR_JEOC_SLV_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define ADC3_Common_CSR_JEOS_SLV          (0x1UL << 22) 
#define ADC3_Common_CSR_JEOS_SLV_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define ADC3_Common_CSR_AWD1_SLV          (0x1UL << 23) 
#define ADC3_Common_CSR_AWD1_SLV_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define ADC3_Common_CSR_AWD2_SLV          (0x1UL << 24) 
#define ADC3_Common_CSR_AWD2_SLV_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define ADC3_Common_CSR_AWD3_SLV          (0x1UL << 25) 
#define ADC3_Common_CSR_AWD3_SLV_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define ADC3_Common_CSR_JQOVF_SLV          (0x1UL << 26) 
#define ADC3_Common_CSR_JQOVF_SLV_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define ADC3_Common_CCR_DUAL          (0x1FUL << 0) 
#define ADC3_Common_CCR_DUAL_VAL(X) (((uint32_t)(X) & 0x1FUL) << 0)
#define ADC3_Common_CCR_DELAY          (0xFUL << 8) 
#define ADC3_Common_CCR_DELAY_VAL(X) (((uint32_t)(X) & 0xFUL) << 8)
#define ADC3_Common_CCR_DAMDF          (0x3UL << 14) 
#define ADC3_Common_CCR_DAMDF_VAL(X) (((uint32_t)(X) & 0x3UL) << 14)
#define ADC3_Common_CCR_CKMODE          (0x3UL << 16) 
#define ADC3_Common_CCR_CKMODE_VAL(X) (((uint32_t)(X) & 0x3UL) << 16)
#define ADC3_Common_CCR_PRESC          (0xFUL << 18) 
#define ADC3_Common_CCR_PRESC_VAL(X) (((uint32_t)(X) & 0xFUL) << 18)
#define ADC3_Common_CCR_VREFEN          (0x1UL << 22) 
#define ADC3_Common_CCR_VREFEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define ADC3_Common_CCR_VSENSEEN          (0x1UL << 23) 
#define ADC3_Common_CCR_VSENSEEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define ADC3_Common_CCR_VBATEN          (0x1UL << 24) 
#define ADC3_Common_CCR_VBATEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define ADC3_Common_CDR_RDATA_SLV          (0xFFFFUL << 16) 
#define ADC3_Common_CDR_RDATA_SLV_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define ADC3_Common_CDR_RDATA_MST          (0xFFFFUL << 0) 
#define ADC3_Common_CDR_RDATA_MST_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define ADC3_Common_CDR2_RDATA_ALT          (0xFFFFFFFFUL << 0) 
#define ADC3_Common_CDR2_RDATA_ALT_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)

#define ADC3_Common  ((struct ADC3_Common*)(0x58026300UL))
struct ADC12_Common {
  volatile const uint32_t CSR;
  const volatile uint32_t RESERVED8[1];
  volatile uint32_t CCR;
  volatile const uint32_t CDR;
  volatile const uint32_t CDR2;
};
#define ADC12_Common_CSR_ADRDY_MST          (0x1UL << 0) 
#define ADC12_Common_CSR_ADRDY_MST_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define ADC12_Common_CSR_EOSMP_MST          (0x1UL << 1) 
#define ADC12_Common_CSR_EOSMP_MST_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define ADC12_Common_CSR_EOC_MST          (0x1UL << 2) 
#define ADC12_Common_CSR_EOC_MST_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define ADC12_Common_CSR_EOS_MST          (0x1UL << 3) 
#define ADC12_Common_CSR_EOS_MST_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define ADC12_Common_CSR_OVR_MST          (0x1UL << 4) 
#define ADC12_Common_CSR_OVR_MST_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define ADC12_Common_CSR_JEOC_MST          (0x1UL << 5) 
#define ADC12_Common_CSR_JEOC_MST_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define ADC12_Common_CSR_JEOS_MST          (0x1UL << 6) 
#define ADC12_Common_CSR_JEOS_MST_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define ADC12_Common_CSR_AWD1_MST          (0x1UL << 7) 
#define ADC12_Common_CSR_AWD1_MST_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define ADC12_Common_CSR_AWD2_MST          (0x1UL << 8) 
#define ADC12_Common_CSR_AWD2_MST_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define ADC12_Common_CSR_AWD3_MST          (0x1UL << 9) 
#define ADC12_Common_CSR_AWD3_MST_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define ADC12_Common_CSR_JQOVF_MST          (0x1UL << 10) 
#define ADC12_Common_CSR_JQOVF_MST_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define ADC12_Common_CSR_ADRDY_SLV          (0x1UL << 16) 
#define ADC12_Common_CSR_ADRDY_SLV_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define ADC12_Common_CSR_EOSMP_SLV          (0x1UL << 17) 
#define ADC12_Common_CSR_EOSMP_SLV_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define ADC12_Common_CSR_EOC_SLV          (0x1UL << 18) 
#define ADC12_Common_CSR_EOC_SLV_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define ADC12_Common_CSR_EOS_SLV          (0x1UL << 19) 
#define ADC12_Common_CSR_EOS_SLV_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define ADC12_Common_CSR_OVR_SLV          (0x1UL << 20) 
#define ADC12_Common_CSR_OVR_SLV_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define ADC12_Common_CSR_JEOC_SLV          (0x1UL << 21) 
#define ADC12_Common_CSR_JEOC_SLV_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define ADC12_Common_CSR_JEOS_SLV          (0x1UL << 22) 
#define ADC12_Common_CSR_JEOS_SLV_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define ADC12_Common_CSR_AWD1_SLV          (0x1UL << 23) 
#define ADC12_Common_CSR_AWD1_SLV_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define ADC12_Common_CSR_AWD2_SLV          (0x1UL << 24) 
#define ADC12_Common_CSR_AWD2_SLV_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define ADC12_Common_CSR_AWD3_SLV          (0x1UL << 25) 
#define ADC12_Common_CSR_AWD3_SLV_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define ADC12_Common_CSR_JQOVF_SLV          (0x1UL << 26) 
#define ADC12_Common_CSR_JQOVF_SLV_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define ADC12_Common_CCR_DUAL          (0x1FUL << 0) 
#define ADC12_Common_CCR_DUAL_VAL(X) (((uint32_t)(X) & 0x1FUL) << 0)
#define ADC12_Common_CCR_DELAY          (0xFUL << 8) 
#define ADC12_Common_CCR_DELAY_VAL(X) (((uint32_t)(X) & 0xFUL) << 8)
#define ADC12_Common_CCR_DAMDF          (0x3UL << 14) 
#define ADC12_Common_CCR_DAMDF_VAL(X) (((uint32_t)(X) & 0x3UL) << 14)
#define ADC12_Common_CCR_CKMODE          (0x3UL << 16) 
#define ADC12_Common_CCR_CKMODE_VAL(X) (((uint32_t)(X) & 0x3UL) << 16)
#define ADC12_Common_CCR_PRESC          (0xFUL << 18) 
#define ADC12_Common_CCR_PRESC_VAL(X) (((uint32_t)(X) & 0xFUL) << 18)
#define ADC12_Common_CCR_VREFEN          (0x1UL << 22) 
#define ADC12_Common_CCR_VREFEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define ADC12_Common_CCR_VSENSEEN          (0x1UL << 23) 
#define ADC12_Common_CCR_VSENSEEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define ADC12_Common_CCR_VBATEN          (0x1UL << 24) 
#define ADC12_Common_CCR_VBATEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define ADC12_Common_CDR_RDATA_SLV          (0xFFFFUL << 16) 
#define ADC12_Common_CDR_RDATA_SLV_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define ADC12_Common_CDR_RDATA_MST          (0xFFFFUL << 0) 
#define ADC12_Common_CDR_RDATA_MST_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define ADC12_Common_CDR2_RDATA_ALT          (0xFFFFFFFFUL << 0) 
#define ADC12_Common_CDR2_RDATA_ALT_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)

