via/viaems/src/platforms/stm32h743/device.h
#define ADC12_Common  ((struct ADC12_Common*)(0x40022300UL))
struct DMAMUX1 {
  volatile uint32_t C0CR;
  volatile uint32_t C1CR;
  volatile uint32_t C2CR;
  volatile uint32_t C3CR;
  volatile uint32_t C4CR;
  volatile uint32_t C5CR;
  volatile uint32_t C6CR;
  volatile uint32_t C7CR;
  volatile uint32_t C8CR;
  volatile uint32_t C9CR;
  volatile uint32_t C10CR;
  volatile uint32_t C11CR;
  volatile uint32_t C12CR;
  volatile uint32_t C13CR;
  volatile uint32_t C14CR;
  volatile uint32_t C15CR;
  const volatile uint32_t RESERVED128[16];
  volatile const uint32_t CSR;
  volatile uint32_t CFR;
  const volatile uint32_t RESERVED256[30];
  volatile uint32_t RG0CR;
  volatile uint32_t RG1CR;
  volatile uint32_t RG2CR;
  volatile uint32_t RG3CR;
  volatile uint32_t RG4CR;
  volatile uint32_t RG5CR;
  volatile uint32_t RG6CR;
  volatile uint32_t RG7CR;
  const volatile uint32_t RESERVED320[8];
  volatile const uint32_t RGSR;
  volatile uint32_t RGCFR;
};
#define DMAMUX1_C0CR_DMAREQ_ID          (0xFFUL << 0) 
#define DMAMUX1_C0CR_DMAREQ_ID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DMAMUX1_C0CR_SOIE          (0x1UL << 8) 
#define DMAMUX1_C0CR_SOIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DMAMUX1_C0CR_EGE          (0x1UL << 9) 
#define DMAMUX1_C0CR_EGE_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define DMAMUX1_C0CR_SE          (0x1UL << 16) 
#define DMAMUX1_C0CR_SE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define DMAMUX1_C0CR_SPOL          (0x3UL << 17) 
#define DMAMUX1_C0CR_SPOL_VAL(X) (((uint32_t)(X) & 0x3UL) << 17)
#define DMAMUX1_C0CR_NBREQ          (0x1FUL << 19) 
#define DMAMUX1_C0CR_NBREQ_VAL(X) (((uint32_t)(X) & 0x1FUL) << 19)
#define DMAMUX1_C0CR_SYNC_ID          (0x1FUL << 24) 
#define DMAMUX1_C0CR_SYNC_ID_VAL(X) (((uint32_t)(X) & 0x1FUL) << 24)
#define DMAMUX1_C1CR_DMAREQ_ID          (0xFFUL << 0) 
#define DMAMUX1_C1CR_DMAREQ_ID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DMAMUX1_C1CR_SOIE          (0x1UL << 8) 
#define DMAMUX1_C1CR_SOIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DMAMUX1_C1CR_EGE          (0x1UL << 9) 
#define DMAMUX1_C1CR_EGE_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define DMAMUX1_C1CR_SE          (0x1UL << 16) 
#define DMAMUX1_C1CR_SE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define DMAMUX1_C1CR_SPOL          (0x3UL << 17) 
#define DMAMUX1_C1CR_SPOL_VAL(X) (((uint32_t)(X) & 0x3UL) << 17)
#define DMAMUX1_C1CR_NBREQ          (0x1FUL << 19) 
#define DMAMUX1_C1CR_NBREQ_VAL(X) (((uint32_t)(X) & 0x1FUL) << 19)
#define DMAMUX1_C1CR_SYNC_ID          (0x1FUL << 24) 
#define DMAMUX1_C1CR_SYNC_ID_VAL(X) (((uint32_t)(X) & 0x1FUL) << 24)
#define DMAMUX1_C2CR_DMAREQ_ID          (0xFFUL << 0) 
#define DMAMUX1_C2CR_DMAREQ_ID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DMAMUX1_C2CR_SOIE          (0x1UL << 8) 
#define DMAMUX1_C2CR_SOIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DMAMUX1_C2CR_EGE          (0x1UL << 9) 
#define DMAMUX1_C2CR_EGE_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define DMAMUX1_C2CR_SE          (0x1UL << 16) 
#define DMAMUX1_C2CR_SE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define DMAMUX1_C2CR_SPOL          (0x3UL << 17) 
#define DMAMUX1_C2CR_SPOL_VAL(X) (((uint32_t)(X) & 0x3UL) << 17)
#define DMAMUX1_C2CR_NBREQ          (0x1FUL << 19) 
#define DMAMUX1_C2CR_NBREQ_VAL(X) (((uint32_t)(X) & 0x1FUL) << 19)
#define DMAMUX1_C2CR_SYNC_ID          (0x1FUL << 24) 
#define DMAMUX1_C2CR_SYNC_ID_VAL(X) (((uint32_t)(X) & 0x1FUL) << 24)
#define DMAMUX1_C3CR_DMAREQ_ID          (0xFFUL << 0) 
#define DMAMUX1_C3CR_DMAREQ_ID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DMAMUX1_C3CR_SOIE          (0x1UL << 8) 
#define DMAMUX1_C3CR_SOIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DMAMUX1_C3CR_EGE          (0x1UL << 9) 
#define DMAMUX1_C3CR_EGE_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define DMAMUX1_C3CR_SE          (0x1UL << 16) 
#define DMAMUX1_C3CR_SE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define DMAMUX1_C3CR_SPOL          (0x3UL << 17) 
#define DMAMUX1_C3CR_SPOL_VAL(X) (((uint32_t)(X) & 0x3UL) << 17)
#define DMAMUX1_C3CR_NBREQ          (0x1FUL << 19) 
#define DMAMUX1_C3CR_NBREQ_VAL(X) (((uint32_t)(X) & 0x1FUL) << 19)
#define DMAMUX1_C3CR_SYNC_ID          (0x1FUL << 24) 
#define DMAMUX1_C3CR_SYNC_ID_VAL(X) (((uint32_t)(X) & 0x1FUL) << 24)
#define DMAMUX1_C4CR_DMAREQ_ID          (0xFFUL << 0) 
#define DMAMUX1_C4CR_DMAREQ_ID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DMAMUX1_C4CR_SOIE          (0x1UL << 8) 
#define DMAMUX1_C4CR_SOIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DMAMUX1_C4CR_EGE          (0x1UL << 9) 
#define DMAMUX1_C4CR_EGE_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define DMAMUX1_C4CR_SE          (0x1UL << 16) 
#define DMAMUX1_C4CR_SE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define DMAMUX1_C4CR_SPOL          (0x3UL << 17) 
#define DMAMUX1_C4CR_SPOL_VAL(X) (((uint32_t)(X) & 0x3UL) << 17)
#define DMAMUX1_C4CR_NBREQ          (0x1FUL << 19) 
#define DMAMUX1_C4CR_NBREQ_VAL(X) (((uint32_t)(X) & 0x1FUL) << 19)
#define DMAMUX1_C4CR_SYNC_ID          (0x1FUL << 24) 
#define DMAMUX1_C4CR_SYNC_ID_VAL(X) (((uint32_t)(X) & 0x1FUL) << 24)
#define DMAMUX1_C5CR_DMAREQ_ID          (0xFFUL << 0) 
#define DMAMUX1_C5CR_DMAREQ_ID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DMAMUX1_C5CR_SOIE          (0x1UL << 8) 
#define DMAMUX1_C5CR_SOIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DMAMUX1_C5CR_EGE          (0x1UL << 9) 
#define DMAMUX1_C5CR_EGE_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define DMAMUX1_C5CR_SE          (0x1UL << 16) 
#define DMAMUX1_C5CR_SE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define DMAMUX1_C5CR_SPOL          (0x3UL << 17) 
#define DMAMUX1_C5CR_SPOL_VAL(X) (((uint32_t)(X) & 0x3UL) << 17)
#define DMAMUX1_C5CR_NBREQ          (0x1FUL << 19) 
#define DMAMUX1_C5CR_NBREQ_VAL(X) (((uint32_t)(X) & 0x1FUL) << 19)
#define DMAMUX1_C5CR_SYNC_ID          (0x1FUL << 24) 
#define DMAMUX1_C5CR_SYNC_ID_VAL(X) (((uint32_t)(X) & 0x1FUL) << 24)
#define DMAMUX1_C6CR_DMAREQ_ID          (0xFFUL << 0) 
#define DMAMUX1_C6CR_DMAREQ_ID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DMAMUX1_C6CR_SOIE          (0x1UL << 8) 
#define DMAMUX1_C6CR_SOIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DMAMUX1_C6CR_EGE          (0x1UL << 9) 
#define DMAMUX1_C6CR_EGE_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define DMAMUX1_C6CR_SE          (0x1UL << 16) 
#define DMAMUX1_C6CR_SE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define DMAMUX1_C6CR_SPOL          (0x3UL << 17) 
#define DMAMUX1_C6CR_SPOL_VAL(X) (((uint32_t)(X) & 0x3UL) << 17)
#define DMAMUX1_C6CR_NBREQ          (0x1FUL << 19) 
#define DMAMUX1_C6CR_NBREQ_VAL(X) (((uint32_t)(X) & 0x1FUL) << 19)
#define DMAMUX1_C6CR_SYNC_ID          (0x1FUL << 24) 
#define DMAMUX1_C6CR_SYNC_ID_VAL(X) (((uint32_t)(X) & 0x1FUL) << 24)
#define DMAMUX1_C7CR_DMAREQ_ID          (0xFFUL << 0) 
#define DMAMUX1_C7CR_DMAREQ_ID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DMAMUX1_C7CR_SOIE          (0x1UL << 8) 
#define DMAMUX1_C7CR_SOIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DMAMUX1_C7CR_EGE          (0x1UL << 9) 
#define DMAMUX1_C7CR_EGE_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define DMAMUX1_C7CR_SE          (0x1UL << 16) 
#define DMAMUX1_C7CR_SE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define DMAMUX1_C7CR_SPOL          (0x3UL << 17) 
#define DMAMUX1_C7CR_SPOL_VAL(X) (((uint32_t)(X) & 0x3UL) << 17)
#define DMAMUX1_C7CR_NBREQ          (0x1FUL << 19) 
#define DMAMUX1_C7CR_NBREQ_VAL(X) (((uint32_t)(X) & 0x1FUL) << 19)
#define DMAMUX1_C7CR_SYNC_ID          (0x1FUL << 24) 
#define DMAMUX1_C7CR_SYNC_ID_VAL(X) (((uint32_t)(X) & 0x1FUL) << 24)
#define DMAMUX1_C8CR_DMAREQ_ID          (0xFFUL << 0) 
#define DMAMUX1_C8CR_DMAREQ_ID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DMAMUX1_C8CR_SOIE          (0x1UL << 8) 
#define DMAMUX1_C8CR_SOIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DMAMUX1_C8CR_EGE          (0x1UL << 9) 
#define DMAMUX1_C8CR_EGE_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define DMAMUX1_C8CR_SE          (0x1UL << 16) 
#define DMAMUX1_C8CR_SE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define DMAMUX1_C8CR_SPOL          (0x3UL << 17) 
#define DMAMUX1_C8CR_SPOL_VAL(X) (((uint32_t)(X) & 0x3UL) << 17)
#define DMAMUX1_C8CR_NBREQ          (0x1FUL << 19) 
#define DMAMUX1_C8CR_NBREQ_VAL(X) (((uint32_t)(X) & 0x1FUL) << 19)
#define DMAMUX1_C8CR_SYNC_ID          (0x1FUL << 24) 
#define DMAMUX1_C8CR_SYNC_ID_VAL(X) (((uint32_t)(X) & 0x1FUL) << 24)
#define DMAMUX1_C9CR_DMAREQ_ID          (0xFFUL << 0) 
#define DMAMUX1_C9CR_DMAREQ_ID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DMAMUX1_C9CR_SOIE          (0x1UL << 8) 
#define DMAMUX1_C9CR_SOIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DMAMUX1_C9CR_EGE          (0x1UL << 9) 
#define DMAMUX1_C9CR_EGE_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define DMAMUX1_C9CR_SE          (0x1UL << 16) 
#define DMAMUX1_C9CR_SE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define DMAMUX1_C9CR_SPOL          (0x3UL << 17) 
#define DMAMUX1_C9CR_SPOL_VAL(X) (((uint32_t)(X) & 0x3UL) << 17)
#define DMAMUX1_C9CR_NBREQ          (0x1FUL << 19) 
#define DMAMUX1_C9CR_NBREQ_VAL(X) (((uint32_t)(X) & 0x1FUL) << 19)
#define DMAMUX1_C9CR_SYNC_ID          (0x1FUL << 24) 
#define DMAMUX1_C9CR_SYNC_ID_VAL(X) (((uint32_t)(X) & 0x1FUL) << 24)
#define DMAMUX1_C10CR_DMAREQ_ID          (0xFFUL << 0) 
#define DMAMUX1_C10CR_DMAREQ_ID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DMAMUX1_C10CR_SOIE          (0x1UL << 8) 
#define DMAMUX1_C10CR_SOIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DMAMUX1_C10CR_EGE          (0x1UL << 9) 
#define DMAMUX1_C10CR_EGE_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define DMAMUX1_C10CR_SE          (0x1UL << 16) 
#define DMAMUX1_C10CR_SE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define DMAMUX1_C10CR_SPOL          (0x3UL << 17) 
#define DMAMUX1_C10CR_SPOL_VAL(X) (((uint32_t)(X) & 0x3UL) << 17)
#define DMAMUX1_C10CR_NBREQ          (0x1FUL << 19) 
#define DMAMUX1_C10CR_NBREQ_VAL(X) (((uint32_t)(X) & 0x1FUL) << 19)
#define DMAMUX1_C10CR_SYNC_ID          (0x1FUL << 24) 
#define DMAMUX1_C10CR_SYNC_ID_VAL(X) (((uint32_t)(X) & 0x1FUL) << 24)
#define DMAMUX1_C11CR_DMAREQ_ID          (0xFFUL << 0) 
#define DMAMUX1_C11CR_DMAREQ_ID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DMAMUX1_C11CR_SOIE          (0x1UL << 8) 
#define DMAMUX1_C11CR_SOIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DMAMUX1_C11CR_EGE          (0x1UL << 9) 
#define DMAMUX1_C11CR_EGE_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define DMAMUX1_C11CR_SE          (0x1UL << 16) 
#define DMAMUX1_C11CR_SE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define DMAMUX1_C11CR_SPOL          (0x3UL << 17) 
#define DMAMUX1_C11CR_SPOL_VAL(X) (((uint32_t)(X) & 0x3UL) << 17)
#define DMAMUX1_C11CR_NBREQ          (0x1FUL << 19) 
#define DMAMUX1_C11CR_NBREQ_VAL(X) (((uint32_t)(X) & 0x1FUL) << 19)
#define DMAMUX1_C11CR_SYNC_ID          (0x1FUL << 24) 
#define DMAMUX1_C11CR_SYNC_ID_VAL(X) (((uint32_t)(X) & 0x1FUL) << 24)
#define DMAMUX1_C12CR_DMAREQ_ID          (0xFFUL << 0) 
#define DMAMUX1_C12CR_DMAREQ_ID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DMAMUX1_C12CR_SOIE          (0x1UL << 8) 
#define DMAMUX1_C12CR_SOIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DMAMUX1_C12CR_EGE          (0x1UL << 9) 
#define DMAMUX1_C12CR_EGE_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define DMAMUX1_C12CR_SE          (0x1UL << 16) 
#define DMAMUX1_C12CR_SE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define DMAMUX1_C12CR_SPOL          (0x3UL << 17) 
#define DMAMUX1_C12CR_SPOL_VAL(X) (((uint32_t)(X) & 0x3UL) << 17)
#define DMAMUX1_C12CR_NBREQ          (0x1FUL << 19) 
#define DMAMUX1_C12CR_NBREQ_VAL(X) (((uint32_t)(X) & 0x1FUL) << 19)
#define DMAMUX1_C12CR_SYNC_ID          (0x1FUL << 24) 
#define DMAMUX1_C12CR_SYNC_ID_VAL(X) (((uint32_t)(X) & 0x1FUL) << 24)
#define DMAMUX1_C13CR_DMAREQ_ID          (0xFFUL << 0) 
#define DMAMUX1_C13CR_DMAREQ_ID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DMAMUX1_C13CR_SOIE          (0x1UL << 8) 
#define DMAMUX1_C13CR_SOIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DMAMUX1_C13CR_EGE          (0x1UL << 9) 
#define DMAMUX1_C13CR_EGE_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define DMAMUX1_C13CR_SE          (0x1UL << 16) 
#define DMAMUX1_C13CR_SE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define DMAMUX1_C13CR_SPOL          (0x3UL << 17) 
#define DMAMUX1_C13CR_SPOL_VAL(X) (((uint32_t)(X) & 0x3UL) << 17)
#define DMAMUX1_C13CR_NBREQ          (0x1FUL << 19) 
#define DMAMUX1_C13CR_NBREQ_VAL(X) (((uint32_t)(X) & 0x1FUL) << 19)
#define DMAMUX1_C13CR_SYNC_ID          (0x1FUL << 24) 
#define DMAMUX1_C13CR_SYNC_ID_VAL(X) (((uint32_t)(X) & 0x1FUL) << 24)
#define DMAMUX1_C14CR_DMAREQ_ID          (0xFFUL << 0) 
#define DMAMUX1_C14CR_DMAREQ_ID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DMAMUX1_C14CR_SOIE          (0x1UL << 8) 
#define DMAMUX1_C14CR_SOIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DMAMUX1_C14CR_EGE          (0x1UL << 9) 
#define DMAMUX1_C14CR_EGE_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define DMAMUX1_C14CR_SE          (0x1UL << 16) 
#define DMAMUX1_C14CR_SE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define DMAMUX1_C14CR_SPOL          (0x3UL << 17) 
#define DMAMUX1_C14CR_SPOL_VAL(X) (((uint32_t)(X) & 0x3UL) << 17)
#define DMAMUX1_C14CR_NBREQ          (0x1FUL << 19) 
#define DMAMUX1_C14CR_NBREQ_VAL(X) (((uint32_t)(X) & 0x1FUL) << 19)
#define DMAMUX1_C14CR_SYNC_ID          (0x1FUL << 24) 
#define DMAMUX1_C14CR_SYNC_ID_VAL(X) (((uint32_t)(X) & 0x1FUL) << 24)
#define DMAMUX1_C15CR_DMAREQ_ID          (0xFFUL << 0) 
#define DMAMUX1_C15CR_DMAREQ_ID_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DMAMUX1_C15CR_SOIE          (0x1UL << 8) 
#define DMAMUX1_C15CR_SOIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DMAMUX1_C15CR_EGE          (0x1UL << 9) 
#define DMAMUX1_C15CR_EGE_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define DMAMUX1_C15CR_SE          (0x1UL << 16) 
#define DMAMUX1_C15CR_SE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define DMAMUX1_C15CR_SPOL          (0x3UL << 17) 
#define DMAMUX1_C15CR_SPOL_VAL(X) (((uint32_t)(X) & 0x3UL) << 17)
#define DMAMUX1_C15CR_NBREQ          (0x1FUL << 19) 
#define DMAMUX1_C15CR_NBREQ_VAL(X) (((uint32_t)(X) & 0x1FUL) << 19)
#define DMAMUX1_C15CR_SYNC_ID          (0x1FUL << 24) 
#define DMAMUX1_C15CR_SYNC_ID_VAL(X) (((uint32_t)(X) & 0x1FUL) << 24)
#define DMAMUX1_RG0CR_SIG_ID          (0x1FUL << 0) 
#define DMAMUX1_RG0CR_SIG_ID_VAL(X) (((uint32_t)(X) & 0x1FUL) << 0)
#define DMAMUX1_RG0CR_OIE          (0x1UL << 8) 
#define DMAMUX1_RG0CR_OIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DMAMUX1_RG0CR_GE          (0x1UL << 16) 
#define DMAMUX1_RG0CR_GE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define DMAMUX1_RG0CR_GPOL          (0x3UL << 17) 
#define DMAMUX1_RG0CR_GPOL_VAL(X) (((uint32_t)(X) & 0x3UL) << 17)
#define DMAMUX1_RG0CR_GNBREQ          (0x1FUL << 19) 
#define DMAMUX1_RG0CR_GNBREQ_VAL(X) (((uint32_t)(X) & 0x1FUL) << 19)
#define DMAMUX1_RG1CR_SIG_ID          (0x1FUL << 0) 
#define DMAMUX1_RG1CR_SIG_ID_VAL(X) (((uint32_t)(X) & 0x1FUL) << 0)
#define DMAMUX1_RG1CR_OIE          (0x1UL << 8) 
#define DMAMUX1_RG1CR_OIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DMAMUX1_RG1CR_GE          (0x1UL << 16) 
#define DMAMUX1_RG1CR_GE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define DMAMUX1_RG1CR_GPOL          (0x3UL << 17) 
#define DMAMUX1_RG1CR_GPOL_VAL(X) (((uint32_t)(X) & 0x3UL) << 17)
#define DMAMUX1_RG1CR_GNBREQ          (0x1FUL << 19) 
#define DMAMUX1_RG1CR_GNBREQ_VAL(X) (((uint32_t)(X) & 0x1FUL) << 19)
#define DMAMUX1_RG2CR_SIG_ID          (0x1FUL << 0) 
#define DMAMUX1_RG2CR_SIG_ID_VAL(X) (((uint32_t)(X) & 0x1FUL) << 0)
#define DMAMUX1_RG2CR_OIE          (0x1UL << 8) 
#define DMAMUX1_RG2CR_OIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DMAMUX1_RG2CR_GE          (0x1UL << 16) 
#define DMAMUX1_RG2CR_GE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define DMAMUX1_RG2CR_GPOL          (0x3UL << 17) 
#define DMAMUX1_RG2CR_GPOL_VAL(X) (((uint32_t)(X) & 0x3UL) << 17)
#define DMAMUX1_RG2CR_GNBREQ          (0x1FUL << 19) 
#define DMAMUX1_RG2CR_GNBREQ_VAL(X) (((uint32_t)(X) & 0x1FUL) << 19)
#define DMAMUX1_RG3CR_SIG_ID          (0x1FUL << 0) 
#define DMAMUX1_RG3CR_SIG_ID_VAL(X) (((uint32_t)(X) & 0x1FUL) << 0)
#define DMAMUX1_RG3CR_OIE          (0x1UL << 8) 
#define DMAMUX1_RG3CR_OIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DMAMUX1_RG3CR_GE          (0x1UL << 16) 
#define DMAMUX1_RG3CR_GE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define DMAMUX1_RG3CR_GPOL          (0x3UL << 17) 
#define DMAMUX1_RG3CR_GPOL_VAL(X) (((uint32_t)(X) & 0x3UL) << 17)
#define DMAMUX1_RG3CR_GNBREQ          (0x1FUL << 19) 
#define DMAMUX1_RG3CR_GNBREQ_VAL(X) (((uint32_t)(X) & 0x1FUL) << 19)
#define DMAMUX1_RG4CR_SIG_ID          (0x1FUL << 0) 
#define DMAMUX1_RG4CR_SIG_ID_VAL(X) (((uint32_t)(X) & 0x1FUL) << 0)
#define DMAMUX1_RG4CR_OIE          (0x1UL << 8) 
#define DMAMUX1_RG4CR_OIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DMAMUX1_RG4CR_GE          (0x1UL << 16) 
#define DMAMUX1_RG4CR_GE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define DMAMUX1_RG4CR_GPOL          (0x3UL << 17) 
#define DMAMUX1_RG4CR_GPOL_VAL(X) (((uint32_t)(X) & 0x3UL) << 17)
#define DMAMUX1_RG4CR_GNBREQ          (0x1FUL << 19) 
#define DMAMUX1_RG4CR_GNBREQ_VAL(X) (((uint32_t)(X) & 0x1FUL) << 19)
#define DMAMUX1_RG5CR_SIG_ID          (0x1FUL << 0) 
#define DMAMUX1_RG5CR_SIG_ID_VAL(X) (((uint32_t)(X) & 0x1FUL) << 0)
#define DMAMUX1_RG5CR_OIE          (0x1UL << 8) 
#define DMAMUX1_RG5CR_OIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DMAMUX1_RG5CR_GE          (0x1UL << 16) 
#define DMAMUX1_RG5CR_GE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define DMAMUX1_RG5CR_GPOL          (0x3UL << 17) 
#define DMAMUX1_RG5CR_GPOL_VAL(X) (((uint32_t)(X) & 0x3UL) << 17)
#define DMAMUX1_RG5CR_GNBREQ          (0x1FUL << 19) 
#define DMAMUX1_RG5CR_GNBREQ_VAL(X) (((uint32_t)(X) & 0x1FUL) << 19)
#define DMAMUX1_RG6CR_SIG_ID          (0x1FUL << 0) 
#define DMAMUX1_RG6CR_SIG_ID_VAL(X) (((uint32_t)(X) & 0x1FUL) << 0)
#define DMAMUX1_RG6CR_OIE          (0x1UL << 8) 
#define DMAMUX1_RG6CR_OIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DMAMUX1_RG6CR_GE          (0x1UL << 16) 
#define DMAMUX1_RG6CR_GE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define DMAMUX1_RG6CR_GPOL          (0x3UL << 17) 
#define DMAMUX1_RG6CR_GPOL_VAL(X) (((uint32_t)(X) & 0x3UL) << 17)
#define DMAMUX1_RG6CR_GNBREQ          (0x1FUL << 19) 
#define DMAMUX1_RG6CR_GNBREQ_VAL(X) (((uint32_t)(X) & 0x1FUL) << 19)
#define DMAMUX1_RG7CR_SIG_ID          (0x1FUL << 0) 
#define DMAMUX1_RG7CR_SIG_ID_VAL(X) (((uint32_t)(X) & 0x1FUL) << 0)
#define DMAMUX1_RG7CR_OIE          (0x1UL << 8) 
#define DMAMUX1_RG7CR_OIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DMAMUX1_RG7CR_GE          (0x1UL << 16) 
#define DMAMUX1_RG7CR_GE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define DMAMUX1_RG7CR_GPOL          (0x3UL << 17) 
#define DMAMUX1_RG7CR_GPOL_VAL(X) (((uint32_t)(X) & 0x3UL) << 17)
#define DMAMUX1_RG7CR_GNBREQ          (0x1FUL << 19) 
#define DMAMUX1_RG7CR_GNBREQ_VAL(X) (((uint32_t)(X) & 0x1FUL) << 19)
#define DMAMUX1_RGSR_OF          (0xFFUL << 0) 
#define DMAMUX1_RGSR_OF_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DMAMUX1_RGCFR_COF          (0xFFUL << 0) 
#define DMAMUX1_RGCFR_COF_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DMAMUX1_CSR_SOF          (0xFFFFUL << 0) 
#define DMAMUX1_CSR_SOF_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define DMAMUX1_CFR_CSOF          (0xFFFFUL << 0) 
#define DMAMUX1_CFR_CSOF_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)

#define DMAMUX1  ((struct DMAMUX1*)(0x40020800UL))
struct CRC {
  volatile uint32_t DR;
  volatile uint32_t IDR;
  volatile uint32_t CR;
  volatile uint32_t INIT;
  volatile uint32_t POL;
};
