via/viaems/src/platforms/stm32h743/device.h
#define CRC_DR_DR          (0xFFFFFFFFUL << 0) 
#define CRC_DR_DR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define CRC_IDR_IDR          (0xFFFFFFFFUL << 0) 
#define CRC_IDR_IDR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define CRC_CR_RESET          (0x1UL << 0) 
#define CRC_CR_RESET_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define CRC_CR_POLYSIZE          (0x3UL << 3) 
#define CRC_CR_POLYSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 3)
#define CRC_CR_REV_IN          (0x3UL << 5) 
#define CRC_CR_REV_IN_VAL(X) (((uint32_t)(X) & 0x3UL) << 5)
#define CRC_CR_REV_OUT          (0x1UL << 7) 
#define CRC_CR_REV_OUT_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define CRC_INIT_CRC_INIT          (0xFFFFFFFFUL << 0) 
#define CRC_INIT_CRC_INIT_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define CRC_POL_POL          (0xFFFFFFFFUL << 0) 
#define CRC_POL_POL_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)

#define CRC  ((struct CRC*)(0x58024C00UL))
struct RCC {
  volatile uint32_t CR;
  volatile uint32_t ICSCR;
  volatile const uint32_t CRRCR;
  const volatile uint32_t RESERVED16[1];
  volatile uint32_t CFGR;
  const volatile uint32_t RESERVED24[1];
  volatile uint32_t D1CFGR;
  volatile uint32_t D2CFGR;
  volatile uint32_t D3CFGR;
  const volatile uint32_t RESERVED40[1];
  volatile uint32_t PLLCKSELR;
  volatile uint32_t PLLCFGR;
  volatile uint32_t PLL1DIVR;
  volatile uint32_t PLL1FRACR;
  volatile uint32_t PLL2DIVR;
  volatile uint32_t PLL2FRACR;
  volatile uint32_t PLL3DIVR;
  volatile uint32_t PLL3FRACR;
  const volatile uint32_t RESERVED76[1];
  volatile uint32_t D1CCIPR;
  volatile uint32_t D2CCIP1R;
  volatile uint32_t D2CCIP2R;
  volatile uint32_t D3CCIPR;
  const volatile uint32_t RESERVED96[1];
  volatile uint32_t CIER;
  volatile uint32_t CIFR;
  volatile uint32_t CICR;
  const volatile uint32_t RESERVED112[1];
  volatile uint32_t BDCR;
  volatile uint32_t CSR;
  const volatile uint32_t RESERVED124[1];
  volatile uint32_t AHB3RSTR;
  volatile uint32_t AHB1RSTR;
  volatile uint32_t AHB2RSTR;
  volatile uint32_t AHB4RSTR;
  volatile uint32_t APB3RSTR;
  volatile uint32_t APB1LRSTR;
  volatile uint32_t APB1HRSTR;
  volatile uint32_t APB2RSTR;
  volatile uint32_t APB4RSTR;
  volatile uint32_t GCR;
  const volatile uint32_t RESERVED168[1];
  volatile uint32_t D3AMR;
  const volatile uint32_t RESERVED208[9];
  volatile uint32_t RSR;
  volatile uint32_t AHB3ENR;
  volatile uint32_t AHB1ENR;
  volatile uint32_t AHB2ENR;
  volatile uint32_t AHB4ENR;
  volatile uint32_t APB3ENR;
  volatile uint32_t APB1LENR;
  volatile uint32_t APB1HENR;
  volatile uint32_t APB2ENR;
  volatile uint32_t APB4ENR;
  const volatile uint32_t RESERVED252[1];
  volatile uint32_t AHB3LPENR;
  volatile uint32_t AHB1LPENR;
  volatile uint32_t AHB2LPENR;
  volatile uint32_t AHB4LPENR;
  volatile uint32_t APB3LPENR;
  volatile uint32_t APB1LLPENR;
  volatile uint32_t APB1HLPENR;
  volatile uint32_t APB2LPENR;
  volatile uint32_t APB4LPENR;
  const volatile uint32_t RESERVED304[4];
  volatile uint32_t C1_RSR;
  volatile uint32_t C1_AHB3ENR;
  volatile uint32_t C1_AHB1ENR;
  volatile uint32_t C1_AHB2ENR;
  volatile uint32_t C1_AHB4ENR;
  volatile uint32_t C1_APB3ENR;
  volatile uint32_t C1_APB1LENR;
  volatile uint32_t C1_APB1HENR;
  volatile uint32_t C1_APB2ENR;
  volatile uint32_t C1_APB4ENR;
  const volatile uint32_t RESERVED348[1];
  volatile uint32_t C1_AHB3LPENR;
  volatile uint32_t C1_AHB1LPENR;
  volatile uint32_t C1_AHB2LPENR;
  volatile uint32_t C1_AHB4LPENR;
  volatile uint32_t C1_APB3LPENR;
  volatile uint32_t C1_APB1LLPENR;
  volatile uint32_t C1_APB1HLPENR;
  volatile uint32_t C1_APB2LPENR;
  volatile uint32_t C1_APB4LPENR;
};
#define RCC_CR_HSION          (0x1UL << 0) 
#define RCC_CR_HSION_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define RCC_CR_HSIKERON          (0x1UL << 1) 
#define RCC_CR_HSIKERON_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define RCC_CR_HSIRDY          (0x1UL << 2) 
#define RCC_CR_HSIRDY_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define RCC_CR_HSIDIV          (0x3UL << 3) 
#define RCC_CR_HSIDIV_VAL(X) (((uint32_t)(X) & 0x3UL) << 3)
#define RCC_CR_HSIDIVF          (0x1UL << 5) 
#define RCC_CR_HSIDIVF_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define RCC_CR_CSION          (0x1UL << 7) 
#define RCC_CR_CSION_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define RCC_CR_CSIRDY          (0x1UL << 8) 
#define RCC_CR_CSIRDY_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define RCC_CR_CSIKERON          (0x1UL << 9) 
#define RCC_CR_CSIKERON_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define RCC_CR_RC48ON          (0x1UL << 12) 
#define RCC_CR_RC48ON_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define RCC_CR_RC48RDY          (0x1UL << 13) 
#define RCC_CR_RC48RDY_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define RCC_CR_D1CKRDY          (0x1UL << 14) 
#define RCC_CR_D1CKRDY_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define RCC_CR_D2CKRDY          (0x1UL << 15) 
#define RCC_CR_D2CKRDY_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define RCC_CR_HSEON          (0x1UL << 16) 
#define RCC_CR_HSEON_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define RCC_CR_HSERDY          (0x1UL << 17) 
#define RCC_CR_HSERDY_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define RCC_CR_HSEBYP          (0x1UL << 18) 
#define RCC_CR_HSEBYP_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define RCC_CR_HSECSSON          (0x1UL << 19) 
#define RCC_CR_HSECSSON_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define RCC_CR_PLL1ON          (0x1UL << 24) 
#define RCC_CR_PLL1ON_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define RCC_CR_PLL1RDY          (0x1UL << 25) 
#define RCC_CR_PLL1RDY_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define RCC_CR_PLL2ON          (0x1UL << 26) 
#define RCC_CR_PLL2ON_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define RCC_CR_PLL2RDY          (0x1UL << 27) 
#define RCC_CR_PLL2RDY_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define RCC_CR_PLL3ON          (0x1UL << 28) 
#define RCC_CR_PLL3ON_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define RCC_CR_PLL3RDY          (0x1UL << 29) 
#define RCC_CR_PLL3RDY_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define RCC_ICSCR_HSICAL          (0xFFFUL << 0) 
#define RCC_ICSCR_HSICAL_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 0)
#define RCC_ICSCR_HSITRIM          (0x3FUL << 12) 
#define RCC_ICSCR_HSITRIM_VAL(X) (((uint32_t)(X) & 0x3FUL) << 12)
#define RCC_ICSCR_CSICAL          (0xFFUL << 18) 
#define RCC_ICSCR_CSICAL_VAL(X) (((uint32_t)(X) & 0xFFUL) << 18)
#define RCC_ICSCR_CSITRIM          (0x1FUL << 26) 
#define RCC_ICSCR_CSITRIM_VAL(X) (((uint32_t)(X) & 0x1FUL) << 26)
#define RCC_CRRCR_RC48CAL          (0x3FFUL << 0) 
#define RCC_CRRCR_RC48CAL_VAL(X) (((uint32_t)(X) & 0x3FFUL) << 0)
#define RCC_CFGR_SW          (0x7UL << 0) 
#define RCC_CFGR_SW_VAL(X) (((uint32_t)(X) & 0x7UL) << 0)
#define RCC_CFGR_SWS          (0x7UL << 3) 
#define RCC_CFGR_SWS_VAL(X) (((uint32_t)(X) & 0x7UL) << 3)
#define RCC_CFGR_STOPWUCK          (0x1UL << 6) 
#define RCC_CFGR_STOPWUCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define RCC_CFGR_STOPKERWUCK          (0x1UL << 7) 
#define RCC_CFGR_STOPKERWUCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define RCC_CFGR_RTCPRE          (0x3FUL << 8) 
#define RCC_CFGR_RTCPRE_VAL(X) (((uint32_t)(X) & 0x3FUL) << 8)
#define RCC_CFGR_HRTIMSEL          (0x1UL << 14) 
#define RCC_CFGR_HRTIMSEL_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define RCC_CFGR_TIMPRE          (0x1UL << 15) 
#define RCC_CFGR_TIMPRE_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define RCC_CFGR_MCO1PRE          (0xFUL << 18) 
#define RCC_CFGR_MCO1PRE_VAL(X) (((uint32_t)(X) & 0xFUL) << 18)
#define RCC_CFGR_MCO1SEL          (0x7UL << 22) 
#define RCC_CFGR_MCO1SEL_VAL(X) (((uint32_t)(X) & 0x7UL) << 22)
#define RCC_CFGR_MCO2PRE          (0xFUL << 25) 
#define RCC_CFGR_MCO2PRE_VAL(X) (((uint32_t)(X) & 0xFUL) << 25)
#define RCC_CFGR_MCO2SEL          (0x7UL << 29) 
#define RCC_CFGR_MCO2SEL_VAL(X) (((uint32_t)(X) & 0x7UL) << 29)
#define RCC_D1CFGR_HPRE          (0xFUL << 0) 
#define RCC_D1CFGR_HPRE_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define RCC_D1CFGR_D1PPRE          (0x7UL << 4) 
#define RCC_D1CFGR_D1PPRE_VAL(X) (((uint32_t)(X) & 0x7UL) << 4)
#define RCC_D1CFGR_D1CPRE          (0xFUL << 8) 
#define RCC_D1CFGR_D1CPRE_VAL(X) (((uint32_t)(X) & 0xFUL) << 8)
#define RCC_D2CFGR_D2PPRE1          (0x7UL << 4) 
#define RCC_D2CFGR_D2PPRE1_VAL(X) (((uint32_t)(X) & 0x7UL) << 4)
#define RCC_D2CFGR_D2PPRE2          (0x7UL << 8) 
#define RCC_D2CFGR_D2PPRE2_VAL(X) (((uint32_t)(X) & 0x7UL) << 8)
#define RCC_D3CFGR_D3PPRE          (0x7UL << 4) 
#define RCC_D3CFGR_D3PPRE_VAL(X) (((uint32_t)(X) & 0x7UL) << 4)
#define RCC_PLLCKSELR_PLLSRC          (0x3UL << 0) 
#define RCC_PLLCKSELR_PLLSRC_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define RCC_PLLCKSELR_DIVM1          (0x3FUL << 4) 
#define RCC_PLLCKSELR_DIVM1_VAL(X) (((uint32_t)(X) & 0x3FUL) << 4)
#define RCC_PLLCKSELR_DIVM2          (0x3FUL << 12) 
#define RCC_PLLCKSELR_DIVM2_VAL(X) (((uint32_t)(X) & 0x3FUL) << 12)
#define RCC_PLLCKSELR_DIVM3          (0x3FUL << 20) 
#define RCC_PLLCKSELR_DIVM3_VAL(X) (((uint32_t)(X) & 0x3FUL) << 20)
#define RCC_PLLCFGR_PLL1FRACEN          (0x1UL << 0) 
#define RCC_PLLCFGR_PLL1FRACEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define RCC_PLLCFGR_PLL1VCOSEL          (0x1UL << 1) 
#define RCC_PLLCFGR_PLL1VCOSEL_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define RCC_PLLCFGR_PLL1RGE          (0x3UL << 2) 
#define RCC_PLLCFGR_PLL1RGE_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define RCC_PLLCFGR_PLL2FRACEN          (0x1UL << 4) 
#define RCC_PLLCFGR_PLL2FRACEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define RCC_PLLCFGR_PLL2VCOSEL          (0x1UL << 5) 
#define RCC_PLLCFGR_PLL2VCOSEL_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define RCC_PLLCFGR_PLL2RGE          (0x3UL << 6) 
#define RCC_PLLCFGR_PLL2RGE_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define RCC_PLLCFGR_PLL3FRACEN          (0x1UL << 8) 
#define RCC_PLLCFGR_PLL3FRACEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define RCC_PLLCFGR_PLL3VCOSEL          (0x1UL << 9) 
#define RCC_PLLCFGR_PLL3VCOSEL_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define RCC_PLLCFGR_PLL3RGE          (0x3UL << 10) 
#define RCC_PLLCFGR_PLL3RGE_VAL(X) (((uint32_t)(X) & 0x3UL) << 10)
#define RCC_PLLCFGR_DIVP1EN          (0x1UL << 16) 
#define RCC_PLLCFGR_DIVP1EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define RCC_PLLCFGR_DIVQ1EN          (0x1UL << 17) 
#define RCC_PLLCFGR_DIVQ1EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define RCC_PLLCFGR_DIVR1EN          (0x1UL << 18) 
#define RCC_PLLCFGR_DIVR1EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define RCC_PLLCFGR_DIVP2EN          (0x1UL << 19) 
#define RCC_PLLCFGR_DIVP2EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define RCC_PLLCFGR_DIVQ2EN          (0x1UL << 20) 
#define RCC_PLLCFGR_DIVQ2EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define RCC_PLLCFGR_DIVR2EN          (0x1UL << 21) 
#define RCC_PLLCFGR_DIVR2EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define RCC_PLLCFGR_DIVP3EN          (0x1UL << 22) 
#define RCC_PLLCFGR_DIVP3EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define RCC_PLLCFGR_DIVQ3EN          (0x1UL << 23) 
#define RCC_PLLCFGR_DIVQ3EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define RCC_PLLCFGR_DIVR3EN          (0x1UL << 24) 
#define RCC_PLLCFGR_DIVR3EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define RCC_PLL1DIVR_DIVN1          (0x1FFUL << 0) 
#define RCC_PLL1DIVR_DIVN1_VAL(X) (((uint32_t)(X) & 0x1FFUL) << 0)
#define RCC_PLL1DIVR_DIVP1          (0x7FUL << 9) 
#define RCC_PLL1DIVR_DIVP1_VAL(X) (((uint32_t)(X) & 0x7FUL) << 9)
#define RCC_PLL1DIVR_DIVQ1          (0x7FUL << 16) 
#define RCC_PLL1DIVR_DIVQ1_VAL(X) (((uint32_t)(X) & 0x7FUL) << 16)
#define RCC_PLL1DIVR_DIVR1          (0x7FUL << 24) 
#define RCC_PLL1DIVR_DIVR1_VAL(X) (((uint32_t)(X) & 0x7FUL) << 24)
#define RCC_PLL1FRACR_FRACN1          (0x1FFFUL << 3) 
#define RCC_PLL1FRACR_FRACN1_VAL(X) (((uint32_t)(X) & 0x1FFFUL) << 3)
#define RCC_PLL2DIVR_DIVN1          (0x1FFUL << 0) 
#define RCC_PLL2DIVR_DIVN1_VAL(X) (((uint32_t)(X) & 0x1FFUL) << 0)
#define RCC_PLL2DIVR_DIVP1          (0x7FUL << 9) 
#define RCC_PLL2DIVR_DIVP1_VAL(X) (((uint32_t)(X) & 0x7FUL) << 9)
#define RCC_PLL2DIVR_DIVQ1          (0x7FUL << 16) 
#define RCC_PLL2DIVR_DIVQ1_VAL(X) (((uint32_t)(X) & 0x7FUL) << 16)
#define RCC_PLL2DIVR_DIVR1          (0x7FUL << 24) 
#define RCC_PLL2DIVR_DIVR1_VAL(X) (((uint32_t)(X) & 0x7FUL) << 24)
#define RCC_PLL2FRACR_FRACN2          (0x1FFFUL << 3) 
#define RCC_PLL2FRACR_FRACN2_VAL(X) (((uint32_t)(X) & 0x1FFFUL) << 3)
#define RCC_PLL3DIVR_DIVN3          (0x1FFUL << 0) 
#define RCC_PLL3DIVR_DIVN3_VAL(X) (((uint32_t)(X) & 0x1FFUL) << 0)
#define RCC_PLL3DIVR_DIVP3          (0x7FUL << 9) 
#define RCC_PLL3DIVR_DIVP3_VAL(X) (((uint32_t)(X) & 0x7FUL) << 9)
#define RCC_PLL3DIVR_DIVQ3          (0x7FUL << 16) 
#define RCC_PLL3DIVR_DIVQ3_VAL(X) (((uint32_t)(X) & 0x7FUL) << 16)
#define RCC_PLL3DIVR_DIVR3          (0x7FUL << 24) 
#define RCC_PLL3DIVR_DIVR3_VAL(X) (((uint32_t)(X) & 0x7FUL) << 24)
#define RCC_PLL3FRACR_FRACN3          (0x1FFFUL << 3) 
#define RCC_PLL3FRACR_FRACN3_VAL(X) (((uint32_t)(X) & 0x1FFFUL) << 3)
#define RCC_D1CCIPR_FMCSRC          (0x3UL << 0) 
#define RCC_D1CCIPR_FMCSRC_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define RCC_D1CCIPR_QSPISRC          (0x3UL << 4) 
#define RCC_D1CCIPR_QSPISRC_VAL(X) (((uint32_t)(X) & 0x3UL) << 4)
#define RCC_D1CCIPR_SDMMCSRC          (0x1UL << 16) 
#define RCC_D1CCIPR_SDMMCSRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define RCC_D1CCIPR_CKPERSRC          (0x3UL << 28) 
#define RCC_D1CCIPR_CKPERSRC_VAL(X) (((uint32_t)(X) & 0x3UL) << 28)
#define RCC_D2CCIP1R_SAI1SRC          (0x7UL << 0) 
#define RCC_D2CCIP1R_SAI1SRC_VAL(X) (((uint32_t)(X) & 0x7UL) << 0)
#define RCC_D2CCIP1R_SAI23SRC          (0x7UL << 6) 
#define RCC_D2CCIP1R_SAI23SRC_VAL(X) (((uint32_t)(X) & 0x7UL) << 6)
#define RCC_D2CCIP1R_SPI123SRC          (0x7UL << 12) 
#define RCC_D2CCIP1R_SPI123SRC_VAL(X) (((uint32_t)(X) & 0x7UL) << 12)
#define RCC_D2CCIP1R_SPI45SRC          (0x7UL << 16) 
#define RCC_D2CCIP1R_SPI45SRC_VAL(X) (((uint32_t)(X) & 0x7UL) << 16)
#define RCC_D2CCIP1R_SPDIFSRC          (0x3UL << 20) 
#define RCC_D2CCIP1R_SPDIFSRC_VAL(X) (((uint32_t)(X) & 0x3UL) << 20)
#define RCC_D2CCIP1R_DFSDM1SRC          (0x1UL << 24) 
#define RCC_D2CCIP1R_DFSDM1SRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define RCC_D2CCIP1R_FDCANSRC          (0x3UL << 28) 
#define RCC_D2CCIP1R_FDCANSRC_VAL(X) (((uint32_t)(X) & 0x3UL) << 28)
#define RCC_D2CCIP1R_SWPSRC          (0x1UL << 31) 
#define RCC_D2CCIP1R_SWPSRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define RCC_D2CCIP2R_USART234578SRC          (0x7UL << 0) 
#define RCC_D2CCIP2R_USART234578SRC_VAL(X) (((uint32_t)(X) & 0x7UL) << 0)
#define RCC_D2CCIP2R_USART16SRC          (0x7UL << 3) 
#define RCC_D2CCIP2R_USART16SRC_VAL(X) (((uint32_t)(X) & 0x7UL) << 3)
#define RCC_D2CCIP2R_RNGSRC          (0x3UL << 8) 
#define RCC_D2CCIP2R_RNGSRC_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define RCC_D2CCIP2R_I2C123SRC          (0x3UL << 12) 
#define RCC_D2CCIP2R_I2C123SRC_VAL(X) (((uint32_t)(X) & 0x3UL) << 12)
#define RCC_D2CCIP2R_USBSRC          (0x3UL << 20) 
#define RCC_D2CCIP2R_USBSRC_VAL(X) (((uint32_t)(X) & 0x3UL) << 20)
#define RCC_D2CCIP2R_CECSRC          (0x3UL << 22) 
#define RCC_D2CCIP2R_CECSRC_VAL(X) (((uint32_t)(X) & 0x3UL) << 22)
#define RCC_D2CCIP2R_LPTIM1SRC          (0x7UL << 28) 
#define RCC_D2CCIP2R_LPTIM1SRC_VAL(X) (((uint32_t)(X) & 0x7UL) << 28)
#define RCC_D3CCIPR_LPUART1SRC          (0x7UL << 0) 
#define RCC_D3CCIPR_LPUART1SRC_VAL(X) (((uint32_t)(X) & 0x7UL) << 0)
#define RCC_D3CCIPR_I2C4SRC          (0x3UL << 8) 
#define RCC_D3CCIPR_I2C4SRC_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define RCC_D3CCIPR_LPTIM2SRC          (0x7UL << 10) 
#define RCC_D3CCIPR_LPTIM2SRC_VAL(X) (((uint32_t)(X) & 0x7UL) << 10)
#define RCC_D3CCIPR_LPTIM345SRC          (0x7UL << 13) 
#define RCC_D3CCIPR_LPTIM345SRC_VAL(X) (((uint32_t)(X) & 0x7UL) << 13)
#define RCC_D3CCIPR_ADCSRC          (0x3UL << 16) 
#define RCC_D3CCIPR_ADCSRC_VAL(X) (((uint32_t)(X) & 0x3UL) << 16)
#define RCC_D3CCIPR_SAI4ASRC          (0x7UL << 21) 
#define RCC_D3CCIPR_SAI4ASRC_VAL(X) (((uint32_t)(X) & 0x7UL) << 21)
#define RCC_D3CCIPR_SAI4BSRC          (0x7UL << 24) 
#define RCC_D3CCIPR_SAI4BSRC_VAL(X) (((uint32_t)(X) & 0x7UL) << 24)
#define RCC_D3CCIPR_SPI6SRC          (0x7UL << 28) 
#define RCC_D3CCIPR_SPI6SRC_VAL(X) (((uint32_t)(X) & 0x7UL) << 28)
#define RCC_CIER_LSIRDYIE          (0x1UL << 0) 
#define RCC_CIER_LSIRDYIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define RCC_CIER_LSERDYIE          (0x1UL << 1) 
#define RCC_CIER_LSERDYIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define RCC_CIER_HSIRDYIE          (0x1UL << 2) 
#define RCC_CIER_HSIRDYIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define RCC_CIER_HSERDYIE          (0x1UL << 3) 
#define RCC_CIER_HSERDYIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define RCC_CIER_CSIRDYIE          (0x1UL << 4) 
#define RCC_CIER_CSIRDYIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define RCC_CIER_RC48RDYIE          (0x1UL << 5) 
#define RCC_CIER_RC48RDYIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define RCC_CIER_PLL1RDYIE          (0x1UL << 6) 
#define RCC_CIER_PLL1RDYIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define RCC_CIER_PLL2RDYIE          (0x1UL << 7) 
#define RCC_CIER_PLL2RDYIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define RCC_CIER_PLL3RDYIE          (0x1UL << 8) 
#define RCC_CIER_PLL3RDYIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define RCC_CIER_LSECSSIE          (0x1UL << 9) 
#define RCC_CIER_LSECSSIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define RCC_CIFR_LSIRDYF          (0x1UL << 0) 
#define RCC_CIFR_LSIRDYF_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define RCC_CIFR_LSERDYF          (0x1UL << 1) 
#define RCC_CIFR_LSERDYF_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define RCC_CIFR_HSIRDYF          (0x1UL << 2) 
#define RCC_CIFR_HSIRDYF_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define RCC_CIFR_HSERDYF          (0x1UL << 3) 
#define RCC_CIFR_HSERDYF_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define RCC_CIFR_CSIRDY          (0x1UL << 4) 
#define RCC_CIFR_CSIRDY_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define RCC_CIFR_RC48RDYF          (0x1UL << 5) 
#define RCC_CIFR_RC48RDYF_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define RCC_CIFR_PLL1RDYF          (0x1UL << 6) 
#define RCC_CIFR_PLL1RDYF_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define RCC_CIFR_PLL2RDYF          (0x1UL << 7) 
#define RCC_CIFR_PLL2RDYF_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define RCC_CIFR_PLL3RDYF          (0x1UL << 8) 
#define RCC_CIFR_PLL3RDYF_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define RCC_CIFR_LSECSSF          (0x1UL << 9) 
#define RCC_CIFR_LSECSSF_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define RCC_CIFR_HSECSSF          (0x1UL << 10) 
#define RCC_CIFR_HSECSSF_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define RCC_CICR_LSIRDYC          (0x1UL << 0) 
#define RCC_CICR_LSIRDYC_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define RCC_CICR_LSERDYC          (0x1UL << 1) 
#define RCC_CICR_LSERDYC_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define RCC_CICR_HSIRDYC          (0x1UL << 2) 
#define RCC_CICR_HSIRDYC_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define RCC_CICR_HSERDYC          (0x1UL << 3) 
#define RCC_CICR_HSERDYC_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define RCC_CICR_HSE_ready_Interrupt_Clear          (0x1UL << 4) 
#define RCC_CICR_HSE_ready_Interrupt_Clear_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define RCC_CICR_RC48RDYC          (0x1UL << 5) 
#define RCC_CICR_RC48RDYC_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define RCC_CICR_PLL1RDYC          (0x1UL << 6) 
#define RCC_CICR_PLL1RDYC_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define RCC_CICR_PLL2RDYC          (0x1UL << 7) 
#define RCC_CICR_PLL2RDYC_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define RCC_CICR_PLL3RDYC          (0x1UL << 8) 
#define RCC_CICR_PLL3RDYC_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define RCC_CICR_LSECSSC          (0x1UL << 9) 
#define RCC_CICR_LSECSSC_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define RCC_CICR_HSECSSC          (0x1UL << 10) 
#define RCC_CICR_HSECSSC_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define RCC_BDCR_LSEON          (0x1UL << 0) 
#define RCC_BDCR_LSEON_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define RCC_BDCR_LSERDY          (0x1UL << 1) 
#define RCC_BDCR_LSERDY_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define RCC_BDCR_LSEBYP          (0x1UL << 2) 
#define RCC_BDCR_LSEBYP_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define RCC_BDCR_LSEDRV          (0x3UL << 3) 
#define RCC_BDCR_LSEDRV_VAL(X) (((uint32_t)(X) & 0x3UL) << 3)
#define RCC_BDCR_LSECSSON          (0x1UL << 5) 
#define RCC_BDCR_LSECSSON_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define RCC_BDCR_LSECSSD          (0x1UL << 6) 
#define RCC_BDCR_LSECSSD_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define RCC_BDCR_RTCSRC          (0x3UL << 8) 
#define RCC_BDCR_RTCSRC_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define RCC_BDCR_RTCEN          (0x1UL << 15) 
#define RCC_BDCR_RTCEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define RCC_BDCR_VSWRST          (0x1UL << 16) 
#define RCC_BDCR_VSWRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define RCC_CSR_LSION          (0x1UL << 0) 
#define RCC_CSR_LSION_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define RCC_CSR_LSIRDY          (0x1UL << 1) 
#define RCC_CSR_LSIRDY_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define RCC_AHB3RSTR_MDMARST          (0x1UL << 0) 
#define RCC_AHB3RSTR_MDMARST_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define RCC_AHB3RSTR_DMA2DRST          (0x1UL << 4) 
#define RCC_AHB3RSTR_DMA2DRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define RCC_AHB3RSTR_JPGDECRST          (0x1UL << 5) 
#define RCC_AHB3RSTR_JPGDECRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define RCC_AHB3RSTR_FMCRST          (0x1UL << 12) 
#define RCC_AHB3RSTR_FMCRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define RCC_AHB3RSTR_QSPIRST          (0x1UL << 14) 
#define RCC_AHB3RSTR_QSPIRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define RCC_AHB3RSTR_SDMMC1RST          (0x1UL << 16) 
#define RCC_AHB3RSTR_SDMMC1RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define RCC_AHB3RSTR_CPURST          (0x1UL << 31) 
#define RCC_AHB3RSTR_CPURST_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define RCC_AHB1RSTR_DMA1RST          (0x1UL << 0) 
#define RCC_AHB1RSTR_DMA1RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define RCC_AHB1RSTR_DMA2RST          (0x1UL << 1) 
#define RCC_AHB1RSTR_DMA2RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define RCC_AHB1RSTR_ADC12RST          (0x1UL << 5) 
#define RCC_AHB1RSTR_ADC12RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define RCC_AHB1RSTR_ETH1MACRST          (0x1UL << 15) 
#define RCC_AHB1RSTR_ETH1MACRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define RCC_AHB1RSTR_USB1OTGRST          (0x1UL << 25) 
#define RCC_AHB1RSTR_USB1OTGRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define RCC_AHB1RSTR_USB2OTGRST          (0x1UL << 27) 
#define RCC_AHB1RSTR_USB2OTGRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define RCC_AHB2RSTR_CAMITFRST          (0x1UL << 0) 
#define RCC_AHB2RSTR_CAMITFRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define RCC_AHB2RSTR_CRYPTRST          (0x1UL << 4) 
#define RCC_AHB2RSTR_CRYPTRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define RCC_AHB2RSTR_HASHRST          (0x1UL << 5) 
#define RCC_AHB2RSTR_HASHRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define RCC_AHB2RSTR_RNGRST          (0x1UL << 6) 
#define RCC_AHB2RSTR_RNGRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define RCC_AHB2RSTR_SDMMC2RST          (0x1UL << 9) 
#define RCC_AHB2RSTR_SDMMC2RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define RCC_AHB4RSTR_GPIOARST          (0x1UL << 0) 
#define RCC_AHB4RSTR_GPIOARST_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define RCC_AHB4RSTR_GPIOBRST          (0x1UL << 1) 
#define RCC_AHB4RSTR_GPIOBRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define RCC_AHB4RSTR_GPIOCRST          (0x1UL << 2) 
#define RCC_AHB4RSTR_GPIOCRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define RCC_AHB4RSTR_GPIODRST          (0x1UL << 3) 
#define RCC_AHB4RSTR_GPIODRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define RCC_AHB4RSTR_GPIOERST          (0x1UL << 4) 
#define RCC_AHB4RSTR_GPIOERST_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define RCC_AHB4RSTR_GPIOFRST          (0x1UL << 5) 
#define RCC_AHB4RSTR_GPIOFRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
