via/viaems/src/platforms/stm32h743/device.h
#define RCC_AHB4RSTR_GPIOGRST          (0x1UL << 6) 
#define RCC_AHB4RSTR_GPIOGRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define RCC_AHB4RSTR_GPIOHRST          (0x1UL << 7) 
#define RCC_AHB4RSTR_GPIOHRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define RCC_AHB4RSTR_GPIOIRST          (0x1UL << 8) 
#define RCC_AHB4RSTR_GPIOIRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define RCC_AHB4RSTR_GPIOJRST          (0x1UL << 9) 
#define RCC_AHB4RSTR_GPIOJRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define RCC_AHB4RSTR_GPIOKRST          (0x1UL << 10) 
#define RCC_AHB4RSTR_GPIOKRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define RCC_AHB4RSTR_CRCRST          (0x1UL << 19) 
#define RCC_AHB4RSTR_CRCRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define RCC_AHB4RSTR_BDMARST          (0x1UL << 21) 
#define RCC_AHB4RSTR_BDMARST_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define RCC_AHB4RSTR_ADC3RST          (0x1UL << 24) 
#define RCC_AHB4RSTR_ADC3RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define RCC_AHB4RSTR_HSEMRST          (0x1UL << 25) 
#define RCC_AHB4RSTR_HSEMRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define RCC_APB3RSTR_LTDCRST          (0x1UL << 3) 
#define RCC_APB3RSTR_LTDCRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define RCC_APB1LRSTR_TIM2RST          (0x1UL << 0) 
#define RCC_APB1LRSTR_TIM2RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define RCC_APB1LRSTR_TIM3RST          (0x1UL << 1) 
#define RCC_APB1LRSTR_TIM3RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define RCC_APB1LRSTR_TIM4RST          (0x1UL << 2) 
#define RCC_APB1LRSTR_TIM4RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define RCC_APB1LRSTR_TIM5RST          (0x1UL << 3) 
#define RCC_APB1LRSTR_TIM5RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define RCC_APB1LRSTR_TIM6RST          (0x1UL << 4) 
#define RCC_APB1LRSTR_TIM6RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define RCC_APB1LRSTR_TIM7RST          (0x1UL << 5) 
#define RCC_APB1LRSTR_TIM7RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define RCC_APB1LRSTR_TIM12RST          (0x1UL << 6) 
#define RCC_APB1LRSTR_TIM12RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define RCC_APB1LRSTR_TIM13RST          (0x1UL << 7) 
#define RCC_APB1LRSTR_TIM13RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define RCC_APB1LRSTR_TIM14RST          (0x1UL << 8) 
#define RCC_APB1LRSTR_TIM14RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define RCC_APB1LRSTR_LPTIM1RST          (0x1UL << 9) 
#define RCC_APB1LRSTR_LPTIM1RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define RCC_APB1LRSTR_SPI2RST          (0x1UL << 14) 
#define RCC_APB1LRSTR_SPI2RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define RCC_APB1LRSTR_SPI3RST          (0x1UL << 15) 
#define RCC_APB1LRSTR_SPI3RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define RCC_APB1LRSTR_SPDIFRXRST          (0x1UL << 16) 
#define RCC_APB1LRSTR_SPDIFRXRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define RCC_APB1LRSTR_USART2RST          (0x1UL << 17) 
#define RCC_APB1LRSTR_USART2RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define RCC_APB1LRSTR_USART3RST          (0x1UL << 18) 
#define RCC_APB1LRSTR_USART3RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define RCC_APB1LRSTR_UART4RST          (0x1UL << 19) 
#define RCC_APB1LRSTR_UART4RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define RCC_APB1LRSTR_UART5RST          (0x1UL << 20) 
#define RCC_APB1LRSTR_UART5RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define RCC_APB1LRSTR_I2C1RST          (0x1UL << 21) 
#define RCC_APB1LRSTR_I2C1RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define RCC_APB1LRSTR_I2C2RST          (0x1UL << 22) 
#define RCC_APB1LRSTR_I2C2RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define RCC_APB1LRSTR_I2C3RST          (0x1UL << 23) 
#define RCC_APB1LRSTR_I2C3RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define RCC_APB1LRSTR_CECRST          (0x1UL << 27) 
#define RCC_APB1LRSTR_CECRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define RCC_APB1LRSTR_DAC12RST          (0x1UL << 29) 
#define RCC_APB1LRSTR_DAC12RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define RCC_APB1LRSTR_USART7RST          (0x1UL << 30) 
#define RCC_APB1LRSTR_USART7RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define RCC_APB1LRSTR_USART8RST          (0x1UL << 31) 
#define RCC_APB1LRSTR_USART8RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define RCC_APB1HRSTR_CRSRST          (0x1UL << 1) 
#define RCC_APB1HRSTR_CRSRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define RCC_APB1HRSTR_SWPRST          (0x1UL << 2) 
#define RCC_APB1HRSTR_SWPRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define RCC_APB1HRSTR_OPAMPRST          (0x1UL << 4) 
#define RCC_APB1HRSTR_OPAMPRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define RCC_APB1HRSTR_MDIOSRST          (0x1UL << 5) 
#define RCC_APB1HRSTR_MDIOSRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define RCC_APB1HRSTR_FDCANRST          (0x1UL << 8) 
#define RCC_APB1HRSTR_FDCANRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define RCC_APB2RSTR_TIM1RST          (0x1UL << 0) 
#define RCC_APB2RSTR_TIM1RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define RCC_APB2RSTR_TIM8RST          (0x1UL << 1) 
#define RCC_APB2RSTR_TIM8RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define RCC_APB2RSTR_USART1RST          (0x1UL << 4) 
#define RCC_APB2RSTR_USART1RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define RCC_APB2RSTR_USART6RST          (0x1UL << 5) 
#define RCC_APB2RSTR_USART6RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define RCC_APB2RSTR_SPI1RST          (0x1UL << 12) 
#define RCC_APB2RSTR_SPI1RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define RCC_APB2RSTR_SPI4RST          (0x1UL << 13) 
#define RCC_APB2RSTR_SPI4RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define RCC_APB2RSTR_TIM15RST          (0x1UL << 16) 
#define RCC_APB2RSTR_TIM15RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define RCC_APB2RSTR_TIM16RST          (0x1UL << 17) 
#define RCC_APB2RSTR_TIM16RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define RCC_APB2RSTR_TIM17RST          (0x1UL << 18) 
#define RCC_APB2RSTR_TIM17RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define RCC_APB2RSTR_SPI5RST          (0x1UL << 20) 
#define RCC_APB2RSTR_SPI5RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define RCC_APB2RSTR_SAI1RST          (0x1UL << 22) 
#define RCC_APB2RSTR_SAI1RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define RCC_APB2RSTR_SAI2RST          (0x1UL << 23) 
#define RCC_APB2RSTR_SAI2RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define RCC_APB2RSTR_SAI3RST          (0x1UL << 24) 
#define RCC_APB2RSTR_SAI3RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define RCC_APB2RSTR_DFSDM1RST          (0x1UL << 28) 
#define RCC_APB2RSTR_DFSDM1RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define RCC_APB2RSTR_HRTIMRST          (0x1UL << 29) 
#define RCC_APB2RSTR_HRTIMRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define RCC_APB4RSTR_SYSCFGRST          (0x1UL << 1) 
#define RCC_APB4RSTR_SYSCFGRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define RCC_APB4RSTR_LPUART1RST          (0x1UL << 3) 
#define RCC_APB4RSTR_LPUART1RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define RCC_APB4RSTR_SPI6RST          (0x1UL << 5) 
#define RCC_APB4RSTR_SPI6RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define RCC_APB4RSTR_I2C4RST          (0x1UL << 7) 
#define RCC_APB4RSTR_I2C4RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define RCC_APB4RSTR_LPTIM2RST          (0x1UL << 9) 
#define RCC_APB4RSTR_LPTIM2RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define RCC_APB4RSTR_LPTIM3RST          (0x1UL << 10) 
#define RCC_APB4RSTR_LPTIM3RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define RCC_APB4RSTR_LPTIM4RST          (0x1UL << 11) 
#define RCC_APB4RSTR_LPTIM4RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define RCC_APB4RSTR_LPTIM5RST          (0x1UL << 12) 
#define RCC_APB4RSTR_LPTIM5RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define RCC_APB4RSTR_COMP12RST          (0x1UL << 14) 
#define RCC_APB4RSTR_COMP12RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define RCC_APB4RSTR_VREFRST          (0x1UL << 15) 
#define RCC_APB4RSTR_VREFRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define RCC_APB4RSTR_SAI4RST          (0x1UL << 21) 
#define RCC_APB4RSTR_SAI4RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define RCC_GCR_WW1RSC          (0x1UL << 0) 
#define RCC_GCR_WW1RSC_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define RCC_D3AMR_BDMAAMEN          (0x1UL << 0) 
#define RCC_D3AMR_BDMAAMEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define RCC_D3AMR_LPUART1AMEN          (0x1UL << 3) 
#define RCC_D3AMR_LPUART1AMEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define RCC_D3AMR_SPI6AMEN          (0x1UL << 5) 
#define RCC_D3AMR_SPI6AMEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define RCC_D3AMR_I2C4AMEN          (0x1UL << 7) 
#define RCC_D3AMR_I2C4AMEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define RCC_D3AMR_LPTIM2AMEN          (0x1UL << 9) 
#define RCC_D3AMR_LPTIM2AMEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define RCC_D3AMR_LPTIM3AMEN          (0x1UL << 10) 
#define RCC_D3AMR_LPTIM3AMEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define RCC_D3AMR_LPTIM4AMEN          (0x1UL << 11) 
#define RCC_D3AMR_LPTIM4AMEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define RCC_D3AMR_LPTIM5AMEN          (0x1UL << 12) 
#define RCC_D3AMR_LPTIM5AMEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define RCC_D3AMR_COMP12AMEN          (0x1UL << 14) 
#define RCC_D3AMR_COMP12AMEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define RCC_D3AMR_VREFAMEN          (0x1UL << 15) 
#define RCC_D3AMR_VREFAMEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define RCC_D3AMR_RTCAMEN          (0x1UL << 16) 
#define RCC_D3AMR_RTCAMEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define RCC_D3AMR_CRCAMEN          (0x1UL << 19) 
#define RCC_D3AMR_CRCAMEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define RCC_D3AMR_SAI4AMEN          (0x1UL << 21) 
#define RCC_D3AMR_SAI4AMEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define RCC_D3AMR_ADC3AMEN          (0x1UL << 24) 
#define RCC_D3AMR_ADC3AMEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define RCC_D3AMR_BKPRAMAMEN          (0x1UL << 28) 
#define RCC_D3AMR_BKPRAMAMEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define RCC_D3AMR_SRAM4AMEN          (0x1UL << 29) 
#define RCC_D3AMR_SRAM4AMEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define RCC_RSR_RMVF          (0x1UL << 16) 
#define RCC_RSR_RMVF_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define RCC_RSR_CPURSTF          (0x1UL << 17) 
#define RCC_RSR_CPURSTF_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define RCC_RSR_D1RSTF          (0x1UL << 19) 
#define RCC_RSR_D1RSTF_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define RCC_RSR_D2RSTF          (0x1UL << 20) 
#define RCC_RSR_D2RSTF_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define RCC_RSR_BORRSTF          (0x1UL << 21) 
#define RCC_RSR_BORRSTF_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define RCC_RSR_PINRSTF          (0x1UL << 22) 
#define RCC_RSR_PINRSTF_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define RCC_RSR_PORRSTF          (0x1UL << 23) 
#define RCC_RSR_PORRSTF_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define RCC_RSR_SFTRSTF          (0x1UL << 24) 
#define RCC_RSR_SFTRSTF_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define RCC_RSR_IWDG1RSTF          (0x1UL << 26) 
#define RCC_RSR_IWDG1RSTF_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define RCC_RSR_WWDG1RSTF          (0x1UL << 28) 
#define RCC_RSR_WWDG1RSTF_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define RCC_RSR_LPWRRSTF          (0x1UL << 30) 
#define RCC_RSR_LPWRRSTF_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define RCC_C1_RSR_RMVF          (0x1UL << 16) 
#define RCC_C1_RSR_RMVF_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define RCC_C1_RSR_CPURSTF          (0x1UL << 17) 
#define RCC_C1_RSR_CPURSTF_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define RCC_C1_RSR_D1RSTF          (0x1UL << 19) 
#define RCC_C1_RSR_D1RSTF_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define RCC_C1_RSR_D2RSTF          (0x1UL << 20) 
#define RCC_C1_RSR_D2RSTF_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define RCC_C1_RSR_BORRSTF          (0x1UL << 21) 
#define RCC_C1_RSR_BORRSTF_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define RCC_C1_RSR_PINRSTF          (0x1UL << 22) 
#define RCC_C1_RSR_PINRSTF_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define RCC_C1_RSR_PORRSTF          (0x1UL << 23) 
#define RCC_C1_RSR_PORRSTF_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define RCC_C1_RSR_SFTRSTF          (0x1UL << 24) 
#define RCC_C1_RSR_SFTRSTF_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define RCC_C1_RSR_IWDG1RSTF          (0x1UL << 26) 
#define RCC_C1_RSR_IWDG1RSTF_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define RCC_C1_RSR_WWDG1RSTF          (0x1UL << 28) 
#define RCC_C1_RSR_WWDG1RSTF_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define RCC_C1_RSR_LPWRRSTF          (0x1UL << 30) 
#define RCC_C1_RSR_LPWRRSTF_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define RCC_C1_AHB3ENR_MDMAEN          (0x1UL << 0) 
#define RCC_C1_AHB3ENR_MDMAEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define RCC_C1_AHB3ENR_DMA2DEN          (0x1UL << 4) 
#define RCC_C1_AHB3ENR_DMA2DEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define RCC_C1_AHB3ENR_JPGDECEN          (0x1UL << 5) 
#define RCC_C1_AHB3ENR_JPGDECEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define RCC_C1_AHB3ENR_FMCEN          (0x1UL << 12) 
#define RCC_C1_AHB3ENR_FMCEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define RCC_C1_AHB3ENR_QSPIEN          (0x1UL << 14) 
#define RCC_C1_AHB3ENR_QSPIEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define RCC_C1_AHB3ENR_SDMMC1EN          (0x1UL << 16) 
#define RCC_C1_AHB3ENR_SDMMC1EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define RCC_AHB3ENR_MDMAEN          (0x1UL << 0) 
#define RCC_AHB3ENR_MDMAEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define RCC_AHB3ENR_DMA2DEN          (0x1UL << 4) 
#define RCC_AHB3ENR_DMA2DEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define RCC_AHB3ENR_JPGDECEN          (0x1UL << 5) 
#define RCC_AHB3ENR_JPGDECEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define RCC_AHB3ENR_FMCEN          (0x1UL << 12) 
#define RCC_AHB3ENR_FMCEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define RCC_AHB3ENR_QSPIEN          (0x1UL << 14) 
#define RCC_AHB3ENR_QSPIEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define RCC_AHB3ENR_SDMMC1EN          (0x1UL << 16) 
#define RCC_AHB3ENR_SDMMC1EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define RCC_AHB1ENR_DMA1EN          (0x1UL << 0) 
#define RCC_AHB1ENR_DMA1EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define RCC_AHB1ENR_DMA2EN          (0x1UL << 1) 
#define RCC_AHB1ENR_DMA2EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define RCC_AHB1ENR_ADC12EN          (0x1UL << 5) 
#define RCC_AHB1ENR_ADC12EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define RCC_AHB1ENR_ETH1MACEN          (0x1UL << 15) 
#define RCC_AHB1ENR_ETH1MACEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define RCC_AHB1ENR_ETH1TXEN          (0x1UL << 16) 
#define RCC_AHB1ENR_ETH1TXEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define RCC_AHB1ENR_ETH1RXEN          (0x1UL << 17) 
#define RCC_AHB1ENR_ETH1RXEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define RCC_AHB1ENR_USB2OTGHSULPIEN          (0x1UL << 18) 
#define RCC_AHB1ENR_USB2OTGHSULPIEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define RCC_AHB1ENR_USB1OTGEN          (0x1UL << 25) 
#define RCC_AHB1ENR_USB1OTGEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define RCC_AHB1ENR_USB1ULPIEN          (0x1UL << 26) 
#define RCC_AHB1ENR_USB1ULPIEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define RCC_AHB1ENR_USB2OTGEN          (0x1UL << 27) 
#define RCC_AHB1ENR_USB2OTGEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define RCC_AHB1ENR_USB2ULPIEN          (0x1UL << 28) 
#define RCC_AHB1ENR_USB2ULPIEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define RCC_C1_AHB1ENR_DMA1EN          (0x1UL << 0) 
#define RCC_C1_AHB1ENR_DMA1EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define RCC_C1_AHB1ENR_DMA2EN          (0x1UL << 1) 
#define RCC_C1_AHB1ENR_DMA2EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define RCC_C1_AHB1ENR_ADC12EN          (0x1UL << 5) 
#define RCC_C1_AHB1ENR_ADC12EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define RCC_C1_AHB1ENR_ETH1MACEN          (0x1UL << 15) 
#define RCC_C1_AHB1ENR_ETH1MACEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define RCC_C1_AHB1ENR_ETH1TXEN          (0x1UL << 16) 
#define RCC_C1_AHB1ENR_ETH1TXEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define RCC_C1_AHB1ENR_ETH1RXEN          (0x1UL << 17) 
#define RCC_C1_AHB1ENR_ETH1RXEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define RCC_C1_AHB1ENR_USB1OTGEN          (0x1UL << 25) 
#define RCC_C1_AHB1ENR_USB1OTGEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define RCC_C1_AHB1ENR_USB1ULPIEN          (0x1UL << 26) 
#define RCC_C1_AHB1ENR_USB1ULPIEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define RCC_C1_AHB1ENR_USB2OTGEN          (0x1UL << 27) 
#define RCC_C1_AHB1ENR_USB2OTGEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define RCC_C1_AHB1ENR_USB2ULPIEN          (0x1UL << 28) 
#define RCC_C1_AHB1ENR_USB2ULPIEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define RCC_C1_AHB2ENR_CAMITFEN          (0x1UL << 0) 
#define RCC_C1_AHB2ENR_CAMITFEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define RCC_C1_AHB2ENR_CRYPTEN          (0x1UL << 4) 
#define RCC_C1_AHB2ENR_CRYPTEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define RCC_C1_AHB2ENR_HASHEN          (0x1UL << 5) 
#define RCC_C1_AHB2ENR_HASHEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define RCC_C1_AHB2ENR_RNGEN          (0x1UL << 6) 
#define RCC_C1_AHB2ENR_RNGEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define RCC_C1_AHB2ENR_SDMMC2EN          (0x1UL << 9) 
#define RCC_C1_AHB2ENR_SDMMC2EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define RCC_C1_AHB2ENR_SRAM1EN          (0x1UL << 29) 
#define RCC_C1_AHB2ENR_SRAM1EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define RCC_C1_AHB2ENR_SRAM2EN          (0x1UL << 30) 
#define RCC_C1_AHB2ENR_SRAM2EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define RCC_C1_AHB2ENR_SRAM3EN          (0x1UL << 31) 
#define RCC_C1_AHB2ENR_SRAM3EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define RCC_AHB2ENR_CAMITFEN          (0x1UL << 0) 
#define RCC_AHB2ENR_CAMITFEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define RCC_AHB2ENR_CRYPTEN          (0x1UL << 4) 
#define RCC_AHB2ENR_CRYPTEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define RCC_AHB2ENR_HASHEN          (0x1UL << 5) 
#define RCC_AHB2ENR_HASHEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define RCC_AHB2ENR_RNGEN          (0x1UL << 6) 
#define RCC_AHB2ENR_RNGEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define RCC_AHB2ENR_SDMMC2EN          (0x1UL << 9) 
#define RCC_AHB2ENR_SDMMC2EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define RCC_AHB2ENR_SRAM1EN          (0x1UL << 29) 
#define RCC_AHB2ENR_SRAM1EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define RCC_AHB2ENR_SRAM2EN          (0x1UL << 30) 
#define RCC_AHB2ENR_SRAM2EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define RCC_AHB2ENR_SRAM3EN          (0x1UL << 31) 
#define RCC_AHB2ENR_SRAM3EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define RCC_AHB4ENR_GPIOAEN          (0x1UL << 0) 
#define RCC_AHB4ENR_GPIOAEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define RCC_AHB4ENR_GPIOBEN          (0x1UL << 1) 
#define RCC_AHB4ENR_GPIOBEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define RCC_AHB4ENR_GPIOCEN          (0x1UL << 2) 
#define RCC_AHB4ENR_GPIOCEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define RCC_AHB4ENR_GPIODEN          (0x1UL << 3) 
#define RCC_AHB4ENR_GPIODEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define RCC_AHB4ENR_GPIOEEN          (0x1UL << 4) 
#define RCC_AHB4ENR_GPIOEEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define RCC_AHB4ENR_GPIOFEN          (0x1UL << 5) 
#define RCC_AHB4ENR_GPIOFEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define RCC_AHB4ENR_GPIOGEN          (0x1UL << 6) 
#define RCC_AHB4ENR_GPIOGEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define RCC_AHB4ENR_GPIOHEN          (0x1UL << 7) 
#define RCC_AHB4ENR_GPIOHEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define RCC_AHB4ENR_GPIOIEN          (0x1UL << 8) 
#define RCC_AHB4ENR_GPIOIEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define RCC_AHB4ENR_GPIOJEN          (0x1UL << 9) 
#define RCC_AHB4ENR_GPIOJEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define RCC_AHB4ENR_GPIOKEN          (0x1UL << 10) 
#define RCC_AHB4ENR_GPIOKEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define RCC_AHB4ENR_CRCEN          (0x1UL << 19) 
#define RCC_AHB4ENR_CRCEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define RCC_AHB4ENR_BDMAEN          (0x1UL << 21) 
#define RCC_AHB4ENR_BDMAEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define RCC_AHB4ENR_ADC3EN          (0x1UL << 24) 
#define RCC_AHB4ENR_ADC3EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define RCC_AHB4ENR_HSEMEN          (0x1UL << 25) 
#define RCC_AHB4ENR_HSEMEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define RCC_AHB4ENR_BKPRAMEN          (0x1UL << 28) 
#define RCC_AHB4ENR_BKPRAMEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define RCC_C1_AHB4ENR_GPIOAEN          (0x1UL << 0) 
#define RCC_C1_AHB4ENR_GPIOAEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define RCC_C1_AHB4ENR_GPIOBEN          (0x1UL << 1) 
#define RCC_C1_AHB4ENR_GPIOBEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define RCC_C1_AHB4ENR_GPIOCEN          (0x1UL << 2) 
#define RCC_C1_AHB4ENR_GPIOCEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define RCC_C1_AHB4ENR_GPIODEN          (0x1UL << 3) 
#define RCC_C1_AHB4ENR_GPIODEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define RCC_C1_AHB4ENR_GPIOEEN          (0x1UL << 4) 
#define RCC_C1_AHB4ENR_GPIOEEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define RCC_C1_AHB4ENR_GPIOFEN          (0x1UL << 5) 
#define RCC_C1_AHB4ENR_GPIOFEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define RCC_C1_AHB4ENR_GPIOGEN          (0x1UL << 6) 
#define RCC_C1_AHB4ENR_GPIOGEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define RCC_C1_AHB4ENR_GPIOHEN          (0x1UL << 7) 
#define RCC_C1_AHB4ENR_GPIOHEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define RCC_C1_AHB4ENR_GPIOIEN          (0x1UL << 8) 
#define RCC_C1_AHB4ENR_GPIOIEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define RCC_C1_AHB4ENR_GPIOJEN          (0x1UL << 9) 
#define RCC_C1_AHB4ENR_GPIOJEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define RCC_C1_AHB4ENR_GPIOKEN          (0x1UL << 10) 
#define RCC_C1_AHB4ENR_GPIOKEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define RCC_C1_AHB4ENR_CRCEN          (0x1UL << 19) 
#define RCC_C1_AHB4ENR_CRCEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define RCC_C1_AHB4ENR_BDMAEN          (0x1UL << 21) 
#define RCC_C1_AHB4ENR_BDMAEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define RCC_C1_AHB4ENR_ADC3EN          (0x1UL << 24) 
#define RCC_C1_AHB4ENR_ADC3EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define RCC_C1_AHB4ENR_HSEMEN          (0x1UL << 25) 
#define RCC_C1_AHB4ENR_HSEMEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define RCC_C1_AHB4ENR_BKPRAMEN          (0x1UL << 28) 
#define RCC_C1_AHB4ENR_BKPRAMEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define RCC_C1_APB3ENR_LTDCEN          (0x1UL << 3) 
#define RCC_C1_APB3ENR_LTDCEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define RCC_C1_APB3ENR_WWDG1EN          (0x1UL << 6) 
#define RCC_C1_APB3ENR_WWDG1EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define RCC_APB3ENR_LTDCEN          (0x1UL << 3) 
#define RCC_APB3ENR_LTDCEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define RCC_APB3ENR_WWDG1EN          (0x1UL << 6) 
#define RCC_APB3ENR_WWDG1EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define RCC_APB1LENR_TIM2EN          (0x1UL << 0) 
#define RCC_APB1LENR_TIM2EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define RCC_APB1LENR_TIM3EN          (0x1UL << 1) 
#define RCC_APB1LENR_TIM3EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define RCC_APB1LENR_TIM4EN          (0x1UL << 2) 
#define RCC_APB1LENR_TIM4EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define RCC_APB1LENR_TIM5EN          (0x1UL << 3) 
#define RCC_APB1LENR_TIM5EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define RCC_APB1LENR_TIM6EN          (0x1UL << 4) 
#define RCC_APB1LENR_TIM6EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define RCC_APB1LENR_TIM7EN          (0x1UL << 5) 
#define RCC_APB1LENR_TIM7EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define RCC_APB1LENR_TIM12EN          (0x1UL << 6) 
#define RCC_APB1LENR_TIM12EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define RCC_APB1LENR_TIM13EN          (0x1UL << 7) 
#define RCC_APB1LENR_TIM13EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define RCC_APB1LENR_TIM14EN          (0x1UL << 8) 
#define RCC_APB1LENR_TIM14EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define RCC_APB1LENR_LPTIM1EN          (0x1UL << 9) 
#define RCC_APB1LENR_LPTIM1EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
