via/viaems/src/platforms/stm32h743/device.h
#define RCC_APB1LENR_SPI2EN          (0x1UL << 14) 
#define RCC_APB1LENR_SPI2EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define RCC_APB1LENR_SPI3EN          (0x1UL << 15) 
#define RCC_APB1LENR_SPI3EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define RCC_APB1LENR_SPDIFRXEN          (0x1UL << 16) 
#define RCC_APB1LENR_SPDIFRXEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define RCC_APB1LENR_USART2EN          (0x1UL << 17) 
#define RCC_APB1LENR_USART2EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define RCC_APB1LENR_USART3EN          (0x1UL << 18) 
#define RCC_APB1LENR_USART3EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define RCC_APB1LENR_UART4EN          (0x1UL << 19) 
#define RCC_APB1LENR_UART4EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define RCC_APB1LENR_UART5EN          (0x1UL << 20) 
#define RCC_APB1LENR_UART5EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define RCC_APB1LENR_I2C1EN          (0x1UL << 21) 
#define RCC_APB1LENR_I2C1EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define RCC_APB1LENR_I2C2EN          (0x1UL << 22) 
#define RCC_APB1LENR_I2C2EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define RCC_APB1LENR_I2C3EN          (0x1UL << 23) 
#define RCC_APB1LENR_I2C3EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define RCC_APB1LENR_CECEN          (0x1UL << 27) 
#define RCC_APB1LENR_CECEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define RCC_APB1LENR_DAC12EN          (0x1UL << 29) 
#define RCC_APB1LENR_DAC12EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define RCC_APB1LENR_USART7EN          (0x1UL << 30) 
#define RCC_APB1LENR_USART7EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define RCC_APB1LENR_USART8EN          (0x1UL << 31) 
#define RCC_APB1LENR_USART8EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define RCC_C1_APB1LENR_TIM2EN          (0x1UL << 0) 
#define RCC_C1_APB1LENR_TIM2EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define RCC_C1_APB1LENR_TIM3EN          (0x1UL << 1) 
#define RCC_C1_APB1LENR_TIM3EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define RCC_C1_APB1LENR_TIM4EN          (0x1UL << 2) 
#define RCC_C1_APB1LENR_TIM4EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define RCC_C1_APB1LENR_TIM5EN          (0x1UL << 3) 
#define RCC_C1_APB1LENR_TIM5EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define RCC_C1_APB1LENR_TIM6EN          (0x1UL << 4) 
#define RCC_C1_APB1LENR_TIM6EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define RCC_C1_APB1LENR_TIM7EN          (0x1UL << 5) 
#define RCC_C1_APB1LENR_TIM7EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define RCC_C1_APB1LENR_TIM12EN          (0x1UL << 6) 
#define RCC_C1_APB1LENR_TIM12EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define RCC_C1_APB1LENR_TIM13EN          (0x1UL << 7) 
#define RCC_C1_APB1LENR_TIM13EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define RCC_C1_APB1LENR_TIM14EN          (0x1UL << 8) 
#define RCC_C1_APB1LENR_TIM14EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define RCC_C1_APB1LENR_LPTIM1EN          (0x1UL << 9) 
#define RCC_C1_APB1LENR_LPTIM1EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define RCC_C1_APB1LENR_SPI2EN          (0x1UL << 14) 
#define RCC_C1_APB1LENR_SPI2EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define RCC_C1_APB1LENR_SPI3EN          (0x1UL << 15) 
#define RCC_C1_APB1LENR_SPI3EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define RCC_C1_APB1LENR_SPDIFRXEN          (0x1UL << 16) 
#define RCC_C1_APB1LENR_SPDIFRXEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define RCC_C1_APB1LENR_USART2EN          (0x1UL << 17) 
#define RCC_C1_APB1LENR_USART2EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define RCC_C1_APB1LENR_USART3EN          (0x1UL << 18) 
#define RCC_C1_APB1LENR_USART3EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define RCC_C1_APB1LENR_UART4EN          (0x1UL << 19) 
#define RCC_C1_APB1LENR_UART4EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define RCC_C1_APB1LENR_UART5EN          (0x1UL << 20) 
#define RCC_C1_APB1LENR_UART5EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define RCC_C1_APB1LENR_I2C1EN          (0x1UL << 21) 
#define RCC_C1_APB1LENR_I2C1EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define RCC_C1_APB1LENR_I2C2EN          (0x1UL << 22) 
#define RCC_C1_APB1LENR_I2C2EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define RCC_C1_APB1LENR_I2C3EN          (0x1UL << 23) 
#define RCC_C1_APB1LENR_I2C3EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define RCC_C1_APB1LENR_HDMICECEN          (0x1UL << 27) 
#define RCC_C1_APB1LENR_HDMICECEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define RCC_C1_APB1LENR_DAC12EN          (0x1UL << 29) 
#define RCC_C1_APB1LENR_DAC12EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define RCC_C1_APB1LENR_USART7EN          (0x1UL << 30) 
#define RCC_C1_APB1LENR_USART7EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define RCC_C1_APB1LENR_USART8EN          (0x1UL << 31) 
#define RCC_C1_APB1LENR_USART8EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define RCC_APB1HENR_CRSEN          (0x1UL << 1) 
#define RCC_APB1HENR_CRSEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define RCC_APB1HENR_SWPEN          (0x1UL << 2) 
#define RCC_APB1HENR_SWPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define RCC_APB1HENR_OPAMPEN          (0x1UL << 4) 
#define RCC_APB1HENR_OPAMPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define RCC_APB1HENR_MDIOSEN          (0x1UL << 5) 
#define RCC_APB1HENR_MDIOSEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define RCC_APB1HENR_FDCANEN          (0x1UL << 8) 
#define RCC_APB1HENR_FDCANEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define RCC_C1_APB1HENR_CRSEN          (0x1UL << 1) 
#define RCC_C1_APB1HENR_CRSEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define RCC_C1_APB1HENR_SWPEN          (0x1UL << 2) 
#define RCC_C1_APB1HENR_SWPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define RCC_C1_APB1HENR_OPAMPEN          (0x1UL << 4) 
#define RCC_C1_APB1HENR_OPAMPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define RCC_C1_APB1HENR_MDIOSEN          (0x1UL << 5) 
#define RCC_C1_APB1HENR_MDIOSEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define RCC_C1_APB1HENR_FDCANEN          (0x1UL << 8) 
#define RCC_C1_APB1HENR_FDCANEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define RCC_C1_APB2ENR_TIM1EN          (0x1UL << 0) 
#define RCC_C1_APB2ENR_TIM1EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define RCC_C1_APB2ENR_TIM8EN          (0x1UL << 1) 
#define RCC_C1_APB2ENR_TIM8EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define RCC_C1_APB2ENR_USART1EN          (0x1UL << 4) 
#define RCC_C1_APB2ENR_USART1EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define RCC_C1_APB2ENR_USART6EN          (0x1UL << 5) 
#define RCC_C1_APB2ENR_USART6EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define RCC_C1_APB2ENR_SPI1EN          (0x1UL << 12) 
#define RCC_C1_APB2ENR_SPI1EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define RCC_C1_APB2ENR_SPI4EN          (0x1UL << 13) 
#define RCC_C1_APB2ENR_SPI4EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define RCC_C1_APB2ENR_TIM16EN          (0x1UL << 17) 
#define RCC_C1_APB2ENR_TIM16EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define RCC_C1_APB2ENR_TIM15EN          (0x1UL << 16) 
#define RCC_C1_APB2ENR_TIM15EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define RCC_C1_APB2ENR_TIM17EN          (0x1UL << 18) 
#define RCC_C1_APB2ENR_TIM17EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define RCC_C1_APB2ENR_SPI5EN          (0x1UL << 20) 
#define RCC_C1_APB2ENR_SPI5EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define RCC_C1_APB2ENR_SAI1EN          (0x1UL << 22) 
#define RCC_C1_APB2ENR_SAI1EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define RCC_C1_APB2ENR_SAI2EN          (0x1UL << 23) 
#define RCC_C1_APB2ENR_SAI2EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define RCC_C1_APB2ENR_SAI3EN          (0x1UL << 24) 
#define RCC_C1_APB2ENR_SAI3EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define RCC_C1_APB2ENR_DFSDM1EN          (0x1UL << 28) 
#define RCC_C1_APB2ENR_DFSDM1EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define RCC_C1_APB2ENR_HRTIMEN          (0x1UL << 29) 
#define RCC_C1_APB2ENR_HRTIMEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define RCC_APB2ENR_TIM1EN          (0x1UL << 0) 
#define RCC_APB2ENR_TIM1EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define RCC_APB2ENR_TIM8EN          (0x1UL << 1) 
#define RCC_APB2ENR_TIM8EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define RCC_APB2ENR_USART1EN          (0x1UL << 4) 
#define RCC_APB2ENR_USART1EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define RCC_APB2ENR_USART6EN          (0x1UL << 5) 
#define RCC_APB2ENR_USART6EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define RCC_APB2ENR_SPI1EN          (0x1UL << 12) 
#define RCC_APB2ENR_SPI1EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define RCC_APB2ENR_SPI4EN          (0x1UL << 13) 
#define RCC_APB2ENR_SPI4EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define RCC_APB2ENR_TIM16EN          (0x1UL << 17) 
#define RCC_APB2ENR_TIM16EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define RCC_APB2ENR_TIM15EN          (0x1UL << 16) 
#define RCC_APB2ENR_TIM15EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define RCC_APB2ENR_TIM17EN          (0x1UL << 18) 
#define RCC_APB2ENR_TIM17EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define RCC_APB2ENR_SPI5EN          (0x1UL << 20) 
#define RCC_APB2ENR_SPI5EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define RCC_APB2ENR_SAI1EN          (0x1UL << 22) 
#define RCC_APB2ENR_SAI1EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define RCC_APB2ENR_SAI2EN          (0x1UL << 23) 
#define RCC_APB2ENR_SAI2EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define RCC_APB2ENR_SAI3EN          (0x1UL << 24) 
#define RCC_APB2ENR_SAI3EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define RCC_APB2ENR_DFSDM1EN          (0x1UL << 28) 
#define RCC_APB2ENR_DFSDM1EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define RCC_APB2ENR_HRTIMEN          (0x1UL << 29) 
#define RCC_APB2ENR_HRTIMEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define RCC_APB4ENR_SYSCFGEN          (0x1UL << 1) 
#define RCC_APB4ENR_SYSCFGEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define RCC_APB4ENR_LPUART1EN          (0x1UL << 3) 
#define RCC_APB4ENR_LPUART1EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define RCC_APB4ENR_SPI6EN          (0x1UL << 5) 
#define RCC_APB4ENR_SPI6EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define RCC_APB4ENR_I2C4EN          (0x1UL << 7) 
#define RCC_APB4ENR_I2C4EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define RCC_APB4ENR_LPTIM2EN          (0x1UL << 9) 
#define RCC_APB4ENR_LPTIM2EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define RCC_APB4ENR_LPTIM3EN          (0x1UL << 10) 
#define RCC_APB4ENR_LPTIM3EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define RCC_APB4ENR_LPTIM4EN          (0x1UL << 11) 
#define RCC_APB4ENR_LPTIM4EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define RCC_APB4ENR_LPTIM5EN          (0x1UL << 12) 
#define RCC_APB4ENR_LPTIM5EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define RCC_APB4ENR_COMP12EN          (0x1UL << 14) 
#define RCC_APB4ENR_COMP12EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define RCC_APB4ENR_VREFEN          (0x1UL << 15) 
#define RCC_APB4ENR_VREFEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define RCC_APB4ENR_RTCAPBEN          (0x1UL << 16) 
#define RCC_APB4ENR_RTCAPBEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define RCC_APB4ENR_SAI4EN          (0x1UL << 21) 
#define RCC_APB4ENR_SAI4EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define RCC_C1_APB4ENR_SYSCFGEN          (0x1UL << 1) 
#define RCC_C1_APB4ENR_SYSCFGEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define RCC_C1_APB4ENR_LPUART1EN          (0x1UL << 3) 
#define RCC_C1_APB4ENR_LPUART1EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define RCC_C1_APB4ENR_SPI6EN          (0x1UL << 5) 
#define RCC_C1_APB4ENR_SPI6EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define RCC_C1_APB4ENR_I2C4EN          (0x1UL << 7) 
#define RCC_C1_APB4ENR_I2C4EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define RCC_C1_APB4ENR_LPTIM2EN          (0x1UL << 9) 
#define RCC_C1_APB4ENR_LPTIM2EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define RCC_C1_APB4ENR_LPTIM3EN          (0x1UL << 10) 
#define RCC_C1_APB4ENR_LPTIM3EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define RCC_C1_APB4ENR_LPTIM4EN          (0x1UL << 11) 
#define RCC_C1_APB4ENR_LPTIM4EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define RCC_C1_APB4ENR_LPTIM5EN          (0x1UL << 12) 
#define RCC_C1_APB4ENR_LPTIM5EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define RCC_C1_APB4ENR_COMP12EN          (0x1UL << 14) 
#define RCC_C1_APB4ENR_COMP12EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define RCC_C1_APB4ENR_VREFEN          (0x1UL << 15) 
#define RCC_C1_APB4ENR_VREFEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define RCC_C1_APB4ENR_RTCAPBEN          (0x1UL << 16) 
#define RCC_C1_APB4ENR_RTCAPBEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define RCC_C1_APB4ENR_SAI4EN          (0x1UL << 21) 
#define RCC_C1_APB4ENR_SAI4EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define RCC_C1_AHB3LPENR_MDMALPEN          (0x1UL << 0) 
#define RCC_C1_AHB3LPENR_MDMALPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define RCC_C1_AHB3LPENR_DMA2DLPEN          (0x1UL << 4) 
#define RCC_C1_AHB3LPENR_DMA2DLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define RCC_C1_AHB3LPENR_JPGDECLPEN          (0x1UL << 5) 
#define RCC_C1_AHB3LPENR_JPGDECLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define RCC_C1_AHB3LPENR_FLITFLPEN          (0x1UL << 8) 
#define RCC_C1_AHB3LPENR_FLITFLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define RCC_C1_AHB3LPENR_FMCLPEN          (0x1UL << 12) 
#define RCC_C1_AHB3LPENR_FMCLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define RCC_C1_AHB3LPENR_QSPILPEN          (0x1UL << 14) 
#define RCC_C1_AHB3LPENR_QSPILPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define RCC_C1_AHB3LPENR_SDMMC1LPEN          (0x1UL << 16) 
#define RCC_C1_AHB3LPENR_SDMMC1LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define RCC_C1_AHB3LPENR_D1DTCM1LPEN          (0x1UL << 28) 
#define RCC_C1_AHB3LPENR_D1DTCM1LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define RCC_C1_AHB3LPENR_DTCM2LPEN          (0x1UL << 29) 
#define RCC_C1_AHB3LPENR_DTCM2LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define RCC_C1_AHB3LPENR_ITCMLPEN          (0x1UL << 30) 
#define RCC_C1_AHB3LPENR_ITCMLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define RCC_C1_AHB3LPENR_AXISRAMLPEN          (0x1UL << 31) 
#define RCC_C1_AHB3LPENR_AXISRAMLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define RCC_AHB3LPENR_MDMALPEN          (0x1UL << 0) 
#define RCC_AHB3LPENR_MDMALPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define RCC_AHB3LPENR_DMA2DLPEN          (0x1UL << 4) 
#define RCC_AHB3LPENR_DMA2DLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define RCC_AHB3LPENR_JPGDECLPEN          (0x1UL << 5) 
#define RCC_AHB3LPENR_JPGDECLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define RCC_AHB3LPENR_FLASHLPEN          (0x1UL << 8) 
#define RCC_AHB3LPENR_FLASHLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define RCC_AHB3LPENR_FMCLPEN          (0x1UL << 12) 
#define RCC_AHB3LPENR_FMCLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define RCC_AHB3LPENR_QSPILPEN          (0x1UL << 14) 
#define RCC_AHB3LPENR_QSPILPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define RCC_AHB3LPENR_SDMMC1LPEN          (0x1UL << 16) 
#define RCC_AHB3LPENR_SDMMC1LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define RCC_AHB3LPENR_D1DTCM1LPEN          (0x1UL << 28) 
#define RCC_AHB3LPENR_D1DTCM1LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define RCC_AHB3LPENR_DTCM2LPEN          (0x1UL << 29) 
#define RCC_AHB3LPENR_DTCM2LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define RCC_AHB3LPENR_ITCMLPEN          (0x1UL << 30) 
#define RCC_AHB3LPENR_ITCMLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define RCC_AHB3LPENR_AXISRAMLPEN          (0x1UL << 31) 
#define RCC_AHB3LPENR_AXISRAMLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define RCC_AHB1LPENR_DMA1LPEN          (0x1UL << 0) 
#define RCC_AHB1LPENR_DMA1LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define RCC_AHB1LPENR_DMA2LPEN          (0x1UL << 1) 
#define RCC_AHB1LPENR_DMA2LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define RCC_AHB1LPENR_ADC12LPEN          (0x1UL << 5) 
#define RCC_AHB1LPENR_ADC12LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define RCC_AHB1LPENR_ETH1MACLPEN          (0x1UL << 15) 
#define RCC_AHB1LPENR_ETH1MACLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define RCC_AHB1LPENR_ETH1TXLPEN          (0x1UL << 16) 
#define RCC_AHB1LPENR_ETH1TXLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define RCC_AHB1LPENR_ETH1RXLPEN          (0x1UL << 17) 
#define RCC_AHB1LPENR_ETH1RXLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define RCC_AHB1LPENR_USB1OTGHSLPEN          (0x1UL << 25) 
#define RCC_AHB1LPENR_USB1OTGHSLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define RCC_AHB1LPENR_USB1OTGHSULPILPEN          (0x1UL << 26) 
#define RCC_AHB1LPENR_USB1OTGHSULPILPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define RCC_AHB1LPENR_USB2OTGHSLPEN          (0x1UL << 27) 
#define RCC_AHB1LPENR_USB2OTGHSLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define RCC_AHB1LPENR_USB2OTGHSULPILPEN          (0x1UL << 28) 
#define RCC_AHB1LPENR_USB2OTGHSULPILPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define RCC_C1_AHB1LPENR_DMA1LPEN          (0x1UL << 0) 
#define RCC_C1_AHB1LPENR_DMA1LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define RCC_C1_AHB1LPENR_DMA2LPEN          (0x1UL << 1) 
#define RCC_C1_AHB1LPENR_DMA2LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define RCC_C1_AHB1LPENR_ADC12LPEN          (0x1UL << 5) 
#define RCC_C1_AHB1LPENR_ADC12LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define RCC_C1_AHB1LPENR_ETH1MACLPEN          (0x1UL << 15) 
#define RCC_C1_AHB1LPENR_ETH1MACLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define RCC_C1_AHB1LPENR_ETH1TXLPEN          (0x1UL << 16) 
#define RCC_C1_AHB1LPENR_ETH1TXLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define RCC_C1_AHB1LPENR_ETH1RXLPEN          (0x1UL << 17) 
#define RCC_C1_AHB1LPENR_ETH1RXLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define RCC_C1_AHB1LPENR_USB1OTGLPEN          (0x1UL << 25) 
#define RCC_C1_AHB1LPENR_USB1OTGLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define RCC_C1_AHB1LPENR_USB1ULPILPEN          (0x1UL << 26) 
#define RCC_C1_AHB1LPENR_USB1ULPILPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define RCC_C1_AHB1LPENR_USB2OTGLPEN          (0x1UL << 27) 
#define RCC_C1_AHB1LPENR_USB2OTGLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define RCC_C1_AHB1LPENR_USB2ULPILPEN          (0x1UL << 28) 
#define RCC_C1_AHB1LPENR_USB2ULPILPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define RCC_C1_AHB2LPENR_CAMITFLPEN          (0x1UL << 0) 
#define RCC_C1_AHB2LPENR_CAMITFLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define RCC_C1_AHB2LPENR_CRYPTLPEN          (0x1UL << 4) 
#define RCC_C1_AHB2LPENR_CRYPTLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define RCC_C1_AHB2LPENR_HASHLPEN          (0x1UL << 5) 
#define RCC_C1_AHB2LPENR_HASHLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define RCC_C1_AHB2LPENR_SDMMC2LPEN          (0x1UL << 9) 
#define RCC_C1_AHB2LPENR_SDMMC2LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define RCC_C1_AHB2LPENR_RNGLPEN          (0x1UL << 6) 
#define RCC_C1_AHB2LPENR_RNGLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define RCC_C1_AHB2LPENR_SRAM1LPEN          (0x1UL << 29) 
#define RCC_C1_AHB2LPENR_SRAM1LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define RCC_C1_AHB2LPENR_SRAM2LPEN          (0x1UL << 30) 
#define RCC_C1_AHB2LPENR_SRAM2LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define RCC_C1_AHB2LPENR_SRAM3LPEN          (0x1UL << 31) 
#define RCC_C1_AHB2LPENR_SRAM3LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define RCC_AHB2LPENR_CAMITFLPEN          (0x1UL << 0) 
#define RCC_AHB2LPENR_CAMITFLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define RCC_AHB2LPENR_CRYPTLPEN          (0x1UL << 4) 
#define RCC_AHB2LPENR_CRYPTLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define RCC_AHB2LPENR_HASHLPEN          (0x1UL << 5) 
#define RCC_AHB2LPENR_HASHLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define RCC_AHB2LPENR_SDMMC2LPEN          (0x1UL << 9) 
#define RCC_AHB2LPENR_SDMMC2LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define RCC_AHB2LPENR_RNGLPEN          (0x1UL << 6) 
#define RCC_AHB2LPENR_RNGLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define RCC_AHB2LPENR_SRAM1LPEN          (0x1UL << 29) 
#define RCC_AHB2LPENR_SRAM1LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define RCC_AHB2LPENR_SRAM2LPEN          (0x1UL << 30) 
#define RCC_AHB2LPENR_SRAM2LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define RCC_AHB2LPENR_SRAM3LPEN          (0x1UL << 31) 
#define RCC_AHB2LPENR_SRAM3LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define RCC_AHB4LPENR_GPIOALPEN          (0x1UL << 0) 
#define RCC_AHB4LPENR_GPIOALPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define RCC_AHB4LPENR_GPIOBLPEN          (0x1UL << 1) 
#define RCC_AHB4LPENR_GPIOBLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define RCC_AHB4LPENR_GPIOCLPEN          (0x1UL << 2) 
#define RCC_AHB4LPENR_GPIOCLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define RCC_AHB4LPENR_GPIODLPEN          (0x1UL << 3) 
#define RCC_AHB4LPENR_GPIODLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define RCC_AHB4LPENR_GPIOELPEN          (0x1UL << 4) 
#define RCC_AHB4LPENR_GPIOELPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define RCC_AHB4LPENR_GPIOFLPEN          (0x1UL << 5) 
#define RCC_AHB4LPENR_GPIOFLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define RCC_AHB4LPENR_GPIOGLPEN          (0x1UL << 6) 
#define RCC_AHB4LPENR_GPIOGLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define RCC_AHB4LPENR_GPIOHLPEN          (0x1UL << 7) 
#define RCC_AHB4LPENR_GPIOHLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define RCC_AHB4LPENR_GPIOILPEN          (0x1UL << 8) 
#define RCC_AHB4LPENR_GPIOILPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define RCC_AHB4LPENR_GPIOJLPEN          (0x1UL << 9) 
#define RCC_AHB4LPENR_GPIOJLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define RCC_AHB4LPENR_GPIOKLPEN          (0x1UL << 10) 
#define RCC_AHB4LPENR_GPIOKLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define RCC_AHB4LPENR_CRCLPEN          (0x1UL << 19) 
#define RCC_AHB4LPENR_CRCLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define RCC_AHB4LPENR_BDMALPEN          (0x1UL << 21) 
#define RCC_AHB4LPENR_BDMALPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define RCC_AHB4LPENR_ADC3LPEN          (0x1UL << 24) 
#define RCC_AHB4LPENR_ADC3LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define RCC_AHB4LPENR_BKPRAMLPEN          (0x1UL << 28) 
#define RCC_AHB4LPENR_BKPRAMLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define RCC_AHB4LPENR_SRAM4LPEN          (0x1UL << 29) 
#define RCC_AHB4LPENR_SRAM4LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define RCC_C1_AHB4LPENR_GPIOALPEN          (0x1UL << 0) 
#define RCC_C1_AHB4LPENR_GPIOALPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define RCC_C1_AHB4LPENR_GPIOBLPEN          (0x1UL << 1) 
#define RCC_C1_AHB4LPENR_GPIOBLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define RCC_C1_AHB4LPENR_GPIOCLPEN          (0x1UL << 2) 
#define RCC_C1_AHB4LPENR_GPIOCLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define RCC_C1_AHB4LPENR_GPIODLPEN          (0x1UL << 3) 
#define RCC_C1_AHB4LPENR_GPIODLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define RCC_C1_AHB4LPENR_GPIOELPEN          (0x1UL << 4) 
#define RCC_C1_AHB4LPENR_GPIOELPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define RCC_C1_AHB4LPENR_GPIOFLPEN          (0x1UL << 5) 
#define RCC_C1_AHB4LPENR_GPIOFLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define RCC_C1_AHB4LPENR_GPIOGLPEN          (0x1UL << 6) 
#define RCC_C1_AHB4LPENR_GPIOGLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define RCC_C1_AHB4LPENR_GPIOHLPEN          (0x1UL << 7) 
#define RCC_C1_AHB4LPENR_GPIOHLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define RCC_C1_AHB4LPENR_GPIOILPEN          (0x1UL << 8) 
#define RCC_C1_AHB4LPENR_GPIOILPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define RCC_C1_AHB4LPENR_GPIOJLPEN          (0x1UL << 9) 
#define RCC_C1_AHB4LPENR_GPIOJLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define RCC_C1_AHB4LPENR_GPIOKLPEN          (0x1UL << 10) 
#define RCC_C1_AHB4LPENR_GPIOKLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define RCC_C1_AHB4LPENR_CRCLPEN          (0x1UL << 19) 
#define RCC_C1_AHB4LPENR_CRCLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define RCC_C1_AHB4LPENR_BDMALPEN          (0x1UL << 21) 
#define RCC_C1_AHB4LPENR_BDMALPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define RCC_C1_AHB4LPENR_ADC3LPEN          (0x1UL << 24) 
#define RCC_C1_AHB4LPENR_ADC3LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define RCC_C1_AHB4LPENR_BKPRAMLPEN          (0x1UL << 28) 
