via/viaems/src/platforms/stm32h743/device.h
#define RCC_C1_AHB4LPENR_BKPRAMLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define RCC_C1_AHB4LPENR_SRAM4LPEN          (0x1UL << 29) 
#define RCC_C1_AHB4LPENR_SRAM4LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define RCC_C1_APB3LPENR_LTDCLPEN          (0x1UL << 3) 
#define RCC_C1_APB3LPENR_LTDCLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define RCC_C1_APB3LPENR_WWDG1LPEN          (0x1UL << 6) 
#define RCC_C1_APB3LPENR_WWDG1LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define RCC_APB3LPENR_LTDCLPEN          (0x1UL << 3) 
#define RCC_APB3LPENR_LTDCLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define RCC_APB3LPENR_WWDG1LPEN          (0x1UL << 6) 
#define RCC_APB3LPENR_WWDG1LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define RCC_APB1LLPENR_TIM2LPEN          (0x1UL << 0) 
#define RCC_APB1LLPENR_TIM2LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define RCC_APB1LLPENR_TIM3LPEN          (0x1UL << 1) 
#define RCC_APB1LLPENR_TIM3LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define RCC_APB1LLPENR_TIM4LPEN          (0x1UL << 2) 
#define RCC_APB1LLPENR_TIM4LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define RCC_APB1LLPENR_TIM5LPEN          (0x1UL << 3) 
#define RCC_APB1LLPENR_TIM5LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define RCC_APB1LLPENR_TIM6LPEN          (0x1UL << 4) 
#define RCC_APB1LLPENR_TIM6LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define RCC_APB1LLPENR_TIM7LPEN          (0x1UL << 5) 
#define RCC_APB1LLPENR_TIM7LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define RCC_APB1LLPENR_TIM12LPEN          (0x1UL << 6) 
#define RCC_APB1LLPENR_TIM12LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define RCC_APB1LLPENR_TIM13LPEN          (0x1UL << 7) 
#define RCC_APB1LLPENR_TIM13LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define RCC_APB1LLPENR_TIM14LPEN          (0x1UL << 8) 
#define RCC_APB1LLPENR_TIM14LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define RCC_APB1LLPENR_LPTIM1LPEN          (0x1UL << 9) 
#define RCC_APB1LLPENR_LPTIM1LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define RCC_APB1LLPENR_SPI2LPEN          (0x1UL << 14) 
#define RCC_APB1LLPENR_SPI2LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define RCC_APB1LLPENR_SPI3LPEN          (0x1UL << 15) 
#define RCC_APB1LLPENR_SPI3LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define RCC_APB1LLPENR_SPDIFRXLPEN          (0x1UL << 16) 
#define RCC_APB1LLPENR_SPDIFRXLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define RCC_APB1LLPENR_USART2LPEN          (0x1UL << 17) 
#define RCC_APB1LLPENR_USART2LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define RCC_APB1LLPENR_USART3LPEN          (0x1UL << 18) 
#define RCC_APB1LLPENR_USART3LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define RCC_APB1LLPENR_UART4LPEN          (0x1UL << 19) 
#define RCC_APB1LLPENR_UART4LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define RCC_APB1LLPENR_UART5LPEN          (0x1UL << 20) 
#define RCC_APB1LLPENR_UART5LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define RCC_APB1LLPENR_I2C1LPEN          (0x1UL << 21) 
#define RCC_APB1LLPENR_I2C1LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define RCC_APB1LLPENR_I2C2LPEN          (0x1UL << 22) 
#define RCC_APB1LLPENR_I2C2LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define RCC_APB1LLPENR_I2C3LPEN          (0x1UL << 23) 
#define RCC_APB1LLPENR_I2C3LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define RCC_APB1LLPENR_HDMICECLPEN          (0x1UL << 27) 
#define RCC_APB1LLPENR_HDMICECLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define RCC_APB1LLPENR_DAC12LPEN          (0x1UL << 29) 
#define RCC_APB1LLPENR_DAC12LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define RCC_APB1LLPENR_USART7LPEN          (0x1UL << 30) 
#define RCC_APB1LLPENR_USART7LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define RCC_APB1LLPENR_USART8LPEN          (0x1UL << 31) 
#define RCC_APB1LLPENR_USART8LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define RCC_C1_APB1LLPENR_TIM2LPEN          (0x1UL << 0) 
#define RCC_C1_APB1LLPENR_TIM2LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define RCC_C1_APB1LLPENR_TIM3LPEN          (0x1UL << 1) 
#define RCC_C1_APB1LLPENR_TIM3LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define RCC_C1_APB1LLPENR_TIM4LPEN          (0x1UL << 2) 
#define RCC_C1_APB1LLPENR_TIM4LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define RCC_C1_APB1LLPENR_TIM5LPEN          (0x1UL << 3) 
#define RCC_C1_APB1LLPENR_TIM5LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define RCC_C1_APB1LLPENR_TIM6LPEN          (0x1UL << 4) 
#define RCC_C1_APB1LLPENR_TIM6LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define RCC_C1_APB1LLPENR_TIM7LPEN          (0x1UL << 5) 
#define RCC_C1_APB1LLPENR_TIM7LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define RCC_C1_APB1LLPENR_TIM12LPEN          (0x1UL << 6) 
#define RCC_C1_APB1LLPENR_TIM12LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define RCC_C1_APB1LLPENR_TIM13LPEN          (0x1UL << 7) 
#define RCC_C1_APB1LLPENR_TIM13LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define RCC_C1_APB1LLPENR_TIM14LPEN          (0x1UL << 8) 
#define RCC_C1_APB1LLPENR_TIM14LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define RCC_C1_APB1LLPENR_LPTIM1LPEN          (0x1UL << 9) 
#define RCC_C1_APB1LLPENR_LPTIM1LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define RCC_C1_APB1LLPENR_SPI2LPEN          (0x1UL << 14) 
#define RCC_C1_APB1LLPENR_SPI2LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define RCC_C1_APB1LLPENR_SPI3LPEN          (0x1UL << 15) 
#define RCC_C1_APB1LLPENR_SPI3LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define RCC_C1_APB1LLPENR_SPDIFRXLPEN          (0x1UL << 16) 
#define RCC_C1_APB1LLPENR_SPDIFRXLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define RCC_C1_APB1LLPENR_USART2LPEN          (0x1UL << 17) 
#define RCC_C1_APB1LLPENR_USART2LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define RCC_C1_APB1LLPENR_USART3LPEN          (0x1UL << 18) 
#define RCC_C1_APB1LLPENR_USART3LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define RCC_C1_APB1LLPENR_UART4LPEN          (0x1UL << 19) 
#define RCC_C1_APB1LLPENR_UART4LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define RCC_C1_APB1LLPENR_UART5LPEN          (0x1UL << 20) 
#define RCC_C1_APB1LLPENR_UART5LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define RCC_C1_APB1LLPENR_I2C1LPEN          (0x1UL << 21) 
#define RCC_C1_APB1LLPENR_I2C1LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define RCC_C1_APB1LLPENR_I2C2LPEN          (0x1UL << 22) 
#define RCC_C1_APB1LLPENR_I2C2LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define RCC_C1_APB1LLPENR_I2C3LPEN          (0x1UL << 23) 
#define RCC_C1_APB1LLPENR_I2C3LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define RCC_C1_APB1LLPENR_HDMICECLPEN          (0x1UL << 27) 
#define RCC_C1_APB1LLPENR_HDMICECLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define RCC_C1_APB1LLPENR_DAC12LPEN          (0x1UL << 29) 
#define RCC_C1_APB1LLPENR_DAC12LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define RCC_C1_APB1LLPENR_USART7LPEN          (0x1UL << 30) 
#define RCC_C1_APB1LLPENR_USART7LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define RCC_C1_APB1LLPENR_USART8LPEN          (0x1UL << 31) 
#define RCC_C1_APB1LLPENR_USART8LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define RCC_C1_APB1HLPENR_CRSLPEN          (0x1UL << 1) 
#define RCC_C1_APB1HLPENR_CRSLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define RCC_C1_APB1HLPENR_SWPLPEN          (0x1UL << 2) 
#define RCC_C1_APB1HLPENR_SWPLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define RCC_C1_APB1HLPENR_OPAMPLPEN          (0x1UL << 4) 
#define RCC_C1_APB1HLPENR_OPAMPLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define RCC_C1_APB1HLPENR_MDIOSLPEN          (0x1UL << 5) 
#define RCC_C1_APB1HLPENR_MDIOSLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define RCC_C1_APB1HLPENR_FDCANLPEN          (0x1UL << 8) 
#define RCC_C1_APB1HLPENR_FDCANLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define RCC_APB1HLPENR_CRSLPEN          (0x1UL << 1) 
#define RCC_APB1HLPENR_CRSLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define RCC_APB1HLPENR_SWPLPEN          (0x1UL << 2) 
#define RCC_APB1HLPENR_SWPLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define RCC_APB1HLPENR_OPAMPLPEN          (0x1UL << 4) 
#define RCC_APB1HLPENR_OPAMPLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define RCC_APB1HLPENR_MDIOSLPEN          (0x1UL << 5) 
#define RCC_APB1HLPENR_MDIOSLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define RCC_APB1HLPENR_FDCANLPEN          (0x1UL << 8) 
#define RCC_APB1HLPENR_FDCANLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define RCC_APB2LPENR_TIM1LPEN          (0x1UL << 0) 
#define RCC_APB2LPENR_TIM1LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define RCC_APB2LPENR_TIM8LPEN          (0x1UL << 1) 
#define RCC_APB2LPENR_TIM8LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define RCC_APB2LPENR_USART1LPEN          (0x1UL << 4) 
#define RCC_APB2LPENR_USART1LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define RCC_APB2LPENR_USART6LPEN          (0x1UL << 5) 
#define RCC_APB2LPENR_USART6LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define RCC_APB2LPENR_SPI1LPEN          (0x1UL << 12) 
#define RCC_APB2LPENR_SPI1LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define RCC_APB2LPENR_SPI4LPEN          (0x1UL << 13) 
#define RCC_APB2LPENR_SPI4LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define RCC_APB2LPENR_TIM15LPEN          (0x1UL << 16) 
#define RCC_APB2LPENR_TIM15LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define RCC_APB2LPENR_TIM16LPEN          (0x1UL << 17) 
#define RCC_APB2LPENR_TIM16LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define RCC_APB2LPENR_TIM17LPEN          (0x1UL << 18) 
#define RCC_APB2LPENR_TIM17LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define RCC_APB2LPENR_SPI5LPEN          (0x1UL << 20) 
#define RCC_APB2LPENR_SPI5LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define RCC_APB2LPENR_SAI1LPEN          (0x1UL << 22) 
#define RCC_APB2LPENR_SAI1LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define RCC_APB2LPENR_SAI2LPEN          (0x1UL << 23) 
#define RCC_APB2LPENR_SAI2LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define RCC_APB2LPENR_SAI3LPEN          (0x1UL << 24) 
#define RCC_APB2LPENR_SAI3LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define RCC_APB2LPENR_DFSDM1LPEN          (0x1UL << 28) 
#define RCC_APB2LPENR_DFSDM1LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define RCC_APB2LPENR_HRTIMLPEN          (0x1UL << 29) 
#define RCC_APB2LPENR_HRTIMLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define RCC_C1_APB2LPENR_TIM1LPEN          (0x1UL << 0) 
#define RCC_C1_APB2LPENR_TIM1LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define RCC_C1_APB2LPENR_TIM8LPEN          (0x1UL << 1) 
#define RCC_C1_APB2LPENR_TIM8LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define RCC_C1_APB2LPENR_USART1LPEN          (0x1UL << 4) 
#define RCC_C1_APB2LPENR_USART1LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define RCC_C1_APB2LPENR_USART6LPEN          (0x1UL << 5) 
#define RCC_C1_APB2LPENR_USART6LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define RCC_C1_APB2LPENR_SPI1LPEN          (0x1UL << 12) 
#define RCC_C1_APB2LPENR_SPI1LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define RCC_C1_APB2LPENR_SPI4LPEN          (0x1UL << 13) 
#define RCC_C1_APB2LPENR_SPI4LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define RCC_C1_APB2LPENR_TIM15LPEN          (0x1UL << 16) 
#define RCC_C1_APB2LPENR_TIM15LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define RCC_C1_APB2LPENR_TIM16LPEN          (0x1UL << 17) 
#define RCC_C1_APB2LPENR_TIM16LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define RCC_C1_APB2LPENR_TIM17LPEN          (0x1UL << 18) 
#define RCC_C1_APB2LPENR_TIM17LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define RCC_C1_APB2LPENR_SPI5LPEN          (0x1UL << 20) 
#define RCC_C1_APB2LPENR_SPI5LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define RCC_C1_APB2LPENR_SAI1LPEN          (0x1UL << 22) 
#define RCC_C1_APB2LPENR_SAI1LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define RCC_C1_APB2LPENR_SAI2LPEN          (0x1UL << 23) 
#define RCC_C1_APB2LPENR_SAI2LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define RCC_C1_APB2LPENR_SAI3LPEN          (0x1UL << 24) 
#define RCC_C1_APB2LPENR_SAI3LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define RCC_C1_APB2LPENR_DFSDM1LPEN          (0x1UL << 28) 
#define RCC_C1_APB2LPENR_DFSDM1LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define RCC_C1_APB2LPENR_HRTIMLPEN          (0x1UL << 29) 
#define RCC_C1_APB2LPENR_HRTIMLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define RCC_C1_APB4LPENR_SYSCFGLPEN          (0x1UL << 1) 
#define RCC_C1_APB4LPENR_SYSCFGLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define RCC_C1_APB4LPENR_LPUART1LPEN          (0x1UL << 3) 
#define RCC_C1_APB4LPENR_LPUART1LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define RCC_C1_APB4LPENR_SPI6LPEN          (0x1UL << 5) 
#define RCC_C1_APB4LPENR_SPI6LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define RCC_C1_APB4LPENR_I2C4LPEN          (0x1UL << 7) 
#define RCC_C1_APB4LPENR_I2C4LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define RCC_C1_APB4LPENR_LPTIM2LPEN          (0x1UL << 9) 
#define RCC_C1_APB4LPENR_LPTIM2LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define RCC_C1_APB4LPENR_LPTIM3LPEN          (0x1UL << 10) 
#define RCC_C1_APB4LPENR_LPTIM3LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define RCC_C1_APB4LPENR_LPTIM4LPEN          (0x1UL << 11) 
#define RCC_C1_APB4LPENR_LPTIM4LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define RCC_C1_APB4LPENR_LPTIM5LPEN          (0x1UL << 12) 
#define RCC_C1_APB4LPENR_LPTIM5LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define RCC_C1_APB4LPENR_COMP12LPEN          (0x1UL << 14) 
#define RCC_C1_APB4LPENR_COMP12LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define RCC_C1_APB4LPENR_VREFLPEN          (0x1UL << 15) 
#define RCC_C1_APB4LPENR_VREFLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define RCC_C1_APB4LPENR_RTCAPBLPEN          (0x1UL << 16) 
#define RCC_C1_APB4LPENR_RTCAPBLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define RCC_C1_APB4LPENR_SAI4LPEN          (0x1UL << 21) 
#define RCC_C1_APB4LPENR_SAI4LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define RCC_APB4LPENR_SYSCFGLPEN          (0x1UL << 1) 
#define RCC_APB4LPENR_SYSCFGLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define RCC_APB4LPENR_LPUART1LPEN          (0x1UL << 3) 
#define RCC_APB4LPENR_LPUART1LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define RCC_APB4LPENR_SPI6LPEN          (0x1UL << 5) 
#define RCC_APB4LPENR_SPI6LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define RCC_APB4LPENR_I2C4LPEN          (0x1UL << 7) 
#define RCC_APB4LPENR_I2C4LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define RCC_APB4LPENR_LPTIM2LPEN          (0x1UL << 9) 
#define RCC_APB4LPENR_LPTIM2LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define RCC_APB4LPENR_LPTIM3LPEN          (0x1UL << 10) 
#define RCC_APB4LPENR_LPTIM3LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define RCC_APB4LPENR_LPTIM4LPEN          (0x1UL << 11) 
#define RCC_APB4LPENR_LPTIM4LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define RCC_APB4LPENR_LPTIM5LPEN          (0x1UL << 12) 
#define RCC_APB4LPENR_LPTIM5LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define RCC_APB4LPENR_COMP12LPEN          (0x1UL << 14) 
#define RCC_APB4LPENR_COMP12LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define RCC_APB4LPENR_VREFLPEN          (0x1UL << 15) 
#define RCC_APB4LPENR_VREFLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define RCC_APB4LPENR_RTCAPBLPEN          (0x1UL << 16) 
#define RCC_APB4LPENR_RTCAPBLPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define RCC_APB4LPENR_SAI4LPEN          (0x1UL << 21) 
#define RCC_APB4LPENR_SAI4LPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)

