via/viaems/src/platforms/stm32h743/device.h
#define RCC  ((struct RCC*)(0x58024400UL))
struct LPTIM1 {
  volatile const uint32_t ISR;
  volatile uint32_t ICR;
  volatile uint32_t IER;
  volatile uint32_t CFGR;
  volatile uint32_t CR;
  volatile uint32_t CMP;
  volatile uint32_t ARR;
  volatile const uint32_t CNT;
  const volatile uint32_t RESERVED36[1];
  volatile uint32_t CFGR2;
};
#define LPTIM1_ISR_DOWN          (0x1UL << 6) 
#define LPTIM1_ISR_DOWN_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define LPTIM1_ISR_UP          (0x1UL << 5) 
#define LPTIM1_ISR_UP_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define LPTIM1_ISR_ARROK          (0x1UL << 4) 
#define LPTIM1_ISR_ARROK_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define LPTIM1_ISR_CMPOK          (0x1UL << 3) 
#define LPTIM1_ISR_CMPOK_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define LPTIM1_ISR_EXTTRIG          (0x1UL << 2) 
#define LPTIM1_ISR_EXTTRIG_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define LPTIM1_ISR_ARRM          (0x1UL << 1) 
#define LPTIM1_ISR_ARRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define LPTIM1_ISR_CMPM          (0x1UL << 0) 
#define LPTIM1_ISR_CMPM_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define LPTIM1_ICR_DOWNCF          (0x1UL << 6) 
#define LPTIM1_ICR_DOWNCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define LPTIM1_ICR_UPCF          (0x1UL << 5) 
#define LPTIM1_ICR_UPCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define LPTIM1_ICR_ARROKCF          (0x1UL << 4) 
#define LPTIM1_ICR_ARROKCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define LPTIM1_ICR_CMPOKCF          (0x1UL << 3) 
#define LPTIM1_ICR_CMPOKCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define LPTIM1_ICR_EXTTRIGCF          (0x1UL << 2) 
#define LPTIM1_ICR_EXTTRIGCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define LPTIM1_ICR_ARRMCF          (0x1UL << 1) 
#define LPTIM1_ICR_ARRMCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define LPTIM1_ICR_CMPMCF          (0x1UL << 0) 
#define LPTIM1_ICR_CMPMCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define LPTIM1_IER_DOWNIE          (0x1UL << 6) 
#define LPTIM1_IER_DOWNIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define LPTIM1_IER_UPIE          (0x1UL << 5) 
#define LPTIM1_IER_UPIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define LPTIM1_IER_ARROKIE          (0x1UL << 4) 
#define LPTIM1_IER_ARROKIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define LPTIM1_IER_CMPOKIE          (0x1UL << 3) 
#define LPTIM1_IER_CMPOKIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define LPTIM1_IER_EXTTRIGIE          (0x1UL << 2) 
#define LPTIM1_IER_EXTTRIGIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define LPTIM1_IER_ARRMIE          (0x1UL << 1) 
#define LPTIM1_IER_ARRMIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define LPTIM1_IER_CMPMIE          (0x1UL << 0) 
#define LPTIM1_IER_CMPMIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define LPTIM1_CFGR_ENC          (0x1UL << 24) 
#define LPTIM1_CFGR_ENC_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define LPTIM1_CFGR_COUNTMODE          (0x1UL << 23) 
#define LPTIM1_CFGR_COUNTMODE_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define LPTIM1_CFGR_PRELOAD          (0x1UL << 22) 
#define LPTIM1_CFGR_PRELOAD_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define LPTIM1_CFGR_WAVPOL          (0x1UL << 21) 
#define LPTIM1_CFGR_WAVPOL_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define LPTIM1_CFGR_WAVE          (0x1UL << 20) 
#define LPTIM1_CFGR_WAVE_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define LPTIM1_CFGR_TIMOUT          (0x1UL << 19) 
#define LPTIM1_CFGR_TIMOUT_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define LPTIM1_CFGR_TRIGEN          (0x3UL << 17) 
#define LPTIM1_CFGR_TRIGEN_VAL(X) (((uint32_t)(X) & 0x3UL) << 17)
#define LPTIM1_CFGR_TRIGSEL          (0x7UL << 13) 
#define LPTIM1_CFGR_TRIGSEL_VAL(X) (((uint32_t)(X) & 0x7UL) << 13)
#define LPTIM1_CFGR_PRESC          (0x7UL << 9) 
#define LPTIM1_CFGR_PRESC_VAL(X) (((uint32_t)(X) & 0x7UL) << 9)
#define LPTIM1_CFGR_TRGFLT          (0x3UL << 6) 
#define LPTIM1_CFGR_TRGFLT_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define LPTIM1_CFGR_CKFLT          (0x3UL << 3) 
#define LPTIM1_CFGR_CKFLT_VAL(X) (((uint32_t)(X) & 0x3UL) << 3)
#define LPTIM1_CFGR_CKPOL          (0x3UL << 1) 
#define LPTIM1_CFGR_CKPOL_VAL(X) (((uint32_t)(X) & 0x3UL) << 1)
#define LPTIM1_CFGR_CKSEL          (0x1UL << 0) 
#define LPTIM1_CFGR_CKSEL_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define LPTIM1_CR_ENABLE          (0x1UL << 0) 
#define LPTIM1_CR_ENABLE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define LPTIM1_CR_SNGSTRT          (0x1UL << 1) 
#define LPTIM1_CR_SNGSTRT_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define LPTIM1_CR_CNTSTRT          (0x1UL << 2) 
#define LPTIM1_CR_CNTSTRT_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define LPTIM1_CR_COUNTRST          (0x1UL << 3) 
#define LPTIM1_CR_COUNTRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define LPTIM1_CR_RSTARE          (0x1UL << 4) 
#define LPTIM1_CR_RSTARE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define LPTIM1_CMP_CMP          (0xFFFFUL << 0) 
#define LPTIM1_CMP_CMP_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define LPTIM1_ARR_ARR          (0xFFFFUL << 0) 
#define LPTIM1_ARR_ARR_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define LPTIM1_CNT_CNT          (0xFFFFUL << 0) 
#define LPTIM1_CNT_CNT_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define LPTIM1_CFGR2_IN1SEL          (0x3UL << 0) 
#define LPTIM1_CFGR2_IN1SEL_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define LPTIM1_CFGR2_IN2SEL          (0x3UL << 4) 
#define LPTIM1_CFGR2_IN2SEL_VAL(X) (((uint32_t)(X) & 0x3UL) << 4)

#define LPTIM1  ((struct LPTIM1*)(0x40002400UL))
struct LPTIM2 {
  volatile const uint32_t ISR;
  volatile uint32_t ICR;
  volatile uint32_t IER;
  volatile uint32_t CFGR;
  volatile uint32_t CR;
  volatile uint32_t CMP;
  volatile uint32_t ARR;
  volatile const uint32_t CNT;
  const volatile uint32_t RESERVED36[1];
  volatile uint32_t CFGR2;
};
#define LPTIM2_ISR_DOWN          (0x1UL << 6) 
#define LPTIM2_ISR_DOWN_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define LPTIM2_ISR_UP          (0x1UL << 5) 
#define LPTIM2_ISR_UP_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define LPTIM2_ISR_ARROK          (0x1UL << 4) 
#define LPTIM2_ISR_ARROK_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define LPTIM2_ISR_CMPOK          (0x1UL << 3) 
#define LPTIM2_ISR_CMPOK_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define LPTIM2_ISR_EXTTRIG          (0x1UL << 2) 
#define LPTIM2_ISR_EXTTRIG_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define LPTIM2_ISR_ARRM          (0x1UL << 1) 
#define LPTIM2_ISR_ARRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define LPTIM2_ISR_CMPM          (0x1UL << 0) 
#define LPTIM2_ISR_CMPM_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define LPTIM2_ICR_DOWNCF          (0x1UL << 6) 
#define LPTIM2_ICR_DOWNCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define LPTIM2_ICR_UPCF          (0x1UL << 5) 
#define LPTIM2_ICR_UPCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define LPTIM2_ICR_ARROKCF          (0x1UL << 4) 
#define LPTIM2_ICR_ARROKCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define LPTIM2_ICR_CMPOKCF          (0x1UL << 3) 
#define LPTIM2_ICR_CMPOKCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define LPTIM2_ICR_EXTTRIGCF          (0x1UL << 2) 
#define LPTIM2_ICR_EXTTRIGCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define LPTIM2_ICR_ARRMCF          (0x1UL << 1) 
#define LPTIM2_ICR_ARRMCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define LPTIM2_ICR_CMPMCF          (0x1UL << 0) 
#define LPTIM2_ICR_CMPMCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define LPTIM2_IER_DOWNIE          (0x1UL << 6) 
#define LPTIM2_IER_DOWNIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define LPTIM2_IER_UPIE          (0x1UL << 5) 
#define LPTIM2_IER_UPIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define LPTIM2_IER_ARROKIE          (0x1UL << 4) 
#define LPTIM2_IER_ARROKIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define LPTIM2_IER_CMPOKIE          (0x1UL << 3) 
#define LPTIM2_IER_CMPOKIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define LPTIM2_IER_EXTTRIGIE          (0x1UL << 2) 
#define LPTIM2_IER_EXTTRIGIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define LPTIM2_IER_ARRMIE          (0x1UL << 1) 
#define LPTIM2_IER_ARRMIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define LPTIM2_IER_CMPMIE          (0x1UL << 0) 
#define LPTIM2_IER_CMPMIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define LPTIM2_CFGR_ENC          (0x1UL << 24) 
#define LPTIM2_CFGR_ENC_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define LPTIM2_CFGR_COUNTMODE          (0x1UL << 23) 
#define LPTIM2_CFGR_COUNTMODE_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define LPTIM2_CFGR_PRELOAD          (0x1UL << 22) 
#define LPTIM2_CFGR_PRELOAD_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define LPTIM2_CFGR_WAVPOL          (0x1UL << 21) 
#define LPTIM2_CFGR_WAVPOL_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define LPTIM2_CFGR_WAVE          (0x1UL << 20) 
#define LPTIM2_CFGR_WAVE_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define LPTIM2_CFGR_TIMOUT          (0x1UL << 19) 
#define LPTIM2_CFGR_TIMOUT_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define LPTIM2_CFGR_TRIGEN          (0x3UL << 17) 
#define LPTIM2_CFGR_TRIGEN_VAL(X) (((uint32_t)(X) & 0x3UL) << 17)
#define LPTIM2_CFGR_TRIGSEL          (0x7UL << 13) 
#define LPTIM2_CFGR_TRIGSEL_VAL(X) (((uint32_t)(X) & 0x7UL) << 13)
#define LPTIM2_CFGR_PRESC          (0x7UL << 9) 
#define LPTIM2_CFGR_PRESC_VAL(X) (((uint32_t)(X) & 0x7UL) << 9)
#define LPTIM2_CFGR_TRGFLT          (0x3UL << 6) 
#define LPTIM2_CFGR_TRGFLT_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define LPTIM2_CFGR_CKFLT          (0x3UL << 3) 
#define LPTIM2_CFGR_CKFLT_VAL(X) (((uint32_t)(X) & 0x3UL) << 3)
#define LPTIM2_CFGR_CKPOL          (0x3UL << 1) 
#define LPTIM2_CFGR_CKPOL_VAL(X) (((uint32_t)(X) & 0x3UL) << 1)
#define LPTIM2_CFGR_CKSEL          (0x1UL << 0) 
#define LPTIM2_CFGR_CKSEL_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define LPTIM2_CR_ENABLE          (0x1UL << 0) 
#define LPTIM2_CR_ENABLE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define LPTIM2_CR_SNGSTRT          (0x1UL << 1) 
#define LPTIM2_CR_SNGSTRT_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define LPTIM2_CR_CNTSTRT          (0x1UL << 2) 
#define LPTIM2_CR_CNTSTRT_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define LPTIM2_CR_COUNTRST          (0x1UL << 3) 
#define LPTIM2_CR_COUNTRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define LPTIM2_CR_RSTARE          (0x1UL << 4) 
#define LPTIM2_CR_RSTARE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define LPTIM2_CMP_CMP          (0xFFFFUL << 0) 
#define LPTIM2_CMP_CMP_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define LPTIM2_ARR_ARR          (0xFFFFUL << 0) 
#define LPTIM2_ARR_ARR_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define LPTIM2_CNT_CNT          (0xFFFFUL << 0) 
#define LPTIM2_CNT_CNT_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define LPTIM2_CFGR2_IN1SEL          (0x3UL << 0) 
#define LPTIM2_CFGR2_IN1SEL_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define LPTIM2_CFGR2_IN2SEL          (0x3UL << 4) 
#define LPTIM2_CFGR2_IN2SEL_VAL(X) (((uint32_t)(X) & 0x3UL) << 4)

