via/viaems/src/platforms/stm32h743/device.h
#define LPTIM2  ((struct LPTIM2*)(0x58002400UL))
struct LPTIM3 {
  volatile const uint32_t ISR;
  volatile uint32_t ICR;
  volatile uint32_t IER;
  volatile uint32_t CFGR;
  volatile uint32_t CR;
  volatile uint32_t CMP;
  volatile uint32_t ARR;
  volatile const uint32_t CNT;
  const volatile uint32_t RESERVED36[1];
  volatile uint32_t CFGR2;
};
#define LPTIM3_ISR_DOWN          (0x1UL << 6) 
#define LPTIM3_ISR_DOWN_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define LPTIM3_ISR_UP          (0x1UL << 5) 
#define LPTIM3_ISR_UP_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define LPTIM3_ISR_ARROK          (0x1UL << 4) 
#define LPTIM3_ISR_ARROK_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define LPTIM3_ISR_CMPOK          (0x1UL << 3) 
#define LPTIM3_ISR_CMPOK_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define LPTIM3_ISR_EXTTRIG          (0x1UL << 2) 
#define LPTIM3_ISR_EXTTRIG_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define LPTIM3_ISR_ARRM          (0x1UL << 1) 
#define LPTIM3_ISR_ARRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define LPTIM3_ISR_CMPM          (0x1UL << 0) 
#define LPTIM3_ISR_CMPM_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define LPTIM3_ICR_DOWNCF          (0x1UL << 6) 
#define LPTIM3_ICR_DOWNCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define LPTIM3_ICR_UPCF          (0x1UL << 5) 
#define LPTIM3_ICR_UPCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define LPTIM3_ICR_ARROKCF          (0x1UL << 4) 
#define LPTIM3_ICR_ARROKCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define LPTIM3_ICR_CMPOKCF          (0x1UL << 3) 
#define LPTIM3_ICR_CMPOKCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define LPTIM3_ICR_EXTTRIGCF          (0x1UL << 2) 
#define LPTIM3_ICR_EXTTRIGCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define LPTIM3_ICR_ARRMCF          (0x1UL << 1) 
#define LPTIM3_ICR_ARRMCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define LPTIM3_ICR_CMPMCF          (0x1UL << 0) 
#define LPTIM3_ICR_CMPMCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define LPTIM3_IER_DOWNIE          (0x1UL << 6) 
#define LPTIM3_IER_DOWNIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define LPTIM3_IER_UPIE          (0x1UL << 5) 
#define LPTIM3_IER_UPIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define LPTIM3_IER_ARROKIE          (0x1UL << 4) 
#define LPTIM3_IER_ARROKIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define LPTIM3_IER_CMPOKIE          (0x1UL << 3) 
#define LPTIM3_IER_CMPOKIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define LPTIM3_IER_EXTTRIGIE          (0x1UL << 2) 
#define LPTIM3_IER_EXTTRIGIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define LPTIM3_IER_ARRMIE          (0x1UL << 1) 
#define LPTIM3_IER_ARRMIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define LPTIM3_IER_CMPMIE          (0x1UL << 0) 
#define LPTIM3_IER_CMPMIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define LPTIM3_CFGR_ENC          (0x1UL << 24) 
#define LPTIM3_CFGR_ENC_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define LPTIM3_CFGR_COUNTMODE          (0x1UL << 23) 
#define LPTIM3_CFGR_COUNTMODE_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define LPTIM3_CFGR_PRELOAD          (0x1UL << 22) 
#define LPTIM3_CFGR_PRELOAD_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define LPTIM3_CFGR_WAVPOL          (0x1UL << 21) 
#define LPTIM3_CFGR_WAVPOL_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define LPTIM3_CFGR_WAVE          (0x1UL << 20) 
#define LPTIM3_CFGR_WAVE_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define LPTIM3_CFGR_TIMOUT          (0x1UL << 19) 
#define LPTIM3_CFGR_TIMOUT_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define LPTIM3_CFGR_TRIGEN          (0x3UL << 17) 
#define LPTIM3_CFGR_TRIGEN_VAL(X) (((uint32_t)(X) & 0x3UL) << 17)
#define LPTIM3_CFGR_TRIGSEL          (0x7UL << 13) 
#define LPTIM3_CFGR_TRIGSEL_VAL(X) (((uint32_t)(X) & 0x7UL) << 13)
#define LPTIM3_CFGR_PRESC          (0x7UL << 9) 
#define LPTIM3_CFGR_PRESC_VAL(X) (((uint32_t)(X) & 0x7UL) << 9)
#define LPTIM3_CFGR_TRGFLT          (0x3UL << 6) 
#define LPTIM3_CFGR_TRGFLT_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define LPTIM3_CFGR_CKFLT          (0x3UL << 3) 
#define LPTIM3_CFGR_CKFLT_VAL(X) (((uint32_t)(X) & 0x3UL) << 3)
#define LPTIM3_CFGR_CKPOL          (0x3UL << 1) 
#define LPTIM3_CFGR_CKPOL_VAL(X) (((uint32_t)(X) & 0x3UL) << 1)
#define LPTIM3_CFGR_CKSEL          (0x1UL << 0) 
#define LPTIM3_CFGR_CKSEL_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define LPTIM3_CR_ENABLE          (0x1UL << 0) 
#define LPTIM3_CR_ENABLE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define LPTIM3_CR_SNGSTRT          (0x1UL << 1) 
#define LPTIM3_CR_SNGSTRT_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define LPTIM3_CR_CNTSTRT          (0x1UL << 2) 
#define LPTIM3_CR_CNTSTRT_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define LPTIM3_CR_COUNTRST          (0x1UL << 3) 
#define LPTIM3_CR_COUNTRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define LPTIM3_CR_RSTARE          (0x1UL << 4) 
#define LPTIM3_CR_RSTARE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define LPTIM3_CMP_CMP          (0xFFFFUL << 0) 
#define LPTIM3_CMP_CMP_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define LPTIM3_ARR_ARR          (0xFFFFUL << 0) 
#define LPTIM3_ARR_ARR_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define LPTIM3_CNT_CNT          (0xFFFFUL << 0) 
#define LPTIM3_CNT_CNT_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define LPTIM3_CFGR2_IN1SEL          (0x3UL << 0) 
#define LPTIM3_CFGR2_IN1SEL_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)

#define LPTIM3  ((struct LPTIM3*)(0x58002800UL))
struct LPTIM4 {
  volatile const uint32_t ISR;
  volatile uint32_t ICR;
  volatile uint32_t IER;
  volatile uint32_t CFGR;
  volatile uint32_t CR;
  volatile uint32_t CMP;
  volatile uint32_t ARR;
  volatile const uint32_t CNT;
  const volatile uint32_t RESERVED36[1];
  volatile uint32_t CFGR2;
};
#define LPTIM4_ISR_DOWN          (0x1UL << 6) 
#define LPTIM4_ISR_DOWN_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define LPTIM4_ISR_UP          (0x1UL << 5) 
#define LPTIM4_ISR_UP_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define LPTIM4_ISR_ARROK          (0x1UL << 4) 
#define LPTIM4_ISR_ARROK_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define LPTIM4_ISR_CMPOK          (0x1UL << 3) 
#define LPTIM4_ISR_CMPOK_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define LPTIM4_ISR_EXTTRIG          (0x1UL << 2) 
#define LPTIM4_ISR_EXTTRIG_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define LPTIM4_ISR_ARRM          (0x1UL << 1) 
#define LPTIM4_ISR_ARRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define LPTIM4_ISR_CMPM          (0x1UL << 0) 
#define LPTIM4_ISR_CMPM_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define LPTIM4_ICR_DOWNCF          (0x1UL << 6) 
#define LPTIM4_ICR_DOWNCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define LPTIM4_ICR_UPCF          (0x1UL << 5) 
#define LPTIM4_ICR_UPCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define LPTIM4_ICR_ARROKCF          (0x1UL << 4) 
#define LPTIM4_ICR_ARROKCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define LPTIM4_ICR_CMPOKCF          (0x1UL << 3) 
#define LPTIM4_ICR_CMPOKCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define LPTIM4_ICR_EXTTRIGCF          (0x1UL << 2) 
#define LPTIM4_ICR_EXTTRIGCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define LPTIM4_ICR_ARRMCF          (0x1UL << 1) 
#define LPTIM4_ICR_ARRMCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define LPTIM4_ICR_CMPMCF          (0x1UL << 0) 
#define LPTIM4_ICR_CMPMCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define LPTIM4_IER_DOWNIE          (0x1UL << 6) 
#define LPTIM4_IER_DOWNIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define LPTIM4_IER_UPIE          (0x1UL << 5) 
#define LPTIM4_IER_UPIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define LPTIM4_IER_ARROKIE          (0x1UL << 4) 
#define LPTIM4_IER_ARROKIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define LPTIM4_IER_CMPOKIE          (0x1UL << 3) 
#define LPTIM4_IER_CMPOKIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define LPTIM4_IER_EXTTRIGIE          (0x1UL << 2) 
#define LPTIM4_IER_EXTTRIGIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define LPTIM4_IER_ARRMIE          (0x1UL << 1) 
#define LPTIM4_IER_ARRMIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define LPTIM4_IER_CMPMIE          (0x1UL << 0) 
#define LPTIM4_IER_CMPMIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define LPTIM4_CFGR_ENC          (0x1UL << 24) 
#define LPTIM4_CFGR_ENC_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define LPTIM4_CFGR_COUNTMODE          (0x1UL << 23) 
#define LPTIM4_CFGR_COUNTMODE_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define LPTIM4_CFGR_PRELOAD          (0x1UL << 22) 
#define LPTIM4_CFGR_PRELOAD_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define LPTIM4_CFGR_WAVPOL          (0x1UL << 21) 
#define LPTIM4_CFGR_WAVPOL_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define LPTIM4_CFGR_WAVE          (0x1UL << 20) 
#define LPTIM4_CFGR_WAVE_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define LPTIM4_CFGR_TIMOUT          (0x1UL << 19) 
#define LPTIM4_CFGR_TIMOUT_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define LPTIM4_CFGR_TRIGEN          (0x3UL << 17) 
#define LPTIM4_CFGR_TRIGEN_VAL(X) (((uint32_t)(X) & 0x3UL) << 17)
#define LPTIM4_CFGR_TRIGSEL          (0x7UL << 13) 
#define LPTIM4_CFGR_TRIGSEL_VAL(X) (((uint32_t)(X) & 0x7UL) << 13)
#define LPTIM4_CFGR_PRESC          (0x7UL << 9) 
#define LPTIM4_CFGR_PRESC_VAL(X) (((uint32_t)(X) & 0x7UL) << 9)
#define LPTIM4_CFGR_TRGFLT          (0x3UL << 6) 
#define LPTIM4_CFGR_TRGFLT_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define LPTIM4_CFGR_CKFLT          (0x3UL << 3) 
#define LPTIM4_CFGR_CKFLT_VAL(X) (((uint32_t)(X) & 0x3UL) << 3)
#define LPTIM4_CFGR_CKPOL          (0x3UL << 1) 
#define LPTIM4_CFGR_CKPOL_VAL(X) (((uint32_t)(X) & 0x3UL) << 1)
#define LPTIM4_CFGR_CKSEL          (0x1UL << 0) 
#define LPTIM4_CFGR_CKSEL_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define LPTIM4_CR_ENABLE          (0x1UL << 0) 
#define LPTIM4_CR_ENABLE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define LPTIM4_CR_SNGSTRT          (0x1UL << 1) 
#define LPTIM4_CR_SNGSTRT_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define LPTIM4_CR_CNTSTRT          (0x1UL << 2) 
#define LPTIM4_CR_CNTSTRT_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define LPTIM4_CR_COUNTRST          (0x1UL << 3) 
#define LPTIM4_CR_COUNTRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define LPTIM4_CR_RSTARE          (0x1UL << 4) 
#define LPTIM4_CR_RSTARE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define LPTIM4_CMP_CMP          (0xFFFFUL << 0) 
#define LPTIM4_CMP_CMP_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define LPTIM4_ARR_ARR          (0xFFFFUL << 0) 
#define LPTIM4_ARR_ARR_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define LPTIM4_CNT_CNT          (0xFFFFUL << 0) 
#define LPTIM4_CNT_CNT_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define LPTIM4_CFGR2_IN1SEL          (0x3UL << 0) 
#define LPTIM4_CFGR2_IN1SEL_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)

#define LPTIM4  ((struct LPTIM4*)(0x58002C00UL))
struct LPTIM5 {
  volatile const uint32_t ISR;
  volatile uint32_t ICR;
  volatile uint32_t IER;
  volatile uint32_t CFGR;
  volatile uint32_t CR;
  volatile uint32_t CMP;
  volatile uint32_t ARR;
  volatile const uint32_t CNT;
  const volatile uint32_t RESERVED36[1];
  volatile uint32_t CFGR2;
};
#define LPTIM5_ISR_DOWN          (0x1UL << 6) 
#define LPTIM5_ISR_DOWN_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define LPTIM5_ISR_UP          (0x1UL << 5) 
#define LPTIM5_ISR_UP_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define LPTIM5_ISR_ARROK          (0x1UL << 4) 
#define LPTIM5_ISR_ARROK_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define LPTIM5_ISR_CMPOK          (0x1UL << 3) 
#define LPTIM5_ISR_CMPOK_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define LPTIM5_ISR_EXTTRIG          (0x1UL << 2) 
#define LPTIM5_ISR_EXTTRIG_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define LPTIM5_ISR_ARRM          (0x1UL << 1) 
#define LPTIM5_ISR_ARRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define LPTIM5_ISR_CMPM          (0x1UL << 0) 
#define LPTIM5_ISR_CMPM_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define LPTIM5_ICR_DOWNCF          (0x1UL << 6) 
#define LPTIM5_ICR_DOWNCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define LPTIM5_ICR_UPCF          (0x1UL << 5) 
#define LPTIM5_ICR_UPCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define LPTIM5_ICR_ARROKCF          (0x1UL << 4) 
#define LPTIM5_ICR_ARROKCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define LPTIM5_ICR_CMPOKCF          (0x1UL << 3) 
#define LPTIM5_ICR_CMPOKCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define LPTIM5_ICR_EXTTRIGCF          (0x1UL << 2) 
#define LPTIM5_ICR_EXTTRIGCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define LPTIM5_ICR_ARRMCF          (0x1UL << 1) 
#define LPTIM5_ICR_ARRMCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define LPTIM5_ICR_CMPMCF          (0x1UL << 0) 
#define LPTIM5_ICR_CMPMCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define LPTIM5_IER_DOWNIE          (0x1UL << 6) 
#define LPTIM5_IER_DOWNIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define LPTIM5_IER_UPIE          (0x1UL << 5) 
#define LPTIM5_IER_UPIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define LPTIM5_IER_ARROKIE          (0x1UL << 4) 
#define LPTIM5_IER_ARROKIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define LPTIM5_IER_CMPOKIE          (0x1UL << 3) 
#define LPTIM5_IER_CMPOKIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define LPTIM5_IER_EXTTRIGIE          (0x1UL << 2) 
#define LPTIM5_IER_EXTTRIGIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define LPTIM5_IER_ARRMIE          (0x1UL << 1) 
#define LPTIM5_IER_ARRMIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define LPTIM5_IER_CMPMIE          (0x1UL << 0) 
#define LPTIM5_IER_CMPMIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define LPTIM5_CFGR_ENC          (0x1UL << 24) 
#define LPTIM5_CFGR_ENC_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define LPTIM5_CFGR_COUNTMODE          (0x1UL << 23) 
#define LPTIM5_CFGR_COUNTMODE_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define LPTIM5_CFGR_PRELOAD          (0x1UL << 22) 
#define LPTIM5_CFGR_PRELOAD_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define LPTIM5_CFGR_WAVPOL          (0x1UL << 21) 
#define LPTIM5_CFGR_WAVPOL_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define LPTIM5_CFGR_WAVE          (0x1UL << 20) 
#define LPTIM5_CFGR_WAVE_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define LPTIM5_CFGR_TIMOUT          (0x1UL << 19) 
#define LPTIM5_CFGR_TIMOUT_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define LPTIM5_CFGR_TRIGEN          (0x3UL << 17) 
#define LPTIM5_CFGR_TRIGEN_VAL(X) (((uint32_t)(X) & 0x3UL) << 17)
#define LPTIM5_CFGR_TRIGSEL          (0x7UL << 13) 
#define LPTIM5_CFGR_TRIGSEL_VAL(X) (((uint32_t)(X) & 0x7UL) << 13)
#define LPTIM5_CFGR_PRESC          (0x7UL << 9) 
#define LPTIM5_CFGR_PRESC_VAL(X) (((uint32_t)(X) & 0x7UL) << 9)
#define LPTIM5_CFGR_TRGFLT          (0x3UL << 6) 
#define LPTIM5_CFGR_TRGFLT_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define LPTIM5_CFGR_CKFLT          (0x3UL << 3) 
#define LPTIM5_CFGR_CKFLT_VAL(X) (((uint32_t)(X) & 0x3UL) << 3)
#define LPTIM5_CFGR_CKPOL          (0x3UL << 1) 
#define LPTIM5_CFGR_CKPOL_VAL(X) (((uint32_t)(X) & 0x3UL) << 1)
#define LPTIM5_CFGR_CKSEL          (0x1UL << 0) 
#define LPTIM5_CFGR_CKSEL_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define LPTIM5_CR_ENABLE          (0x1UL << 0) 
#define LPTIM5_CR_ENABLE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define LPTIM5_CR_SNGSTRT          (0x1UL << 1) 
#define LPTIM5_CR_SNGSTRT_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define LPTIM5_CR_CNTSTRT          (0x1UL << 2) 
#define LPTIM5_CR_CNTSTRT_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define LPTIM5_CR_COUNTRST          (0x1UL << 3) 
#define LPTIM5_CR_COUNTRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define LPTIM5_CR_RSTARE          (0x1UL << 4) 
#define LPTIM5_CR_RSTARE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define LPTIM5_CMP_CMP          (0xFFFFUL << 0) 
#define LPTIM5_CMP_CMP_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define LPTIM5_ARR_ARR          (0xFFFFUL << 0) 
#define LPTIM5_ARR_ARR_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define LPTIM5_CNT_CNT          (0xFFFFUL << 0) 
#define LPTIM5_CNT_CNT_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define LPTIM5_CFGR2_IN1SEL          (0x3UL << 0) 
#define LPTIM5_CFGR2_IN1SEL_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)

#define LPTIM5  ((struct LPTIM5*)(0x58003000UL))
struct LPUART1 {
  volatile uint32_t CR1;
  volatile uint32_t CR2;
  volatile uint32_t CR3;
  volatile uint32_t BRR;
  volatile uint32_t GTPR;
  volatile uint32_t RTOR;
  volatile uint32_t RQR;
  volatile const uint32_t ISR;
  volatile uint32_t ICR;
  volatile const uint32_t RDR;
  volatile uint32_t TDR;
  volatile uint32_t PRESC;
};
