via/viaems/src/platforms/stm32h743/device.h
#define LPUART1_CR1_RXFFIE          (0x1UL << 31) 
#define LPUART1_CR1_RXFFIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define LPUART1_CR1_TXFEIE          (0x1UL << 30) 
#define LPUART1_CR1_TXFEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define LPUART1_CR1_FIFOEN          (0x1UL << 29) 
#define LPUART1_CR1_FIFOEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define LPUART1_CR1_M1          (0x1UL << 28) 
#define LPUART1_CR1_M1_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define LPUART1_CR1_DEAT          (0x1FUL << 21) 
#define LPUART1_CR1_DEAT_VAL(X) (((uint32_t)(X) & 0x1FUL) << 21)
#define LPUART1_CR1_DEDT          (0x1FUL << 16) 
#define LPUART1_CR1_DEDT_VAL(X) (((uint32_t)(X) & 0x1FUL) << 16)
#define LPUART1_CR1_CMIE          (0x1UL << 14) 
#define LPUART1_CR1_CMIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define LPUART1_CR1_MME          (0x1UL << 13) 
#define LPUART1_CR1_MME_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define LPUART1_CR1_M0          (0x1UL << 12) 
#define LPUART1_CR1_M0_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define LPUART1_CR1_WAKE          (0x1UL << 11) 
#define LPUART1_CR1_WAKE_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define LPUART1_CR1_PCE          (0x1UL << 10) 
#define LPUART1_CR1_PCE_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define LPUART1_CR1_PS          (0x1UL << 9) 
#define LPUART1_CR1_PS_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define LPUART1_CR1_PEIE          (0x1UL << 8) 
#define LPUART1_CR1_PEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define LPUART1_CR1_TXEIE          (0x1UL << 7) 
#define LPUART1_CR1_TXEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define LPUART1_CR1_TCIE          (0x1UL << 6) 
#define LPUART1_CR1_TCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define LPUART1_CR1_RXNEIE          (0x1UL << 5) 
#define LPUART1_CR1_RXNEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define LPUART1_CR1_IDLEIE          (0x1UL << 4) 
#define LPUART1_CR1_IDLEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define LPUART1_CR1_TE          (0x1UL << 3) 
#define LPUART1_CR1_TE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define LPUART1_CR1_RE          (0x1UL << 2) 
#define LPUART1_CR1_RE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define LPUART1_CR1_UESM          (0x1UL << 1) 
#define LPUART1_CR1_UESM_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define LPUART1_CR1_UE          (0x1UL << 0) 
#define LPUART1_CR1_UE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define LPUART1_CR2_ADD          (0xFFUL << 24) 
#define LPUART1_CR2_ADD_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define LPUART1_CR2_MSBFIRST          (0x1UL << 19) 
#define LPUART1_CR2_MSBFIRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define LPUART1_CR2_DATAINV          (0x1UL << 18) 
#define LPUART1_CR2_DATAINV_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define LPUART1_CR2_TXINV          (0x1UL << 17) 
#define LPUART1_CR2_TXINV_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define LPUART1_CR2_RXINV          (0x1UL << 16) 
#define LPUART1_CR2_RXINV_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define LPUART1_CR2_SWAP          (0x1UL << 15) 
#define LPUART1_CR2_SWAP_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define LPUART1_CR2_STOP          (0x3UL << 12) 
#define LPUART1_CR2_STOP_VAL(X) (((uint32_t)(X) & 0x3UL) << 12)
#define LPUART1_CR2_ADDM7          (0x1UL << 4) 
#define LPUART1_CR2_ADDM7_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define LPUART1_CR3_TXFTCFG          (0x7UL << 29) 
#define LPUART1_CR3_TXFTCFG_VAL(X) (((uint32_t)(X) & 0x7UL) << 29)
#define LPUART1_CR3_RXFTIE          (0x1UL << 28) 
#define LPUART1_CR3_RXFTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define LPUART1_CR3_RXFTCFG          (0x7UL << 25) 
#define LPUART1_CR3_RXFTCFG_VAL(X) (((uint32_t)(X) & 0x7UL) << 25)
#define LPUART1_CR3_TXFTIE          (0x1UL << 23) 
#define LPUART1_CR3_TXFTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define LPUART1_CR3_WUFIE          (0x1UL << 22) 
#define LPUART1_CR3_WUFIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define LPUART1_CR3_WUS          (0x3UL << 20) 
#define LPUART1_CR3_WUS_VAL(X) (((uint32_t)(X) & 0x3UL) << 20)
#define LPUART1_CR3_DEP          (0x1UL << 15) 
#define LPUART1_CR3_DEP_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define LPUART1_CR3_DEM          (0x1UL << 14) 
#define LPUART1_CR3_DEM_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define LPUART1_CR3_DDRE          (0x1UL << 13) 
#define LPUART1_CR3_DDRE_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define LPUART1_CR3_OVRDIS          (0x1UL << 12) 
#define LPUART1_CR3_OVRDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define LPUART1_CR3_CTSIE          (0x1UL << 10) 
#define LPUART1_CR3_CTSIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define LPUART1_CR3_CTSE          (0x1UL << 9) 
#define LPUART1_CR3_CTSE_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define LPUART1_CR3_RTSE          (0x1UL << 8) 
#define LPUART1_CR3_RTSE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define LPUART1_CR3_DMAT          (0x1UL << 7) 
#define LPUART1_CR3_DMAT_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define LPUART1_CR3_DMAR          (0x1UL << 6) 
#define LPUART1_CR3_DMAR_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define LPUART1_CR3_HDSEL          (0x1UL << 3) 
#define LPUART1_CR3_HDSEL_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define LPUART1_CR3_EIE          (0x1UL << 0) 
#define LPUART1_CR3_EIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define LPUART1_BRR_BRR          (0xFFFFFUL << 0) 
#define LPUART1_BRR_BRR_VAL(X) (((uint32_t)(X) & 0xFFFFFUL) << 0)
#define LPUART1_GTPR_GT          (0xFFUL << 8) 
#define LPUART1_GTPR_GT_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define LPUART1_GTPR_PSC          (0xFFUL << 0) 
#define LPUART1_GTPR_PSC_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define LPUART1_RTOR_BLEN          (0xFFUL << 24) 
#define LPUART1_RTOR_BLEN_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define LPUART1_RTOR_RTO          (0xFFFFFFUL << 0) 
#define LPUART1_RTOR_RTO_VAL(X) (((uint32_t)(X) & 0xFFFFFFUL) << 0)
#define LPUART1_RQR_TXFRQ          (0x1UL << 4) 
#define LPUART1_RQR_TXFRQ_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define LPUART1_RQR_RXFRQ          (0x1UL << 3) 
#define LPUART1_RQR_RXFRQ_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define LPUART1_RQR_MMRQ          (0x1UL << 2) 
#define LPUART1_RQR_MMRQ_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define LPUART1_RQR_SBKRQ          (0x1UL << 1) 
#define LPUART1_RQR_SBKRQ_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define LPUART1_RQR_ABRRQ          (0x1UL << 0) 
#define LPUART1_RQR_ABRRQ_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define LPUART1_ISR_TXFT          (0x1UL << 27) 
#define LPUART1_ISR_TXFT_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define LPUART1_ISR_RXFT          (0x1UL << 26) 
#define LPUART1_ISR_RXFT_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define LPUART1_ISR_RXFF          (0x1UL << 24) 
#define LPUART1_ISR_RXFF_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define LPUART1_ISR_TXFE          (0x1UL << 23) 
#define LPUART1_ISR_TXFE_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define LPUART1_ISR_REACK          (0x1UL << 22) 
#define LPUART1_ISR_REACK_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define LPUART1_ISR_TEACK          (0x1UL << 21) 
#define LPUART1_ISR_TEACK_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define LPUART1_ISR_WUF          (0x1UL << 20) 
#define LPUART1_ISR_WUF_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define LPUART1_ISR_RWU          (0x1UL << 19) 
#define LPUART1_ISR_RWU_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define LPUART1_ISR_SBKF          (0x1UL << 18) 
#define LPUART1_ISR_SBKF_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define LPUART1_ISR_CMF          (0x1UL << 17) 
#define LPUART1_ISR_CMF_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define LPUART1_ISR_BUSY          (0x1UL << 16) 
#define LPUART1_ISR_BUSY_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define LPUART1_ISR_CTS          (0x1UL << 10) 
#define LPUART1_ISR_CTS_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define LPUART1_ISR_CTSIF          (0x1UL << 9) 
#define LPUART1_ISR_CTSIF_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define LPUART1_ISR_TXE          (0x1UL << 7) 
#define LPUART1_ISR_TXE_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define LPUART1_ISR_TC          (0x1UL << 6) 
#define LPUART1_ISR_TC_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define LPUART1_ISR_RXNE          (0x1UL << 5) 
#define LPUART1_ISR_RXNE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define LPUART1_ISR_IDLE          (0x1UL << 4) 
#define LPUART1_ISR_IDLE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define LPUART1_ISR_ORE          (0x1UL << 3) 
#define LPUART1_ISR_ORE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define LPUART1_ISR_NE          (0x1UL << 2) 
#define LPUART1_ISR_NE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define LPUART1_ISR_FE          (0x1UL << 1) 
#define LPUART1_ISR_FE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define LPUART1_ISR_PE          (0x1UL << 0) 
#define LPUART1_ISR_PE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define LPUART1_ICR_WUCF          (0x1UL << 20) 
#define LPUART1_ICR_WUCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define LPUART1_ICR_CMCF          (0x1UL << 17) 
#define LPUART1_ICR_CMCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define LPUART1_ICR_CTSCF          (0x1UL << 9) 
#define LPUART1_ICR_CTSCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define LPUART1_ICR_TCCF          (0x1UL << 6) 
#define LPUART1_ICR_TCCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define LPUART1_ICR_IDLECF          (0x1UL << 4) 
#define LPUART1_ICR_IDLECF_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define LPUART1_ICR_ORECF          (0x1UL << 3) 
#define LPUART1_ICR_ORECF_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define LPUART1_ICR_NCF          (0x1UL << 2) 
#define LPUART1_ICR_NCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define LPUART1_ICR_FECF          (0x1UL << 1) 
#define LPUART1_ICR_FECF_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define LPUART1_ICR_PECF          (0x1UL << 0) 
#define LPUART1_ICR_PECF_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define LPUART1_RDR_RDR          (0x1FFUL << 0) 
#define LPUART1_RDR_RDR_VAL(X) (((uint32_t)(X) & 0x1FFUL) << 0)
#define LPUART1_TDR_TDR          (0x1FFUL << 0) 
#define LPUART1_TDR_TDR_VAL(X) (((uint32_t)(X) & 0x1FFUL) << 0)
#define LPUART1_PRESC_PRESCALER          (0xFUL << 0) 
#define LPUART1_PRESC_PRESCALER_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)

#define LPUART1  ((struct LPUART1*)(0x58000C00UL))
struct SYSCFG {
  volatile uint32_t PMCR;
  volatile uint32_t EXTICR1;
  volatile uint32_t EXTICR2;
  volatile uint32_t EXTICR3;
  volatile uint32_t EXTICR4;
  const volatile uint32_t RESERVED32[2];
  volatile uint32_t CCCSR;
  volatile const uint32_t CCVR;
  volatile uint32_t CCCR;
  volatile uint32_t PWRCR;
  const volatile uint32_t RESERVED292[61];
  volatile const uint32_t PKGR;
  const volatile uint32_t RESERVED768[118];
  volatile const uint32_t UR0;
  const volatile uint32_t RESERVED776[1];
  volatile uint32_t UR2;
  volatile uint32_t UR3;
  volatile const uint32_t UR4;
  volatile const uint32_t UR5;
  volatile const uint32_t UR6;
  volatile const uint32_t UR7;
  volatile const uint32_t UR8;
  volatile const uint32_t UR9;
  volatile const uint32_t UR10;
  volatile const uint32_t UR11;
  volatile const uint32_t UR12;
  volatile const uint32_t UR13;
  volatile uint32_t UR14;
  volatile const uint32_t UR15;
  volatile const uint32_t UR16;
  volatile const uint32_t UR17;
};
#define SYSCFG_PMCR_I2C1FMP          (0x1UL << 0) 
#define SYSCFG_PMCR_I2C1FMP_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define SYSCFG_PMCR_I2C2FMP          (0x1UL << 1) 
#define SYSCFG_PMCR_I2C2FMP_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define SYSCFG_PMCR_I2C3FMP          (0x1UL << 2) 
#define SYSCFG_PMCR_I2C3FMP_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define SYSCFG_PMCR_I2C4FMP          (0x1UL << 3) 
#define SYSCFG_PMCR_I2C4FMP_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define SYSCFG_PMCR_PB6FMP          (0x1UL << 4) 
#define SYSCFG_PMCR_PB6FMP_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define SYSCFG_PMCR_PB7FMP          (0x1UL << 5) 
#define SYSCFG_PMCR_PB7FMP_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define SYSCFG_PMCR_PB8FMP          (0x1UL << 6) 
#define SYSCFG_PMCR_PB8FMP_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define SYSCFG_PMCR_PB9FMP          (0x1UL << 7) 
#define SYSCFG_PMCR_PB9FMP_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define SYSCFG_PMCR_BOOSTE          (0x1UL << 8) 
#define SYSCFG_PMCR_BOOSTE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define SYSCFG_PMCR_BOOSTVDDSEL          (0x1UL << 9) 
#define SYSCFG_PMCR_BOOSTVDDSEL_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define SYSCFG_PMCR_EPIS          (0x7UL << 21) 
#define SYSCFG_PMCR_EPIS_VAL(X) (((uint32_t)(X) & 0x7UL) << 21)
#define SYSCFG_PMCR_PA0SO          (0x1UL << 24) 
#define SYSCFG_PMCR_PA0SO_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define SYSCFG_PMCR_PA1SO          (0x1UL << 25) 
#define SYSCFG_PMCR_PA1SO_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define SYSCFG_PMCR_PC2SO          (0x1UL << 26) 
#define SYSCFG_PMCR_PC2SO_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define SYSCFG_PMCR_PC3SO          (0x1UL << 27) 
#define SYSCFG_PMCR_PC3SO_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define SYSCFG_EXTICR1_EXTI3          (0xFUL << 12) 
#define SYSCFG_EXTICR1_EXTI3_VAL(X) (((uint32_t)(X) & 0xFUL) << 12)
#define SYSCFG_EXTICR1_EXTI2          (0xFUL << 8) 
#define SYSCFG_EXTICR1_EXTI2_VAL(X) (((uint32_t)(X) & 0xFUL) << 8)
#define SYSCFG_EXTICR1_EXTI1          (0xFUL << 4) 
#define SYSCFG_EXTICR1_EXTI1_VAL(X) (((uint32_t)(X) & 0xFUL) << 4)
#define SYSCFG_EXTICR1_EXTI0          (0xFUL << 0) 
#define SYSCFG_EXTICR1_EXTI0_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define SYSCFG_EXTICR2_EXTI7          (0xFUL << 12) 
#define SYSCFG_EXTICR2_EXTI7_VAL(X) (((uint32_t)(X) & 0xFUL) << 12)
#define SYSCFG_EXTICR2_EXTI6          (0xFUL << 8) 
#define SYSCFG_EXTICR2_EXTI6_VAL(X) (((uint32_t)(X) & 0xFUL) << 8)
#define SYSCFG_EXTICR2_EXTI5          (0xFUL << 4) 
#define SYSCFG_EXTICR2_EXTI5_VAL(X) (((uint32_t)(X) & 0xFUL) << 4)
#define SYSCFG_EXTICR2_EXTI4          (0xFUL << 0) 
#define SYSCFG_EXTICR2_EXTI4_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define SYSCFG_EXTICR3_EXTI11          (0xFUL << 12) 
#define SYSCFG_EXTICR3_EXTI11_VAL(X) (((uint32_t)(X) & 0xFUL) << 12)
#define SYSCFG_EXTICR3_EXTI10          (0xFUL << 8) 
#define SYSCFG_EXTICR3_EXTI10_VAL(X) (((uint32_t)(X) & 0xFUL) << 8)
#define SYSCFG_EXTICR3_EXTI9          (0xFUL << 4) 
#define SYSCFG_EXTICR3_EXTI9_VAL(X) (((uint32_t)(X) & 0xFUL) << 4)
#define SYSCFG_EXTICR3_EXTI8          (0xFUL << 0) 
#define SYSCFG_EXTICR3_EXTI8_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define SYSCFG_EXTICR4_EXTI15          (0xFUL << 12) 
#define SYSCFG_EXTICR4_EXTI15_VAL(X) (((uint32_t)(X) & 0xFUL) << 12)
#define SYSCFG_EXTICR4_EXTI14          (0xFUL << 8) 
#define SYSCFG_EXTICR4_EXTI14_VAL(X) (((uint32_t)(X) & 0xFUL) << 8)
#define SYSCFG_EXTICR4_EXTI13          (0xFUL << 4) 
#define SYSCFG_EXTICR4_EXTI13_VAL(X) (((uint32_t)(X) & 0xFUL) << 4)
#define SYSCFG_EXTICR4_EXTI12          (0xFUL << 0) 
#define SYSCFG_EXTICR4_EXTI12_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define SYSCFG_CCCSR_EN          (0x1UL << 0) 
#define SYSCFG_CCCSR_EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define SYSCFG_CCCSR_CS          (0x1UL << 1) 
#define SYSCFG_CCCSR_CS_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define SYSCFG_CCCSR_READY          (0x1UL << 8) 
#define SYSCFG_CCCSR_READY_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define SYSCFG_CCCSR_HSLV          (0x1UL << 16) 
#define SYSCFG_CCCSR_HSLV_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define SYSCFG_CCVR_NCV          (0xFUL << 0) 
#define SYSCFG_CCVR_NCV_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define SYSCFG_CCVR_PCV          (0xFUL << 4) 
#define SYSCFG_CCVR_PCV_VAL(X) (((uint32_t)(X) & 0xFUL) << 4)
#define SYSCFG_CCCR_NCC          (0xFUL << 0) 
#define SYSCFG_CCCR_NCC_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define SYSCFG_CCCR_PCC          (0xFUL << 4) 
#define SYSCFG_CCCR_PCC_VAL(X) (((uint32_t)(X) & 0xFUL) << 4)
#define SYSCFG_PWRCR_ODEN          (0xFUL << 0) 
#define SYSCFG_PWRCR_ODEN_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define SYSCFG_PKGR_PKG          (0xFUL << 0) 
#define SYSCFG_PKGR_PKG_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define SYSCFG_UR0_BKS          (0x1UL << 0) 
#define SYSCFG_UR0_BKS_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define SYSCFG_UR0_RDP          (0xFFUL << 16) 
#define SYSCFG_UR0_RDP_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define SYSCFG_UR2_BORH          (0x3UL << 0) 
#define SYSCFG_UR2_BORH_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define SYSCFG_UR2_BOOT_ADD0          (0xFFFFUL << 16) 
#define SYSCFG_UR2_BOOT_ADD0_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define SYSCFG_UR3_BOOT_ADD1          (0xFFFFUL << 16) 
#define SYSCFG_UR3_BOOT_ADD1_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define SYSCFG_UR4_MEPAD_1          (0x1UL << 16) 
#define SYSCFG_UR4_MEPAD_1_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define SYSCFG_UR5_MESAD_1          (0x1UL << 0) 
#define SYSCFG_UR5_MESAD_1_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define SYSCFG_UR5_WRPN_1          (0xFFUL << 16) 
#define SYSCFG_UR5_WRPN_1_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define SYSCFG_UR6_PA_BEG_1          (0xFFFUL << 0) 
#define SYSCFG_UR6_PA_BEG_1_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 0)
#define SYSCFG_UR6_PA_END_1          (0xFFFUL << 16) 
#define SYSCFG_UR6_PA_END_1_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 16)
#define SYSCFG_UR7_SA_BEG_1          (0xFFFUL << 0) 
#define SYSCFG_UR7_SA_BEG_1_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 0)
#define SYSCFG_UR7_SA_END_1          (0xFFFUL << 16) 
#define SYSCFG_UR7_SA_END_1_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 16)
#define SYSCFG_UR8_MEPAD_2          (0x1UL << 0) 
#define SYSCFG_UR8_MEPAD_2_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define SYSCFG_UR8_MESAD_2          (0x1UL << 16) 
#define SYSCFG_UR8_MESAD_2_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define SYSCFG_UR9_WRPN_2          (0xFFUL << 0) 
#define SYSCFG_UR9_WRPN_2_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define SYSCFG_UR9_PA_BEG_2          (0xFFFUL << 16) 
#define SYSCFG_UR9_PA_BEG_2_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 16)
#define SYSCFG_UR10_PA_END_2          (0xFFFUL << 0) 
#define SYSCFG_UR10_PA_END_2_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 0)
#define SYSCFG_UR10_SA_BEG_2          (0xFFFUL << 16) 
#define SYSCFG_UR10_SA_BEG_2_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 16)
#define SYSCFG_UR11_SA_END_2          (0xFFFUL << 0) 
#define SYSCFG_UR11_SA_END_2_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 0)
#define SYSCFG_UR11_IWDG1M          (0x1UL << 16) 
#define SYSCFG_UR11_IWDG1M_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define SYSCFG_UR12_SECURE          (0x1UL << 16) 
#define SYSCFG_UR12_SECURE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define SYSCFG_UR13_SDRS          (0x3UL << 0) 
#define SYSCFG_UR13_SDRS_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define SYSCFG_UR13_D1SBRST          (0x1UL << 16) 
#define SYSCFG_UR13_D1SBRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define SYSCFG_UR14_D1STPRST          (0x1UL << 0) 
#define SYSCFG_UR14_D1STPRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define SYSCFG_UR15_FZIWDGSTB          (0x1UL << 16) 
#define SYSCFG_UR15_FZIWDGSTB_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define SYSCFG_UR16_FZIWDGSTP          (0x1UL << 0) 
#define SYSCFG_UR16_FZIWDGSTP_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define SYSCFG_UR16_PKP          (0x1UL << 16) 
#define SYSCFG_UR16_PKP_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define SYSCFG_UR17_IO_HSLV          (0x1UL << 0) 
#define SYSCFG_UR17_IO_HSLV_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)

#define SYSCFG  ((struct SYSCFG*)(0x58000400UL))
struct EXTI {
  volatile uint32_t RTSR1;
  volatile uint32_t FTSR1;
  volatile uint32_t SWIER1;
  volatile uint32_t D3PMR1;
  volatile uint32_t D3PCR1L;
  volatile uint32_t D3PCR1H;
  const volatile uint32_t RESERVED32[2];
  volatile uint32_t RTSR2;
  volatile uint32_t FTSR2;
  volatile uint32_t SWIER2;
  volatile uint32_t D3PMR2;
  volatile uint32_t D3PCR2L;
  volatile uint32_t D3PCR2H;
  const volatile uint32_t RESERVED64[2];
  volatile uint32_t RTSR3;
  volatile uint32_t FTSR3;
  volatile uint32_t SWIER3;
  volatile uint32_t D3PMR3;
  const volatile uint32_t RESERVED84[1];
  volatile uint32_t D3PCR3H;
  const volatile uint32_t RESERVED128[10];
  volatile uint32_t CPUIMR1;
  volatile uint32_t CPUEMR1;
  volatile uint32_t CPUPR1;
  const volatile uint32_t RESERVED144[1];
  volatile uint32_t CPUIMR2;
  volatile uint32_t CPUEMR2;
  volatile const uint32_t CPUPR2;
  const volatile uint32_t RESERVED160[1];
  volatile const uint32_t CPUIMR3;
  volatile const uint32_t CPUEMR3;
  volatile const uint32_t CPUPR3;
};
