via/viaems/src/platforms/stm32h743/device.h
#define EXTI_RTSR1_TR0          (0x1UL << 0) 
#define EXTI_RTSR1_TR0_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define EXTI_RTSR1_TR1          (0x1UL << 1) 
#define EXTI_RTSR1_TR1_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define EXTI_RTSR1_TR2          (0x1UL << 2) 
#define EXTI_RTSR1_TR2_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define EXTI_RTSR1_TR3          (0x1UL << 3) 
#define EXTI_RTSR1_TR3_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define EXTI_RTSR1_TR4          (0x1UL << 4) 
#define EXTI_RTSR1_TR4_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define EXTI_RTSR1_TR5          (0x1UL << 5) 
#define EXTI_RTSR1_TR5_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define EXTI_RTSR1_TR6          (0x1UL << 6) 
#define EXTI_RTSR1_TR6_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define EXTI_RTSR1_TR7          (0x1UL << 7) 
#define EXTI_RTSR1_TR7_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define EXTI_RTSR1_TR8          (0x1UL << 8) 
#define EXTI_RTSR1_TR8_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define EXTI_RTSR1_TR9          (0x1UL << 9) 
#define EXTI_RTSR1_TR9_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define EXTI_RTSR1_TR10          (0x1UL << 10) 
#define EXTI_RTSR1_TR10_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define EXTI_RTSR1_TR11          (0x1UL << 11) 
#define EXTI_RTSR1_TR11_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define EXTI_RTSR1_TR12          (0x1UL << 12) 
#define EXTI_RTSR1_TR12_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define EXTI_RTSR1_TR13          (0x1UL << 13) 
#define EXTI_RTSR1_TR13_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define EXTI_RTSR1_TR14          (0x1UL << 14) 
#define EXTI_RTSR1_TR14_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define EXTI_RTSR1_TR15          (0x1UL << 15) 
#define EXTI_RTSR1_TR15_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define EXTI_RTSR1_TR16          (0x1UL << 16) 
#define EXTI_RTSR1_TR16_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define EXTI_RTSR1_TR17          (0x1UL << 17) 
#define EXTI_RTSR1_TR17_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define EXTI_RTSR1_TR18          (0x1UL << 18) 
#define EXTI_RTSR1_TR18_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define EXTI_RTSR1_TR19          (0x1UL << 19) 
#define EXTI_RTSR1_TR19_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define EXTI_RTSR1_TR20          (0x1UL << 20) 
#define EXTI_RTSR1_TR20_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define EXTI_RTSR1_TR21          (0x1UL << 21) 
#define EXTI_RTSR1_TR21_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define EXTI_FTSR1_TR0          (0x1UL << 0) 
#define EXTI_FTSR1_TR0_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define EXTI_FTSR1_TR1          (0x1UL << 1) 
#define EXTI_FTSR1_TR1_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define EXTI_FTSR1_TR2          (0x1UL << 2) 
#define EXTI_FTSR1_TR2_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define EXTI_FTSR1_TR3          (0x1UL << 3) 
#define EXTI_FTSR1_TR3_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define EXTI_FTSR1_TR4          (0x1UL << 4) 
#define EXTI_FTSR1_TR4_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define EXTI_FTSR1_TR5          (0x1UL << 5) 
#define EXTI_FTSR1_TR5_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define EXTI_FTSR1_TR6          (0x1UL << 6) 
#define EXTI_FTSR1_TR6_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define EXTI_FTSR1_TR7          (0x1UL << 7) 
#define EXTI_FTSR1_TR7_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define EXTI_FTSR1_TR8          (0x1UL << 8) 
#define EXTI_FTSR1_TR8_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define EXTI_FTSR1_TR9          (0x1UL << 9) 
#define EXTI_FTSR1_TR9_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define EXTI_FTSR1_TR10          (0x1UL << 10) 
#define EXTI_FTSR1_TR10_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define EXTI_FTSR1_TR11          (0x1UL << 11) 
#define EXTI_FTSR1_TR11_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define EXTI_FTSR1_TR12          (0x1UL << 12) 
#define EXTI_FTSR1_TR12_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define EXTI_FTSR1_TR13          (0x1UL << 13) 
#define EXTI_FTSR1_TR13_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define EXTI_FTSR1_TR14          (0x1UL << 14) 
#define EXTI_FTSR1_TR14_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define EXTI_FTSR1_TR15          (0x1UL << 15) 
#define EXTI_FTSR1_TR15_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define EXTI_FTSR1_TR16          (0x1UL << 16) 
#define EXTI_FTSR1_TR16_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define EXTI_FTSR1_TR17          (0x1UL << 17) 
#define EXTI_FTSR1_TR17_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define EXTI_FTSR1_TR18          (0x1UL << 18) 
#define EXTI_FTSR1_TR18_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define EXTI_FTSR1_TR19          (0x1UL << 19) 
#define EXTI_FTSR1_TR19_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define EXTI_FTSR1_TR20          (0x1UL << 20) 
#define EXTI_FTSR1_TR20_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define EXTI_FTSR1_TR21          (0x1UL << 21) 
#define EXTI_FTSR1_TR21_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define EXTI_SWIER1_SWIER0          (0x1UL << 0) 
#define EXTI_SWIER1_SWIER0_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define EXTI_SWIER1_SWIER1          (0x1UL << 1) 
#define EXTI_SWIER1_SWIER1_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define EXTI_SWIER1_SWIER2          (0x1UL << 2) 
#define EXTI_SWIER1_SWIER2_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define EXTI_SWIER1_SWIER3          (0x1UL << 3) 
#define EXTI_SWIER1_SWIER3_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define EXTI_SWIER1_SWIER4          (0x1UL << 4) 
#define EXTI_SWIER1_SWIER4_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define EXTI_SWIER1_SWIER5          (0x1UL << 5) 
#define EXTI_SWIER1_SWIER5_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define EXTI_SWIER1_SWIER6          (0x1UL << 6) 
#define EXTI_SWIER1_SWIER6_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define EXTI_SWIER1_SWIER7          (0x1UL << 7) 
#define EXTI_SWIER1_SWIER7_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define EXTI_SWIER1_SWIER8          (0x1UL << 8) 
#define EXTI_SWIER1_SWIER8_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define EXTI_SWIER1_SWIER9          (0x1UL << 9) 
#define EXTI_SWIER1_SWIER9_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define EXTI_SWIER1_SWIER10          (0x1UL << 10) 
#define EXTI_SWIER1_SWIER10_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define EXTI_SWIER1_SWIER11          (0x1UL << 11) 
#define EXTI_SWIER1_SWIER11_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define EXTI_SWIER1_SWIER12          (0x1UL << 12) 
#define EXTI_SWIER1_SWIER12_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define EXTI_SWIER1_SWIER13          (0x1UL << 13) 
#define EXTI_SWIER1_SWIER13_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define EXTI_SWIER1_SWIER14          (0x1UL << 14) 
#define EXTI_SWIER1_SWIER14_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define EXTI_SWIER1_SWIER15          (0x1UL << 15) 
#define EXTI_SWIER1_SWIER15_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define EXTI_SWIER1_SWIER16          (0x1UL << 16) 
#define EXTI_SWIER1_SWIER16_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define EXTI_SWIER1_SWIER17          (0x1UL << 17) 
#define EXTI_SWIER1_SWIER17_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define EXTI_SWIER1_SWIER18          (0x1UL << 18) 
#define EXTI_SWIER1_SWIER18_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define EXTI_SWIER1_SWIER19          (0x1UL << 19) 
#define EXTI_SWIER1_SWIER19_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define EXTI_SWIER1_SWIER20          (0x1UL << 20) 
#define EXTI_SWIER1_SWIER20_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define EXTI_SWIER1_SWIER21          (0x1UL << 21) 
#define EXTI_SWIER1_SWIER21_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define EXTI_D3PMR1_MR0          (0x1UL << 0) 
#define EXTI_D3PMR1_MR0_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define EXTI_D3PMR1_MR1          (0x1UL << 1) 
#define EXTI_D3PMR1_MR1_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define EXTI_D3PMR1_MR2          (0x1UL << 2) 
#define EXTI_D3PMR1_MR2_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define EXTI_D3PMR1_MR3          (0x1UL << 3) 
#define EXTI_D3PMR1_MR3_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define EXTI_D3PMR1_MR4          (0x1UL << 4) 
#define EXTI_D3PMR1_MR4_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define EXTI_D3PMR1_MR5          (0x1UL << 5) 
#define EXTI_D3PMR1_MR5_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define EXTI_D3PMR1_MR6          (0x1UL << 6) 
#define EXTI_D3PMR1_MR6_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define EXTI_D3PMR1_MR7          (0x1UL << 7) 
#define EXTI_D3PMR1_MR7_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define EXTI_D3PMR1_MR8          (0x1UL << 8) 
#define EXTI_D3PMR1_MR8_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define EXTI_D3PMR1_MR9          (0x1UL << 9) 
#define EXTI_D3PMR1_MR9_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define EXTI_D3PMR1_MR10          (0x1UL << 10) 
#define EXTI_D3PMR1_MR10_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define EXTI_D3PMR1_MR11          (0x1UL << 11) 
#define EXTI_D3PMR1_MR11_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define EXTI_D3PMR1_MR12          (0x1UL << 12) 
#define EXTI_D3PMR1_MR12_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define EXTI_D3PMR1_MR13          (0x1UL << 13) 
#define EXTI_D3PMR1_MR13_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define EXTI_D3PMR1_MR14          (0x1UL << 14) 
#define EXTI_D3PMR1_MR14_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define EXTI_D3PMR1_MR15          (0x1UL << 15) 
#define EXTI_D3PMR1_MR15_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define EXTI_D3PMR1_MR19          (0x1UL << 19) 
#define EXTI_D3PMR1_MR19_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define EXTI_D3PMR1_MR20          (0x1UL << 20) 
#define EXTI_D3PMR1_MR20_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define EXTI_D3PMR1_MR21          (0x1UL << 21) 
#define EXTI_D3PMR1_MR21_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define EXTI_D3PMR1_MR25          (0x1UL << 25) 
#define EXTI_D3PMR1_MR25_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define EXTI_D3PCR1L_PCS0          (0x3UL << 0) 
#define EXTI_D3PCR1L_PCS0_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define EXTI_D3PCR1L_PCS1          (0x3UL << 2) 
#define EXTI_D3PCR1L_PCS1_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define EXTI_D3PCR1L_PCS2          (0x3UL << 4) 
#define EXTI_D3PCR1L_PCS2_VAL(X) (((uint32_t)(X) & 0x3UL) << 4)
#define EXTI_D3PCR1L_PCS3          (0x3UL << 6) 
#define EXTI_D3PCR1L_PCS3_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define EXTI_D3PCR1L_PCS4          (0x3UL << 8) 
#define EXTI_D3PCR1L_PCS4_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define EXTI_D3PCR1L_PCS5          (0x3UL << 10) 
#define EXTI_D3PCR1L_PCS5_VAL(X) (((uint32_t)(X) & 0x3UL) << 10)
#define EXTI_D3PCR1L_PCS6          (0x3UL << 12) 
#define EXTI_D3PCR1L_PCS6_VAL(X) (((uint32_t)(X) & 0x3UL) << 12)
#define EXTI_D3PCR1L_PCS7          (0x3UL << 14) 
#define EXTI_D3PCR1L_PCS7_VAL(X) (((uint32_t)(X) & 0x3UL) << 14)
#define EXTI_D3PCR1L_PCS8          (0x3UL << 16) 
#define EXTI_D3PCR1L_PCS8_VAL(X) (((uint32_t)(X) & 0x3UL) << 16)
#define EXTI_D3PCR1L_PCS9          (0x3UL << 18) 
#define EXTI_D3PCR1L_PCS9_VAL(X) (((uint32_t)(X) & 0x3UL) << 18)
#define EXTI_D3PCR1L_PCS10          (0x3UL << 20) 
#define EXTI_D3PCR1L_PCS10_VAL(X) (((uint32_t)(X) & 0x3UL) << 20)
#define EXTI_D3PCR1L_PCS11          (0x3UL << 22) 
#define EXTI_D3PCR1L_PCS11_VAL(X) (((uint32_t)(X) & 0x3UL) << 22)
#define EXTI_D3PCR1L_PCS12          (0x3UL << 24) 
#define EXTI_D3PCR1L_PCS12_VAL(X) (((uint32_t)(X) & 0x3UL) << 24)
#define EXTI_D3PCR1L_PCS13          (0x3UL << 26) 
#define EXTI_D3PCR1L_PCS13_VAL(X) (((uint32_t)(X) & 0x3UL) << 26)
#define EXTI_D3PCR1L_PCS14          (0x3UL << 28) 
#define EXTI_D3PCR1L_PCS14_VAL(X) (((uint32_t)(X) & 0x3UL) << 28)
#define EXTI_D3PCR1L_PCS15          (0x3UL << 30) 
#define EXTI_D3PCR1L_PCS15_VAL(X) (((uint32_t)(X) & 0x3UL) << 30)
#define EXTI_D3PCR1H_PCS19          (0x3UL << 6) 
#define EXTI_D3PCR1H_PCS19_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define EXTI_D3PCR1H_PCS20          (0x3UL << 8) 
#define EXTI_D3PCR1H_PCS20_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define EXTI_D3PCR1H_PCS21          (0x3UL << 10) 
#define EXTI_D3PCR1H_PCS21_VAL(X) (((uint32_t)(X) & 0x3UL) << 10)
#define EXTI_D3PCR1H_PCS25          (0x3UL << 18) 
#define EXTI_D3PCR1H_PCS25_VAL(X) (((uint32_t)(X) & 0x3UL) << 18)
#define EXTI_RTSR2_TR49          (0x1UL << 17) 
#define EXTI_RTSR2_TR49_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define EXTI_RTSR2_TR51          (0x1UL << 19) 
#define EXTI_RTSR2_TR51_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define EXTI_FTSR2_TR49          (0x1UL << 17) 
#define EXTI_FTSR2_TR49_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define EXTI_FTSR2_TR51          (0x1UL << 19) 
#define EXTI_FTSR2_TR51_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define EXTI_SWIER2_SWIER49          (0x1UL << 17) 
#define EXTI_SWIER2_SWIER49_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define EXTI_SWIER2_SWIER51          (0x1UL << 19) 
#define EXTI_SWIER2_SWIER51_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define EXTI_D3PMR2_MR34          (0x1UL << 2) 
#define EXTI_D3PMR2_MR34_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define EXTI_D3PMR2_MR35          (0x1UL << 3) 
#define EXTI_D3PMR2_MR35_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define EXTI_D3PMR2_MR41          (0x1UL << 9) 
#define EXTI_D3PMR2_MR41_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define EXTI_D3PMR2_MR48          (0x1UL << 16) 
#define EXTI_D3PMR2_MR48_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define EXTI_D3PMR2_MR49          (0x1UL << 17) 
#define EXTI_D3PMR2_MR49_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define EXTI_D3PMR2_MR50          (0x1UL << 18) 
#define EXTI_D3PMR2_MR50_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define EXTI_D3PMR2_MR51          (0x1UL << 19) 
#define EXTI_D3PMR2_MR51_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define EXTI_D3PMR2_MR52          (0x1UL << 20) 
#define EXTI_D3PMR2_MR52_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define EXTI_D3PMR2_MR53          (0x1UL << 21) 
#define EXTI_D3PMR2_MR53_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define EXTI_D3PCR2L_PCS35          (0x3UL << 6) 
#define EXTI_D3PCR2L_PCS35_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define EXTI_D3PCR2L_PCS34          (0x3UL << 4) 
#define EXTI_D3PCR2L_PCS34_VAL(X) (((uint32_t)(X) & 0x3UL) << 4)
#define EXTI_D3PCR2L_PCS41          (0x3UL << 18) 
#define EXTI_D3PCR2L_PCS41_VAL(X) (((uint32_t)(X) & 0x3UL) << 18)
#define EXTI_D3PCR2H_PCS48          (0x3UL << 0) 
#define EXTI_D3PCR2H_PCS48_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define EXTI_D3PCR2H_PCS49          (0x3UL << 2) 
#define EXTI_D3PCR2H_PCS49_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define EXTI_D3PCR2H_PCS50          (0x3UL << 4) 
#define EXTI_D3PCR2H_PCS50_VAL(X) (((uint32_t)(X) & 0x3UL) << 4)
#define EXTI_D3PCR2H_PCS51          (0x3UL << 6) 
#define EXTI_D3PCR2H_PCS51_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define EXTI_D3PCR2H_PCS52          (0x3UL << 8) 
#define EXTI_D3PCR2H_PCS52_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define EXTI_D3PCR2H_PCS53          (0x3UL << 10) 
#define EXTI_D3PCR2H_PCS53_VAL(X) (((uint32_t)(X) & 0x3UL) << 10)
#define EXTI_RTSR3_TR82          (0x1UL << 18) 
#define EXTI_RTSR3_TR82_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define EXTI_RTSR3_TR84          (0x1UL << 20) 
#define EXTI_RTSR3_TR84_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define EXTI_RTSR3_TR85          (0x1UL << 21) 
#define EXTI_RTSR3_TR85_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define EXTI_RTSR3_TR86          (0x1UL << 22) 
#define EXTI_RTSR3_TR86_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define EXTI_FTSR3_TR82          (0x1UL << 18) 
#define EXTI_FTSR3_TR82_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define EXTI_FTSR3_TR84          (0x1UL << 20) 
#define EXTI_FTSR3_TR84_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define EXTI_FTSR3_TR85          (0x1UL << 21) 
#define EXTI_FTSR3_TR85_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define EXTI_FTSR3_TR86          (0x1UL << 22) 
#define EXTI_FTSR3_TR86_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define EXTI_SWIER3_SWIER82          (0x1UL << 18) 
#define EXTI_SWIER3_SWIER82_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define EXTI_SWIER3_SWIER84          (0x1UL << 20) 
#define EXTI_SWIER3_SWIER84_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define EXTI_SWIER3_SWIER85          (0x1UL << 21) 
#define EXTI_SWIER3_SWIER85_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define EXTI_SWIER3_SWIER86          (0x1UL << 22) 
#define EXTI_SWIER3_SWIER86_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define EXTI_D3PMR3_MR88          (0x1UL << 24) 
#define EXTI_D3PMR3_MR88_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define EXTI_D3PCR3H_PCS88          (0x3UL << 18) 
#define EXTI_D3PCR3H_PCS88_VAL(X) (((uint32_t)(X) & 0x3UL) << 18)
#define EXTI_CPUIMR1_MR0          (0x1UL << 0) 
#define EXTI_CPUIMR1_MR0_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define EXTI_CPUIMR1_MR1          (0x1UL << 1) 
#define EXTI_CPUIMR1_MR1_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define EXTI_CPUIMR1_MR2          (0x1UL << 2) 
#define EXTI_CPUIMR1_MR2_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define EXTI_CPUIMR1_MR3          (0x1UL << 3) 
#define EXTI_CPUIMR1_MR3_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define EXTI_CPUIMR1_MR4          (0x1UL << 4) 
#define EXTI_CPUIMR1_MR4_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define EXTI_CPUIMR1_MR5          (0x1UL << 5) 
#define EXTI_CPUIMR1_MR5_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define EXTI_CPUIMR1_MR6          (0x1UL << 6) 
#define EXTI_CPUIMR1_MR6_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define EXTI_CPUIMR1_MR7          (0x1UL << 7) 
#define EXTI_CPUIMR1_MR7_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define EXTI_CPUIMR1_MR8          (0x1UL << 8) 
#define EXTI_CPUIMR1_MR8_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define EXTI_CPUIMR1_MR9          (0x1UL << 9) 
#define EXTI_CPUIMR1_MR9_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define EXTI_CPUIMR1_MR10          (0x1UL << 10) 
#define EXTI_CPUIMR1_MR10_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define EXTI_CPUIMR1_MR11          (0x1UL << 11) 
#define EXTI_CPUIMR1_MR11_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define EXTI_CPUIMR1_MR12          (0x1UL << 12) 
#define EXTI_CPUIMR1_MR12_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define EXTI_CPUIMR1_MR13          (0x1UL << 13) 
#define EXTI_CPUIMR1_MR13_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define EXTI_CPUIMR1_MR14          (0x1UL << 14) 
#define EXTI_CPUIMR1_MR14_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define EXTI_CPUIMR1_MR15          (0x1UL << 15) 
#define EXTI_CPUIMR1_MR15_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define EXTI_CPUIMR1_MR16          (0x1UL << 16) 
#define EXTI_CPUIMR1_MR16_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define EXTI_CPUIMR1_MR17          (0x1UL << 17) 
#define EXTI_CPUIMR1_MR17_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define EXTI_CPUIMR1_MR18          (0x1UL << 18) 
#define EXTI_CPUIMR1_MR18_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define EXTI_CPUIMR1_MR19          (0x1UL << 19) 
#define EXTI_CPUIMR1_MR19_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define EXTI_CPUIMR1_MR20          (0x1UL << 20) 
#define EXTI_CPUIMR1_MR20_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define EXTI_CPUIMR1_MR21          (0x1UL << 21) 
#define EXTI_CPUIMR1_MR21_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define EXTI_CPUIMR1_MR22          (0x1UL << 22) 
#define EXTI_CPUIMR1_MR22_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define EXTI_CPUIMR1_MR23          (0x1UL << 23) 
#define EXTI_CPUIMR1_MR23_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define EXTI_CPUIMR1_MR24          (0x1UL << 24) 
#define EXTI_CPUIMR1_MR24_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define EXTI_CPUIMR1_MR25          (0x1UL << 25) 
#define EXTI_CPUIMR1_MR25_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define EXTI_CPUIMR1_MR26          (0x1UL << 26) 
#define EXTI_CPUIMR1_MR26_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define EXTI_CPUIMR1_MR27          (0x1UL << 27) 
#define EXTI_CPUIMR1_MR27_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define EXTI_CPUIMR1_MR28          (0x1UL << 28) 
#define EXTI_CPUIMR1_MR28_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define EXTI_CPUIMR1_MR29          (0x1UL << 29) 
#define EXTI_CPUIMR1_MR29_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define EXTI_CPUIMR1_MR30          (0x1UL << 30) 
#define EXTI_CPUIMR1_MR30_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define EXTI_CPUIMR1_MR31          (0x1UL << 31) 
#define EXTI_CPUIMR1_MR31_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define EXTI_CPUEMR1_MR0          (0x1UL << 0) 
#define EXTI_CPUEMR1_MR0_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define EXTI_CPUEMR1_MR1          (0x1UL << 1) 
#define EXTI_CPUEMR1_MR1_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define EXTI_CPUEMR1_MR2          (0x1UL << 2) 
#define EXTI_CPUEMR1_MR2_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define EXTI_CPUEMR1_MR3          (0x1UL << 3) 
#define EXTI_CPUEMR1_MR3_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define EXTI_CPUEMR1_MR4          (0x1UL << 4) 
#define EXTI_CPUEMR1_MR4_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define EXTI_CPUEMR1_MR5          (0x1UL << 5) 
#define EXTI_CPUEMR1_MR5_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define EXTI_CPUEMR1_MR6          (0x1UL << 6) 
#define EXTI_CPUEMR1_MR6_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define EXTI_CPUEMR1_MR7          (0x1UL << 7) 
#define EXTI_CPUEMR1_MR7_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define EXTI_CPUEMR1_MR8          (0x1UL << 8) 
#define EXTI_CPUEMR1_MR8_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define EXTI_CPUEMR1_MR9          (0x1UL << 9) 
#define EXTI_CPUEMR1_MR9_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define EXTI_CPUEMR1_MR10          (0x1UL << 10) 
#define EXTI_CPUEMR1_MR10_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define EXTI_CPUEMR1_MR11          (0x1UL << 11) 
#define EXTI_CPUEMR1_MR11_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define EXTI_CPUEMR1_MR12          (0x1UL << 12) 
#define EXTI_CPUEMR1_MR12_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define EXTI_CPUEMR1_MR13          (0x1UL << 13) 
#define EXTI_CPUEMR1_MR13_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define EXTI_CPUEMR1_MR14          (0x1UL << 14) 
#define EXTI_CPUEMR1_MR14_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define EXTI_CPUEMR1_MR15          (0x1UL << 15) 
#define EXTI_CPUEMR1_MR15_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define EXTI_CPUEMR1_MR16          (0x1UL << 16) 
#define EXTI_CPUEMR1_MR16_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define EXTI_CPUEMR1_MR17          (0x1UL << 17) 
#define EXTI_CPUEMR1_MR17_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define EXTI_CPUEMR1_MR18          (0x1UL << 18) 
#define EXTI_CPUEMR1_MR18_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define EXTI_CPUEMR1_MR19          (0x1UL << 19) 
#define EXTI_CPUEMR1_MR19_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define EXTI_CPUEMR1_MR20          (0x1UL << 20) 
#define EXTI_CPUEMR1_MR20_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define EXTI_CPUEMR1_MR21          (0x1UL << 21) 
#define EXTI_CPUEMR1_MR21_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define EXTI_CPUEMR1_MR22          (0x1UL << 22) 
#define EXTI_CPUEMR1_MR22_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define EXTI_CPUEMR1_MR23          (0x1UL << 23) 
#define EXTI_CPUEMR1_MR23_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define EXTI_CPUEMR1_MR24          (0x1UL << 24) 
#define EXTI_CPUEMR1_MR24_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define EXTI_CPUEMR1_MR25          (0x1UL << 25) 
#define EXTI_CPUEMR1_MR25_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define EXTI_CPUEMR1_MR26          (0x1UL << 26) 
#define EXTI_CPUEMR1_MR26_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define EXTI_CPUEMR1_MR27          (0x1UL << 27) 
#define EXTI_CPUEMR1_MR27_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define EXTI_CPUEMR1_MR28          (0x1UL << 28) 
#define EXTI_CPUEMR1_MR28_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define EXTI_CPUEMR1_MR29          (0x1UL << 29) 
#define EXTI_CPUEMR1_MR29_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define EXTI_CPUEMR1_MR30          (0x1UL << 30) 
#define EXTI_CPUEMR1_MR30_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define EXTI_CPUEMR1_MR31          (0x1UL << 31) 
#define EXTI_CPUEMR1_MR31_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define EXTI_CPUPR1_PR0          (0x1UL << 0) 
#define EXTI_CPUPR1_PR0_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define EXTI_CPUPR1_PR1          (0x1UL << 1) 
#define EXTI_CPUPR1_PR1_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define EXTI_CPUPR1_PR2          (0x1UL << 2) 
#define EXTI_CPUPR1_PR2_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define EXTI_CPUPR1_PR3          (0x1UL << 3) 
#define EXTI_CPUPR1_PR3_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define EXTI_CPUPR1_PR4          (0x1UL << 4) 
