via/viaems/src/platforms/stm32h743/device.h
#define EXTI_CPUPR1_PR4_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define EXTI_CPUPR1_PR5          (0x1UL << 5) 
#define EXTI_CPUPR1_PR5_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define EXTI_CPUPR1_PR6          (0x1UL << 6) 
#define EXTI_CPUPR1_PR6_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define EXTI_CPUPR1_PR7          (0x1UL << 7) 
#define EXTI_CPUPR1_PR7_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define EXTI_CPUPR1_PR8          (0x1UL << 8) 
#define EXTI_CPUPR1_PR8_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define EXTI_CPUPR1_PR9          (0x1UL << 9) 
#define EXTI_CPUPR1_PR9_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define EXTI_CPUPR1_PR10          (0x1UL << 10) 
#define EXTI_CPUPR1_PR10_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define EXTI_CPUPR1_PR11          (0x1UL << 11) 
#define EXTI_CPUPR1_PR11_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define EXTI_CPUPR1_PR12          (0x1UL << 12) 
#define EXTI_CPUPR1_PR12_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define EXTI_CPUPR1_PR13          (0x1UL << 13) 
#define EXTI_CPUPR1_PR13_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define EXTI_CPUPR1_PR14          (0x1UL << 14) 
#define EXTI_CPUPR1_PR14_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define EXTI_CPUPR1_PR15          (0x1UL << 15) 
#define EXTI_CPUPR1_PR15_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define EXTI_CPUPR1_PR16          (0x1UL << 16) 
#define EXTI_CPUPR1_PR16_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define EXTI_CPUPR1_PR17          (0x1UL << 17) 
#define EXTI_CPUPR1_PR17_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define EXTI_CPUPR1_PR18          (0x1UL << 18) 
#define EXTI_CPUPR1_PR18_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define EXTI_CPUPR1_PR19          (0x1UL << 19) 
#define EXTI_CPUPR1_PR19_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define EXTI_CPUPR1_PR20          (0x1UL << 20) 
#define EXTI_CPUPR1_PR20_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define EXTI_CPUPR1_PR21          (0x1UL << 21) 
#define EXTI_CPUPR1_PR21_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define EXTI_CPUIMR2_MR0          (0x1UL << 0) 
#define EXTI_CPUIMR2_MR0_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define EXTI_CPUIMR2_MR1          (0x1UL << 1) 
#define EXTI_CPUIMR2_MR1_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define EXTI_CPUIMR2_MR2          (0x1UL << 2) 
#define EXTI_CPUIMR2_MR2_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define EXTI_CPUIMR2_MR3          (0x1UL << 3) 
#define EXTI_CPUIMR2_MR3_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define EXTI_CPUIMR2_MR4          (0x1UL << 4) 
#define EXTI_CPUIMR2_MR4_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define EXTI_CPUIMR2_MR5          (0x1UL << 5) 
#define EXTI_CPUIMR2_MR5_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define EXTI_CPUIMR2_MR6          (0x1UL << 6) 
#define EXTI_CPUIMR2_MR6_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define EXTI_CPUIMR2_MR7          (0x1UL << 7) 
#define EXTI_CPUIMR2_MR7_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define EXTI_CPUIMR2_MR8          (0x1UL << 8) 
#define EXTI_CPUIMR2_MR8_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define EXTI_CPUIMR2_MR9          (0x1UL << 9) 
#define EXTI_CPUIMR2_MR9_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define EXTI_CPUIMR2_MR10          (0x1UL << 10) 
#define EXTI_CPUIMR2_MR10_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define EXTI_CPUIMR2_MR11          (0x1UL << 11) 
#define EXTI_CPUIMR2_MR11_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define EXTI_CPUIMR2_MR12          (0x1UL << 12) 
#define EXTI_CPUIMR2_MR12_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define EXTI_CPUIMR2_MR14          (0x1UL << 14) 
#define EXTI_CPUIMR2_MR14_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define EXTI_CPUIMR2_MR15          (0x1UL << 15) 
#define EXTI_CPUIMR2_MR15_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define EXTI_CPUIMR2_MR16          (0x1UL << 16) 
#define EXTI_CPUIMR2_MR16_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define EXTI_CPUIMR2_MR17          (0x1UL << 17) 
#define EXTI_CPUIMR2_MR17_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define EXTI_CPUIMR2_MR18          (0x1UL << 18) 
#define EXTI_CPUIMR2_MR18_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define EXTI_CPUIMR2_MR19          (0x1UL << 19) 
#define EXTI_CPUIMR2_MR19_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define EXTI_CPUIMR2_MR20          (0x1UL << 20) 
#define EXTI_CPUIMR2_MR20_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define EXTI_CPUIMR2_MR21          (0x1UL << 21) 
#define EXTI_CPUIMR2_MR21_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define EXTI_CPUIMR2_MR22          (0x1UL << 22) 
#define EXTI_CPUIMR2_MR22_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define EXTI_CPUIMR2_MR23          (0x1UL << 23) 
#define EXTI_CPUIMR2_MR23_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define EXTI_CPUIMR2_MR24          (0x1UL << 24) 
#define EXTI_CPUIMR2_MR24_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define EXTI_CPUIMR2_MR25          (0x1UL << 25) 
#define EXTI_CPUIMR2_MR25_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define EXTI_CPUIMR2_MR26          (0x1UL << 26) 
#define EXTI_CPUIMR2_MR26_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define EXTI_CPUIMR2_MR27          (0x1UL << 27) 
#define EXTI_CPUIMR2_MR27_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define EXTI_CPUIMR2_MR28          (0x1UL << 28) 
#define EXTI_CPUIMR2_MR28_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define EXTI_CPUIMR2_MR29          (0x1UL << 29) 
#define EXTI_CPUIMR2_MR29_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define EXTI_CPUIMR2_MR30          (0x1UL << 30) 
#define EXTI_CPUIMR2_MR30_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define EXTI_CPUIMR2_MR31          (0x1UL << 31) 
#define EXTI_CPUIMR2_MR31_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define EXTI_CPUEMR2_MR32          (0x1UL << 0) 
#define EXTI_CPUEMR2_MR32_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define EXTI_CPUEMR2_MR33          (0x1UL << 1) 
#define EXTI_CPUEMR2_MR33_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define EXTI_CPUEMR2_MR34          (0x1UL << 2) 
#define EXTI_CPUEMR2_MR34_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define EXTI_CPUEMR2_MR35          (0x1UL << 3) 
#define EXTI_CPUEMR2_MR35_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define EXTI_CPUEMR2_MR36          (0x1UL << 4) 
#define EXTI_CPUEMR2_MR36_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define EXTI_CPUEMR2_MR37          (0x1UL << 5) 
#define EXTI_CPUEMR2_MR37_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define EXTI_CPUEMR2_MR38          (0x1UL << 6) 
#define EXTI_CPUEMR2_MR38_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define EXTI_CPUEMR2_MR39          (0x1UL << 7) 
#define EXTI_CPUEMR2_MR39_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define EXTI_CPUEMR2_MR40          (0x1UL << 8) 
#define EXTI_CPUEMR2_MR40_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define EXTI_CPUEMR2_MR41          (0x1UL << 9) 
#define EXTI_CPUEMR2_MR41_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define EXTI_CPUEMR2_MR42          (0x1UL << 10) 
#define EXTI_CPUEMR2_MR42_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define EXTI_CPUEMR2_MR43          (0x1UL << 11) 
#define EXTI_CPUEMR2_MR43_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define EXTI_CPUEMR2_MR44          (0x1UL << 12) 
#define EXTI_CPUEMR2_MR44_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define EXTI_CPUEMR2_MR46          (0x1UL << 14) 
#define EXTI_CPUEMR2_MR46_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define EXTI_CPUEMR2_MR47          (0x1UL << 15) 
#define EXTI_CPUEMR2_MR47_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define EXTI_CPUEMR2_MR48          (0x1UL << 16) 
#define EXTI_CPUEMR2_MR48_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define EXTI_CPUEMR2_MR49          (0x1UL << 17) 
#define EXTI_CPUEMR2_MR49_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define EXTI_CPUEMR2_MR50          (0x1UL << 18) 
#define EXTI_CPUEMR2_MR50_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define EXTI_CPUEMR2_MR51          (0x1UL << 19) 
#define EXTI_CPUEMR2_MR51_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define EXTI_CPUEMR2_MR52          (0x1UL << 20) 
#define EXTI_CPUEMR2_MR52_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define EXTI_CPUEMR2_MR53          (0x1UL << 21) 
#define EXTI_CPUEMR2_MR53_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define EXTI_CPUEMR2_MR54          (0x1UL << 22) 
#define EXTI_CPUEMR2_MR54_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define EXTI_CPUEMR2_MR55          (0x1UL << 23) 
#define EXTI_CPUEMR2_MR55_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define EXTI_CPUEMR2_MR56          (0x1UL << 24) 
#define EXTI_CPUEMR2_MR56_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define EXTI_CPUEMR2_MR57          (0x1UL << 25) 
#define EXTI_CPUEMR2_MR57_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define EXTI_CPUEMR2_MR58          (0x1UL << 26) 
#define EXTI_CPUEMR2_MR58_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define EXTI_CPUEMR2_MR59          (0x1UL << 27) 
#define EXTI_CPUEMR2_MR59_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define EXTI_CPUEMR2_MR60          (0x1UL << 28) 
#define EXTI_CPUEMR2_MR60_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define EXTI_CPUEMR2_MR61          (0x1UL << 29) 
#define EXTI_CPUEMR2_MR61_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define EXTI_CPUEMR2_MR62          (0x1UL << 30) 
#define EXTI_CPUEMR2_MR62_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define EXTI_CPUEMR2_MR63          (0x1UL << 31) 
#define EXTI_CPUEMR2_MR63_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define EXTI_CPUPR2_PR49          (0x1UL << 17) 
#define EXTI_CPUPR2_PR49_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define EXTI_CPUPR2_PR51          (0x1UL << 19) 
#define EXTI_CPUPR2_PR51_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define EXTI_CPUIMR3_MR64          (0x1UL << 0) 
#define EXTI_CPUIMR3_MR64_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define EXTI_CPUIMR3_MR65          (0x1UL << 1) 
#define EXTI_CPUIMR3_MR65_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define EXTI_CPUIMR3_MR66          (0x1UL << 2) 
#define EXTI_CPUIMR3_MR66_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define EXTI_CPUIMR3_MR67          (0x1UL << 3) 
#define EXTI_CPUIMR3_MR67_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define EXTI_CPUIMR3_MR68          (0x1UL << 4) 
#define EXTI_CPUIMR3_MR68_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define EXTI_CPUIMR3_MR69          (0x1UL << 5) 
#define EXTI_CPUIMR3_MR69_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define EXTI_CPUIMR3_MR70          (0x1UL << 6) 
#define EXTI_CPUIMR3_MR70_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define EXTI_CPUIMR3_MR71          (0x1UL << 7) 
#define EXTI_CPUIMR3_MR71_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define EXTI_CPUIMR3_MR72          (0x1UL << 8) 
#define EXTI_CPUIMR3_MR72_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define EXTI_CPUIMR3_MR73          (0x1UL << 9) 
#define EXTI_CPUIMR3_MR73_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define EXTI_CPUIMR3_MR74          (0x1UL << 10) 
#define EXTI_CPUIMR3_MR74_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define EXTI_CPUIMR3_MR75          (0x1UL << 11) 
#define EXTI_CPUIMR3_MR75_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define EXTI_CPUIMR3_MR76          (0x1UL << 12) 
#define EXTI_CPUIMR3_MR76_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define EXTI_CPUIMR3_MR77          (0x1UL << 13) 
#define EXTI_CPUIMR3_MR77_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define EXTI_CPUIMR3_MR78          (0x1UL << 14) 
#define EXTI_CPUIMR3_MR78_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define EXTI_CPUIMR3_MR79          (0x1UL << 15) 
#define EXTI_CPUIMR3_MR79_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define EXTI_CPUIMR3_MR80          (0x1UL << 16) 
#define EXTI_CPUIMR3_MR80_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define EXTI_CPUIMR3_MR82          (0x1UL << 18) 
#define EXTI_CPUIMR3_MR82_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define EXTI_CPUIMR3_MR84          (0x1UL << 20) 
#define EXTI_CPUIMR3_MR84_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define EXTI_CPUIMR3_MR85          (0x1UL << 21) 
#define EXTI_CPUIMR3_MR85_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define EXTI_CPUIMR3_MR86          (0x1UL << 22) 
#define EXTI_CPUIMR3_MR86_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define EXTI_CPUIMR3_MR87          (0x1UL << 23) 
#define EXTI_CPUIMR3_MR87_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define EXTI_CPUIMR3_MR88          (0x1UL << 24) 
#define EXTI_CPUIMR3_MR88_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define EXTI_CPUEMR3_MR64          (0x1UL << 0) 
#define EXTI_CPUEMR3_MR64_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define EXTI_CPUEMR3_MR65          (0x1UL << 1) 
#define EXTI_CPUEMR3_MR65_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define EXTI_CPUEMR3_MR66          (0x1UL << 2) 
#define EXTI_CPUEMR3_MR66_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define EXTI_CPUEMR3_MR67          (0x1UL << 3) 
#define EXTI_CPUEMR3_MR67_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define EXTI_CPUEMR3_MR68          (0x1UL << 4) 
#define EXTI_CPUEMR3_MR68_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define EXTI_CPUEMR3_MR69          (0x1UL << 5) 
#define EXTI_CPUEMR3_MR69_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define EXTI_CPUEMR3_MR70          (0x1UL << 6) 
#define EXTI_CPUEMR3_MR70_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define EXTI_CPUEMR3_MR71          (0x1UL << 7) 
#define EXTI_CPUEMR3_MR71_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define EXTI_CPUEMR3_MR72          (0x1UL << 8) 
#define EXTI_CPUEMR3_MR72_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define EXTI_CPUEMR3_MR73          (0x1UL << 9) 
#define EXTI_CPUEMR3_MR73_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define EXTI_CPUEMR3_MR74          (0x1UL << 10) 
#define EXTI_CPUEMR3_MR74_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define EXTI_CPUEMR3_MR75          (0x1UL << 11) 
#define EXTI_CPUEMR3_MR75_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define EXTI_CPUEMR3_MR76          (0x1UL << 12) 
#define EXTI_CPUEMR3_MR76_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define EXTI_CPUEMR3_MR77          (0x1UL << 13) 
#define EXTI_CPUEMR3_MR77_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define EXTI_CPUEMR3_MR78          (0x1UL << 14) 
#define EXTI_CPUEMR3_MR78_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define EXTI_CPUEMR3_MR79          (0x1UL << 15) 
#define EXTI_CPUEMR3_MR79_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define EXTI_CPUEMR3_MR80          (0x1UL << 16) 
#define EXTI_CPUEMR3_MR80_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define EXTI_CPUEMR3_MR82          (0x1UL << 18) 
#define EXTI_CPUEMR3_MR82_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define EXTI_CPUEMR3_MR84          (0x1UL << 20) 
#define EXTI_CPUEMR3_MR84_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define EXTI_CPUEMR3_MR85          (0x1UL << 21) 
#define EXTI_CPUEMR3_MR85_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define EXTI_CPUEMR3_MR86          (0x1UL << 22) 
#define EXTI_CPUEMR3_MR86_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define EXTI_CPUEMR3_MR87          (0x1UL << 23) 
#define EXTI_CPUEMR3_MR87_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define EXTI_CPUEMR3_MR88          (0x1UL << 24) 
#define EXTI_CPUEMR3_MR88_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define EXTI_CPUPR3_PR82          (0x1UL << 18) 
#define EXTI_CPUPR3_PR82_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define EXTI_CPUPR3_PR84          (0x1UL << 20) 
#define EXTI_CPUPR3_PR84_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define EXTI_CPUPR3_PR85          (0x1UL << 21) 
#define EXTI_CPUPR3_PR85_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define EXTI_CPUPR3_PR86          (0x1UL << 22) 
#define EXTI_CPUPR3_PR86_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)

