via/viaems/src/platforms/stm32h743/device.h
#define EXTI  ((struct EXTI*)(0x58000000UL))
struct DELAY_Block_SDMMC1 {
  volatile uint32_t CR;
  volatile uint32_t CFGR;
};
#define DELAY_Block_SDMMC1_CR_DEN          (0x1UL << 0) 
#define DELAY_Block_SDMMC1_CR_DEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define DELAY_Block_SDMMC1_CR_SEN          (0x1UL << 1) 
#define DELAY_Block_SDMMC1_CR_SEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define DELAY_Block_SDMMC1_CFGR_SEL          (0xFUL << 0) 
#define DELAY_Block_SDMMC1_CFGR_SEL_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define DELAY_Block_SDMMC1_CFGR_UNIT          (0x7FUL << 8) 
#define DELAY_Block_SDMMC1_CFGR_UNIT_VAL(X) (((uint32_t)(X) & 0x7FUL) << 8)
#define DELAY_Block_SDMMC1_CFGR_LNG          (0xFFFUL << 16) 
#define DELAY_Block_SDMMC1_CFGR_LNG_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 16)
#define DELAY_Block_SDMMC1_CFGR_LNGF          (0x1UL << 31) 
#define DELAY_Block_SDMMC1_CFGR_LNGF_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)

#define DELAY_Block_SDMMC1  ((struct DELAY_Block_SDMMC1*)(0x52008000UL))
struct DELAY_Block_QUADSPI {
  volatile uint32_t CR;
  volatile uint32_t CFGR;
};
#define DELAY_Block_QUADSPI_CR_DEN          (0x1UL << 0) 
#define DELAY_Block_QUADSPI_CR_DEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define DELAY_Block_QUADSPI_CR_SEN          (0x1UL << 1) 
#define DELAY_Block_QUADSPI_CR_SEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define DELAY_Block_QUADSPI_CFGR_SEL          (0xFUL << 0) 
#define DELAY_Block_QUADSPI_CFGR_SEL_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define DELAY_Block_QUADSPI_CFGR_UNIT          (0x7FUL << 8) 
#define DELAY_Block_QUADSPI_CFGR_UNIT_VAL(X) (((uint32_t)(X) & 0x7FUL) << 8)
#define DELAY_Block_QUADSPI_CFGR_LNG          (0xFFFUL << 16) 
#define DELAY_Block_QUADSPI_CFGR_LNG_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 16)
#define DELAY_Block_QUADSPI_CFGR_LNGF          (0x1UL << 31) 
#define DELAY_Block_QUADSPI_CFGR_LNGF_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)

#define DELAY_Block_QUADSPI  ((struct DELAY_Block_QUADSPI*)(0x52006000UL))
struct DELAY_Block_SDMMC2 {
  volatile uint32_t CR;
  volatile uint32_t CFGR;
};
#define DELAY_Block_SDMMC2_CR_DEN          (0x1UL << 0) 
#define DELAY_Block_SDMMC2_CR_DEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define DELAY_Block_SDMMC2_CR_SEN          (0x1UL << 1) 
#define DELAY_Block_SDMMC2_CR_SEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define DELAY_Block_SDMMC2_CFGR_SEL          (0xFUL << 0) 
#define DELAY_Block_SDMMC2_CFGR_SEL_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define DELAY_Block_SDMMC2_CFGR_UNIT          (0x7FUL << 8) 
#define DELAY_Block_SDMMC2_CFGR_UNIT_VAL(X) (((uint32_t)(X) & 0x7FUL) << 8)
#define DELAY_Block_SDMMC2_CFGR_LNG          (0xFFFUL << 16) 
#define DELAY_Block_SDMMC2_CFGR_LNG_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 16)
#define DELAY_Block_SDMMC2_CFGR_LNGF          (0x1UL << 31) 
#define DELAY_Block_SDMMC2_CFGR_LNGF_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)

#define DELAY_Block_SDMMC2  ((struct DELAY_Block_SDMMC2*)(0x48022800UL))
struct Flash {
  volatile uint32_t ACR;
  volatile uint32_t KEYR1;
  volatile uint32_t OPTKEYR;
  volatile uint32_t CR1;
  volatile uint32_t SR1;
  volatile uint32_t CCR1;
  volatile uint32_t OPTCR;
  volatile uint32_t OPTSR_CUR;
  volatile uint32_t OPTSR_PRG;
  volatile uint32_t OPTCCR;
  volatile const uint32_t PRAR_CUR1;
  volatile uint32_t PRAR_PRG1;
  volatile uint32_t PRAR_PRG2;
  volatile uint32_t SCAR_CUR1;
  volatile uint32_t SCAR_PRG1;
  volatile const uint32_t WPSN_CUR1R;
  volatile uint32_t WPSN_PRG1R;
  volatile const uint32_t BOOT_CURR;
  volatile const uint32_t BOOT_PRGR;
  const volatile uint32_t RESERVED80[2];
  volatile uint32_t CRCCR1;
  volatile uint32_t CRCSADD1R;
  volatile uint32_t CRCEADD1R;
  volatile uint32_t CRCDATAR;
  volatile const uint32_t ECC_FA1R;
  const volatile uint32_t RESERVED256[39];
  volatile uint32_t ACR_;
  volatile const uint32_t KEYR2;
  volatile uint32_t OPTKEYR_;
  volatile uint32_t CR2;
  volatile uint32_t SR2;
  volatile uint32_t CCR2;
  volatile uint32_t OPTCR_;
  volatile uint32_t OPTSR_CUR_;
  volatile uint32_t OPTSR_PRG_;
  volatile uint32_t OPTCCR_;
  volatile const uint32_t PRAR_CUR2;
  const volatile uint32_t RESERVED304[1];
  volatile uint32_t SCAR_CUR2;
  volatile uint32_t SCAR_PRG2;
  volatile const uint32_t WPSN_CUR2R;
  volatile uint32_t WPSN_PRG2R;
  const volatile uint32_t RESERVED336[4];
  volatile uint32_t CRCCR2;
  volatile uint32_t CRCSADD2R;
  volatile uint32_t CRCEADD2R;
  const volatile uint32_t RESERVED352[1];
  volatile const uint32_t ECC_FA2R;
};
#define Flash_ACR_LATENCY          (0x7UL << 0) 
#define Flash_ACR_LATENCY_VAL(X) (((uint32_t)(X) & 0x7UL) << 0)
#define Flash_ACR_WRHIGHFREQ          (0x3UL << 4) 
#define Flash_ACR_WRHIGHFREQ_VAL(X) (((uint32_t)(X) & 0x3UL) << 4)
#define Flash_ACR__LATENCY          (0x7UL << 0) 
#define Flash_ACR__LATENCY_VAL(X) (((uint32_t)(X) & 0x7UL) << 0)
#define Flash_ACR__WRHIGHFREQ          (0x3UL << 4) 
#define Flash_ACR__WRHIGHFREQ_VAL(X) (((uint32_t)(X) & 0x3UL) << 4)
#define Flash_KEYR1_KEYR1          (0xFFFFFFFFUL << 0) 
#define Flash_KEYR1_KEYR1_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define Flash_OPTKEYR_OPTKEYR          (0xFFFFFFFFUL << 0) 
#define Flash_OPTKEYR_OPTKEYR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define Flash_OPTKEYR__OPTKEYR          (0xFFFFFFFFUL << 0) 
#define Flash_OPTKEYR__OPTKEYR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define Flash_CR1_LOCK1          (0x1UL << 0) 
#define Flash_CR1_LOCK1_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define Flash_CR1_PG1          (0x1UL << 1) 
#define Flash_CR1_PG1_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define Flash_CR1_SER1          (0x1UL << 2) 
#define Flash_CR1_SER1_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define Flash_CR1_BER1          (0x1UL << 3) 
#define Flash_CR1_BER1_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define Flash_CR1_PSIZE1          (0x3UL << 4) 
#define Flash_CR1_PSIZE1_VAL(X) (((uint32_t)(X) & 0x3UL) << 4)
#define Flash_CR1_FW1          (0x1UL << 6) 
#define Flash_CR1_FW1_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define Flash_CR1_START1          (0x1UL << 7) 
#define Flash_CR1_START1_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define Flash_CR1_SNB1          (0x7UL << 8) 
#define Flash_CR1_SNB1_VAL(X) (((uint32_t)(X) & 0x7UL) << 8)
#define Flash_CR1_CRC_EN          (0x1UL << 15) 
#define Flash_CR1_CRC_EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define Flash_CR1_EOPIE1          (0x1UL << 16) 
#define Flash_CR1_EOPIE1_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define Flash_CR1_WRPERRIE1          (0x1UL << 17) 
#define Flash_CR1_WRPERRIE1_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define Flash_CR1_PGSERRIE1          (0x1UL << 18) 
#define Flash_CR1_PGSERRIE1_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define Flash_CR1_STRBERRIE1          (0x1UL << 19) 
#define Flash_CR1_STRBERRIE1_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define Flash_CR1_INCERRIE1          (0x1UL << 21) 
#define Flash_CR1_INCERRIE1_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define Flash_CR1_OPERRIE1          (0x1UL << 22) 
#define Flash_CR1_OPERRIE1_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define Flash_CR1_RDPERRIE1          (0x1UL << 23) 
#define Flash_CR1_RDPERRIE1_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define Flash_CR1_RDSERRIE1          (0x1UL << 24) 
#define Flash_CR1_RDSERRIE1_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define Flash_CR1_SNECCERRIE1          (0x1UL << 25) 
#define Flash_CR1_SNECCERRIE1_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define Flash_CR1_DBECCERRIE1          (0x1UL << 26) 
#define Flash_CR1_DBECCERRIE1_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define Flash_CR1_CRCENDIE1          (0x1UL << 27) 
#define Flash_CR1_CRCENDIE1_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define Flash_SR1_BSY1          (0x1UL << 0) 
#define Flash_SR1_BSY1_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define Flash_SR1_WBNE1          (0x1UL << 1) 
#define Flash_SR1_WBNE1_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define Flash_SR1_QW1          (0x1UL << 2) 
#define Flash_SR1_QW1_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define Flash_SR1_CRC_BUSY1          (0x1UL << 3) 
#define Flash_SR1_CRC_BUSY1_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define Flash_SR1_EOP1          (0x1UL << 16) 
#define Flash_SR1_EOP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define Flash_SR1_WRPERR1          (0x1UL << 17) 
#define Flash_SR1_WRPERR1_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define Flash_SR1_PGSERR1          (0x1UL << 18) 
#define Flash_SR1_PGSERR1_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define Flash_SR1_STRBERR1          (0x1UL << 19) 
#define Flash_SR1_STRBERR1_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define Flash_SR1_INCERR1          (0x1UL << 21) 
#define Flash_SR1_INCERR1_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define Flash_SR1_OPERR1          (0x1UL << 22) 
#define Flash_SR1_OPERR1_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define Flash_SR1_RDPERR1          (0x1UL << 23) 
#define Flash_SR1_RDPERR1_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define Flash_SR1_RDSERR1          (0x1UL << 24) 
#define Flash_SR1_RDSERR1_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define Flash_SR1_SNECCERR11          (0x1UL << 25) 
#define Flash_SR1_SNECCERR11_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define Flash_SR1_DBECCERR1          (0x1UL << 26) 
#define Flash_SR1_DBECCERR1_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define Flash_SR1_CRCEND1          (0x1UL << 27) 
#define Flash_SR1_CRCEND1_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define Flash_CCR1_CLR_EOP1          (0x1UL << 16) 
#define Flash_CCR1_CLR_EOP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define Flash_CCR1_CLR_WRPERR1          (0x1UL << 17) 
#define Flash_CCR1_CLR_WRPERR1_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define Flash_CCR1_CLR_PGSERR1          (0x1UL << 18) 
#define Flash_CCR1_CLR_PGSERR1_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define Flash_CCR1_CLR_STRBERR1          (0x1UL << 19) 
#define Flash_CCR1_CLR_STRBERR1_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define Flash_CCR1_CLR_INCERR1          (0x1UL << 21) 
#define Flash_CCR1_CLR_INCERR1_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define Flash_CCR1_CLR_OPERR1          (0x1UL << 22) 
#define Flash_CCR1_CLR_OPERR1_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define Flash_CCR1_CLR_RDPERR1          (0x1UL << 23) 
#define Flash_CCR1_CLR_RDPERR1_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define Flash_CCR1_CLR_RDSERR1          (0x1UL << 24) 
#define Flash_CCR1_CLR_RDSERR1_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define Flash_CCR1_CLR_SNECCERR1          (0x1UL << 25) 
#define Flash_CCR1_CLR_SNECCERR1_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define Flash_CCR1_CLR_DBECCERR1          (0x1UL << 26) 
#define Flash_CCR1_CLR_DBECCERR1_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define Flash_CCR1_CLR_CRCEND1          (0x1UL << 27) 
#define Flash_CCR1_CLR_CRCEND1_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define Flash_OPTCR_OPTLOCK          (0x1UL << 0) 
#define Flash_OPTCR_OPTLOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define Flash_OPTCR_OPTSTART          (0x1UL << 1) 
#define Flash_OPTCR_OPTSTART_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define Flash_OPTCR_MER          (0x1UL << 4) 
#define Flash_OPTCR_MER_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define Flash_OPTCR_OPTCHANGEERRIE          (0x1UL << 30) 
#define Flash_OPTCR_OPTCHANGEERRIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define Flash_OPTCR_SWAP_BANK          (0x1UL << 31) 
#define Flash_OPTCR_SWAP_BANK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define Flash_OPTCR__OPTLOCK          (0x1UL << 0) 
#define Flash_OPTCR__OPTLOCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define Flash_OPTCR__OPTSTART          (0x1UL << 1) 
#define Flash_OPTCR__OPTSTART_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define Flash_OPTCR__MER          (0x1UL << 4) 
#define Flash_OPTCR__MER_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define Flash_OPTCR__OPTCHANGEERRIE          (0x1UL << 30) 
#define Flash_OPTCR__OPTCHANGEERRIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define Flash_OPTCR__SWAP_BANK          (0x1UL << 31) 
#define Flash_OPTCR__SWAP_BANK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define Flash_OPTSR_CUR__OPT_BUSY          (0x1UL << 0) 
#define Flash_OPTSR_CUR__OPT_BUSY_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define Flash_OPTSR_CUR__BOR_LEV          (0x3UL << 2) 
#define Flash_OPTSR_CUR__BOR_LEV_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define Flash_OPTSR_CUR__IWDG1_HW          (0x1UL << 4) 
#define Flash_OPTSR_CUR__IWDG1_HW_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define Flash_OPTSR_CUR__nRST_STOP_D1          (0x1UL << 6) 
#define Flash_OPTSR_CUR__nRST_STOP_D1_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define Flash_OPTSR_CUR__nRST_STBY_D1          (0x1UL << 7) 
#define Flash_OPTSR_CUR__nRST_STBY_D1_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define Flash_OPTSR_CUR__RDP          (0xFFUL << 8) 
#define Flash_OPTSR_CUR__RDP_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define Flash_OPTSR_CUR__FZ_IWDG_STOP          (0x1UL << 17) 
#define Flash_OPTSR_CUR__FZ_IWDG_STOP_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define Flash_OPTSR_CUR__FZ_IWDG_SDBY          (0x1UL << 18) 
#define Flash_OPTSR_CUR__FZ_IWDG_SDBY_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define Flash_OPTSR_CUR__ST_RAM_SIZE          (0x3UL << 19) 
#define Flash_OPTSR_CUR__ST_RAM_SIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 19)
#define Flash_OPTSR_CUR__SECURITY          (0x1UL << 21) 
#define Flash_OPTSR_CUR__SECURITY_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define Flash_OPTSR_CUR__RSS1          (0x1UL << 26) 
#define Flash_OPTSR_CUR__RSS1_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define Flash_OPTSR_CUR__PERSO_OK          (0x1UL << 28) 
#define Flash_OPTSR_CUR__PERSO_OK_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define Flash_OPTSR_CUR__IO_HSLV          (0x1UL << 29) 
#define Flash_OPTSR_CUR__IO_HSLV_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define Flash_OPTSR_CUR__OPTCHANGEERR          (0x1UL << 30) 
#define Flash_OPTSR_CUR__OPTCHANGEERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define Flash_OPTSR_CUR__SWAP_BANK_OPT          (0x1UL << 31) 
#define Flash_OPTSR_CUR__SWAP_BANK_OPT_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define Flash_OPTSR_CUR_OPT_BUSY          (0x1UL << 0) 
#define Flash_OPTSR_CUR_OPT_BUSY_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define Flash_OPTSR_CUR_BOR_LEV          (0x3UL << 2) 
#define Flash_OPTSR_CUR_BOR_LEV_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define Flash_OPTSR_CUR_IWDG1_HW          (0x1UL << 4) 
#define Flash_OPTSR_CUR_IWDG1_HW_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define Flash_OPTSR_CUR_nRST_STOP_D1          (0x1UL << 6) 
#define Flash_OPTSR_CUR_nRST_STOP_D1_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define Flash_OPTSR_CUR_nRST_STBY_D1          (0x1UL << 7) 
#define Flash_OPTSR_CUR_nRST_STBY_D1_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define Flash_OPTSR_CUR_RDP          (0xFFUL << 8) 
#define Flash_OPTSR_CUR_RDP_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define Flash_OPTSR_CUR_FZ_IWDG_STOP          (0x1UL << 17) 
#define Flash_OPTSR_CUR_FZ_IWDG_STOP_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define Flash_OPTSR_CUR_FZ_IWDG_SDBY          (0x1UL << 18) 
#define Flash_OPTSR_CUR_FZ_IWDG_SDBY_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define Flash_OPTSR_CUR_ST_RAM_SIZE          (0x3UL << 19) 
#define Flash_OPTSR_CUR_ST_RAM_SIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 19)
#define Flash_OPTSR_CUR_SECURITY          (0x1UL << 21) 
#define Flash_OPTSR_CUR_SECURITY_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define Flash_OPTSR_CUR_RSS1          (0x1UL << 26) 
#define Flash_OPTSR_CUR_RSS1_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define Flash_OPTSR_CUR_PERSO_OK          (0x1UL << 28) 
#define Flash_OPTSR_CUR_PERSO_OK_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define Flash_OPTSR_CUR_IO_HSLV          (0x1UL << 29) 
#define Flash_OPTSR_CUR_IO_HSLV_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define Flash_OPTSR_CUR_OPTCHANGEERR          (0x1UL << 30) 
#define Flash_OPTSR_CUR_OPTCHANGEERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define Flash_OPTSR_CUR_SWAP_BANK_OPT          (0x1UL << 31) 
#define Flash_OPTSR_CUR_SWAP_BANK_OPT_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define Flash_OPTSR_PRG_BOR_LEV          (0x3UL << 2) 
#define Flash_OPTSR_PRG_BOR_LEV_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define Flash_OPTSR_PRG_IWDG1_HW          (0x1UL << 4) 
#define Flash_OPTSR_PRG_IWDG1_HW_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define Flash_OPTSR_PRG_nRST_STOP_D1          (0x1UL << 6) 
#define Flash_OPTSR_PRG_nRST_STOP_D1_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define Flash_OPTSR_PRG_nRST_STBY_D1          (0x1UL << 7) 
#define Flash_OPTSR_PRG_nRST_STBY_D1_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define Flash_OPTSR_PRG_RDP          (0xFFUL << 8) 
#define Flash_OPTSR_PRG_RDP_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define Flash_OPTSR_PRG_FZ_IWDG_STOP          (0x1UL << 17) 
#define Flash_OPTSR_PRG_FZ_IWDG_STOP_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define Flash_OPTSR_PRG_FZ_IWDG_SDBY          (0x1UL << 18) 
#define Flash_OPTSR_PRG_FZ_IWDG_SDBY_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define Flash_OPTSR_PRG_ST_RAM_SIZE          (0x3UL << 19) 
#define Flash_OPTSR_PRG_ST_RAM_SIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 19)
#define Flash_OPTSR_PRG_SECURITY          (0x1UL << 21) 
#define Flash_OPTSR_PRG_SECURITY_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define Flash_OPTSR_PRG_RSS1          (0x1UL << 26) 
#define Flash_OPTSR_PRG_RSS1_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define Flash_OPTSR_PRG_RSS2          (0x1UL << 27) 
#define Flash_OPTSR_PRG_RSS2_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define Flash_OPTSR_PRG_IO_HSLV          (0x1UL << 29) 
#define Flash_OPTSR_PRG_IO_HSLV_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define Flash_OPTSR_PRG_SWAP_BANK_OPT          (0x1UL << 31) 
#define Flash_OPTSR_PRG_SWAP_BANK_OPT_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define Flash_OPTSR_PRG__BOR_LEV          (0x3UL << 2) 
#define Flash_OPTSR_PRG__BOR_LEV_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define Flash_OPTSR_PRG__IWDG1_HW          (0x1UL << 4) 
#define Flash_OPTSR_PRG__IWDG1_HW_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define Flash_OPTSR_PRG__nRST_STOP_D1          (0x1UL << 6) 
#define Flash_OPTSR_PRG__nRST_STOP_D1_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define Flash_OPTSR_PRG__nRST_STBY_D1          (0x1UL << 7) 
#define Flash_OPTSR_PRG__nRST_STBY_D1_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define Flash_OPTSR_PRG__RDP          (0xFFUL << 8) 
#define Flash_OPTSR_PRG__RDP_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define Flash_OPTSR_PRG__FZ_IWDG_STOP          (0x1UL << 17) 
#define Flash_OPTSR_PRG__FZ_IWDG_STOP_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define Flash_OPTSR_PRG__FZ_IWDG_SDBY          (0x1UL << 18) 
#define Flash_OPTSR_PRG__FZ_IWDG_SDBY_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define Flash_OPTSR_PRG__ST_RAM_SIZE          (0x3UL << 19) 
#define Flash_OPTSR_PRG__ST_RAM_SIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 19)
#define Flash_OPTSR_PRG__SECURITY          (0x1UL << 21) 
#define Flash_OPTSR_PRG__SECURITY_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define Flash_OPTSR_PRG__RSS1          (0x1UL << 26) 
#define Flash_OPTSR_PRG__RSS1_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define Flash_OPTSR_PRG__RSS2          (0x1UL << 27) 
#define Flash_OPTSR_PRG__RSS2_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define Flash_OPTSR_PRG__IO_HSLV          (0x1UL << 29) 
#define Flash_OPTSR_PRG__IO_HSLV_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define Flash_OPTSR_PRG__SWAP_BANK_OPT          (0x1UL << 31) 
#define Flash_OPTSR_PRG__SWAP_BANK_OPT_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define Flash_OPTCCR__CLR_OPTCHANGEERR          (0x1UL << 30) 
#define Flash_OPTCCR__CLR_OPTCHANGEERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define Flash_OPTCCR_CLR_OPTCHANGEERR          (0x1UL << 30) 
#define Flash_OPTCCR_CLR_OPTCHANGEERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define Flash_PRAR_CUR1_PROT_AREA_START1          (0xFFFUL << 0) 
#define Flash_PRAR_CUR1_PROT_AREA_START1_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 0)
#define Flash_PRAR_CUR1_PROT_AREA_END1          (0xFFFUL << 16) 
#define Flash_PRAR_CUR1_PROT_AREA_END1_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 16)
#define Flash_PRAR_CUR1_DMEP1          (0x1UL << 31) 
#define Flash_PRAR_CUR1_DMEP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define Flash_PRAR_PRG1_PROT_AREA_START1          (0xFFFUL << 0) 
#define Flash_PRAR_PRG1_PROT_AREA_START1_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 0)
#define Flash_PRAR_PRG1_PROT_AREA_END1          (0xFFFUL << 16) 
#define Flash_PRAR_PRG1_PROT_AREA_END1_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 16)
#define Flash_PRAR_PRG1_DMEP1          (0x1UL << 31) 
#define Flash_PRAR_PRG1_DMEP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define Flash_SCAR_CUR1_SEC_AREA_START1          (0xFFFUL << 0) 
#define Flash_SCAR_CUR1_SEC_AREA_START1_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 0)
#define Flash_SCAR_CUR1_SEC_AREA_END1          (0xFFFUL << 16) 
#define Flash_SCAR_CUR1_SEC_AREA_END1_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 16)
#define Flash_SCAR_CUR1_DMES1          (0x1UL << 31) 
#define Flash_SCAR_CUR1_DMES1_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define Flash_SCAR_PRG1_SEC_AREA_START1          (0xFFFUL << 0) 
#define Flash_SCAR_PRG1_SEC_AREA_START1_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 0)
#define Flash_SCAR_PRG1_SEC_AREA_END1          (0xFFFUL << 16) 
#define Flash_SCAR_PRG1_SEC_AREA_END1_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 16)
#define Flash_SCAR_PRG1_DMES1          (0x1UL << 31) 
#define Flash_SCAR_PRG1_DMES1_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define Flash_WPSN_CUR1R_WRPSn1          (0xFFUL << 0) 
#define Flash_WPSN_CUR1R_WRPSn1_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define Flash_WPSN_PRG1R_WRPSn1          (0xFFUL << 0) 
#define Flash_WPSN_PRG1R_WRPSn1_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define Flash_BOOT_CURR_BOOT_ADD0          (0xFFFFUL << 0) 
#define Flash_BOOT_CURR_BOOT_ADD0_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define Flash_BOOT_CURR_BOOT_ADD1          (0xFFFFUL << 16) 
#define Flash_BOOT_CURR_BOOT_ADD1_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define Flash_BOOT_PRGR_BOOT_ADD0          (0xFFFFUL << 0) 
#define Flash_BOOT_PRGR_BOOT_ADD0_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define Flash_BOOT_PRGR_BOOT_ADD1          (0xFFFFUL << 16) 
#define Flash_BOOT_PRGR_BOOT_ADD1_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define Flash_CRCCR1_CRC_SECT          (0x7UL << 0) 
#define Flash_CRCCR1_CRC_SECT_VAL(X) (((uint32_t)(X) & 0x7UL) << 0)
#define Flash_CRCCR1_ALL_BANK          (0x1UL << 7) 
#define Flash_CRCCR1_ALL_BANK_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define Flash_CRCCR1_CRC_BY_SECT          (0x1UL << 8) 
#define Flash_CRCCR1_CRC_BY_SECT_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define Flash_CRCCR1_ADD_SECT          (0x1UL << 9) 
#define Flash_CRCCR1_ADD_SECT_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define Flash_CRCCR1_CLEAN_SECT          (0x1UL << 10) 
#define Flash_CRCCR1_CLEAN_SECT_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define Flash_CRCCR1_START_CRC          (0x1UL << 16) 
#define Flash_CRCCR1_START_CRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define Flash_CRCCR1_CLEAN_CRC          (0x1UL << 17) 
#define Flash_CRCCR1_CLEAN_CRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define Flash_CRCCR1_CRC_BURST          (0x3UL << 20) 
#define Flash_CRCCR1_CRC_BURST_VAL(X) (((uint32_t)(X) & 0x3UL) << 20)
#define Flash_CRCSADD1R_CRC_START_ADDR          (0xFFFFFFFFUL << 0) 
#define Flash_CRCSADD1R_CRC_START_ADDR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define Flash_CRCEADD1R_CRC_END_ADDR          (0xFFFFFFFFUL << 0) 
#define Flash_CRCEADD1R_CRC_END_ADDR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define Flash_CRCDATAR_CRC_DATA          (0xFFFFFFFFUL << 0) 
#define Flash_CRCDATAR_CRC_DATA_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define Flash_ECC_FA1R_FAIL_ECC_ADDR1          (0x7FFFUL << 0) 
#define Flash_ECC_FA1R_FAIL_ECC_ADDR1_VAL(X) (((uint32_t)(X) & 0x7FFFUL) << 0)
#define Flash_KEYR2_KEYR2          (0xFFFFFFFFUL << 0) 
#define Flash_KEYR2_KEYR2_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define Flash_CR2_LOCK2          (0x1UL << 0) 
#define Flash_CR2_LOCK2_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define Flash_CR2_PG2          (0x1UL << 1) 
#define Flash_CR2_PG2_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define Flash_CR2_SER2          (0x1UL << 2) 
