via/viaems/src/platforms/stm32h743/device.h
#define Flash_CR2_SER2_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define Flash_CR2_BER2          (0x1UL << 3) 
#define Flash_CR2_BER2_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define Flash_CR2_PSIZE2          (0x3UL << 4) 
#define Flash_CR2_PSIZE2_VAL(X) (((uint32_t)(X) & 0x3UL) << 4)
#define Flash_CR2_FW2          (0x1UL << 6) 
#define Flash_CR2_FW2_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define Flash_CR2_START2          (0x1UL << 7) 
#define Flash_CR2_START2_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define Flash_CR2_SNB2          (0x7UL << 8) 
#define Flash_CR2_SNB2_VAL(X) (((uint32_t)(X) & 0x7UL) << 8)
#define Flash_CR2_CRC_EN          (0x1UL << 15) 
#define Flash_CR2_CRC_EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define Flash_CR2_EOPIE2          (0x1UL << 16) 
#define Flash_CR2_EOPIE2_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define Flash_CR2_WRPERRIE2          (0x1UL << 17) 
#define Flash_CR2_WRPERRIE2_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define Flash_CR2_PGSERRIE2          (0x1UL << 18) 
#define Flash_CR2_PGSERRIE2_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define Flash_CR2_STRBERRIE2          (0x1UL << 19) 
#define Flash_CR2_STRBERRIE2_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define Flash_CR2_INCERRIE2          (0x1UL << 21) 
#define Flash_CR2_INCERRIE2_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define Flash_CR2_OPERRIE2          (0x1UL << 22) 
#define Flash_CR2_OPERRIE2_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define Flash_CR2_RDPERRIE2          (0x1UL << 23) 
#define Flash_CR2_RDPERRIE2_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define Flash_CR2_RDSERRIE2          (0x1UL << 24) 
#define Flash_CR2_RDSERRIE2_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define Flash_CR2_SNECCERRIE2          (0x1UL << 25) 
#define Flash_CR2_SNECCERRIE2_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define Flash_CR2_DBECCERRIE2          (0x1UL << 26) 
#define Flash_CR2_DBECCERRIE2_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define Flash_CR2_CRCENDIE2          (0x1UL << 27) 
#define Flash_CR2_CRCENDIE2_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define Flash_SR2_BSY2          (0x1UL << 0) 
#define Flash_SR2_BSY2_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define Flash_SR2_WBNE2          (0x1UL << 1) 
#define Flash_SR2_WBNE2_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define Flash_SR2_QW2          (0x1UL << 2) 
#define Flash_SR2_QW2_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define Flash_SR2_CRC_BUSY2          (0x1UL << 3) 
#define Flash_SR2_CRC_BUSY2_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define Flash_SR2_EOP2          (0x1UL << 16) 
#define Flash_SR2_EOP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define Flash_SR2_WRPERR2          (0x1UL << 17) 
#define Flash_SR2_WRPERR2_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define Flash_SR2_PGSERR2          (0x1UL << 18) 
#define Flash_SR2_PGSERR2_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define Flash_SR2_STRBERR2          (0x1UL << 19) 
#define Flash_SR2_STRBERR2_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define Flash_SR2_INCERR2          (0x1UL << 21) 
#define Flash_SR2_INCERR2_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define Flash_SR2_OPERR2          (0x1UL << 22) 
#define Flash_SR2_OPERR2_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define Flash_SR2_RDPERR2          (0x1UL << 23) 
#define Flash_SR2_RDPERR2_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define Flash_SR2_RDSERR2          (0x1UL << 24) 
#define Flash_SR2_RDSERR2_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define Flash_SR2_SNECCERR2          (0x1UL << 25) 
#define Flash_SR2_SNECCERR2_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define Flash_SR2_DBECCERR2          (0x1UL << 26) 
#define Flash_SR2_DBECCERR2_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define Flash_SR2_CRCEND2          (0x1UL << 27) 
#define Flash_SR2_CRCEND2_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define Flash_CCR2_CLR_EOP2          (0x1UL << 16) 
#define Flash_CCR2_CLR_EOP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define Flash_CCR2_CLR_WRPERR2          (0x1UL << 17) 
#define Flash_CCR2_CLR_WRPERR2_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define Flash_CCR2_CLR_PGSERR2          (0x1UL << 18) 
#define Flash_CCR2_CLR_PGSERR2_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define Flash_CCR2_CLR_STRBERR2          (0x1UL << 19) 
#define Flash_CCR2_CLR_STRBERR2_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define Flash_CCR2_CLR_INCERR2          (0x1UL << 21) 
#define Flash_CCR2_CLR_INCERR2_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define Flash_CCR2_CLR_OPERR2          (0x1UL << 22) 
#define Flash_CCR2_CLR_OPERR2_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define Flash_CCR2_CLR_RDPERR2          (0x1UL << 23) 
#define Flash_CCR2_CLR_RDPERR2_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define Flash_CCR2_CLR_RDSERR1          (0x1UL << 24) 
#define Flash_CCR2_CLR_RDSERR1_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define Flash_CCR2_CLR_SNECCERR2          (0x1UL << 25) 
#define Flash_CCR2_CLR_SNECCERR2_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define Flash_CCR2_CLR_DBECCERR1          (0x1UL << 26) 
#define Flash_CCR2_CLR_DBECCERR1_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define Flash_CCR2_CLR_CRCEND2          (0x1UL << 27) 
#define Flash_CCR2_CLR_CRCEND2_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define Flash_PRAR_CUR2_PROT_AREA_START2          (0xFFFUL << 0) 
#define Flash_PRAR_CUR2_PROT_AREA_START2_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 0)
#define Flash_PRAR_CUR2_PROT_AREA_END2          (0xFFFUL << 16) 
#define Flash_PRAR_CUR2_PROT_AREA_END2_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 16)
#define Flash_PRAR_CUR2_DMEP2          (0x1UL << 31) 
#define Flash_PRAR_CUR2_DMEP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define Flash_PRAR_PRG2_PROT_AREA_START2          (0xFFFUL << 0) 
#define Flash_PRAR_PRG2_PROT_AREA_START2_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 0)
#define Flash_PRAR_PRG2_PROT_AREA_END2          (0xFFFUL << 16) 
#define Flash_PRAR_PRG2_PROT_AREA_END2_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 16)
#define Flash_PRAR_PRG2_DMEP2          (0x1UL << 31) 
#define Flash_PRAR_PRG2_DMEP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define Flash_SCAR_CUR2_SEC_AREA_START2          (0xFFFUL << 0) 
#define Flash_SCAR_CUR2_SEC_AREA_START2_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 0)
#define Flash_SCAR_CUR2_SEC_AREA_END2          (0xFFFUL << 16) 
#define Flash_SCAR_CUR2_SEC_AREA_END2_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 16)
#define Flash_SCAR_CUR2_DMES2          (0x1UL << 31) 
#define Flash_SCAR_CUR2_DMES2_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define Flash_SCAR_PRG2_SEC_AREA_START2          (0xFFFUL << 0) 
#define Flash_SCAR_PRG2_SEC_AREA_START2_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 0)
#define Flash_SCAR_PRG2_SEC_AREA_END2          (0xFFFUL << 16) 
#define Flash_SCAR_PRG2_SEC_AREA_END2_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 16)
#define Flash_SCAR_PRG2_DMES2          (0x1UL << 31) 
#define Flash_SCAR_PRG2_DMES2_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define Flash_WPSN_CUR2R_WRPSn2          (0xFFUL << 0) 
#define Flash_WPSN_CUR2R_WRPSn2_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define Flash_WPSN_PRG2R_WRPSn2          (0xFFUL << 0) 
#define Flash_WPSN_PRG2R_WRPSn2_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define Flash_CRCCR2_CRC_SECT          (0x7UL << 0) 
#define Flash_CRCCR2_CRC_SECT_VAL(X) (((uint32_t)(X) & 0x7UL) << 0)
#define Flash_CRCCR2_ALL_BANK          (0x1UL << 7) 
#define Flash_CRCCR2_ALL_BANK_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define Flash_CRCCR2_CRC_BY_SECT          (0x1UL << 8) 
#define Flash_CRCCR2_CRC_BY_SECT_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define Flash_CRCCR2_ADD_SECT          (0x1UL << 9) 
#define Flash_CRCCR2_ADD_SECT_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define Flash_CRCCR2_CLEAN_SECT          (0x1UL << 10) 
#define Flash_CRCCR2_CLEAN_SECT_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define Flash_CRCCR2_START_CRC          (0x1UL << 16) 
#define Flash_CRCCR2_START_CRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define Flash_CRCCR2_CLEAN_CRC          (0x1UL << 17) 
#define Flash_CRCCR2_CLEAN_CRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define Flash_CRCCR2_CRC_BURST          (0x3UL << 20) 
#define Flash_CRCCR2_CRC_BURST_VAL(X) (((uint32_t)(X) & 0x3UL) << 20)
#define Flash_CRCSADD2R_CRC_START_ADDR          (0xFFFFFFFFUL << 0) 
#define Flash_CRCSADD2R_CRC_START_ADDR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define Flash_CRCEADD2R_CRC_END_ADDR          (0xFFFFFFFFUL << 0) 
#define Flash_CRCEADD2R_CRC_END_ADDR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define Flash_ECC_FA2R_FAIL_ECC_ADDR2          (0x7FFFUL << 0) 
#define Flash_ECC_FA2R_FAIL_ECC_ADDR2_VAL(X) (((uint32_t)(X) & 0x7FFFUL) << 0)

#define Flash  ((struct Flash*)(0x52002000UL))
struct AXI {
  volatile const uint32_t AXI_PERIPH_ID_4;
  const volatile uint32_t RESERVED8160[3];
  volatile const uint32_t AXI_PERIPH_ID_0;
  volatile const uint32_t AXI_PERIPH_ID_1;
  volatile const uint32_t AXI_PERIPH_ID_2;
  volatile const uint32_t AXI_PERIPH_ID_3;
  volatile const uint32_t AXI_COMP_ID_0;
  volatile const uint32_t AXI_COMP_ID_1;
  volatile const uint32_t AXI_COMP_ID_2;
  volatile const uint32_t AXI_COMP_ID_3;
  const volatile uint32_t RESERVED8200[2];
  volatile uint32_t AXI_TARG1_FN_MOD_ISS_BM;
  const volatile uint32_t RESERVED8228[6];
  volatile uint32_t AXI_TARG1_FN_MOD2;
  const volatile uint32_t RESERVED8236[1];
  volatile uint32_t AXI_TARG1_FN_MOD_LB;
  const volatile uint32_t RESERVED8456[54];
  volatile uint32_t AXI_TARG1_FN_MOD;
  const volatile uint32_t RESERVED12296[959];
  volatile uint32_t AXI_TARG2_FN_MOD_ISS_BM;
  const volatile uint32_t RESERVED12324[6];
  volatile uint32_t AXI_TARG2_FN_MOD2;
  const volatile uint32_t RESERVED12332[1];
  volatile uint32_t AXI_TARG2_FN_MOD_LB;
  const volatile uint32_t RESERVED12552[54];
  volatile uint32_t AXI_TARG2_FN_MOD;
  const volatile uint32_t RESERVED16392[959];
  volatile uint32_t AXI_TARG3_FN_MOD_ISS_BM;
  const volatile uint32_t RESERVED20488[1023];
  volatile uint32_t AXI_TARG4_FN_MOD_ISS_BM;
  const volatile uint32_t RESERVED24584[1023];
  volatile uint32_t AXI_TARG5_FN_MOD_ISS_BM;
  const volatile uint32_t RESERVED28680[1023];
  volatile uint32_t AXI_TARG6_FN_MOD_ISS_BM;
  const volatile uint32_t RESERVED32780[1024];
  volatile uint32_t AXI_TARG7_FN_MOD_ISS_BM;
  const volatile uint32_t RESERVED32804[5];
  volatile uint32_t AXI_TARG7_FN_MOD2;
  const volatile uint32_t RESERVED33032[56];
  volatile uint32_t AXI_TARG7_FN_MOD;
  const volatile uint32_t RESERVED270372[59334];
  volatile uint32_t AXI_INI1_FN_MOD2;
  volatile uint32_t AXI_INI1_FN_MOD_AHB;
  const volatile uint32_t RESERVED270592[53];
  volatile uint32_t AXI_INI1_READ_QOS;
  volatile uint32_t AXI_INI1_WRITE_QOS;
  volatile uint32_t AXI_INI1_FN_MOD;
  const volatile uint32_t RESERVED274688[1021];
  volatile uint32_t AXI_INI2_READ_QOS;
  volatile uint32_t AXI_INI2_WRITE_QOS;
  volatile uint32_t AXI_INI2_FN_MOD;
  const volatile uint32_t RESERVED278564[966];
  volatile uint32_t AXI_INI3_FN_MOD2;
  volatile uint32_t AXI_INI3_FN_MOD_AHB;
  const volatile uint32_t RESERVED278784[53];
  volatile uint32_t AXI_INI3_READ_QOS;
  volatile uint32_t AXI_INI3_WRITE_QOS;
  volatile uint32_t AXI_INI3_FN_MOD;
  const volatile uint32_t RESERVED282880[1021];
  volatile uint32_t AXI_INI4_READ_QOS;
  volatile uint32_t AXI_INI4_WRITE_QOS;
  volatile uint32_t AXI_INI4_FN_MOD;
  const volatile uint32_t RESERVED286976[1021];
  volatile uint32_t AXI_INI5_READ_QOS;
  volatile uint32_t AXI_INI5_WRITE_QOS;
  volatile uint32_t AXI_INI5_FN_MOD;
  const volatile uint32_t RESERVED291072[1021];
  volatile uint32_t AXI_INI6_READ_QOS;
  volatile uint32_t AXI_INI6_WRITE_QOS;
  volatile uint32_t AXI_INI6_FN_MOD;
};
#define AXI_AXI_PERIPH_ID_4_JEP106CON          (0xFUL << 0) 
#define AXI_AXI_PERIPH_ID_4_JEP106CON_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define AXI_AXI_PERIPH_ID_4_KCOUNT4          (0xFUL << 4) 
#define AXI_AXI_PERIPH_ID_4_KCOUNT4_VAL(X) (((uint32_t)(X) & 0xFUL) << 4)
#define AXI_AXI_PERIPH_ID_0_PARTNUM          (0xFFUL << 0) 
#define AXI_AXI_PERIPH_ID_0_PARTNUM_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define AXI_AXI_PERIPH_ID_1_PARTNUM          (0xFUL << 0) 
#define AXI_AXI_PERIPH_ID_1_PARTNUM_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define AXI_AXI_PERIPH_ID_1_JEP106I          (0xFUL << 4) 
#define AXI_AXI_PERIPH_ID_1_JEP106I_VAL(X) (((uint32_t)(X) & 0xFUL) << 4)
#define AXI_AXI_PERIPH_ID_2_JEP106ID          (0x7UL << 0) 
#define AXI_AXI_PERIPH_ID_2_JEP106ID_VAL(X) (((uint32_t)(X) & 0x7UL) << 0)
#define AXI_AXI_PERIPH_ID_2_JEDEC          (0x1UL << 3) 
#define AXI_AXI_PERIPH_ID_2_JEDEC_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define AXI_AXI_PERIPH_ID_2_REVISION          (0xFUL << 4) 
#define AXI_AXI_PERIPH_ID_2_REVISION_VAL(X) (((uint32_t)(X) & 0xFUL) << 4)
#define AXI_AXI_PERIPH_ID_3_CUST_MOD_NUM          (0xFUL << 0) 
#define AXI_AXI_PERIPH_ID_3_CUST_MOD_NUM_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define AXI_AXI_PERIPH_ID_3_REV_AND          (0xFUL << 4) 
#define AXI_AXI_PERIPH_ID_3_REV_AND_VAL(X) (((uint32_t)(X) & 0xFUL) << 4)
#define AXI_AXI_COMP_ID_0_PREAMBLE          (0xFFUL << 0) 
#define AXI_AXI_COMP_ID_0_PREAMBLE_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define AXI_AXI_COMP_ID_1_PREAMBLE          (0xFUL << 0) 
#define AXI_AXI_COMP_ID_1_PREAMBLE_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define AXI_AXI_COMP_ID_1_CLASS          (0xFUL << 4) 
#define AXI_AXI_COMP_ID_1_CLASS_VAL(X) (((uint32_t)(X) & 0xFUL) << 4)
#define AXI_AXI_COMP_ID_2_PREAMBLE          (0xFFUL << 0) 
#define AXI_AXI_COMP_ID_2_PREAMBLE_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define AXI_AXI_COMP_ID_3_PREAMBLE          (0xFFUL << 0) 
#define AXI_AXI_COMP_ID_3_PREAMBLE_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define AXI_AXI_TARG1_FN_MOD_ISS_BM_READ_ISS_OVERRIDE          (0x1UL << 0) 
#define AXI_AXI_TARG1_FN_MOD_ISS_BM_READ_ISS_OVERRIDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define AXI_AXI_TARG1_FN_MOD_ISS_BM_WRITE_ISS_OVERRIDE          (0x1UL << 1) 
#define AXI_AXI_TARG1_FN_MOD_ISS_BM_WRITE_ISS_OVERRIDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define AXI_AXI_TARG2_FN_MOD_ISS_BM_READ_ISS_OVERRIDE          (0x1UL << 0) 
#define AXI_AXI_TARG2_FN_MOD_ISS_BM_READ_ISS_OVERRIDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define AXI_AXI_TARG2_FN_MOD_ISS_BM_WRITE_ISS_OVERRIDE          (0x1UL << 1) 
#define AXI_AXI_TARG2_FN_MOD_ISS_BM_WRITE_ISS_OVERRIDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define AXI_AXI_TARG3_FN_MOD_ISS_BM_READ_ISS_OVERRIDE          (0x1UL << 0) 
#define AXI_AXI_TARG3_FN_MOD_ISS_BM_READ_ISS_OVERRIDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define AXI_AXI_TARG3_FN_MOD_ISS_BM_WRITE_ISS_OVERRIDE          (0x1UL << 1) 
#define AXI_AXI_TARG3_FN_MOD_ISS_BM_WRITE_ISS_OVERRIDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define AXI_AXI_TARG4_FN_MOD_ISS_BM_READ_ISS_OVERRIDE          (0x1UL << 0) 
#define AXI_AXI_TARG4_FN_MOD_ISS_BM_READ_ISS_OVERRIDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define AXI_AXI_TARG4_FN_MOD_ISS_BM_WRITE_ISS_OVERRIDE          (0x1UL << 1) 
#define AXI_AXI_TARG4_FN_MOD_ISS_BM_WRITE_ISS_OVERRIDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define AXI_AXI_TARG5_FN_MOD_ISS_BM_READ_ISS_OVERRIDE          (0x1UL << 0) 
#define AXI_AXI_TARG5_FN_MOD_ISS_BM_READ_ISS_OVERRIDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define AXI_AXI_TARG5_FN_MOD_ISS_BM_WRITE_ISS_OVERRIDE          (0x1UL << 1) 
#define AXI_AXI_TARG5_FN_MOD_ISS_BM_WRITE_ISS_OVERRIDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define AXI_AXI_TARG6_FN_MOD_ISS_BM_READ_ISS_OVERRIDE          (0x1UL << 0) 
#define AXI_AXI_TARG6_FN_MOD_ISS_BM_READ_ISS_OVERRIDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define AXI_AXI_TARG6_FN_MOD_ISS_BM_WRITE_ISS_OVERRIDE          (0x1UL << 1) 
#define AXI_AXI_TARG6_FN_MOD_ISS_BM_WRITE_ISS_OVERRIDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define AXI_AXI_TARG7_FN_MOD_ISS_BM_READ_ISS_OVERRIDE          (0x1UL << 0) 
#define AXI_AXI_TARG7_FN_MOD_ISS_BM_READ_ISS_OVERRIDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define AXI_AXI_TARG7_FN_MOD_ISS_BM_WRITE_ISS_OVERRIDE          (0x1UL << 1) 
#define AXI_AXI_TARG7_FN_MOD_ISS_BM_WRITE_ISS_OVERRIDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define AXI_AXI_TARG1_FN_MOD2_BYPASS_MERGE          (0x1UL << 0) 
#define AXI_AXI_TARG1_FN_MOD2_BYPASS_MERGE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define AXI_AXI_TARG2_FN_MOD2_BYPASS_MERGE          (0x1UL << 0) 
#define AXI_AXI_TARG2_FN_MOD2_BYPASS_MERGE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define AXI_AXI_TARG7_FN_MOD2_BYPASS_MERGE          (0x1UL << 0) 
#define AXI_AXI_TARG7_FN_MOD2_BYPASS_MERGE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define AXI_AXI_TARG1_FN_MOD_LB_FN_MOD_LB          (0x1UL << 0) 
#define AXI_AXI_TARG1_FN_MOD_LB_FN_MOD_LB_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define AXI_AXI_TARG2_FN_MOD_LB_FN_MOD_LB          (0x1UL << 0) 
#define AXI_AXI_TARG2_FN_MOD_LB_FN_MOD_LB_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define AXI_AXI_TARG1_FN_MOD_READ_ISS_OVERRIDE          (0x1UL << 0) 
#define AXI_AXI_TARG1_FN_MOD_READ_ISS_OVERRIDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define AXI_AXI_TARG1_FN_MOD_WRITE_ISS_OVERRIDE          (0x1UL << 1) 
#define AXI_AXI_TARG1_FN_MOD_WRITE_ISS_OVERRIDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define AXI_AXI_TARG2_FN_MOD_READ_ISS_OVERRIDE          (0x1UL << 0) 
#define AXI_AXI_TARG2_FN_MOD_READ_ISS_OVERRIDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define AXI_AXI_TARG2_FN_MOD_WRITE_ISS_OVERRIDE          (0x1UL << 1) 
#define AXI_AXI_TARG2_FN_MOD_WRITE_ISS_OVERRIDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define AXI_AXI_TARG7_FN_MOD_READ_ISS_OVERRIDE          (0x1UL << 0) 
#define AXI_AXI_TARG7_FN_MOD_READ_ISS_OVERRIDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define AXI_AXI_TARG7_FN_MOD_WRITE_ISS_OVERRIDE          (0x1UL << 1) 
#define AXI_AXI_TARG7_FN_MOD_WRITE_ISS_OVERRIDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define AXI_AXI_INI1_FN_MOD2_BYPASS_MERGE          (0x1UL << 0) 
#define AXI_AXI_INI1_FN_MOD2_BYPASS_MERGE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define AXI_AXI_INI3_FN_MOD2_BYPASS_MERGE          (0x1UL << 0) 
#define AXI_AXI_INI3_FN_MOD2_BYPASS_MERGE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define AXI_AXI_INI1_FN_MOD_AHB_RD_INC_OVERRIDE          (0x1UL << 0) 
#define AXI_AXI_INI1_FN_MOD_AHB_RD_INC_OVERRIDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define AXI_AXI_INI1_FN_MOD_AHB_WR_INC_OVERRIDE          (0x1UL << 1) 
#define AXI_AXI_INI1_FN_MOD_AHB_WR_INC_OVERRIDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define AXI_AXI_INI3_FN_MOD_AHB_RD_INC_OVERRIDE          (0x1UL << 0) 
#define AXI_AXI_INI3_FN_MOD_AHB_RD_INC_OVERRIDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define AXI_AXI_INI3_FN_MOD_AHB_WR_INC_OVERRIDE          (0x1UL << 1) 
#define AXI_AXI_INI3_FN_MOD_AHB_WR_INC_OVERRIDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define AXI_AXI_INI1_READ_QOS_AR_QOS          (0xFUL << 0) 
#define AXI_AXI_INI1_READ_QOS_AR_QOS_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define AXI_AXI_INI2_READ_QOS_AR_QOS          (0xFUL << 0) 
#define AXI_AXI_INI2_READ_QOS_AR_QOS_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define AXI_AXI_INI3_READ_QOS_AR_QOS          (0xFUL << 0) 
#define AXI_AXI_INI3_READ_QOS_AR_QOS_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define AXI_AXI_INI4_READ_QOS_AR_QOS          (0xFUL << 0) 
#define AXI_AXI_INI4_READ_QOS_AR_QOS_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define AXI_AXI_INI5_READ_QOS_AR_QOS          (0xFUL << 0) 
#define AXI_AXI_INI5_READ_QOS_AR_QOS_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define AXI_AXI_INI6_READ_QOS_AR_QOS          (0xFUL << 0) 
#define AXI_AXI_INI6_READ_QOS_AR_QOS_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define AXI_AXI_INI1_WRITE_QOS_AW_QOS          (0xFUL << 0) 
#define AXI_AXI_INI1_WRITE_QOS_AW_QOS_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define AXI_AXI_INI2_WRITE_QOS_AW_QOS          (0xFUL << 0) 
#define AXI_AXI_INI2_WRITE_QOS_AW_QOS_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define AXI_AXI_INI3_WRITE_QOS_AW_QOS          (0xFUL << 0) 
#define AXI_AXI_INI3_WRITE_QOS_AW_QOS_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define AXI_AXI_INI4_WRITE_QOS_AW_QOS          (0xFUL << 0) 
#define AXI_AXI_INI4_WRITE_QOS_AW_QOS_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define AXI_AXI_INI5_WRITE_QOS_AW_QOS          (0xFUL << 0) 
#define AXI_AXI_INI5_WRITE_QOS_AW_QOS_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define AXI_AXI_INI6_WRITE_QOS_AW_QOS          (0xFUL << 0) 
#define AXI_AXI_INI6_WRITE_QOS_AW_QOS_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define AXI_AXI_INI1_FN_MOD_READ_ISS_OVERRIDE          (0x1UL << 0) 
#define AXI_AXI_INI1_FN_MOD_READ_ISS_OVERRIDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define AXI_AXI_INI1_FN_MOD_WRITE_ISS_OVERRIDE          (0x1UL << 1) 
#define AXI_AXI_INI1_FN_MOD_WRITE_ISS_OVERRIDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define AXI_AXI_INI2_FN_MOD_READ_ISS_OVERRIDE          (0x1UL << 0) 
#define AXI_AXI_INI2_FN_MOD_READ_ISS_OVERRIDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define AXI_AXI_INI2_FN_MOD_WRITE_ISS_OVERRIDE          (0x1UL << 1) 
#define AXI_AXI_INI2_FN_MOD_WRITE_ISS_OVERRIDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define AXI_AXI_INI3_FN_MOD_READ_ISS_OVERRIDE          (0x1UL << 0) 
#define AXI_AXI_INI3_FN_MOD_READ_ISS_OVERRIDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define AXI_AXI_INI3_FN_MOD_WRITE_ISS_OVERRIDE          (0x1UL << 1) 
#define AXI_AXI_INI3_FN_MOD_WRITE_ISS_OVERRIDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define AXI_AXI_INI4_FN_MOD_READ_ISS_OVERRIDE          (0x1UL << 0) 
#define AXI_AXI_INI4_FN_MOD_READ_ISS_OVERRIDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define AXI_AXI_INI4_FN_MOD_WRITE_ISS_OVERRIDE          (0x1UL << 1) 
#define AXI_AXI_INI4_FN_MOD_WRITE_ISS_OVERRIDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define AXI_AXI_INI5_FN_MOD_READ_ISS_OVERRIDE          (0x1UL << 0) 
#define AXI_AXI_INI5_FN_MOD_READ_ISS_OVERRIDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define AXI_AXI_INI5_FN_MOD_WRITE_ISS_OVERRIDE          (0x1UL << 1) 
#define AXI_AXI_INI5_FN_MOD_WRITE_ISS_OVERRIDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define AXI_AXI_INI6_FN_MOD_READ_ISS_OVERRIDE          (0x1UL << 0) 
#define AXI_AXI_INI6_FN_MOD_READ_ISS_OVERRIDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define AXI_AXI_INI6_FN_MOD_WRITE_ISS_OVERRIDE          (0x1UL << 1) 
#define AXI_AXI_INI6_FN_MOD_WRITE_ISS_OVERRIDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)

#define AXI  ((struct AXI*)(0x51000000UL))
struct DCMI {
  volatile uint32_t CR;
  volatile const uint32_t SR;
  volatile const uint32_t RIS;
  volatile uint32_t IER;
  volatile const uint32_t MIS;
  volatile uint32_t ICR;
  volatile uint32_t ESCR;
  volatile uint32_t ESUR;
  volatile uint32_t CWSTRT;
  volatile uint32_t CWSIZE;
  volatile const uint32_t DR;
};
