via/viaems/src/platforms/stm32h743/device.h
#define DCMI_CR_OELS          (0x1UL << 20) 
#define DCMI_CR_OELS_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define DCMI_CR_LSM          (0x1UL << 19) 
#define DCMI_CR_LSM_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define DCMI_CR_OEBS          (0x1UL << 18) 
#define DCMI_CR_OEBS_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define DCMI_CR_BSM          (0x3UL << 16) 
#define DCMI_CR_BSM_VAL(X) (((uint32_t)(X) & 0x3UL) << 16)
#define DCMI_CR_ENABLE          (0x1UL << 14) 
#define DCMI_CR_ENABLE_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define DCMI_CR_EDM          (0x3UL << 10) 
#define DCMI_CR_EDM_VAL(X) (((uint32_t)(X) & 0x3UL) << 10)
#define DCMI_CR_FCRC          (0x3UL << 8) 
#define DCMI_CR_FCRC_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define DCMI_CR_VSPOL          (0x1UL << 7) 
#define DCMI_CR_VSPOL_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define DCMI_CR_HSPOL          (0x1UL << 6) 
#define DCMI_CR_HSPOL_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define DCMI_CR_PCKPOL          (0x1UL << 5) 
#define DCMI_CR_PCKPOL_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define DCMI_CR_ESS          (0x1UL << 4) 
#define DCMI_CR_ESS_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define DCMI_CR_JPEG          (0x1UL << 3) 
#define DCMI_CR_JPEG_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define DCMI_CR_CROP          (0x1UL << 2) 
#define DCMI_CR_CROP_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define DCMI_CR_CM          (0x1UL << 1) 
#define DCMI_CR_CM_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define DCMI_CR_CAPTURE          (0x1UL << 0) 
#define DCMI_CR_CAPTURE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define DCMI_SR_FNE          (0x1UL << 2) 
#define DCMI_SR_FNE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define DCMI_SR_VSYNC          (0x1UL << 1) 
#define DCMI_SR_VSYNC_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define DCMI_SR_HSYNC          (0x1UL << 0) 
#define DCMI_SR_HSYNC_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define DCMI_RIS_LINE_RIS          (0x1UL << 4) 
#define DCMI_RIS_LINE_RIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define DCMI_RIS_VSYNC_RIS          (0x1UL << 3) 
#define DCMI_RIS_VSYNC_RIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define DCMI_RIS_ERR_RIS          (0x1UL << 2) 
#define DCMI_RIS_ERR_RIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define DCMI_RIS_OVR_RIS          (0x1UL << 1) 
#define DCMI_RIS_OVR_RIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define DCMI_RIS_FRAME_RIS          (0x1UL << 0) 
#define DCMI_RIS_FRAME_RIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define DCMI_IER_LINE_IE          (0x1UL << 4) 
#define DCMI_IER_LINE_IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define DCMI_IER_VSYNC_IE          (0x1UL << 3) 
#define DCMI_IER_VSYNC_IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define DCMI_IER_ERR_IE          (0x1UL << 2) 
#define DCMI_IER_ERR_IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define DCMI_IER_OVR_IE          (0x1UL << 1) 
#define DCMI_IER_OVR_IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define DCMI_IER_FRAME_IE          (0x1UL << 0) 
#define DCMI_IER_FRAME_IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define DCMI_MIS_LINE_MIS          (0x1UL << 4) 
#define DCMI_MIS_LINE_MIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define DCMI_MIS_VSYNC_MIS          (0x1UL << 3) 
#define DCMI_MIS_VSYNC_MIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define DCMI_MIS_ERR_MIS          (0x1UL << 2) 
#define DCMI_MIS_ERR_MIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define DCMI_MIS_OVR_MIS          (0x1UL << 1) 
#define DCMI_MIS_OVR_MIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define DCMI_MIS_FRAME_MIS          (0x1UL << 0) 
#define DCMI_MIS_FRAME_MIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define DCMI_ICR_LINE_ISC          (0x1UL << 4) 
#define DCMI_ICR_LINE_ISC_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define DCMI_ICR_VSYNC_ISC          (0x1UL << 3) 
#define DCMI_ICR_VSYNC_ISC_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define DCMI_ICR_ERR_ISC          (0x1UL << 2) 
#define DCMI_ICR_ERR_ISC_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define DCMI_ICR_OVR_ISC          (0x1UL << 1) 
#define DCMI_ICR_OVR_ISC_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define DCMI_ICR_FRAME_ISC          (0x1UL << 0) 
#define DCMI_ICR_FRAME_ISC_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define DCMI_ESCR_FEC          (0xFFUL << 24) 
#define DCMI_ESCR_FEC_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define DCMI_ESCR_LEC          (0xFFUL << 16) 
#define DCMI_ESCR_LEC_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define DCMI_ESCR_LSC          (0xFFUL << 8) 
#define DCMI_ESCR_LSC_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define DCMI_ESCR_FSC          (0xFFUL << 0) 
#define DCMI_ESCR_FSC_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DCMI_ESUR_FEU          (0xFFUL << 24) 
#define DCMI_ESUR_FEU_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define DCMI_ESUR_LEU          (0xFFUL << 16) 
#define DCMI_ESUR_LEU_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define DCMI_ESUR_LSU          (0xFFUL << 8) 
#define DCMI_ESUR_LSU_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define DCMI_ESUR_FSU          (0xFFUL << 0) 
#define DCMI_ESUR_FSU_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DCMI_CWSTRT_VST          (0x1FFFUL << 16) 
#define DCMI_CWSTRT_VST_VAL(X) (((uint32_t)(X) & 0x1FFFUL) << 16)
#define DCMI_CWSTRT_HOFFCNT          (0x3FFFUL << 0) 
#define DCMI_CWSTRT_HOFFCNT_VAL(X) (((uint32_t)(X) & 0x3FFFUL) << 0)
#define DCMI_CWSIZE_VLINE          (0x3FFFUL << 16) 
#define DCMI_CWSIZE_VLINE_VAL(X) (((uint32_t)(X) & 0x3FFFUL) << 16)
#define DCMI_CWSIZE_CAPCNT          (0x3FFFUL << 0) 
#define DCMI_CWSIZE_CAPCNT_VAL(X) (((uint32_t)(X) & 0x3FFFUL) << 0)
#define DCMI_DR_Byte3          (0xFFUL << 24) 
#define DCMI_DR_Byte3_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define DCMI_DR_Byte2          (0xFFUL << 16) 
#define DCMI_DR_Byte2_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define DCMI_DR_Byte1          (0xFFUL << 8) 
#define DCMI_DR_Byte1_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define DCMI_DR_Byte0          (0xFFUL << 0) 
#define DCMI_DR_Byte0_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)

#define DCMI  ((struct DCMI*)(0x48020000UL))
struct OTG1_HS_GLOBAL {
  volatile uint32_t OTG_HS_GOTGCTL;
  volatile uint32_t OTG_HS_GOTGINT;
  volatile uint32_t OTG_HS_GAHBCFG;
  volatile uint32_t OTG_HS_GUSBCFG;
  volatile uint32_t OTG_HS_GRSTCTL;
  volatile uint32_t OTG_HS_GINTSTS;
  volatile uint32_t OTG_HS_GINTMSK;
  volatile const uint32_t OTG_HS_GRXSTSR_Host;
  volatile const uint32_t OTG_HS_GRXSTSR_Device;
  volatile const uint32_t OTG_HS_GRXSTSP_Host;
  volatile const uint32_t OTG_HS_GRXSTSP_Device;
  volatile uint32_t OTG_HS_GRXFSIZ;
  volatile uint32_t OTG_HS_HNPTXFSIZ_Host;
  volatile uint32_t OTG_HS_DIEPTXF0_Device;
  volatile const uint32_t OTG_HS_HNPTXSTS;
  const volatile uint32_t RESERVED56[2];
  volatile uint32_t OTG_HS_GCCFG;
  volatile uint32_t OTG_HS_CID;
  const volatile uint32_t RESERVED84[5];
  volatile uint32_t OTG_HS_GLPMCFG;
  const volatile uint32_t RESERVED256[42];
  volatile uint32_t OTG_HS_HPTXFSIZ;
  volatile uint32_t OTG_HS_DIEPTXF1;
  volatile uint32_t OTG_HS_DIEPTXF2;
  volatile uint32_t OTG_HS_DIEPTXF3;
  volatile uint32_t OTG_HS_DIEPTXF4;
  volatile uint32_t OTG_HS_DIEPTXF5;
  volatile uint32_t OTG_HS_DIEPTXF6;
  volatile uint32_t OTG_HS_DIEPTXF7;
  volatile uint32_t OTG_HS_DIEPTXF8;
};
