via/viaems/src/platforms/stm32h743/device.h
#define OTG1_HS_GLOBAL_OTG_HS_GRXSTSP_Device_PKTSTS          (0xFUL << 17) 
#define OTG1_HS_GLOBAL_OTG_HS_GRXSTSP_Device_PKTSTS_VAL(X) (((uint32_t)(X) & 0xFUL) << 17)
#define OTG1_HS_GLOBAL_OTG_HS_GRXSTSP_Device_FRMNUM          (0xFUL << 21) 
#define OTG1_HS_GLOBAL_OTG_HS_GRXSTSP_Device_FRMNUM_VAL(X) (((uint32_t)(X) & 0xFUL) << 21)
#define OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_LPMEN          (0x1UL << 0) 
#define OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_LPMEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_LPMACK          (0x1UL << 1) 
#define OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_LPMACK_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_BESL          (0xFUL << 2) 
#define OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_BESL_VAL(X) (((uint32_t)(X) & 0xFUL) << 2)
#define OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_REMWAKE          (0x1UL << 6) 
#define OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_REMWAKE_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_L1SSEN          (0x1UL << 7) 
#define OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_L1SSEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_BESLTHRS          (0xFUL << 8) 
#define OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_BESLTHRS_VAL(X) (((uint32_t)(X) & 0xFUL) << 8)
#define OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_L1DSEN          (0x1UL << 12) 
#define OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_L1DSEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_LPMRST          (0x3UL << 13) 
#define OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_LPMRST_VAL(X) (((uint32_t)(X) & 0x3UL) << 13)
#define OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_SLPSTS          (0x1UL << 15) 
#define OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_SLPSTS_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_L1RSMOK          (0x1UL << 16) 
#define OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_L1RSMOK_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_LPMCHIDX          (0xFUL << 17) 
#define OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_LPMCHIDX_VAL(X) (((uint32_t)(X) & 0xFUL) << 17)
#define OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_LPMRCNT          (0x7UL << 21) 
#define OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_LPMRCNT_VAL(X) (((uint32_t)(X) & 0x7UL) << 21)
#define OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_SNDLPM          (0x1UL << 24) 
#define OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_SNDLPM_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_LPMRCNTSTS          (0x7UL << 25) 
#define OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_LPMRCNTSTS_VAL(X) (((uint32_t)(X) & 0x7UL) << 25)
#define OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_ENBESL          (0x1UL << 28) 
#define OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_ENBESL_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)

#define OTG1_HS_GLOBAL  ((struct OTG1_HS_GLOBAL*)(0x40040000UL))
struct OTG2_HS_GLOBAL {
  volatile uint32_t OTG_HS_GOTGCTL;
  volatile uint32_t OTG_HS_GOTGINT;
  volatile uint32_t OTG_HS_GAHBCFG;
  volatile uint32_t OTG_HS_GUSBCFG;
  volatile uint32_t OTG_HS_GRSTCTL;
  volatile uint32_t OTG_HS_GINTSTS;
  volatile uint32_t OTG_HS_GINTMSK;
  volatile const uint32_t OTG_HS_GRXSTSR_Host;
  volatile const uint32_t OTG_HS_GRXSTSR_Device;
  volatile const uint32_t OTG_HS_GRXSTSP_Host;
  volatile const uint32_t OTG_HS_GRXSTSP_Device;
  volatile uint32_t OTG_HS_GRXFSIZ;
  volatile uint32_t OTG_HS_HNPTXFSIZ_Host;
  volatile uint32_t OTG_HS_DIEPTXF0_Device;
  volatile const uint32_t OTG_HS_HNPTXSTS;
  const volatile uint32_t RESERVED56[2];
  volatile uint32_t OTG_HS_GCCFG;
  volatile uint32_t OTG_HS_CID;
  const volatile uint32_t RESERVED84[5];
  volatile uint32_t OTG_HS_GLPMCFG;
  const volatile uint32_t RESERVED256[42];
  volatile uint32_t OTG_HS_HPTXFSIZ;
  volatile uint32_t OTG_HS_DIEPTXF1;
  volatile uint32_t OTG_HS_DIEPTXF2;
  volatile uint32_t OTG_HS_DIEPTXF3;
  volatile uint32_t OTG_HS_DIEPTXF4;
  volatile uint32_t OTG_HS_DIEPTXF5;
  volatile uint32_t OTG_HS_DIEPTXF6;
  volatile uint32_t OTG_HS_DIEPTXF7;
  volatile uint32_t OTG_HS_DIEPTXF8;
};
#define OTG2_HS_GLOBAL_OTG_HS_GOTGCTL_SRQSCS          (0x1UL << 0) 
#define OTG2_HS_GLOBAL_OTG_HS_GOTGCTL_SRQSCS_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG2_HS_GLOBAL_OTG_HS_GOTGCTL_SRQ          (0x1UL << 1) 
#define OTG2_HS_GLOBAL_OTG_HS_GOTGCTL_SRQ_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG2_HS_GLOBAL_OTG_HS_GOTGCTL_HNGSCS          (0x1UL << 8) 
#define OTG2_HS_GLOBAL_OTG_HS_GOTGCTL_HNGSCS_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OTG2_HS_GLOBAL_OTG_HS_GOTGCTL_HNPRQ          (0x1UL << 9) 
#define OTG2_HS_GLOBAL_OTG_HS_GOTGCTL_HNPRQ_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define OTG2_HS_GLOBAL_OTG_HS_GOTGCTL_HSHNPEN          (0x1UL << 10) 
#define OTG2_HS_GLOBAL_OTG_HS_GOTGCTL_HSHNPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define OTG2_HS_GLOBAL_OTG_HS_GOTGCTL_DHNPEN          (0x1UL << 11) 
#define OTG2_HS_GLOBAL_OTG_HS_GOTGCTL_DHNPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define OTG2_HS_GLOBAL_OTG_HS_GOTGCTL_CIDSTS          (0x1UL << 16) 
#define OTG2_HS_GLOBAL_OTG_HS_GOTGCTL_CIDSTS_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define OTG2_HS_GLOBAL_OTG_HS_GOTGCTL_DBCT          (0x1UL << 17) 
#define OTG2_HS_GLOBAL_OTG_HS_GOTGCTL_DBCT_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define OTG2_HS_GLOBAL_OTG_HS_GOTGCTL_ASVLD          (0x1UL << 18) 
#define OTG2_HS_GLOBAL_OTG_HS_GOTGCTL_ASVLD_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define OTG2_HS_GLOBAL_OTG_HS_GOTGCTL_BSVLD          (0x1UL << 19) 
#define OTG2_HS_GLOBAL_OTG_HS_GOTGCTL_BSVLD_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define OTG2_HS_GLOBAL_OTG_HS_GOTGCTL_EHEN          (0x1UL << 12) 
#define OTG2_HS_GLOBAL_OTG_HS_GOTGCTL_EHEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define OTG2_HS_GLOBAL_OTG_HS_GOTGINT_SEDET          (0x1UL << 2) 
#define OTG2_HS_GLOBAL_OTG_HS_GOTGINT_SEDET_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define OTG2_HS_GLOBAL_OTG_HS_GOTGINT_SRSSCHG          (0x1UL << 8) 
#define OTG2_HS_GLOBAL_OTG_HS_GOTGINT_SRSSCHG_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OTG2_HS_GLOBAL_OTG_HS_GOTGINT_HNSSCHG          (0x1UL << 9) 
#define OTG2_HS_GLOBAL_OTG_HS_GOTGINT_HNSSCHG_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define OTG2_HS_GLOBAL_OTG_HS_GOTGINT_HNGDET          (0x1UL << 17) 
#define OTG2_HS_GLOBAL_OTG_HS_GOTGINT_HNGDET_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define OTG2_HS_GLOBAL_OTG_HS_GOTGINT_ADTOCHG          (0x1UL << 18) 
#define OTG2_HS_GLOBAL_OTG_HS_GOTGINT_ADTOCHG_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define OTG2_HS_GLOBAL_OTG_HS_GOTGINT_DBCDNE          (0x1UL << 19) 
#define OTG2_HS_GLOBAL_OTG_HS_GOTGINT_DBCDNE_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define OTG2_HS_GLOBAL_OTG_HS_GOTGINT_IDCHNG          (0x1UL << 20) 
#define OTG2_HS_GLOBAL_OTG_HS_GOTGINT_IDCHNG_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define OTG2_HS_GLOBAL_OTG_HS_GAHBCFG_GINT          (0x1UL << 0) 
#define OTG2_HS_GLOBAL_OTG_HS_GAHBCFG_GINT_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG2_HS_GLOBAL_OTG_HS_GAHBCFG_HBSTLEN          (0xFUL << 1) 
#define OTG2_HS_GLOBAL_OTG_HS_GAHBCFG_HBSTLEN_VAL(X) (((uint32_t)(X) & 0xFUL) << 1)
#define OTG2_HS_GLOBAL_OTG_HS_GAHBCFG_DMAEN          (0x1UL << 5) 
#define OTG2_HS_GLOBAL_OTG_HS_GAHBCFG_DMAEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define OTG2_HS_GLOBAL_OTG_HS_GAHBCFG_TXFELVL          (0x1UL << 7) 
#define OTG2_HS_GLOBAL_OTG_HS_GAHBCFG_TXFELVL_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define OTG2_HS_GLOBAL_OTG_HS_GAHBCFG_PTXFELVL          (0x1UL << 8) 
#define OTG2_HS_GLOBAL_OTG_HS_GAHBCFG_PTXFELVL_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OTG2_HS_GLOBAL_OTG_HS_GUSBCFG_TOCAL          (0x7UL << 0) 
#define OTG2_HS_GLOBAL_OTG_HS_GUSBCFG_TOCAL_VAL(X) (((uint32_t)(X) & 0x7UL) << 0)
#define OTG2_HS_GLOBAL_OTG_HS_GUSBCFG_PHYSEL          (0x1UL << 6) 
#define OTG2_HS_GLOBAL_OTG_HS_GUSBCFG_PHYSEL_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG2_HS_GLOBAL_OTG_HS_GUSBCFG_SRPCAP          (0x1UL << 8) 
#define OTG2_HS_GLOBAL_OTG_HS_GUSBCFG_SRPCAP_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OTG2_HS_GLOBAL_OTG_HS_GUSBCFG_HNPCAP          (0x1UL << 9) 
#define OTG2_HS_GLOBAL_OTG_HS_GUSBCFG_HNPCAP_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define OTG2_HS_GLOBAL_OTG_HS_GUSBCFG_TRDT          (0xFUL << 10) 
#define OTG2_HS_GLOBAL_OTG_HS_GUSBCFG_TRDT_VAL(X) (((uint32_t)(X) & 0xFUL) << 10)
#define OTG2_HS_GLOBAL_OTG_HS_GUSBCFG_PHYLPCS          (0x1UL << 15) 
#define OTG2_HS_GLOBAL_OTG_HS_GUSBCFG_PHYLPCS_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define OTG2_HS_GLOBAL_OTG_HS_GUSBCFG_ULPIFSLS          (0x1UL << 17) 
#define OTG2_HS_GLOBAL_OTG_HS_GUSBCFG_ULPIFSLS_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define OTG2_HS_GLOBAL_OTG_HS_GUSBCFG_ULPIAR          (0x1UL << 18) 
#define OTG2_HS_GLOBAL_OTG_HS_GUSBCFG_ULPIAR_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define OTG2_HS_GLOBAL_OTG_HS_GUSBCFG_ULPICSM          (0x1UL << 19) 
#define OTG2_HS_GLOBAL_OTG_HS_GUSBCFG_ULPICSM_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define OTG2_HS_GLOBAL_OTG_HS_GUSBCFG_ULPIEVBUSD          (0x1UL << 20) 
#define OTG2_HS_GLOBAL_OTG_HS_GUSBCFG_ULPIEVBUSD_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define OTG2_HS_GLOBAL_OTG_HS_GUSBCFG_ULPIEVBUSI          (0x1UL << 21) 
#define OTG2_HS_GLOBAL_OTG_HS_GUSBCFG_ULPIEVBUSI_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define OTG2_HS_GLOBAL_OTG_HS_GUSBCFG_TSDPS          (0x1UL << 22) 
#define OTG2_HS_GLOBAL_OTG_HS_GUSBCFG_TSDPS_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define OTG2_HS_GLOBAL_OTG_HS_GUSBCFG_PCCI          (0x1UL << 23) 
#define OTG2_HS_GLOBAL_OTG_HS_GUSBCFG_PCCI_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define OTG2_HS_GLOBAL_OTG_HS_GUSBCFG_PTCI          (0x1UL << 24) 
#define OTG2_HS_GLOBAL_OTG_HS_GUSBCFG_PTCI_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define OTG2_HS_GLOBAL_OTG_HS_GUSBCFG_ULPIIPD          (0x1UL << 25) 
#define OTG2_HS_GLOBAL_OTG_HS_GUSBCFG_ULPIIPD_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define OTG2_HS_GLOBAL_OTG_HS_GUSBCFG_FHMOD          (0x1UL << 29) 
#define OTG2_HS_GLOBAL_OTG_HS_GUSBCFG_FHMOD_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define OTG2_HS_GLOBAL_OTG_HS_GUSBCFG_FDMOD          (0x1UL << 30) 
#define OTG2_HS_GLOBAL_OTG_HS_GUSBCFG_FDMOD_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define OTG2_HS_GLOBAL_OTG_HS_GRSTCTL_CSRST          (0x1UL << 0) 
#define OTG2_HS_GLOBAL_OTG_HS_GRSTCTL_CSRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG2_HS_GLOBAL_OTG_HS_GRSTCTL_HSRST          (0x1UL << 1) 
#define OTG2_HS_GLOBAL_OTG_HS_GRSTCTL_HSRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG2_HS_GLOBAL_OTG_HS_GRSTCTL_FCRST          (0x1UL << 2) 
#define OTG2_HS_GLOBAL_OTG_HS_GRSTCTL_FCRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define OTG2_HS_GLOBAL_OTG_HS_GRSTCTL_RXFFLSH          (0x1UL << 4) 
#define OTG2_HS_GLOBAL_OTG_HS_GRSTCTL_RXFFLSH_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG2_HS_GLOBAL_OTG_HS_GRSTCTL_TXFFLSH          (0x1UL << 5) 
#define OTG2_HS_GLOBAL_OTG_HS_GRSTCTL_TXFFLSH_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define OTG2_HS_GLOBAL_OTG_HS_GRSTCTL_TXFNUM          (0x1FUL << 6) 
#define OTG2_HS_GLOBAL_OTG_HS_GRSTCTL_TXFNUM_VAL(X) (((uint32_t)(X) & 0x1FUL) << 6)
#define OTG2_HS_GLOBAL_OTG_HS_GRSTCTL_AHBIDL          (0x1UL << 31) 
#define OTG2_HS_GLOBAL_OTG_HS_GRSTCTL_AHBIDL_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG2_HS_GLOBAL_OTG_HS_GRSTCTL_DMAREQ          (0x1UL << 30) 
#define OTG2_HS_GLOBAL_OTG_HS_GRSTCTL_DMAREQ_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define OTG2_HS_GLOBAL_OTG_HS_GINTSTS_CMOD          (0x1UL << 0) 
#define OTG2_HS_GLOBAL_OTG_HS_GINTSTS_CMOD_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG2_HS_GLOBAL_OTG_HS_GINTSTS_MMIS          (0x1UL << 1) 
#define OTG2_HS_GLOBAL_OTG_HS_GINTSTS_MMIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG2_HS_GLOBAL_OTG_HS_GINTSTS_OTGINT          (0x1UL << 2) 
#define OTG2_HS_GLOBAL_OTG_HS_GINTSTS_OTGINT_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define OTG2_HS_GLOBAL_OTG_HS_GINTSTS_SOF          (0x1UL << 3) 
#define OTG2_HS_GLOBAL_OTG_HS_GINTSTS_SOF_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG2_HS_GLOBAL_OTG_HS_GINTSTS_RXFLVL          (0x1UL << 4) 
#define OTG2_HS_GLOBAL_OTG_HS_GINTSTS_RXFLVL_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG2_HS_GLOBAL_OTG_HS_GINTSTS_NPTXFE          (0x1UL << 5) 
#define OTG2_HS_GLOBAL_OTG_HS_GINTSTS_NPTXFE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define OTG2_HS_GLOBAL_OTG_HS_GINTSTS_GINAKEFF          (0x1UL << 6) 
#define OTG2_HS_GLOBAL_OTG_HS_GINTSTS_GINAKEFF_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG2_HS_GLOBAL_OTG_HS_GINTSTS_BOUTNAKEFF          (0x1UL << 7) 
#define OTG2_HS_GLOBAL_OTG_HS_GINTSTS_BOUTNAKEFF_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define OTG2_HS_GLOBAL_OTG_HS_GINTSTS_ESUSP          (0x1UL << 10) 
#define OTG2_HS_GLOBAL_OTG_HS_GINTSTS_ESUSP_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define OTG2_HS_GLOBAL_OTG_HS_GINTSTS_USBSUSP          (0x1UL << 11) 
#define OTG2_HS_GLOBAL_OTG_HS_GINTSTS_USBSUSP_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define OTG2_HS_GLOBAL_OTG_HS_GINTSTS_USBRST          (0x1UL << 12) 
#define OTG2_HS_GLOBAL_OTG_HS_GINTSTS_USBRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define OTG2_HS_GLOBAL_OTG_HS_GINTSTS_ENUMDNE          (0x1UL << 13) 
#define OTG2_HS_GLOBAL_OTG_HS_GINTSTS_ENUMDNE_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define OTG2_HS_GLOBAL_OTG_HS_GINTSTS_ISOODRP          (0x1UL << 14) 
#define OTG2_HS_GLOBAL_OTG_HS_GINTSTS_ISOODRP_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define OTG2_HS_GLOBAL_OTG_HS_GINTSTS_EOPF          (0x1UL << 15) 
#define OTG2_HS_GLOBAL_OTG_HS_GINTSTS_EOPF_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define OTG2_HS_GLOBAL_OTG_HS_GINTSTS_IEPINT          (0x1UL << 18) 
#define OTG2_HS_GLOBAL_OTG_HS_GINTSTS_IEPINT_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define OTG2_HS_GLOBAL_OTG_HS_GINTSTS_OEPINT          (0x1UL << 19) 
#define OTG2_HS_GLOBAL_OTG_HS_GINTSTS_OEPINT_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define OTG2_HS_GLOBAL_OTG_HS_GINTSTS_IISOIXFR          (0x1UL << 20) 
#define OTG2_HS_GLOBAL_OTG_HS_GINTSTS_IISOIXFR_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define OTG2_HS_GLOBAL_OTG_HS_GINTSTS_PXFR_INCOMPISOOUT          (0x1UL << 21) 
#define OTG2_HS_GLOBAL_OTG_HS_GINTSTS_PXFR_INCOMPISOOUT_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define OTG2_HS_GLOBAL_OTG_HS_GINTSTS_DATAFSUSP          (0x1UL << 22) 
#define OTG2_HS_GLOBAL_OTG_HS_GINTSTS_DATAFSUSP_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define OTG2_HS_GLOBAL_OTG_HS_GINTSTS_HPRTINT          (0x1UL << 24) 
#define OTG2_HS_GLOBAL_OTG_HS_GINTSTS_HPRTINT_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define OTG2_HS_GLOBAL_OTG_HS_GINTSTS_HCINT          (0x1UL << 25) 
#define OTG2_HS_GLOBAL_OTG_HS_GINTSTS_HCINT_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define OTG2_HS_GLOBAL_OTG_HS_GINTSTS_PTXFE          (0x1UL << 26) 
#define OTG2_HS_GLOBAL_OTG_HS_GINTSTS_PTXFE_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define OTG2_HS_GLOBAL_OTG_HS_GINTSTS_CIDSCHG          (0x1UL << 28) 
#define OTG2_HS_GLOBAL_OTG_HS_GINTSTS_CIDSCHG_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define OTG2_HS_GLOBAL_OTG_HS_GINTSTS_DISCINT          (0x1UL << 29) 
#define OTG2_HS_GLOBAL_OTG_HS_GINTSTS_DISCINT_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define OTG2_HS_GLOBAL_OTG_HS_GINTSTS_SRQINT          (0x1UL << 30) 
#define OTG2_HS_GLOBAL_OTG_HS_GINTSTS_SRQINT_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define OTG2_HS_GLOBAL_OTG_HS_GINTSTS_WKUINT          (0x1UL << 31) 
#define OTG2_HS_GLOBAL_OTG_HS_GINTSTS_WKUINT_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG2_HS_GLOBAL_OTG_HS_GINTMSK_MMISM          (0x1UL << 1) 
#define OTG2_HS_GLOBAL_OTG_HS_GINTMSK_MMISM_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG2_HS_GLOBAL_OTG_HS_GINTMSK_OTGINT          (0x1UL << 2) 
#define OTG2_HS_GLOBAL_OTG_HS_GINTMSK_OTGINT_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define OTG2_HS_GLOBAL_OTG_HS_GINTMSK_SOFM          (0x1UL << 3) 
#define OTG2_HS_GLOBAL_OTG_HS_GINTMSK_SOFM_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG2_HS_GLOBAL_OTG_HS_GINTMSK_RXFLVLM          (0x1UL << 4) 
#define OTG2_HS_GLOBAL_OTG_HS_GINTMSK_RXFLVLM_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG2_HS_GLOBAL_OTG_HS_GINTMSK_NPTXFEM          (0x1UL << 5) 
#define OTG2_HS_GLOBAL_OTG_HS_GINTMSK_NPTXFEM_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define OTG2_HS_GLOBAL_OTG_HS_GINTMSK_GINAKEFFM          (0x1UL << 6) 
#define OTG2_HS_GLOBAL_OTG_HS_GINTMSK_GINAKEFFM_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG2_HS_GLOBAL_OTG_HS_GINTMSK_GONAKEFFM          (0x1UL << 7) 
#define OTG2_HS_GLOBAL_OTG_HS_GINTMSK_GONAKEFFM_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define OTG2_HS_GLOBAL_OTG_HS_GINTMSK_ESUSPM          (0x1UL << 10) 
#define OTG2_HS_GLOBAL_OTG_HS_GINTMSK_ESUSPM_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define OTG2_HS_GLOBAL_OTG_HS_GINTMSK_USBSUSPM          (0x1UL << 11) 
#define OTG2_HS_GLOBAL_OTG_HS_GINTMSK_USBSUSPM_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define OTG2_HS_GLOBAL_OTG_HS_GINTMSK_USBRST          (0x1UL << 12) 
#define OTG2_HS_GLOBAL_OTG_HS_GINTMSK_USBRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define OTG2_HS_GLOBAL_OTG_HS_GINTMSK_ENUMDNEM          (0x1UL << 13) 
#define OTG2_HS_GLOBAL_OTG_HS_GINTMSK_ENUMDNEM_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define OTG2_HS_GLOBAL_OTG_HS_GINTMSK_ISOODRPM          (0x1UL << 14) 
#define OTG2_HS_GLOBAL_OTG_HS_GINTMSK_ISOODRPM_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define OTG2_HS_GLOBAL_OTG_HS_GINTMSK_EOPFM          (0x1UL << 15) 
#define OTG2_HS_GLOBAL_OTG_HS_GINTMSK_EOPFM_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define OTG2_HS_GLOBAL_OTG_HS_GINTMSK_IEPINT          (0x1UL << 18) 
#define OTG2_HS_GLOBAL_OTG_HS_GINTMSK_IEPINT_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define OTG2_HS_GLOBAL_OTG_HS_GINTMSK_OEPINT          (0x1UL << 19) 
#define OTG2_HS_GLOBAL_OTG_HS_GINTMSK_OEPINT_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define OTG2_HS_GLOBAL_OTG_HS_GINTMSK_IISOIXFRM          (0x1UL << 20) 
#define OTG2_HS_GLOBAL_OTG_HS_GINTMSK_IISOIXFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define OTG2_HS_GLOBAL_OTG_HS_GINTMSK_PXFRM_IISOOXFRM          (0x1UL << 21) 
#define OTG2_HS_GLOBAL_OTG_HS_GINTMSK_PXFRM_IISOOXFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define OTG2_HS_GLOBAL_OTG_HS_GINTMSK_FSUSPM          (0x1UL << 22) 
#define OTG2_HS_GLOBAL_OTG_HS_GINTMSK_FSUSPM_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define OTG2_HS_GLOBAL_OTG_HS_GINTMSK_PRTIM          (0x1UL << 24) 
#define OTG2_HS_GLOBAL_OTG_HS_GINTMSK_PRTIM_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define OTG2_HS_GLOBAL_OTG_HS_GINTMSK_HCIM          (0x1UL << 25) 
#define OTG2_HS_GLOBAL_OTG_HS_GINTMSK_HCIM_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define OTG2_HS_GLOBAL_OTG_HS_GINTMSK_PTXFEM          (0x1UL << 26) 
#define OTG2_HS_GLOBAL_OTG_HS_GINTMSK_PTXFEM_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define OTG2_HS_GLOBAL_OTG_HS_GINTMSK_CIDSCHGM          (0x1UL << 28) 
#define OTG2_HS_GLOBAL_OTG_HS_GINTMSK_CIDSCHGM_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define OTG2_HS_GLOBAL_OTG_HS_GINTMSK_DISCINT          (0x1UL << 29) 
#define OTG2_HS_GLOBAL_OTG_HS_GINTMSK_DISCINT_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define OTG2_HS_GLOBAL_OTG_HS_GINTMSK_SRQIM          (0x1UL << 30) 
#define OTG2_HS_GLOBAL_OTG_HS_GINTMSK_SRQIM_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define OTG2_HS_GLOBAL_OTG_HS_GINTMSK_WUIM          (0x1UL << 31) 
#define OTG2_HS_GLOBAL_OTG_HS_GINTMSK_WUIM_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG2_HS_GLOBAL_OTG_HS_GINTMSK_RSTDE          (0x1UL << 23) 
#define OTG2_HS_GLOBAL_OTG_HS_GINTMSK_RSTDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define OTG2_HS_GLOBAL_OTG_HS_GINTMSK_LPMINTM          (0x1UL << 27) 
#define OTG2_HS_GLOBAL_OTG_HS_GINTMSK_LPMINTM_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define OTG2_HS_GLOBAL_OTG_HS_GRXSTSR_Host_CHNUM          (0xFUL << 0) 
#define OTG2_HS_GLOBAL_OTG_HS_GRXSTSR_Host_CHNUM_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define OTG2_HS_GLOBAL_OTG_HS_GRXSTSR_Host_BCNT          (0x7FFUL << 4) 
#define OTG2_HS_GLOBAL_OTG_HS_GRXSTSR_Host_BCNT_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 4)
#define OTG2_HS_GLOBAL_OTG_HS_GRXSTSR_Host_DPID          (0x3UL << 15) 
#define OTG2_HS_GLOBAL_OTG_HS_GRXSTSR_Host_DPID_VAL(X) (((uint32_t)(X) & 0x3UL) << 15)
#define OTG2_HS_GLOBAL_OTG_HS_GRXSTSR_Host_PKTSTS          (0xFUL << 17) 
#define OTG2_HS_GLOBAL_OTG_HS_GRXSTSR_Host_PKTSTS_VAL(X) (((uint32_t)(X) & 0xFUL) << 17)
#define OTG2_HS_GLOBAL_OTG_HS_GRXSTSP_Host_CHNUM          (0xFUL << 0) 
#define OTG2_HS_GLOBAL_OTG_HS_GRXSTSP_Host_CHNUM_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define OTG2_HS_GLOBAL_OTG_HS_GRXSTSP_Host_BCNT          (0x7FFUL << 4) 
#define OTG2_HS_GLOBAL_OTG_HS_GRXSTSP_Host_BCNT_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 4)
#define OTG2_HS_GLOBAL_OTG_HS_GRXSTSP_Host_DPID          (0x3UL << 15) 
#define OTG2_HS_GLOBAL_OTG_HS_GRXSTSP_Host_DPID_VAL(X) (((uint32_t)(X) & 0x3UL) << 15)
#define OTG2_HS_GLOBAL_OTG_HS_GRXSTSP_Host_PKTSTS          (0xFUL << 17) 
#define OTG2_HS_GLOBAL_OTG_HS_GRXSTSP_Host_PKTSTS_VAL(X) (((uint32_t)(X) & 0xFUL) << 17)
#define OTG2_HS_GLOBAL_OTG_HS_GRXFSIZ_RXFD          (0xFFFFUL << 0) 
#define OTG2_HS_GLOBAL_OTG_HS_GRXFSIZ_RXFD_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define OTG2_HS_GLOBAL_OTG_HS_HNPTXFSIZ_Host_NPTXFSA          (0xFFFFUL << 0) 
#define OTG2_HS_GLOBAL_OTG_HS_HNPTXFSIZ_Host_NPTXFSA_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define OTG2_HS_GLOBAL_OTG_HS_HNPTXFSIZ_Host_NPTXFD          (0xFFFFUL << 16) 
#define OTG2_HS_GLOBAL_OTG_HS_HNPTXFSIZ_Host_NPTXFD_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define OTG2_HS_GLOBAL_OTG_HS_DIEPTXF0_Device_TX0FSA          (0xFFFFUL << 0) 
#define OTG2_HS_GLOBAL_OTG_HS_DIEPTXF0_Device_TX0FSA_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define OTG2_HS_GLOBAL_OTG_HS_DIEPTXF0_Device_TX0FD          (0xFFFFUL << 16) 
#define OTG2_HS_GLOBAL_OTG_HS_DIEPTXF0_Device_TX0FD_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define OTG2_HS_GLOBAL_OTG_HS_HNPTXSTS_NPTXFSAV          (0xFFFFUL << 0) 
#define OTG2_HS_GLOBAL_OTG_HS_HNPTXSTS_NPTXFSAV_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define OTG2_HS_GLOBAL_OTG_HS_HNPTXSTS_NPTQXSAV          (0xFFUL << 16) 
#define OTG2_HS_GLOBAL_OTG_HS_HNPTXSTS_NPTQXSAV_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define OTG2_HS_GLOBAL_OTG_HS_HNPTXSTS_NPTXQTOP          (0x7FUL << 24) 
#define OTG2_HS_GLOBAL_OTG_HS_HNPTXSTS_NPTXQTOP_VAL(X) (((uint32_t)(X) & 0x7FUL) << 24)
#define OTG2_HS_GLOBAL_OTG_HS_GCCFG_PWRDWN          (0x1UL << 16) 
#define OTG2_HS_GLOBAL_OTG_HS_GCCFG_PWRDWN_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define OTG2_HS_GLOBAL_OTG_HS_GCCFG_BCDEN          (0x1UL << 17) 
#define OTG2_HS_GLOBAL_OTG_HS_GCCFG_BCDEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define OTG2_HS_GLOBAL_OTG_HS_GCCFG_DCDEN          (0x1UL << 18) 
#define OTG2_HS_GLOBAL_OTG_HS_GCCFG_DCDEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define OTG2_HS_GLOBAL_OTG_HS_GCCFG_PDEN          (0x1UL << 19) 
#define OTG2_HS_GLOBAL_OTG_HS_GCCFG_PDEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define OTG2_HS_GLOBAL_OTG_HS_GCCFG_SDEN          (0x1UL << 20) 
#define OTG2_HS_GLOBAL_OTG_HS_GCCFG_SDEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define OTG2_HS_GLOBAL_OTG_HS_GCCFG_VBDEN          (0x1UL << 21) 
#define OTG2_HS_GLOBAL_OTG_HS_GCCFG_VBDEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define OTG2_HS_GLOBAL_OTG_HS_GCCFG_DCDET          (0x1UL << 0) 
#define OTG2_HS_GLOBAL_OTG_HS_GCCFG_DCDET_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG2_HS_GLOBAL_OTG_HS_GCCFG_PDET          (0x1UL << 1) 
#define OTG2_HS_GLOBAL_OTG_HS_GCCFG_PDET_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG2_HS_GLOBAL_OTG_HS_GCCFG_SDET          (0x1UL << 2) 
#define OTG2_HS_GLOBAL_OTG_HS_GCCFG_SDET_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define OTG2_HS_GLOBAL_OTG_HS_GCCFG_PS2DET          (0x1UL << 3) 
#define OTG2_HS_GLOBAL_OTG_HS_GCCFG_PS2DET_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG2_HS_GLOBAL_OTG_HS_CID_PRODUCT_ID          (0xFFFFFFFFUL << 0) 
#define OTG2_HS_GLOBAL_OTG_HS_CID_PRODUCT_ID_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define OTG2_HS_GLOBAL_OTG_HS_HPTXFSIZ_PTXSA          (0xFFFFUL << 0) 
#define OTG2_HS_GLOBAL_OTG_HS_HPTXFSIZ_PTXSA_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define OTG2_HS_GLOBAL_OTG_HS_HPTXFSIZ_PTXFSIZ          (0xFFFFUL << 16) 
#define OTG2_HS_GLOBAL_OTG_HS_HPTXFSIZ_PTXFSIZ_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define OTG2_HS_GLOBAL_OTG_HS_DIEPTXF1_INEPTXSA          (0xFFFFUL << 0) 
