via/viaems/src/platforms/stm32h743/device.h
#define OTG2_HS_GLOBAL_OTG_HS_DIEPTXF1_INEPTXSA_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define OTG2_HS_GLOBAL_OTG_HS_DIEPTXF1_INEPTXFD          (0xFFFFUL << 16) 
#define OTG2_HS_GLOBAL_OTG_HS_DIEPTXF1_INEPTXFD_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define OTG2_HS_GLOBAL_OTG_HS_DIEPTXF2_INEPTXSA          (0xFFFFUL << 0) 
#define OTG2_HS_GLOBAL_OTG_HS_DIEPTXF2_INEPTXSA_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define OTG2_HS_GLOBAL_OTG_HS_DIEPTXF2_INEPTXFD          (0xFFFFUL << 16) 
#define OTG2_HS_GLOBAL_OTG_HS_DIEPTXF2_INEPTXFD_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define OTG2_HS_GLOBAL_OTG_HS_DIEPTXF3_INEPTXSA          (0xFFFFUL << 0) 
#define OTG2_HS_GLOBAL_OTG_HS_DIEPTXF3_INEPTXSA_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define OTG2_HS_GLOBAL_OTG_HS_DIEPTXF3_INEPTXFD          (0xFFFFUL << 16) 
#define OTG2_HS_GLOBAL_OTG_HS_DIEPTXF3_INEPTXFD_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define OTG2_HS_GLOBAL_OTG_HS_DIEPTXF4_INEPTXSA          (0xFFFFUL << 0) 
#define OTG2_HS_GLOBAL_OTG_HS_DIEPTXF4_INEPTXSA_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define OTG2_HS_GLOBAL_OTG_HS_DIEPTXF4_INEPTXFD          (0xFFFFUL << 16) 
#define OTG2_HS_GLOBAL_OTG_HS_DIEPTXF4_INEPTXFD_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define OTG2_HS_GLOBAL_OTG_HS_DIEPTXF5_INEPTXSA          (0xFFFFUL << 0) 
#define OTG2_HS_GLOBAL_OTG_HS_DIEPTXF5_INEPTXSA_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define OTG2_HS_GLOBAL_OTG_HS_DIEPTXF5_INEPTXFD          (0xFFFFUL << 16) 
#define OTG2_HS_GLOBAL_OTG_HS_DIEPTXF5_INEPTXFD_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define OTG2_HS_GLOBAL_OTG_HS_DIEPTXF6_INEPTXSA          (0xFFFFUL << 0) 
#define OTG2_HS_GLOBAL_OTG_HS_DIEPTXF6_INEPTXSA_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define OTG2_HS_GLOBAL_OTG_HS_DIEPTXF6_INEPTXFD          (0xFFFFUL << 16) 
#define OTG2_HS_GLOBAL_OTG_HS_DIEPTXF6_INEPTXFD_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define OTG2_HS_GLOBAL_OTG_HS_DIEPTXF7_INEPTXSA          (0xFFFFUL << 0) 
#define OTG2_HS_GLOBAL_OTG_HS_DIEPTXF7_INEPTXSA_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define OTG2_HS_GLOBAL_OTG_HS_DIEPTXF7_INEPTXFD          (0xFFFFUL << 16) 
#define OTG2_HS_GLOBAL_OTG_HS_DIEPTXF7_INEPTXFD_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define OTG2_HS_GLOBAL_OTG_HS_DIEPTXF8_INEPTXSA          (0xFFFFUL << 0) 
#define OTG2_HS_GLOBAL_OTG_HS_DIEPTXF8_INEPTXSA_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define OTG2_HS_GLOBAL_OTG_HS_DIEPTXF8_INEPTXFD          (0xFFFFUL << 16) 
#define OTG2_HS_GLOBAL_OTG_HS_DIEPTXF8_INEPTXFD_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define OTG2_HS_GLOBAL_OTG_HS_GRXSTSR_Device_EPNUM          (0xFUL << 0) 
#define OTG2_HS_GLOBAL_OTG_HS_GRXSTSR_Device_EPNUM_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define OTG2_HS_GLOBAL_OTG_HS_GRXSTSR_Device_BCNT          (0x7FFUL << 4) 
#define OTG2_HS_GLOBAL_OTG_HS_GRXSTSR_Device_BCNT_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 4)
#define OTG2_HS_GLOBAL_OTG_HS_GRXSTSR_Device_DPID          (0x3UL << 15) 
#define OTG2_HS_GLOBAL_OTG_HS_GRXSTSR_Device_DPID_VAL(X) (((uint32_t)(X) & 0x3UL) << 15)
#define OTG2_HS_GLOBAL_OTG_HS_GRXSTSR_Device_PKTSTS          (0xFUL << 17) 
#define OTG2_HS_GLOBAL_OTG_HS_GRXSTSR_Device_PKTSTS_VAL(X) (((uint32_t)(X) & 0xFUL) << 17)
#define OTG2_HS_GLOBAL_OTG_HS_GRXSTSR_Device_FRMNUM          (0xFUL << 21) 
#define OTG2_HS_GLOBAL_OTG_HS_GRXSTSR_Device_FRMNUM_VAL(X) (((uint32_t)(X) & 0xFUL) << 21)
#define OTG2_HS_GLOBAL_OTG_HS_GRXSTSP_Device_EPNUM          (0xFUL << 0) 
#define OTG2_HS_GLOBAL_OTG_HS_GRXSTSP_Device_EPNUM_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define OTG2_HS_GLOBAL_OTG_HS_GRXSTSP_Device_BCNT          (0x7FFUL << 4) 
#define OTG2_HS_GLOBAL_OTG_HS_GRXSTSP_Device_BCNT_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 4)
#define OTG2_HS_GLOBAL_OTG_HS_GRXSTSP_Device_DPID          (0x3UL << 15) 
#define OTG2_HS_GLOBAL_OTG_HS_GRXSTSP_Device_DPID_VAL(X) (((uint32_t)(X) & 0x3UL) << 15)
#define OTG2_HS_GLOBAL_OTG_HS_GRXSTSP_Device_PKTSTS          (0xFUL << 17) 
#define OTG2_HS_GLOBAL_OTG_HS_GRXSTSP_Device_PKTSTS_VAL(X) (((uint32_t)(X) & 0xFUL) << 17)
#define OTG2_HS_GLOBAL_OTG_HS_GRXSTSP_Device_FRMNUM          (0xFUL << 21) 
#define OTG2_HS_GLOBAL_OTG_HS_GRXSTSP_Device_FRMNUM_VAL(X) (((uint32_t)(X) & 0xFUL) << 21)
#define OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_LPMEN          (0x1UL << 0) 
#define OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_LPMEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_LPMACK          (0x1UL << 1) 
#define OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_LPMACK_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_BESL          (0xFUL << 2) 
#define OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_BESL_VAL(X) (((uint32_t)(X) & 0xFUL) << 2)
#define OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_REMWAKE          (0x1UL << 6) 
#define OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_REMWAKE_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_L1SSEN          (0x1UL << 7) 
#define OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_L1SSEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_BESLTHRS          (0xFUL << 8) 
#define OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_BESLTHRS_VAL(X) (((uint32_t)(X) & 0xFUL) << 8)
#define OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_L1DSEN          (0x1UL << 12) 
#define OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_L1DSEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_LPMRST          (0x3UL << 13) 
#define OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_LPMRST_VAL(X) (((uint32_t)(X) & 0x3UL) << 13)
#define OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_SLPSTS          (0x1UL << 15) 
#define OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_SLPSTS_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_L1RSMOK          (0x1UL << 16) 
#define OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_L1RSMOK_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_LPMCHIDX          (0xFUL << 17) 
#define OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_LPMCHIDX_VAL(X) (((uint32_t)(X) & 0xFUL) << 17)
#define OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_LPMRCNT          (0x7UL << 21) 
#define OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_LPMRCNT_VAL(X) (((uint32_t)(X) & 0x7UL) << 21)
#define OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_SNDLPM          (0x1UL << 24) 
#define OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_SNDLPM_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_LPMRCNTSTS          (0x7UL << 25) 
#define OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_LPMRCNTSTS_VAL(X) (((uint32_t)(X) & 0x7UL) << 25)
#define OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_ENBESL          (0x1UL << 28) 
#define OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_ENBESL_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)

#define OTG2_HS_GLOBAL  ((struct OTG2_HS_GLOBAL*)(0x40080000UL))
struct OTG1_HS_HOST {
  volatile uint32_t OTG_HS_HCFG;
  volatile uint32_t OTG_HS_HFIR;
  volatile const uint32_t OTG_HS_HFNUM;
  const volatile uint32_t RESERVED16[1];
  volatile uint32_t OTG_HS_HPTXSTS;
  volatile const uint32_t OTG_HS_HAINT;
  volatile uint32_t OTG_HS_HAINTMSK;
  const volatile uint32_t RESERVED64[9];
  volatile uint32_t OTG_HS_HPRT;
  const volatile uint32_t RESERVED256[47];
  volatile uint32_t OTG_HS_HCCHAR0;
  volatile uint32_t OTG_HS_HCSPLT0;
  volatile uint32_t OTG_HS_HCINT0;
  volatile uint32_t OTG_HS_HCINTMSK0;
  volatile uint32_t OTG_HS_HCTSIZ0;
  volatile uint32_t OTG_HS_HCDMA0;
  const volatile uint32_t RESERVED288[2];
  volatile uint32_t OTG_HS_HCCHAR1;
  volatile uint32_t OTG_HS_HCSPLT1;
  volatile uint32_t OTG_HS_HCINT1;
  volatile uint32_t OTG_HS_HCINTMSK1;
  volatile uint32_t OTG_HS_HCTSIZ1;
  volatile uint32_t OTG_HS_HCDMA1;
  const volatile uint32_t RESERVED320[2];
  volatile uint32_t OTG_HS_HCCHAR2;
  volatile uint32_t OTG_HS_HCSPLT2;
  volatile uint32_t OTG_HS_HCINT2;
  volatile uint32_t OTG_HS_HCINTMSK2;
  volatile uint32_t OTG_HS_HCTSIZ2;
  volatile uint32_t OTG_HS_HCDMA2;
  const volatile uint32_t RESERVED352[2];
  volatile uint32_t OTG_HS_HCCHAR3;
  volatile uint32_t OTG_HS_HCSPLT3;
  volatile uint32_t OTG_HS_HCINT3;
  volatile uint32_t OTG_HS_HCINTMSK3;
  volatile uint32_t OTG_HS_HCTSIZ3;
  volatile uint32_t OTG_HS_HCDMA3;
  const volatile uint32_t RESERVED384[2];
  volatile uint32_t OTG_HS_HCCHAR4;
  volatile uint32_t OTG_HS_HCSPLT4;
  volatile uint32_t OTG_HS_HCINT4;
  volatile uint32_t OTG_HS_HCINTMSK4;
  volatile uint32_t OTG_HS_HCTSIZ4;
  volatile uint32_t OTG_HS_HCDMA4;
  const volatile uint32_t RESERVED416[2];
  volatile uint32_t OTG_HS_HCCHAR5;
  volatile uint32_t OTG_HS_HCSPLT5;
  volatile uint32_t OTG_HS_HCINT5;
  volatile uint32_t OTG_HS_HCINTMSK5;
  volatile uint32_t OTG_HS_HCTSIZ5;
  volatile uint32_t OTG_HS_HCDMA5;
  const volatile uint32_t RESERVED448[2];
  volatile uint32_t OTG_HS_HCCHAR6;
  volatile uint32_t OTG_HS_HCSPLT6;
  volatile uint32_t OTG_HS_HCINT6;
  volatile uint32_t OTG_HS_HCINTMSK6;
  volatile uint32_t OTG_HS_HCTSIZ6;
  volatile uint32_t OTG_HS_HCDMA6;
  const volatile uint32_t RESERVED480[2];
  volatile uint32_t OTG_HS_HCCHAR7;
  volatile uint32_t OTG_HS_HCSPLT7;
  volatile uint32_t OTG_HS_HCINT7;
  volatile uint32_t OTG_HS_HCINTMSK7;
  volatile uint32_t OTG_HS_HCTSIZ7;
  volatile uint32_t OTG_HS_HCDMA7;
  const volatile uint32_t RESERVED512[2];
  volatile uint32_t OTG_HS_HCCHAR8;
  volatile uint32_t OTG_HS_HCSPLT8;
  volatile uint32_t OTG_HS_HCINT8;
  volatile uint32_t OTG_HS_HCINTMSK8;
  volatile uint32_t OTG_HS_HCTSIZ8;
  volatile uint32_t OTG_HS_HCDMA8;
  const volatile uint32_t RESERVED544[2];
  volatile uint32_t OTG_HS_HCCHAR9;
  volatile uint32_t OTG_HS_HCSPLT9;
  volatile uint32_t OTG_HS_HCINT9;
  volatile uint32_t OTG_HS_HCINTMSK9;
  volatile uint32_t OTG_HS_HCTSIZ9;
  volatile uint32_t OTG_HS_HCDMA9;
  const volatile uint32_t RESERVED576[2];
  volatile uint32_t OTG_HS_HCCHAR10;
  volatile uint32_t OTG_HS_HCSPLT10;
  volatile uint32_t OTG_HS_HCINT10;
  volatile uint32_t OTG_HS_HCINTMSK10;
  volatile uint32_t OTG_HS_HCTSIZ10;
  volatile uint32_t OTG_HS_HCDMA10;
  const volatile uint32_t RESERVED608[2];
  volatile uint32_t OTG_HS_HCCHAR11;
  volatile uint32_t OTG_HS_HCSPLT11;
  volatile uint32_t OTG_HS_HCINT11;
  volatile uint32_t OTG_HS_HCINTMSK11;
  volatile uint32_t OTG_HS_HCTSIZ11;
  volatile uint32_t OTG_HS_HCDMA11;
  volatile uint32_t OTG_HS_HCCHAR12;
  volatile uint32_t OTG_HS_HCSPLT12;
  volatile uint32_t OTG_HS_HCINT12;
  volatile uint32_t OTG_HS_HCINTMSK12;
  volatile uint32_t OTG_HS_HCTSIZ12;
  volatile uint32_t OTG_HS_HCDMA12;
  volatile uint32_t OTG_HS_HCCHAR13;
  volatile uint32_t OTG_HS_HCSPLT13;
  volatile uint32_t OTG_HS_HCINT13;
  volatile uint32_t OTG_HS_HCINTMSK13;
  volatile uint32_t OTG_HS_HCTSIZ13;
  volatile uint32_t OTG_HS_HCDMA13;
  volatile uint32_t OTG_HS_HCCHAR14;
  volatile uint32_t OTG_HS_HCSPLT14;
  volatile uint32_t OTG_HS_HCINT14;
  volatile uint32_t OTG_HS_HCINTMSK14;
  volatile uint32_t OTG_HS_HCTSIZ14;
  volatile uint32_t OTG_HS_HCDMA14;
  volatile uint32_t OTG_HS_HCCHAR15;
  volatile uint32_t OTG_HS_HCSPLT15;
  volatile uint32_t OTG_HS_HCINT15;
  volatile uint32_t OTG_HS_HCINTMSK15;
  volatile uint32_t OTG_HS_HCTSIZ15;
  volatile uint32_t OTG_HS_HCDMA15;
};
