via/viaems/src/platforms/stm32h743/device.h
#define OTG1_HS_HOST_OTG_HS_HCSPLT4_PRTADDR          (0x7FUL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT4_PRTADDR_VAL(X) (((uint32_t)(X) & 0x7FUL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCSPLT4_HUBADDR          (0x7FUL << 7) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT4_HUBADDR_VAL(X) (((uint32_t)(X) & 0x7FUL) << 7)
#define OTG1_HS_HOST_OTG_HS_HCSPLT4_XACTPOS          (0x3UL << 14) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT4_XACTPOS_VAL(X) (((uint32_t)(X) & 0x3UL) << 14)
#define OTG1_HS_HOST_OTG_HS_HCSPLT4_COMPLSPLT          (0x1UL << 16) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT4_COMPLSPLT_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define OTG1_HS_HOST_OTG_HS_HCSPLT4_SPLITEN          (0x1UL << 31) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT4_SPLITEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG1_HS_HOST_OTG_HS_HCSPLT5_PRTADDR          (0x7FUL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT5_PRTADDR_VAL(X) (((uint32_t)(X) & 0x7FUL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCSPLT5_HUBADDR          (0x7FUL << 7) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT5_HUBADDR_VAL(X) (((uint32_t)(X) & 0x7FUL) << 7)
#define OTG1_HS_HOST_OTG_HS_HCSPLT5_XACTPOS          (0x3UL << 14) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT5_XACTPOS_VAL(X) (((uint32_t)(X) & 0x3UL) << 14)
#define OTG1_HS_HOST_OTG_HS_HCSPLT5_COMPLSPLT          (0x1UL << 16) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT5_COMPLSPLT_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define OTG1_HS_HOST_OTG_HS_HCSPLT5_SPLITEN          (0x1UL << 31) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT5_SPLITEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG1_HS_HOST_OTG_HS_HCSPLT6_PRTADDR          (0x7FUL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT6_PRTADDR_VAL(X) (((uint32_t)(X) & 0x7FUL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCSPLT6_HUBADDR          (0x7FUL << 7) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT6_HUBADDR_VAL(X) (((uint32_t)(X) & 0x7FUL) << 7)
#define OTG1_HS_HOST_OTG_HS_HCSPLT6_XACTPOS          (0x3UL << 14) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT6_XACTPOS_VAL(X) (((uint32_t)(X) & 0x3UL) << 14)
#define OTG1_HS_HOST_OTG_HS_HCSPLT6_COMPLSPLT          (0x1UL << 16) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT6_COMPLSPLT_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define OTG1_HS_HOST_OTG_HS_HCSPLT6_SPLITEN          (0x1UL << 31) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT6_SPLITEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG1_HS_HOST_OTG_HS_HCSPLT7_PRTADDR          (0x7FUL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT7_PRTADDR_VAL(X) (((uint32_t)(X) & 0x7FUL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCSPLT7_HUBADDR          (0x7FUL << 7) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT7_HUBADDR_VAL(X) (((uint32_t)(X) & 0x7FUL) << 7)
#define OTG1_HS_HOST_OTG_HS_HCSPLT7_XACTPOS          (0x3UL << 14) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT7_XACTPOS_VAL(X) (((uint32_t)(X) & 0x3UL) << 14)
#define OTG1_HS_HOST_OTG_HS_HCSPLT7_COMPLSPLT          (0x1UL << 16) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT7_COMPLSPLT_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define OTG1_HS_HOST_OTG_HS_HCSPLT7_SPLITEN          (0x1UL << 31) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT7_SPLITEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG1_HS_HOST_OTG_HS_HCSPLT8_PRTADDR          (0x7FUL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT8_PRTADDR_VAL(X) (((uint32_t)(X) & 0x7FUL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCSPLT8_HUBADDR          (0x7FUL << 7) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT8_HUBADDR_VAL(X) (((uint32_t)(X) & 0x7FUL) << 7)
#define OTG1_HS_HOST_OTG_HS_HCSPLT8_XACTPOS          (0x3UL << 14) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT8_XACTPOS_VAL(X) (((uint32_t)(X) & 0x3UL) << 14)
#define OTG1_HS_HOST_OTG_HS_HCSPLT8_COMPLSPLT          (0x1UL << 16) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT8_COMPLSPLT_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define OTG1_HS_HOST_OTG_HS_HCSPLT8_SPLITEN          (0x1UL << 31) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT8_SPLITEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG1_HS_HOST_OTG_HS_HCSPLT9_PRTADDR          (0x7FUL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT9_PRTADDR_VAL(X) (((uint32_t)(X) & 0x7FUL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCSPLT9_HUBADDR          (0x7FUL << 7) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT9_HUBADDR_VAL(X) (((uint32_t)(X) & 0x7FUL) << 7)
#define OTG1_HS_HOST_OTG_HS_HCSPLT9_XACTPOS          (0x3UL << 14) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT9_XACTPOS_VAL(X) (((uint32_t)(X) & 0x3UL) << 14)
#define OTG1_HS_HOST_OTG_HS_HCSPLT9_COMPLSPLT          (0x1UL << 16) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT9_COMPLSPLT_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define OTG1_HS_HOST_OTG_HS_HCSPLT9_SPLITEN          (0x1UL << 31) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT9_SPLITEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG1_HS_HOST_OTG_HS_HCSPLT10_PRTADDR          (0x7FUL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT10_PRTADDR_VAL(X) (((uint32_t)(X) & 0x7FUL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCSPLT10_HUBADDR          (0x7FUL << 7) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT10_HUBADDR_VAL(X) (((uint32_t)(X) & 0x7FUL) << 7)
#define OTG1_HS_HOST_OTG_HS_HCSPLT10_XACTPOS          (0x3UL << 14) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT10_XACTPOS_VAL(X) (((uint32_t)(X) & 0x3UL) << 14)
#define OTG1_HS_HOST_OTG_HS_HCSPLT10_COMPLSPLT          (0x1UL << 16) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT10_COMPLSPLT_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define OTG1_HS_HOST_OTG_HS_HCSPLT10_SPLITEN          (0x1UL << 31) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT10_SPLITEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG1_HS_HOST_OTG_HS_HCSPLT11_PRTADDR          (0x7FUL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT11_PRTADDR_VAL(X) (((uint32_t)(X) & 0x7FUL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCSPLT11_HUBADDR          (0x7FUL << 7) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT11_HUBADDR_VAL(X) (((uint32_t)(X) & 0x7FUL) << 7)
#define OTG1_HS_HOST_OTG_HS_HCSPLT11_XACTPOS          (0x3UL << 14) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT11_XACTPOS_VAL(X) (((uint32_t)(X) & 0x3UL) << 14)
#define OTG1_HS_HOST_OTG_HS_HCSPLT11_COMPLSPLT          (0x1UL << 16) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT11_COMPLSPLT_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define OTG1_HS_HOST_OTG_HS_HCSPLT11_SPLITEN          (0x1UL << 31) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT11_SPLITEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG1_HS_HOST_OTG_HS_HCINT0_XFRC          (0x1UL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCINT0_XFRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCINT0_CHH          (0x1UL << 1) 
#define OTG1_HS_HOST_OTG_HS_HCINT0_CHH_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG1_HS_HOST_OTG_HS_HCINT0_AHBERR          (0x1UL << 2) 
#define OTG1_HS_HOST_OTG_HS_HCINT0_AHBERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define OTG1_HS_HOST_OTG_HS_HCINT0_STALL          (0x1UL << 3) 
#define OTG1_HS_HOST_OTG_HS_HCINT0_STALL_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG1_HS_HOST_OTG_HS_HCINT0_NAK          (0x1UL << 4) 
#define OTG1_HS_HOST_OTG_HS_HCINT0_NAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG1_HS_HOST_OTG_HS_HCINT0_ACK          (0x1UL << 5) 
#define OTG1_HS_HOST_OTG_HS_HCINT0_ACK_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define OTG1_HS_HOST_OTG_HS_HCINT0_NYET          (0x1UL << 6) 
#define OTG1_HS_HOST_OTG_HS_HCINT0_NYET_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG1_HS_HOST_OTG_HS_HCINT0_TXERR          (0x1UL << 7) 
#define OTG1_HS_HOST_OTG_HS_HCINT0_TXERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define OTG1_HS_HOST_OTG_HS_HCINT0_BBERR          (0x1UL << 8) 
#define OTG1_HS_HOST_OTG_HS_HCINT0_BBERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OTG1_HS_HOST_OTG_HS_HCINT0_FRMOR          (0x1UL << 9) 
#define OTG1_HS_HOST_OTG_HS_HCINT0_FRMOR_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define OTG1_HS_HOST_OTG_HS_HCINT0_DTERR          (0x1UL << 10) 
#define OTG1_HS_HOST_OTG_HS_HCINT0_DTERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define OTG1_HS_HOST_OTG_HS_HCINT1_XFRC          (0x1UL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCINT1_XFRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCINT1_CHH          (0x1UL << 1) 
#define OTG1_HS_HOST_OTG_HS_HCINT1_CHH_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG1_HS_HOST_OTG_HS_HCINT1_AHBERR          (0x1UL << 2) 
#define OTG1_HS_HOST_OTG_HS_HCINT1_AHBERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define OTG1_HS_HOST_OTG_HS_HCINT1_STALL          (0x1UL << 3) 
#define OTG1_HS_HOST_OTG_HS_HCINT1_STALL_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG1_HS_HOST_OTG_HS_HCINT1_NAK          (0x1UL << 4) 
#define OTG1_HS_HOST_OTG_HS_HCINT1_NAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG1_HS_HOST_OTG_HS_HCINT1_ACK          (0x1UL << 5) 
#define OTG1_HS_HOST_OTG_HS_HCINT1_ACK_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define OTG1_HS_HOST_OTG_HS_HCINT1_NYET          (0x1UL << 6) 
#define OTG1_HS_HOST_OTG_HS_HCINT1_NYET_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG1_HS_HOST_OTG_HS_HCINT1_TXERR          (0x1UL << 7) 
#define OTG1_HS_HOST_OTG_HS_HCINT1_TXERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define OTG1_HS_HOST_OTG_HS_HCINT1_BBERR          (0x1UL << 8) 
#define OTG1_HS_HOST_OTG_HS_HCINT1_BBERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OTG1_HS_HOST_OTG_HS_HCINT1_FRMOR          (0x1UL << 9) 
#define OTG1_HS_HOST_OTG_HS_HCINT1_FRMOR_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define OTG1_HS_HOST_OTG_HS_HCINT1_DTERR          (0x1UL << 10) 
#define OTG1_HS_HOST_OTG_HS_HCINT1_DTERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define OTG1_HS_HOST_OTG_HS_HCINT2_XFRC          (0x1UL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCINT2_XFRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCINT2_CHH          (0x1UL << 1) 
#define OTG1_HS_HOST_OTG_HS_HCINT2_CHH_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG1_HS_HOST_OTG_HS_HCINT2_AHBERR          (0x1UL << 2) 
#define OTG1_HS_HOST_OTG_HS_HCINT2_AHBERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define OTG1_HS_HOST_OTG_HS_HCINT2_STALL          (0x1UL << 3) 
#define OTG1_HS_HOST_OTG_HS_HCINT2_STALL_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG1_HS_HOST_OTG_HS_HCINT2_NAK          (0x1UL << 4) 
#define OTG1_HS_HOST_OTG_HS_HCINT2_NAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG1_HS_HOST_OTG_HS_HCINT2_ACK          (0x1UL << 5) 
#define OTG1_HS_HOST_OTG_HS_HCINT2_ACK_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define OTG1_HS_HOST_OTG_HS_HCINT2_NYET          (0x1UL << 6) 
#define OTG1_HS_HOST_OTG_HS_HCINT2_NYET_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG1_HS_HOST_OTG_HS_HCINT2_TXERR          (0x1UL << 7) 
#define OTG1_HS_HOST_OTG_HS_HCINT2_TXERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define OTG1_HS_HOST_OTG_HS_HCINT2_BBERR          (0x1UL << 8) 
#define OTG1_HS_HOST_OTG_HS_HCINT2_BBERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OTG1_HS_HOST_OTG_HS_HCINT2_FRMOR          (0x1UL << 9) 
#define OTG1_HS_HOST_OTG_HS_HCINT2_FRMOR_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define OTG1_HS_HOST_OTG_HS_HCINT2_DTERR          (0x1UL << 10) 
#define OTG1_HS_HOST_OTG_HS_HCINT2_DTERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define OTG1_HS_HOST_OTG_HS_HCINT3_XFRC          (0x1UL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCINT3_XFRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCINT3_CHH          (0x1UL << 1) 
#define OTG1_HS_HOST_OTG_HS_HCINT3_CHH_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG1_HS_HOST_OTG_HS_HCINT3_AHBERR          (0x1UL << 2) 
#define OTG1_HS_HOST_OTG_HS_HCINT3_AHBERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define OTG1_HS_HOST_OTG_HS_HCINT3_STALL          (0x1UL << 3) 
#define OTG1_HS_HOST_OTG_HS_HCINT3_STALL_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG1_HS_HOST_OTG_HS_HCINT3_NAK          (0x1UL << 4) 
#define OTG1_HS_HOST_OTG_HS_HCINT3_NAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG1_HS_HOST_OTG_HS_HCINT3_ACK          (0x1UL << 5) 
#define OTG1_HS_HOST_OTG_HS_HCINT3_ACK_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define OTG1_HS_HOST_OTG_HS_HCINT3_NYET          (0x1UL << 6) 
#define OTG1_HS_HOST_OTG_HS_HCINT3_NYET_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG1_HS_HOST_OTG_HS_HCINT3_TXERR          (0x1UL << 7) 
#define OTG1_HS_HOST_OTG_HS_HCINT3_TXERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define OTG1_HS_HOST_OTG_HS_HCINT3_BBERR          (0x1UL << 8) 
#define OTG1_HS_HOST_OTG_HS_HCINT3_BBERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OTG1_HS_HOST_OTG_HS_HCINT3_FRMOR          (0x1UL << 9) 
#define OTG1_HS_HOST_OTG_HS_HCINT3_FRMOR_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define OTG1_HS_HOST_OTG_HS_HCINT3_DTERR          (0x1UL << 10) 
#define OTG1_HS_HOST_OTG_HS_HCINT3_DTERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define OTG1_HS_HOST_OTG_HS_HCINT4_XFRC          (0x1UL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCINT4_XFRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCINT4_CHH          (0x1UL << 1) 
#define OTG1_HS_HOST_OTG_HS_HCINT4_CHH_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG1_HS_HOST_OTG_HS_HCINT4_AHBERR          (0x1UL << 2) 
#define OTG1_HS_HOST_OTG_HS_HCINT4_AHBERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define OTG1_HS_HOST_OTG_HS_HCINT4_STALL          (0x1UL << 3) 
#define OTG1_HS_HOST_OTG_HS_HCINT4_STALL_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG1_HS_HOST_OTG_HS_HCINT4_NAK          (0x1UL << 4) 
#define OTG1_HS_HOST_OTG_HS_HCINT4_NAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG1_HS_HOST_OTG_HS_HCINT4_ACK          (0x1UL << 5) 
#define OTG1_HS_HOST_OTG_HS_HCINT4_ACK_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define OTG1_HS_HOST_OTG_HS_HCINT4_NYET          (0x1UL << 6) 
#define OTG1_HS_HOST_OTG_HS_HCINT4_NYET_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG1_HS_HOST_OTG_HS_HCINT4_TXERR          (0x1UL << 7) 
#define OTG1_HS_HOST_OTG_HS_HCINT4_TXERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define OTG1_HS_HOST_OTG_HS_HCINT4_BBERR          (0x1UL << 8) 
#define OTG1_HS_HOST_OTG_HS_HCINT4_BBERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OTG1_HS_HOST_OTG_HS_HCINT4_FRMOR          (0x1UL << 9) 
#define OTG1_HS_HOST_OTG_HS_HCINT4_FRMOR_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define OTG1_HS_HOST_OTG_HS_HCINT4_DTERR          (0x1UL << 10) 
#define OTG1_HS_HOST_OTG_HS_HCINT4_DTERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define OTG1_HS_HOST_OTG_HS_HCINT5_XFRC          (0x1UL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCINT5_XFRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCINT5_CHH          (0x1UL << 1) 
#define OTG1_HS_HOST_OTG_HS_HCINT5_CHH_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG1_HS_HOST_OTG_HS_HCINT5_AHBERR          (0x1UL << 2) 
#define OTG1_HS_HOST_OTG_HS_HCINT5_AHBERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define OTG1_HS_HOST_OTG_HS_HCINT5_STALL          (0x1UL << 3) 
#define OTG1_HS_HOST_OTG_HS_HCINT5_STALL_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG1_HS_HOST_OTG_HS_HCINT5_NAK          (0x1UL << 4) 
#define OTG1_HS_HOST_OTG_HS_HCINT5_NAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG1_HS_HOST_OTG_HS_HCINT5_ACK          (0x1UL << 5) 
#define OTG1_HS_HOST_OTG_HS_HCINT5_ACK_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define OTG1_HS_HOST_OTG_HS_HCINT5_NYET          (0x1UL << 6) 
#define OTG1_HS_HOST_OTG_HS_HCINT5_NYET_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG1_HS_HOST_OTG_HS_HCINT5_TXERR          (0x1UL << 7) 
#define OTG1_HS_HOST_OTG_HS_HCINT5_TXERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define OTG1_HS_HOST_OTG_HS_HCINT5_BBERR          (0x1UL << 8) 
#define OTG1_HS_HOST_OTG_HS_HCINT5_BBERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OTG1_HS_HOST_OTG_HS_HCINT5_FRMOR          (0x1UL << 9) 
#define OTG1_HS_HOST_OTG_HS_HCINT5_FRMOR_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define OTG1_HS_HOST_OTG_HS_HCINT5_DTERR          (0x1UL << 10) 
#define OTG1_HS_HOST_OTG_HS_HCINT5_DTERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define OTG1_HS_HOST_OTG_HS_HCINT6_XFRC          (0x1UL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCINT6_XFRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCINT6_CHH          (0x1UL << 1) 
#define OTG1_HS_HOST_OTG_HS_HCINT6_CHH_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG1_HS_HOST_OTG_HS_HCINT6_AHBERR          (0x1UL << 2) 
#define OTG1_HS_HOST_OTG_HS_HCINT6_AHBERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define OTG1_HS_HOST_OTG_HS_HCINT6_STALL          (0x1UL << 3) 
#define OTG1_HS_HOST_OTG_HS_HCINT6_STALL_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG1_HS_HOST_OTG_HS_HCINT6_NAK          (0x1UL << 4) 
#define OTG1_HS_HOST_OTG_HS_HCINT6_NAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG1_HS_HOST_OTG_HS_HCINT6_ACK          (0x1UL << 5) 
#define OTG1_HS_HOST_OTG_HS_HCINT6_ACK_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define OTG1_HS_HOST_OTG_HS_HCINT6_NYET          (0x1UL << 6) 
#define OTG1_HS_HOST_OTG_HS_HCINT6_NYET_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG1_HS_HOST_OTG_HS_HCINT6_TXERR          (0x1UL << 7) 
#define OTG1_HS_HOST_OTG_HS_HCINT6_TXERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define OTG1_HS_HOST_OTG_HS_HCINT6_BBERR          (0x1UL << 8) 
#define OTG1_HS_HOST_OTG_HS_HCINT6_BBERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OTG1_HS_HOST_OTG_HS_HCINT6_FRMOR          (0x1UL << 9) 
#define OTG1_HS_HOST_OTG_HS_HCINT6_FRMOR_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define OTG1_HS_HOST_OTG_HS_HCINT6_DTERR          (0x1UL << 10) 
#define OTG1_HS_HOST_OTG_HS_HCINT6_DTERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define OTG1_HS_HOST_OTG_HS_HCINT7_XFRC          (0x1UL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCINT7_XFRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCINT7_CHH          (0x1UL << 1) 
#define OTG1_HS_HOST_OTG_HS_HCINT7_CHH_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG1_HS_HOST_OTG_HS_HCINT7_AHBERR          (0x1UL << 2) 
#define OTG1_HS_HOST_OTG_HS_HCINT7_AHBERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define OTG1_HS_HOST_OTG_HS_HCINT7_STALL          (0x1UL << 3) 
#define OTG1_HS_HOST_OTG_HS_HCINT7_STALL_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG1_HS_HOST_OTG_HS_HCINT7_NAK          (0x1UL << 4) 
#define OTG1_HS_HOST_OTG_HS_HCINT7_NAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG1_HS_HOST_OTG_HS_HCINT7_ACK          (0x1UL << 5) 
#define OTG1_HS_HOST_OTG_HS_HCINT7_ACK_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define OTG1_HS_HOST_OTG_HS_HCINT7_NYET          (0x1UL << 6) 
#define OTG1_HS_HOST_OTG_HS_HCINT7_NYET_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG1_HS_HOST_OTG_HS_HCINT7_TXERR          (0x1UL << 7) 
#define OTG1_HS_HOST_OTG_HS_HCINT7_TXERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define OTG1_HS_HOST_OTG_HS_HCINT7_BBERR          (0x1UL << 8) 
#define OTG1_HS_HOST_OTG_HS_HCINT7_BBERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OTG1_HS_HOST_OTG_HS_HCINT7_FRMOR          (0x1UL << 9) 
#define OTG1_HS_HOST_OTG_HS_HCINT7_FRMOR_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define OTG1_HS_HOST_OTG_HS_HCINT7_DTERR          (0x1UL << 10) 
#define OTG1_HS_HOST_OTG_HS_HCINT7_DTERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define OTG1_HS_HOST_OTG_HS_HCINT8_XFRC          (0x1UL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCINT8_XFRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCINT8_CHH          (0x1UL << 1) 
#define OTG1_HS_HOST_OTG_HS_HCINT8_CHH_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG1_HS_HOST_OTG_HS_HCINT8_AHBERR          (0x1UL << 2) 
#define OTG1_HS_HOST_OTG_HS_HCINT8_AHBERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define OTG1_HS_HOST_OTG_HS_HCINT8_STALL          (0x1UL << 3) 
#define OTG1_HS_HOST_OTG_HS_HCINT8_STALL_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG1_HS_HOST_OTG_HS_HCINT8_NAK          (0x1UL << 4) 
#define OTG1_HS_HOST_OTG_HS_HCINT8_NAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG1_HS_HOST_OTG_HS_HCINT8_ACK          (0x1UL << 5) 
#define OTG1_HS_HOST_OTG_HS_HCINT8_ACK_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define OTG1_HS_HOST_OTG_HS_HCINT8_NYET          (0x1UL << 6) 
#define OTG1_HS_HOST_OTG_HS_HCINT8_NYET_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG1_HS_HOST_OTG_HS_HCINT8_TXERR          (0x1UL << 7) 
#define OTG1_HS_HOST_OTG_HS_HCINT8_TXERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define OTG1_HS_HOST_OTG_HS_HCINT8_BBERR          (0x1UL << 8) 
#define OTG1_HS_HOST_OTG_HS_HCINT8_BBERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OTG1_HS_HOST_OTG_HS_HCINT8_FRMOR          (0x1UL << 9) 
#define OTG1_HS_HOST_OTG_HS_HCINT8_FRMOR_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define OTG1_HS_HOST_OTG_HS_HCINT8_DTERR          (0x1UL << 10) 
#define OTG1_HS_HOST_OTG_HS_HCINT8_DTERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define OTG1_HS_HOST_OTG_HS_HCINT9_XFRC          (0x1UL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCINT9_XFRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCINT9_CHH          (0x1UL << 1) 
#define OTG1_HS_HOST_OTG_HS_HCINT9_CHH_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG1_HS_HOST_OTG_HS_HCINT9_AHBERR          (0x1UL << 2) 
#define OTG1_HS_HOST_OTG_HS_HCINT9_AHBERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define OTG1_HS_HOST_OTG_HS_HCINT9_STALL          (0x1UL << 3) 
#define OTG1_HS_HOST_OTG_HS_HCINT9_STALL_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG1_HS_HOST_OTG_HS_HCINT9_NAK          (0x1UL << 4) 
#define OTG1_HS_HOST_OTG_HS_HCINT9_NAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG1_HS_HOST_OTG_HS_HCINT9_ACK          (0x1UL << 5) 
#define OTG1_HS_HOST_OTG_HS_HCINT9_ACK_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define OTG1_HS_HOST_OTG_HS_HCINT9_NYET          (0x1UL << 6) 
#define OTG1_HS_HOST_OTG_HS_HCINT9_NYET_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG1_HS_HOST_OTG_HS_HCINT9_TXERR          (0x1UL << 7) 
#define OTG1_HS_HOST_OTG_HS_HCINT9_TXERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define OTG1_HS_HOST_OTG_HS_HCINT9_BBERR          (0x1UL << 8) 
#define OTG1_HS_HOST_OTG_HS_HCINT9_BBERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OTG1_HS_HOST_OTG_HS_HCINT9_FRMOR          (0x1UL << 9) 
#define OTG1_HS_HOST_OTG_HS_HCINT9_FRMOR_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define OTG1_HS_HOST_OTG_HS_HCINT9_DTERR          (0x1UL << 10) 
#define OTG1_HS_HOST_OTG_HS_HCINT9_DTERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define OTG1_HS_HOST_OTG_HS_HCINT10_XFRC          (0x1UL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCINT10_XFRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCINT10_CHH          (0x1UL << 1) 
#define OTG1_HS_HOST_OTG_HS_HCINT10_CHH_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG1_HS_HOST_OTG_HS_HCINT10_AHBERR          (0x1UL << 2) 
#define OTG1_HS_HOST_OTG_HS_HCINT10_AHBERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define OTG1_HS_HOST_OTG_HS_HCINT10_STALL          (0x1UL << 3) 
#define OTG1_HS_HOST_OTG_HS_HCINT10_STALL_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG1_HS_HOST_OTG_HS_HCINT10_NAK          (0x1UL << 4) 
#define OTG1_HS_HOST_OTG_HS_HCINT10_NAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG1_HS_HOST_OTG_HS_HCINT10_ACK          (0x1UL << 5) 
#define OTG1_HS_HOST_OTG_HS_HCINT10_ACK_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define OTG1_HS_HOST_OTG_HS_HCINT10_NYET          (0x1UL << 6) 
#define OTG1_HS_HOST_OTG_HS_HCINT10_NYET_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG1_HS_HOST_OTG_HS_HCINT10_TXERR          (0x1UL << 7) 
#define OTG1_HS_HOST_OTG_HS_HCINT10_TXERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define OTG1_HS_HOST_OTG_HS_HCINT10_BBERR          (0x1UL << 8) 
#define OTG1_HS_HOST_OTG_HS_HCINT10_BBERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OTG1_HS_HOST_OTG_HS_HCINT10_FRMOR          (0x1UL << 9) 
#define OTG1_HS_HOST_OTG_HS_HCINT10_FRMOR_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define OTG1_HS_HOST_OTG_HS_HCINT10_DTERR          (0x1UL << 10) 
#define OTG1_HS_HOST_OTG_HS_HCINT10_DTERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define OTG1_HS_HOST_OTG_HS_HCINT11_XFRC          (0x1UL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCINT11_XFRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCINT11_CHH          (0x1UL << 1) 
#define OTG1_HS_HOST_OTG_HS_HCINT11_CHH_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG1_HS_HOST_OTG_HS_HCINT11_AHBERR          (0x1UL << 2) 
#define OTG1_HS_HOST_OTG_HS_HCINT11_AHBERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define OTG1_HS_HOST_OTG_HS_HCINT11_STALL          (0x1UL << 3) 
#define OTG1_HS_HOST_OTG_HS_HCINT11_STALL_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG1_HS_HOST_OTG_HS_HCINT11_NAK          (0x1UL << 4) 
