via/viaems/src/platforms/stm32h743/device.h
#define OTG1_HS_HOST_OTG_HS_HCTSIZ7_XFRSIZ_VAL(X) (((uint32_t)(X) & 0x7FFFFUL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ7_PKTCNT          (0x3FFUL << 19) 
#define OTG1_HS_HOST_OTG_HS_HCTSIZ7_PKTCNT_VAL(X) (((uint32_t)(X) & 0x3FFUL) << 19)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ7_DPID          (0x3UL << 29) 
#define OTG1_HS_HOST_OTG_HS_HCTSIZ7_DPID_VAL(X) (((uint32_t)(X) & 0x3UL) << 29)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ8_XFRSIZ          (0x7FFFFUL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCTSIZ8_XFRSIZ_VAL(X) (((uint32_t)(X) & 0x7FFFFUL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ8_PKTCNT          (0x3FFUL << 19) 
#define OTG1_HS_HOST_OTG_HS_HCTSIZ8_PKTCNT_VAL(X) (((uint32_t)(X) & 0x3FFUL) << 19)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ8_DPID          (0x3UL << 29) 
#define OTG1_HS_HOST_OTG_HS_HCTSIZ8_DPID_VAL(X) (((uint32_t)(X) & 0x3UL) << 29)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ9_XFRSIZ          (0x7FFFFUL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCTSIZ9_XFRSIZ_VAL(X) (((uint32_t)(X) & 0x7FFFFUL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ9_PKTCNT          (0x3FFUL << 19) 
#define OTG1_HS_HOST_OTG_HS_HCTSIZ9_PKTCNT_VAL(X) (((uint32_t)(X) & 0x3FFUL) << 19)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ9_DPID          (0x3UL << 29) 
#define OTG1_HS_HOST_OTG_HS_HCTSIZ9_DPID_VAL(X) (((uint32_t)(X) & 0x3UL) << 29)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ10_XFRSIZ          (0x7FFFFUL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCTSIZ10_XFRSIZ_VAL(X) (((uint32_t)(X) & 0x7FFFFUL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ10_PKTCNT          (0x3FFUL << 19) 
#define OTG1_HS_HOST_OTG_HS_HCTSIZ10_PKTCNT_VAL(X) (((uint32_t)(X) & 0x3FFUL) << 19)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ10_DPID          (0x3UL << 29) 
#define OTG1_HS_HOST_OTG_HS_HCTSIZ10_DPID_VAL(X) (((uint32_t)(X) & 0x3UL) << 29)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ11_XFRSIZ          (0x7FFFFUL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCTSIZ11_XFRSIZ_VAL(X) (((uint32_t)(X) & 0x7FFFFUL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ11_PKTCNT          (0x3FFUL << 19) 
#define OTG1_HS_HOST_OTG_HS_HCTSIZ11_PKTCNT_VAL(X) (((uint32_t)(X) & 0x3FFUL) << 19)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ11_DPID          (0x3UL << 29) 
#define OTG1_HS_HOST_OTG_HS_HCTSIZ11_DPID_VAL(X) (((uint32_t)(X) & 0x3UL) << 29)
#define OTG1_HS_HOST_OTG_HS_HCDMA0_DMAADDR          (0xFFFFFFFFUL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCDMA0_DMAADDR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCDMA1_DMAADDR          (0xFFFFFFFFUL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCDMA1_DMAADDR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCDMA2_DMAADDR          (0xFFFFFFFFUL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCDMA2_DMAADDR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCDMA3_DMAADDR          (0xFFFFFFFFUL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCDMA3_DMAADDR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCDMA4_DMAADDR          (0xFFFFFFFFUL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCDMA4_DMAADDR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCDMA5_DMAADDR          (0xFFFFFFFFUL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCDMA5_DMAADDR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCDMA6_DMAADDR          (0xFFFFFFFFUL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCDMA6_DMAADDR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCDMA7_DMAADDR          (0xFFFFFFFFUL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCDMA7_DMAADDR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCDMA8_DMAADDR          (0xFFFFFFFFUL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCDMA8_DMAADDR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCDMA9_DMAADDR          (0xFFFFFFFFUL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCDMA9_DMAADDR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCDMA10_DMAADDR          (0xFFFFFFFFUL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCDMA10_DMAADDR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCDMA11_DMAADDR          (0xFFFFFFFFUL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCDMA11_DMAADDR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCCHAR12_MPSIZ          (0x7FFUL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCCHAR12_MPSIZ_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCCHAR12_EPNUM          (0xFUL << 11) 
#define OTG1_HS_HOST_OTG_HS_HCCHAR12_EPNUM_VAL(X) (((uint32_t)(X) & 0xFUL) << 11)
#define OTG1_HS_HOST_OTG_HS_HCCHAR12_EPDIR          (0x1UL << 15) 
#define OTG1_HS_HOST_OTG_HS_HCCHAR12_EPDIR_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define OTG1_HS_HOST_OTG_HS_HCCHAR12_LSDEV          (0x1UL << 17) 
#define OTG1_HS_HOST_OTG_HS_HCCHAR12_LSDEV_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define OTG1_HS_HOST_OTG_HS_HCCHAR12_EPTYP          (0x3UL << 18) 
#define OTG1_HS_HOST_OTG_HS_HCCHAR12_EPTYP_VAL(X) (((uint32_t)(X) & 0x3UL) << 18)
#define OTG1_HS_HOST_OTG_HS_HCCHAR12_MC          (0x3UL << 20) 
#define OTG1_HS_HOST_OTG_HS_HCCHAR12_MC_VAL(X) (((uint32_t)(X) & 0x3UL) << 20)
#define OTG1_HS_HOST_OTG_HS_HCCHAR12_DAD          (0x7FUL << 22) 
#define OTG1_HS_HOST_OTG_HS_HCCHAR12_DAD_VAL(X) (((uint32_t)(X) & 0x7FUL) << 22)
#define OTG1_HS_HOST_OTG_HS_HCCHAR12_ODDFRM          (0x1UL << 29) 
#define OTG1_HS_HOST_OTG_HS_HCCHAR12_ODDFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define OTG1_HS_HOST_OTG_HS_HCCHAR12_CHDIS          (0x1UL << 30) 
#define OTG1_HS_HOST_OTG_HS_HCCHAR12_CHDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define OTG1_HS_HOST_OTG_HS_HCCHAR12_CHENA          (0x1UL << 31) 
#define OTG1_HS_HOST_OTG_HS_HCCHAR12_CHENA_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG1_HS_HOST_OTG_HS_HCSPLT12_PRTADDR          (0x7FUL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT12_PRTADDR_VAL(X) (((uint32_t)(X) & 0x7FUL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCSPLT12_HUBADDR          (0x7FUL << 7) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT12_HUBADDR_VAL(X) (((uint32_t)(X) & 0x7FUL) << 7)
#define OTG1_HS_HOST_OTG_HS_HCSPLT12_XACTPOS          (0x3UL << 14) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT12_XACTPOS_VAL(X) (((uint32_t)(X) & 0x3UL) << 14)
#define OTG1_HS_HOST_OTG_HS_HCSPLT12_COMPLSPLT          (0x1UL << 16) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT12_COMPLSPLT_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define OTG1_HS_HOST_OTG_HS_HCSPLT12_SPLITEN          (0x1UL << 31) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT12_SPLITEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG1_HS_HOST_OTG_HS_HCINT12_XFRC          (0x1UL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCINT12_XFRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCINT12_CHH          (0x1UL << 1) 
#define OTG1_HS_HOST_OTG_HS_HCINT12_CHH_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG1_HS_HOST_OTG_HS_HCINT12_AHBERR          (0x1UL << 2) 
#define OTG1_HS_HOST_OTG_HS_HCINT12_AHBERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define OTG1_HS_HOST_OTG_HS_HCINT12_STALL          (0x1UL << 3) 
#define OTG1_HS_HOST_OTG_HS_HCINT12_STALL_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG1_HS_HOST_OTG_HS_HCINT12_NAK          (0x1UL << 4) 
#define OTG1_HS_HOST_OTG_HS_HCINT12_NAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG1_HS_HOST_OTG_HS_HCINT12_ACK          (0x1UL << 5) 
#define OTG1_HS_HOST_OTG_HS_HCINT12_ACK_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define OTG1_HS_HOST_OTG_HS_HCINT12_NYET          (0x1UL << 6) 
#define OTG1_HS_HOST_OTG_HS_HCINT12_NYET_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG1_HS_HOST_OTG_HS_HCINT12_TXERR          (0x1UL << 7) 
#define OTG1_HS_HOST_OTG_HS_HCINT12_TXERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define OTG1_HS_HOST_OTG_HS_HCINT12_BBERR          (0x1UL << 8) 
#define OTG1_HS_HOST_OTG_HS_HCINT12_BBERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OTG1_HS_HOST_OTG_HS_HCINT12_FRMOR          (0x1UL << 9) 
#define OTG1_HS_HOST_OTG_HS_HCINT12_FRMOR_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define OTG1_HS_HOST_OTG_HS_HCINT12_DTERR          (0x1UL << 10) 
#define OTG1_HS_HOST_OTG_HS_HCINT12_DTERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK12_XFRCM          (0x1UL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCINTMSK12_XFRCM_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK12_CHHM          (0x1UL << 1) 
#define OTG1_HS_HOST_OTG_HS_HCINTMSK12_CHHM_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK12_AHBERR          (0x1UL << 2) 
#define OTG1_HS_HOST_OTG_HS_HCINTMSK12_AHBERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK12_STALLM          (0x1UL << 3) 
#define OTG1_HS_HOST_OTG_HS_HCINTMSK12_STALLM_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK12_NAKM          (0x1UL << 4) 
#define OTG1_HS_HOST_OTG_HS_HCINTMSK12_NAKM_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK12_ACKM          (0x1UL << 5) 
#define OTG1_HS_HOST_OTG_HS_HCINTMSK12_ACKM_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK12_NYET          (0x1UL << 6) 
#define OTG1_HS_HOST_OTG_HS_HCINTMSK12_NYET_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK12_TXERRM          (0x1UL << 7) 
#define OTG1_HS_HOST_OTG_HS_HCINTMSK12_TXERRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK12_BBERRM          (0x1UL << 8) 
#define OTG1_HS_HOST_OTG_HS_HCINTMSK12_BBERRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK12_FRMORM          (0x1UL << 9) 
#define OTG1_HS_HOST_OTG_HS_HCINTMSK12_FRMORM_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK12_DTERRM          (0x1UL << 10) 
#define OTG1_HS_HOST_OTG_HS_HCINTMSK12_DTERRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ12_XFRSIZ          (0x7FFFFUL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCTSIZ12_XFRSIZ_VAL(X) (((uint32_t)(X) & 0x7FFFFUL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ12_PKTCNT          (0x3FFUL << 19) 
#define OTG1_HS_HOST_OTG_HS_HCTSIZ12_PKTCNT_VAL(X) (((uint32_t)(X) & 0x3FFUL) << 19)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ12_DPID          (0x3UL << 29) 
#define OTG1_HS_HOST_OTG_HS_HCTSIZ12_DPID_VAL(X) (((uint32_t)(X) & 0x3UL) << 29)
#define OTG1_HS_HOST_OTG_HS_HCDMA12_DMAADDR          (0xFFFFFFFFUL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCDMA12_DMAADDR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCCHAR13_MPSIZ          (0x7FFUL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCCHAR13_MPSIZ_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCCHAR13_EPNUM          (0xFUL << 11) 
#define OTG1_HS_HOST_OTG_HS_HCCHAR13_EPNUM_VAL(X) (((uint32_t)(X) & 0xFUL) << 11)
#define OTG1_HS_HOST_OTG_HS_HCCHAR13_EPDIR          (0x1UL << 15) 
#define OTG1_HS_HOST_OTG_HS_HCCHAR13_EPDIR_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define OTG1_HS_HOST_OTG_HS_HCCHAR13_LSDEV          (0x1UL << 17) 
#define OTG1_HS_HOST_OTG_HS_HCCHAR13_LSDEV_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define OTG1_HS_HOST_OTG_HS_HCCHAR13_EPTYP          (0x3UL << 18) 
#define OTG1_HS_HOST_OTG_HS_HCCHAR13_EPTYP_VAL(X) (((uint32_t)(X) & 0x3UL) << 18)
#define OTG1_HS_HOST_OTG_HS_HCCHAR13_MC          (0x3UL << 20) 
#define OTG1_HS_HOST_OTG_HS_HCCHAR13_MC_VAL(X) (((uint32_t)(X) & 0x3UL) << 20)
#define OTG1_HS_HOST_OTG_HS_HCCHAR13_DAD          (0x7FUL << 22) 
#define OTG1_HS_HOST_OTG_HS_HCCHAR13_DAD_VAL(X) (((uint32_t)(X) & 0x7FUL) << 22)
#define OTG1_HS_HOST_OTG_HS_HCCHAR13_ODDFRM          (0x1UL << 29) 
#define OTG1_HS_HOST_OTG_HS_HCCHAR13_ODDFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define OTG1_HS_HOST_OTG_HS_HCCHAR13_CHDIS          (0x1UL << 30) 
#define OTG1_HS_HOST_OTG_HS_HCCHAR13_CHDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define OTG1_HS_HOST_OTG_HS_HCCHAR13_CHENA          (0x1UL << 31) 
#define OTG1_HS_HOST_OTG_HS_HCCHAR13_CHENA_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG1_HS_HOST_OTG_HS_HCSPLT13_PRTADDR          (0x7FUL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT13_PRTADDR_VAL(X) (((uint32_t)(X) & 0x7FUL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCSPLT13_HUBADDR          (0x7FUL << 7) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT13_HUBADDR_VAL(X) (((uint32_t)(X) & 0x7FUL) << 7)
#define OTG1_HS_HOST_OTG_HS_HCSPLT13_XACTPOS          (0x3UL << 14) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT13_XACTPOS_VAL(X) (((uint32_t)(X) & 0x3UL) << 14)
#define OTG1_HS_HOST_OTG_HS_HCSPLT13_COMPLSPLT          (0x1UL << 16) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT13_COMPLSPLT_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define OTG1_HS_HOST_OTG_HS_HCSPLT13_SPLITEN          (0x1UL << 31) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT13_SPLITEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG1_HS_HOST_OTG_HS_HCINT13_XFRC          (0x1UL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCINT13_XFRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCINT13_CHH          (0x1UL << 1) 
#define OTG1_HS_HOST_OTG_HS_HCINT13_CHH_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG1_HS_HOST_OTG_HS_HCINT13_AHBERR          (0x1UL << 2) 
#define OTG1_HS_HOST_OTG_HS_HCINT13_AHBERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define OTG1_HS_HOST_OTG_HS_HCINT13_STALL          (0x1UL << 3) 
#define OTG1_HS_HOST_OTG_HS_HCINT13_STALL_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG1_HS_HOST_OTG_HS_HCINT13_NAK          (0x1UL << 4) 
#define OTG1_HS_HOST_OTG_HS_HCINT13_NAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG1_HS_HOST_OTG_HS_HCINT13_ACK          (0x1UL << 5) 
#define OTG1_HS_HOST_OTG_HS_HCINT13_ACK_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define OTG1_HS_HOST_OTG_HS_HCINT13_NYET          (0x1UL << 6) 
#define OTG1_HS_HOST_OTG_HS_HCINT13_NYET_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG1_HS_HOST_OTG_HS_HCINT13_TXERR          (0x1UL << 7) 
#define OTG1_HS_HOST_OTG_HS_HCINT13_TXERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define OTG1_HS_HOST_OTG_HS_HCINT13_BBERR          (0x1UL << 8) 
#define OTG1_HS_HOST_OTG_HS_HCINT13_BBERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OTG1_HS_HOST_OTG_HS_HCINT13_FRMOR          (0x1UL << 9) 
#define OTG1_HS_HOST_OTG_HS_HCINT13_FRMOR_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define OTG1_HS_HOST_OTG_HS_HCINT13_DTERR          (0x1UL << 10) 
#define OTG1_HS_HOST_OTG_HS_HCINT13_DTERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK13_XFRCM          (0x1UL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCINTMSK13_XFRCM_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK13_CHHM          (0x1UL << 1) 
#define OTG1_HS_HOST_OTG_HS_HCINTMSK13_CHHM_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK13_AHBERR          (0x1UL << 2) 
#define OTG1_HS_HOST_OTG_HS_HCINTMSK13_AHBERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK13_STALLM          (0x1UL << 3) 
#define OTG1_HS_HOST_OTG_HS_HCINTMSK13_STALLM_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK13_NAKM          (0x1UL << 4) 
#define OTG1_HS_HOST_OTG_HS_HCINTMSK13_NAKM_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK13_ACKM          (0x1UL << 5) 
#define OTG1_HS_HOST_OTG_HS_HCINTMSK13_ACKM_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK13_NYET          (0x1UL << 6) 
#define OTG1_HS_HOST_OTG_HS_HCINTMSK13_NYET_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK13_TXERRM          (0x1UL << 7) 
#define OTG1_HS_HOST_OTG_HS_HCINTMSK13_TXERRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK13_BBERRM          (0x1UL << 8) 
#define OTG1_HS_HOST_OTG_HS_HCINTMSK13_BBERRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK13_FRMORM          (0x1UL << 9) 
#define OTG1_HS_HOST_OTG_HS_HCINTMSK13_FRMORM_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK13_DTERRM          (0x1UL << 10) 
#define OTG1_HS_HOST_OTG_HS_HCINTMSK13_DTERRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ13_XFRSIZ          (0x7FFFFUL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCTSIZ13_XFRSIZ_VAL(X) (((uint32_t)(X) & 0x7FFFFUL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ13_PKTCNT          (0x3FFUL << 19) 
#define OTG1_HS_HOST_OTG_HS_HCTSIZ13_PKTCNT_VAL(X) (((uint32_t)(X) & 0x3FFUL) << 19)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ13_DPID          (0x3UL << 29) 
#define OTG1_HS_HOST_OTG_HS_HCTSIZ13_DPID_VAL(X) (((uint32_t)(X) & 0x3UL) << 29)
#define OTG1_HS_HOST_OTG_HS_HCDMA13_DMAADDR          (0xFFFFFFFFUL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCDMA13_DMAADDR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCCHAR14_MPSIZ          (0x7FFUL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCCHAR14_MPSIZ_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCCHAR14_EPNUM          (0xFUL << 11) 
#define OTG1_HS_HOST_OTG_HS_HCCHAR14_EPNUM_VAL(X) (((uint32_t)(X) & 0xFUL) << 11)
#define OTG1_HS_HOST_OTG_HS_HCCHAR14_EPDIR          (0x1UL << 15) 
#define OTG1_HS_HOST_OTG_HS_HCCHAR14_EPDIR_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define OTG1_HS_HOST_OTG_HS_HCCHAR14_LSDEV          (0x1UL << 17) 
#define OTG1_HS_HOST_OTG_HS_HCCHAR14_LSDEV_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define OTG1_HS_HOST_OTG_HS_HCCHAR14_EPTYP          (0x3UL << 18) 
#define OTG1_HS_HOST_OTG_HS_HCCHAR14_EPTYP_VAL(X) (((uint32_t)(X) & 0x3UL) << 18)
#define OTG1_HS_HOST_OTG_HS_HCCHAR14_MC          (0x3UL << 20) 
#define OTG1_HS_HOST_OTG_HS_HCCHAR14_MC_VAL(X) (((uint32_t)(X) & 0x3UL) << 20)
#define OTG1_HS_HOST_OTG_HS_HCCHAR14_DAD          (0x7FUL << 22) 
#define OTG1_HS_HOST_OTG_HS_HCCHAR14_DAD_VAL(X) (((uint32_t)(X) & 0x7FUL) << 22)
#define OTG1_HS_HOST_OTG_HS_HCCHAR14_ODDFRM          (0x1UL << 29) 
#define OTG1_HS_HOST_OTG_HS_HCCHAR14_ODDFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define OTG1_HS_HOST_OTG_HS_HCCHAR14_CHDIS          (0x1UL << 30) 
#define OTG1_HS_HOST_OTG_HS_HCCHAR14_CHDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define OTG1_HS_HOST_OTG_HS_HCCHAR14_CHENA          (0x1UL << 31) 
#define OTG1_HS_HOST_OTG_HS_HCCHAR14_CHENA_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG1_HS_HOST_OTG_HS_HCSPLT14_PRTADDR          (0x7FUL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT14_PRTADDR_VAL(X) (((uint32_t)(X) & 0x7FUL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCSPLT14_HUBADDR          (0x7FUL << 7) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT14_HUBADDR_VAL(X) (((uint32_t)(X) & 0x7FUL) << 7)
#define OTG1_HS_HOST_OTG_HS_HCSPLT14_XACTPOS          (0x3UL << 14) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT14_XACTPOS_VAL(X) (((uint32_t)(X) & 0x3UL) << 14)
#define OTG1_HS_HOST_OTG_HS_HCSPLT14_COMPLSPLT          (0x1UL << 16) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT14_COMPLSPLT_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define OTG1_HS_HOST_OTG_HS_HCSPLT14_SPLITEN          (0x1UL << 31) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT14_SPLITEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG1_HS_HOST_OTG_HS_HCINT14_XFRC          (0x1UL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCINT14_XFRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCINT14_CHH          (0x1UL << 1) 
#define OTG1_HS_HOST_OTG_HS_HCINT14_CHH_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG1_HS_HOST_OTG_HS_HCINT14_AHBERR          (0x1UL << 2) 
#define OTG1_HS_HOST_OTG_HS_HCINT14_AHBERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define OTG1_HS_HOST_OTG_HS_HCINT14_STALL          (0x1UL << 3) 
#define OTG1_HS_HOST_OTG_HS_HCINT14_STALL_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG1_HS_HOST_OTG_HS_HCINT14_NAK          (0x1UL << 4) 
#define OTG1_HS_HOST_OTG_HS_HCINT14_NAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG1_HS_HOST_OTG_HS_HCINT14_ACK          (0x1UL << 5) 
#define OTG1_HS_HOST_OTG_HS_HCINT14_ACK_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define OTG1_HS_HOST_OTG_HS_HCINT14_NYET          (0x1UL << 6) 
#define OTG1_HS_HOST_OTG_HS_HCINT14_NYET_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG1_HS_HOST_OTG_HS_HCINT14_TXERR          (0x1UL << 7) 
#define OTG1_HS_HOST_OTG_HS_HCINT14_TXERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define OTG1_HS_HOST_OTG_HS_HCINT14_BBERR          (0x1UL << 8) 
#define OTG1_HS_HOST_OTG_HS_HCINT14_BBERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OTG1_HS_HOST_OTG_HS_HCINT14_FRMOR          (0x1UL << 9) 
#define OTG1_HS_HOST_OTG_HS_HCINT14_FRMOR_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define OTG1_HS_HOST_OTG_HS_HCINT14_DTERR          (0x1UL << 10) 
#define OTG1_HS_HOST_OTG_HS_HCINT14_DTERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK14_XFRCM          (0x1UL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCINTMSK14_XFRCM_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK14_CHHM          (0x1UL << 1) 
#define OTG1_HS_HOST_OTG_HS_HCINTMSK14_CHHM_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK14_AHBERR          (0x1UL << 2) 
#define OTG1_HS_HOST_OTG_HS_HCINTMSK14_AHBERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK14_STALLM          (0x1UL << 3) 
#define OTG1_HS_HOST_OTG_HS_HCINTMSK14_STALLM_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK14_NAKM          (0x1UL << 4) 
#define OTG1_HS_HOST_OTG_HS_HCINTMSK14_NAKM_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK14_ACKM          (0x1UL << 5) 
#define OTG1_HS_HOST_OTG_HS_HCINTMSK14_ACKM_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK14_NYET          (0x1UL << 6) 
#define OTG1_HS_HOST_OTG_HS_HCINTMSK14_NYET_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK14_TXERRM          (0x1UL << 7) 
#define OTG1_HS_HOST_OTG_HS_HCINTMSK14_TXERRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK14_BBERRM          (0x1UL << 8) 
#define OTG1_HS_HOST_OTG_HS_HCINTMSK14_BBERRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK14_FRMORM          (0x1UL << 9) 
#define OTG1_HS_HOST_OTG_HS_HCINTMSK14_FRMORM_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK14_DTERRM          (0x1UL << 10) 
#define OTG1_HS_HOST_OTG_HS_HCINTMSK14_DTERRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ14_XFRSIZ          (0x7FFFFUL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCTSIZ14_XFRSIZ_VAL(X) (((uint32_t)(X) & 0x7FFFFUL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ14_PKTCNT          (0x3FFUL << 19) 
#define OTG1_HS_HOST_OTG_HS_HCTSIZ14_PKTCNT_VAL(X) (((uint32_t)(X) & 0x3FFUL) << 19)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ14_DPID          (0x3UL << 29) 
#define OTG1_HS_HOST_OTG_HS_HCTSIZ14_DPID_VAL(X) (((uint32_t)(X) & 0x3UL) << 29)
#define OTG1_HS_HOST_OTG_HS_HCDMA14_DMAADDR          (0xFFFFFFFFUL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCDMA14_DMAADDR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCCHAR15_MPSIZ          (0x7FFUL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCCHAR15_MPSIZ_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCCHAR15_EPNUM          (0xFUL << 11) 
#define OTG1_HS_HOST_OTG_HS_HCCHAR15_EPNUM_VAL(X) (((uint32_t)(X) & 0xFUL) << 11)
#define OTG1_HS_HOST_OTG_HS_HCCHAR15_EPDIR          (0x1UL << 15) 
#define OTG1_HS_HOST_OTG_HS_HCCHAR15_EPDIR_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define OTG1_HS_HOST_OTG_HS_HCCHAR15_LSDEV          (0x1UL << 17) 
#define OTG1_HS_HOST_OTG_HS_HCCHAR15_LSDEV_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define OTG1_HS_HOST_OTG_HS_HCCHAR15_EPTYP          (0x3UL << 18) 
#define OTG1_HS_HOST_OTG_HS_HCCHAR15_EPTYP_VAL(X) (((uint32_t)(X) & 0x3UL) << 18)
#define OTG1_HS_HOST_OTG_HS_HCCHAR15_MC          (0x3UL << 20) 
#define OTG1_HS_HOST_OTG_HS_HCCHAR15_MC_VAL(X) (((uint32_t)(X) & 0x3UL) << 20)
#define OTG1_HS_HOST_OTG_HS_HCCHAR15_DAD          (0x7FUL << 22) 
#define OTG1_HS_HOST_OTG_HS_HCCHAR15_DAD_VAL(X) (((uint32_t)(X) & 0x7FUL) << 22)
#define OTG1_HS_HOST_OTG_HS_HCCHAR15_ODDFRM          (0x1UL << 29) 
#define OTG1_HS_HOST_OTG_HS_HCCHAR15_ODDFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define OTG1_HS_HOST_OTG_HS_HCCHAR15_CHDIS          (0x1UL << 30) 
#define OTG1_HS_HOST_OTG_HS_HCCHAR15_CHDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define OTG1_HS_HOST_OTG_HS_HCCHAR15_CHENA          (0x1UL << 31) 
