via/viaems/src/platforms/stm32h743/device.h
#define OTG1_HS_HOST_OTG_HS_HCCHAR15_CHENA_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG1_HS_HOST_OTG_HS_HCSPLT15_PRTADDR          (0x7FUL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT15_PRTADDR_VAL(X) (((uint32_t)(X) & 0x7FUL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCSPLT15_HUBADDR          (0x7FUL << 7) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT15_HUBADDR_VAL(X) (((uint32_t)(X) & 0x7FUL) << 7)
#define OTG1_HS_HOST_OTG_HS_HCSPLT15_XACTPOS          (0x3UL << 14) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT15_XACTPOS_VAL(X) (((uint32_t)(X) & 0x3UL) << 14)
#define OTG1_HS_HOST_OTG_HS_HCSPLT15_COMPLSPLT          (0x1UL << 16) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT15_COMPLSPLT_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define OTG1_HS_HOST_OTG_HS_HCSPLT15_SPLITEN          (0x1UL << 31) 
#define OTG1_HS_HOST_OTG_HS_HCSPLT15_SPLITEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG1_HS_HOST_OTG_HS_HCINT15_XFRC          (0x1UL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCINT15_XFRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCINT15_CHH          (0x1UL << 1) 
#define OTG1_HS_HOST_OTG_HS_HCINT15_CHH_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG1_HS_HOST_OTG_HS_HCINT15_AHBERR          (0x1UL << 2) 
#define OTG1_HS_HOST_OTG_HS_HCINT15_AHBERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define OTG1_HS_HOST_OTG_HS_HCINT15_STALL          (0x1UL << 3) 
#define OTG1_HS_HOST_OTG_HS_HCINT15_STALL_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG1_HS_HOST_OTG_HS_HCINT15_NAK          (0x1UL << 4) 
#define OTG1_HS_HOST_OTG_HS_HCINT15_NAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG1_HS_HOST_OTG_HS_HCINT15_ACK          (0x1UL << 5) 
#define OTG1_HS_HOST_OTG_HS_HCINT15_ACK_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define OTG1_HS_HOST_OTG_HS_HCINT15_NYET          (0x1UL << 6) 
#define OTG1_HS_HOST_OTG_HS_HCINT15_NYET_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG1_HS_HOST_OTG_HS_HCINT15_TXERR          (0x1UL << 7) 
#define OTG1_HS_HOST_OTG_HS_HCINT15_TXERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define OTG1_HS_HOST_OTG_HS_HCINT15_BBERR          (0x1UL << 8) 
#define OTG1_HS_HOST_OTG_HS_HCINT15_BBERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OTG1_HS_HOST_OTG_HS_HCINT15_FRMOR          (0x1UL << 9) 
#define OTG1_HS_HOST_OTG_HS_HCINT15_FRMOR_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define OTG1_HS_HOST_OTG_HS_HCINT15_DTERR          (0x1UL << 10) 
#define OTG1_HS_HOST_OTG_HS_HCINT15_DTERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK15_XFRCM          (0x1UL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCINTMSK15_XFRCM_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK15_CHHM          (0x1UL << 1) 
#define OTG1_HS_HOST_OTG_HS_HCINTMSK15_CHHM_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK15_AHBERR          (0x1UL << 2) 
#define OTG1_HS_HOST_OTG_HS_HCINTMSK15_AHBERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK15_STALL          (0x1UL << 3) 
#define OTG1_HS_HOST_OTG_HS_HCINTMSK15_STALL_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK15_NAKM          (0x1UL << 4) 
#define OTG1_HS_HOST_OTG_HS_HCINTMSK15_NAKM_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK15_ACKM          (0x1UL << 5) 
#define OTG1_HS_HOST_OTG_HS_HCINTMSK15_ACKM_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK15_NYET          (0x1UL << 6) 
#define OTG1_HS_HOST_OTG_HS_HCINTMSK15_NYET_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK15_TXERRM          (0x1UL << 7) 
#define OTG1_HS_HOST_OTG_HS_HCINTMSK15_TXERRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK15_BBERRM          (0x1UL << 8) 
#define OTG1_HS_HOST_OTG_HS_HCINTMSK15_BBERRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK15_FRMORM          (0x1UL << 9) 
#define OTG1_HS_HOST_OTG_HS_HCINTMSK15_FRMORM_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK15_DTERRM          (0x1UL << 10) 
#define OTG1_HS_HOST_OTG_HS_HCINTMSK15_DTERRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ15_XFRSIZ          (0x7FFFFUL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCTSIZ15_XFRSIZ_VAL(X) (((uint32_t)(X) & 0x7FFFFUL) << 0)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ15_PKTCNT          (0x3FFUL << 19) 
#define OTG1_HS_HOST_OTG_HS_HCTSIZ15_PKTCNT_VAL(X) (((uint32_t)(X) & 0x3FFUL) << 19)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ15_DPID          (0x3UL << 29) 
#define OTG1_HS_HOST_OTG_HS_HCTSIZ15_DPID_VAL(X) (((uint32_t)(X) & 0x3UL) << 29)
#define OTG1_HS_HOST_OTG_HS_HCDMA15_DMAADDR          (0xFFFFFFFFUL << 0) 
#define OTG1_HS_HOST_OTG_HS_HCDMA15_DMAADDR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)

#define OTG1_HS_HOST  ((struct OTG1_HS_HOST*)(0x40040400UL))
struct OTG2_HS_HOST {
  volatile uint32_t OTG_HS_HCFG;
  volatile uint32_t OTG_HS_HFIR;
  volatile const uint32_t OTG_HS_HFNUM;
  const volatile uint32_t RESERVED16[1];
  volatile uint32_t OTG_HS_HPTXSTS;
  volatile const uint32_t OTG_HS_HAINT;
  volatile uint32_t OTG_HS_HAINTMSK;
  const volatile uint32_t RESERVED64[9];
  volatile uint32_t OTG_HS_HPRT;
  const volatile uint32_t RESERVED256[47];
  volatile uint32_t OTG_HS_HCCHAR0;
  volatile uint32_t OTG_HS_HCSPLT0;
  volatile uint32_t OTG_HS_HCINT0;
  volatile uint32_t OTG_HS_HCINTMSK0;
  volatile uint32_t OTG_HS_HCTSIZ0;
  volatile uint32_t OTG_HS_HCDMA0;
  const volatile uint32_t RESERVED288[2];
  volatile uint32_t OTG_HS_HCCHAR1;
  volatile uint32_t OTG_HS_HCSPLT1;
  volatile uint32_t OTG_HS_HCINT1;
  volatile uint32_t OTG_HS_HCINTMSK1;
  volatile uint32_t OTG_HS_HCTSIZ1;
  volatile uint32_t OTG_HS_HCDMA1;
  const volatile uint32_t RESERVED320[2];
  volatile uint32_t OTG_HS_HCCHAR2;
  volatile uint32_t OTG_HS_HCSPLT2;
  volatile uint32_t OTG_HS_HCINT2;
  volatile uint32_t OTG_HS_HCINTMSK2;
  volatile uint32_t OTG_HS_HCTSIZ2;
  volatile uint32_t OTG_HS_HCDMA2;
  const volatile uint32_t RESERVED352[2];
  volatile uint32_t OTG_HS_HCCHAR3;
  volatile uint32_t OTG_HS_HCSPLT3;
  volatile uint32_t OTG_HS_HCINT3;
  volatile uint32_t OTG_HS_HCINTMSK3;
  volatile uint32_t OTG_HS_HCTSIZ3;
  volatile uint32_t OTG_HS_HCDMA3;
  const volatile uint32_t RESERVED384[2];
  volatile uint32_t OTG_HS_HCCHAR4;
  volatile uint32_t OTG_HS_HCSPLT4;
  volatile uint32_t OTG_HS_HCINT4;
  volatile uint32_t OTG_HS_HCINTMSK4;
  volatile uint32_t OTG_HS_HCTSIZ4;
  volatile uint32_t OTG_HS_HCDMA4;
  const volatile uint32_t RESERVED416[2];
  volatile uint32_t OTG_HS_HCCHAR5;
  volatile uint32_t OTG_HS_HCSPLT5;
  volatile uint32_t OTG_HS_HCINT5;
  volatile uint32_t OTG_HS_HCINTMSK5;
  volatile uint32_t OTG_HS_HCTSIZ5;
  volatile uint32_t OTG_HS_HCDMA5;
  const volatile uint32_t RESERVED448[2];
  volatile uint32_t OTG_HS_HCCHAR6;
  volatile uint32_t OTG_HS_HCSPLT6;
  volatile uint32_t OTG_HS_HCINT6;
  volatile uint32_t OTG_HS_HCINTMSK6;
  volatile uint32_t OTG_HS_HCTSIZ6;
  volatile uint32_t OTG_HS_HCDMA6;
  const volatile uint32_t RESERVED480[2];
  volatile uint32_t OTG_HS_HCCHAR7;
  volatile uint32_t OTG_HS_HCSPLT7;
  volatile uint32_t OTG_HS_HCINT7;
  volatile uint32_t OTG_HS_HCINTMSK7;
  volatile uint32_t OTG_HS_HCTSIZ7;
  volatile uint32_t OTG_HS_HCDMA7;
  const volatile uint32_t RESERVED512[2];
  volatile uint32_t OTG_HS_HCCHAR8;
  volatile uint32_t OTG_HS_HCSPLT8;
  volatile uint32_t OTG_HS_HCINT8;
  volatile uint32_t OTG_HS_HCINTMSK8;
  volatile uint32_t OTG_HS_HCTSIZ8;
  volatile uint32_t OTG_HS_HCDMA8;
  const volatile uint32_t RESERVED544[2];
  volatile uint32_t OTG_HS_HCCHAR9;
  volatile uint32_t OTG_HS_HCSPLT9;
  volatile uint32_t OTG_HS_HCINT9;
  volatile uint32_t OTG_HS_HCINTMSK9;
  volatile uint32_t OTG_HS_HCTSIZ9;
  volatile uint32_t OTG_HS_HCDMA9;
  const volatile uint32_t RESERVED576[2];
  volatile uint32_t OTG_HS_HCCHAR10;
  volatile uint32_t OTG_HS_HCSPLT10;
  volatile uint32_t OTG_HS_HCINT10;
  volatile uint32_t OTG_HS_HCINTMSK10;
  volatile uint32_t OTG_HS_HCTSIZ10;
  volatile uint32_t OTG_HS_HCDMA10;
  const volatile uint32_t RESERVED608[2];
  volatile uint32_t OTG_HS_HCCHAR11;
  volatile uint32_t OTG_HS_HCSPLT11;
  volatile uint32_t OTG_HS_HCINT11;
  volatile uint32_t OTG_HS_HCINTMSK11;
  volatile uint32_t OTG_HS_HCTSIZ11;
  volatile uint32_t OTG_HS_HCDMA11;
  volatile uint32_t OTG_HS_HCCHAR12;
  volatile uint32_t OTG_HS_HCSPLT12;
  volatile uint32_t OTG_HS_HCINT12;
  volatile uint32_t OTG_HS_HCINTMSK12;
  volatile uint32_t OTG_HS_HCTSIZ12;
  volatile uint32_t OTG_HS_HCDMA12;
  volatile uint32_t OTG_HS_HCCHAR13;
  volatile uint32_t OTG_HS_HCSPLT13;
  volatile uint32_t OTG_HS_HCINT13;
  volatile uint32_t OTG_HS_HCINTMSK13;
  volatile uint32_t OTG_HS_HCTSIZ13;
  volatile uint32_t OTG_HS_HCDMA13;
  volatile uint32_t OTG_HS_HCCHAR14;
  volatile uint32_t OTG_HS_HCSPLT14;
  volatile uint32_t OTG_HS_HCINT14;
  volatile uint32_t OTG_HS_HCINTMSK14;
  volatile uint32_t OTG_HS_HCTSIZ14;
  volatile uint32_t OTG_HS_HCDMA14;
  volatile uint32_t OTG_HS_HCCHAR15;
  volatile uint32_t OTG_HS_HCSPLT15;
  volatile uint32_t OTG_HS_HCINT15;
  volatile uint32_t OTG_HS_HCINTMSK15;
  volatile uint32_t OTG_HS_HCTSIZ15;
  volatile uint32_t OTG_HS_HCDMA15;
};
