via/viaems/src/platforms/stm32h743/device.h
#define OTG2_HS_HOST_OTG_HS_HCFG_FSLSPCS          (0x3UL << 0) 
#define OTG2_HS_HOST_OTG_HS_HCFG_FSLSPCS_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define OTG2_HS_HOST_OTG_HS_HCFG_FSLSS          (0x1UL << 2) 
#define OTG2_HS_HOST_OTG_HS_HCFG_FSLSS_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define OTG2_HS_HOST_OTG_HS_HFIR_FRIVL          (0xFFFFUL << 0) 
#define OTG2_HS_HOST_OTG_HS_HFIR_FRIVL_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define OTG2_HS_HOST_OTG_HS_HFNUM_FRNUM          (0xFFFFUL << 0) 
#define OTG2_HS_HOST_OTG_HS_HFNUM_FRNUM_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define OTG2_HS_HOST_OTG_HS_HFNUM_FTREM          (0xFFFFUL << 16) 
#define OTG2_HS_HOST_OTG_HS_HFNUM_FTREM_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define OTG2_HS_HOST_OTG_HS_HPTXSTS_PTXFSAVL          (0xFFFFUL << 0) 
#define OTG2_HS_HOST_OTG_HS_HPTXSTS_PTXFSAVL_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define OTG2_HS_HOST_OTG_HS_HPTXSTS_PTXQSAV          (0xFFUL << 16) 
#define OTG2_HS_HOST_OTG_HS_HPTXSTS_PTXQSAV_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define OTG2_HS_HOST_OTG_HS_HPTXSTS_PTXQTOP          (0xFFUL << 24) 
#define OTG2_HS_HOST_OTG_HS_HPTXSTS_PTXQTOP_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define OTG2_HS_HOST_OTG_HS_HAINT_HAINT          (0xFFFFUL << 0) 
#define OTG2_HS_HOST_OTG_HS_HAINT_HAINT_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define OTG2_HS_HOST_OTG_HS_HAINTMSK_HAINTM          (0xFFFFUL << 0) 
#define OTG2_HS_HOST_OTG_HS_HAINTMSK_HAINTM_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define OTG2_HS_HOST_OTG_HS_HPRT_PCSTS          (0x1UL << 0) 
#define OTG2_HS_HOST_OTG_HS_HPRT_PCSTS_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG2_HS_HOST_OTG_HS_HPRT_PCDET          (0x1UL << 1) 
#define OTG2_HS_HOST_OTG_HS_HPRT_PCDET_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG2_HS_HOST_OTG_HS_HPRT_PENA          (0x1UL << 2) 
#define OTG2_HS_HOST_OTG_HS_HPRT_PENA_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define OTG2_HS_HOST_OTG_HS_HPRT_PENCHNG          (0x1UL << 3) 
#define OTG2_HS_HOST_OTG_HS_HPRT_PENCHNG_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG2_HS_HOST_OTG_HS_HPRT_POCA          (0x1UL << 4) 
#define OTG2_HS_HOST_OTG_HS_HPRT_POCA_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG2_HS_HOST_OTG_HS_HPRT_POCCHNG          (0x1UL << 5) 
#define OTG2_HS_HOST_OTG_HS_HPRT_POCCHNG_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define OTG2_HS_HOST_OTG_HS_HPRT_PRES          (0x1UL << 6) 
#define OTG2_HS_HOST_OTG_HS_HPRT_PRES_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG2_HS_HOST_OTG_HS_HPRT_PSUSP          (0x1UL << 7) 
#define OTG2_HS_HOST_OTG_HS_HPRT_PSUSP_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define OTG2_HS_HOST_OTG_HS_HPRT_PRST          (0x1UL << 8) 
#define OTG2_HS_HOST_OTG_HS_HPRT_PRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OTG2_HS_HOST_OTG_HS_HPRT_PLSTS          (0x3UL << 10) 
#define OTG2_HS_HOST_OTG_HS_HPRT_PLSTS_VAL(X) (((uint32_t)(X) & 0x3UL) << 10)
#define OTG2_HS_HOST_OTG_HS_HPRT_PPWR          (0x1UL << 12) 
#define OTG2_HS_HOST_OTG_HS_HPRT_PPWR_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define OTG2_HS_HOST_OTG_HS_HPRT_PTCTL          (0xFUL << 13) 
#define OTG2_HS_HOST_OTG_HS_HPRT_PTCTL_VAL(X) (((uint32_t)(X) & 0xFUL) << 13)
#define OTG2_HS_HOST_OTG_HS_HPRT_PSPD          (0x3UL << 17) 
#define OTG2_HS_HOST_OTG_HS_HPRT_PSPD_VAL(X) (((uint32_t)(X) & 0x3UL) << 17)
#define OTG2_HS_HOST_OTG_HS_HCCHAR0_MPSIZ          (0x7FFUL << 0) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR0_MPSIZ_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 0)
#define OTG2_HS_HOST_OTG_HS_HCCHAR0_EPNUM          (0xFUL << 11) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR0_EPNUM_VAL(X) (((uint32_t)(X) & 0xFUL) << 11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR0_EPDIR          (0x1UL << 15) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR0_EPDIR_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define OTG2_HS_HOST_OTG_HS_HCCHAR0_LSDEV          (0x1UL << 17) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR0_LSDEV_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define OTG2_HS_HOST_OTG_HS_HCCHAR0_EPTYP          (0x3UL << 18) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR0_EPTYP_VAL(X) (((uint32_t)(X) & 0x3UL) << 18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR0_MC          (0x3UL << 20) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR0_MC_VAL(X) (((uint32_t)(X) & 0x3UL) << 20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR0_DAD          (0x7FUL << 22) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR0_DAD_VAL(X) (((uint32_t)(X) & 0x7FUL) << 22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR0_ODDFRM          (0x1UL << 29) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR0_ODDFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define OTG2_HS_HOST_OTG_HS_HCCHAR0_CHDIS          (0x1UL << 30) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR0_CHDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define OTG2_HS_HOST_OTG_HS_HCCHAR0_CHENA          (0x1UL << 31) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR0_CHENA_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG2_HS_HOST_OTG_HS_HCCHAR1_MPSIZ          (0x7FFUL << 0) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR1_MPSIZ_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 0)
#define OTG2_HS_HOST_OTG_HS_HCCHAR1_EPNUM          (0xFUL << 11) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR1_EPNUM_VAL(X) (((uint32_t)(X) & 0xFUL) << 11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR1_EPDIR          (0x1UL << 15) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR1_EPDIR_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define OTG2_HS_HOST_OTG_HS_HCCHAR1_LSDEV          (0x1UL << 17) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR1_LSDEV_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define OTG2_HS_HOST_OTG_HS_HCCHAR1_EPTYP          (0x3UL << 18) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR1_EPTYP_VAL(X) (((uint32_t)(X) & 0x3UL) << 18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR1_MC          (0x3UL << 20) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR1_MC_VAL(X) (((uint32_t)(X) & 0x3UL) << 20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR1_DAD          (0x7FUL << 22) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR1_DAD_VAL(X) (((uint32_t)(X) & 0x7FUL) << 22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR1_ODDFRM          (0x1UL << 29) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR1_ODDFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define OTG2_HS_HOST_OTG_HS_HCCHAR1_CHDIS          (0x1UL << 30) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR1_CHDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define OTG2_HS_HOST_OTG_HS_HCCHAR1_CHENA          (0x1UL << 31) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR1_CHENA_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG2_HS_HOST_OTG_HS_HCCHAR2_MPSIZ          (0x7FFUL << 0) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR2_MPSIZ_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 0)
#define OTG2_HS_HOST_OTG_HS_HCCHAR2_EPNUM          (0xFUL << 11) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR2_EPNUM_VAL(X) (((uint32_t)(X) & 0xFUL) << 11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR2_EPDIR          (0x1UL << 15) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR2_EPDIR_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define OTG2_HS_HOST_OTG_HS_HCCHAR2_LSDEV          (0x1UL << 17) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR2_LSDEV_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define OTG2_HS_HOST_OTG_HS_HCCHAR2_EPTYP          (0x3UL << 18) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR2_EPTYP_VAL(X) (((uint32_t)(X) & 0x3UL) << 18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR2_MC          (0x3UL << 20) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR2_MC_VAL(X) (((uint32_t)(X) & 0x3UL) << 20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR2_DAD          (0x7FUL << 22) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR2_DAD_VAL(X) (((uint32_t)(X) & 0x7FUL) << 22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR2_ODDFRM          (0x1UL << 29) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR2_ODDFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define OTG2_HS_HOST_OTG_HS_HCCHAR2_CHDIS          (0x1UL << 30) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR2_CHDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define OTG2_HS_HOST_OTG_HS_HCCHAR2_CHENA          (0x1UL << 31) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR2_CHENA_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG2_HS_HOST_OTG_HS_HCCHAR3_MPSIZ          (0x7FFUL << 0) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR3_MPSIZ_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 0)
#define OTG2_HS_HOST_OTG_HS_HCCHAR3_EPNUM          (0xFUL << 11) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR3_EPNUM_VAL(X) (((uint32_t)(X) & 0xFUL) << 11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR3_EPDIR          (0x1UL << 15) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR3_EPDIR_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define OTG2_HS_HOST_OTG_HS_HCCHAR3_LSDEV          (0x1UL << 17) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR3_LSDEV_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define OTG2_HS_HOST_OTG_HS_HCCHAR3_EPTYP          (0x3UL << 18) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR3_EPTYP_VAL(X) (((uint32_t)(X) & 0x3UL) << 18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR3_MC          (0x3UL << 20) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR3_MC_VAL(X) (((uint32_t)(X) & 0x3UL) << 20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR3_DAD          (0x7FUL << 22) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR3_DAD_VAL(X) (((uint32_t)(X) & 0x7FUL) << 22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR3_ODDFRM          (0x1UL << 29) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR3_ODDFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define OTG2_HS_HOST_OTG_HS_HCCHAR3_CHDIS          (0x1UL << 30) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR3_CHDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define OTG2_HS_HOST_OTG_HS_HCCHAR3_CHENA          (0x1UL << 31) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR3_CHENA_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG2_HS_HOST_OTG_HS_HCCHAR4_MPSIZ          (0x7FFUL << 0) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR4_MPSIZ_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 0)
#define OTG2_HS_HOST_OTG_HS_HCCHAR4_EPNUM          (0xFUL << 11) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR4_EPNUM_VAL(X) (((uint32_t)(X) & 0xFUL) << 11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR4_EPDIR          (0x1UL << 15) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR4_EPDIR_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define OTG2_HS_HOST_OTG_HS_HCCHAR4_LSDEV          (0x1UL << 17) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR4_LSDEV_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define OTG2_HS_HOST_OTG_HS_HCCHAR4_EPTYP          (0x3UL << 18) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR4_EPTYP_VAL(X) (((uint32_t)(X) & 0x3UL) << 18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR4_MC          (0x3UL << 20) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR4_MC_VAL(X) (((uint32_t)(X) & 0x3UL) << 20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR4_DAD          (0x7FUL << 22) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR4_DAD_VAL(X) (((uint32_t)(X) & 0x7FUL) << 22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR4_ODDFRM          (0x1UL << 29) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR4_ODDFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define OTG2_HS_HOST_OTG_HS_HCCHAR4_CHDIS          (0x1UL << 30) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR4_CHDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define OTG2_HS_HOST_OTG_HS_HCCHAR4_CHENA          (0x1UL << 31) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR4_CHENA_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG2_HS_HOST_OTG_HS_HCCHAR5_MPSIZ          (0x7FFUL << 0) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR5_MPSIZ_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 0)
#define OTG2_HS_HOST_OTG_HS_HCCHAR5_EPNUM          (0xFUL << 11) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR5_EPNUM_VAL(X) (((uint32_t)(X) & 0xFUL) << 11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR5_EPDIR          (0x1UL << 15) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR5_EPDIR_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define OTG2_HS_HOST_OTG_HS_HCCHAR5_LSDEV          (0x1UL << 17) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR5_LSDEV_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define OTG2_HS_HOST_OTG_HS_HCCHAR5_EPTYP          (0x3UL << 18) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR5_EPTYP_VAL(X) (((uint32_t)(X) & 0x3UL) << 18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR5_MC          (0x3UL << 20) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR5_MC_VAL(X) (((uint32_t)(X) & 0x3UL) << 20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR5_DAD          (0x7FUL << 22) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR5_DAD_VAL(X) (((uint32_t)(X) & 0x7FUL) << 22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR5_ODDFRM          (0x1UL << 29) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR5_ODDFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define OTG2_HS_HOST_OTG_HS_HCCHAR5_CHDIS          (0x1UL << 30) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR5_CHDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define OTG2_HS_HOST_OTG_HS_HCCHAR5_CHENA          (0x1UL << 31) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR5_CHENA_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG2_HS_HOST_OTG_HS_HCCHAR6_MPSIZ          (0x7FFUL << 0) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR6_MPSIZ_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 0)
#define OTG2_HS_HOST_OTG_HS_HCCHAR6_EPNUM          (0xFUL << 11) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR6_EPNUM_VAL(X) (((uint32_t)(X) & 0xFUL) << 11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR6_EPDIR          (0x1UL << 15) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR6_EPDIR_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define OTG2_HS_HOST_OTG_HS_HCCHAR6_LSDEV          (0x1UL << 17) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR6_LSDEV_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define OTG2_HS_HOST_OTG_HS_HCCHAR6_EPTYP          (0x3UL << 18) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR6_EPTYP_VAL(X) (((uint32_t)(X) & 0x3UL) << 18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR6_MC          (0x3UL << 20) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR6_MC_VAL(X) (((uint32_t)(X) & 0x3UL) << 20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR6_DAD          (0x7FUL << 22) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR6_DAD_VAL(X) (((uint32_t)(X) & 0x7FUL) << 22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR6_ODDFRM          (0x1UL << 29) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR6_ODDFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define OTG2_HS_HOST_OTG_HS_HCCHAR6_CHDIS          (0x1UL << 30) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR6_CHDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define OTG2_HS_HOST_OTG_HS_HCCHAR6_CHENA          (0x1UL << 31) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR6_CHENA_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_MPSIZ          (0x7FFUL << 0) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_MPSIZ_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 0)
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_EPNUM          (0xFUL << 11) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_EPNUM_VAL(X) (((uint32_t)(X) & 0xFUL) << 11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_EPDIR          (0x1UL << 15) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_EPDIR_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_LSDEV          (0x1UL << 17) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_LSDEV_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_EPTYP          (0x3UL << 18) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_EPTYP_VAL(X) (((uint32_t)(X) & 0x3UL) << 18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_MC          (0x3UL << 20) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_MC_VAL(X) (((uint32_t)(X) & 0x3UL) << 20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_DAD          (0x7FUL << 22) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_DAD_VAL(X) (((uint32_t)(X) & 0x7FUL) << 22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_ODDFRM          (0x1UL << 29) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_ODDFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_CHDIS          (0x1UL << 30) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_CHDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_CHENA          (0x1UL << 31) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_CHENA_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG2_HS_HOST_OTG_HS_HCCHAR8_MPSIZ          (0x7FFUL << 0) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR8_MPSIZ_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 0)
#define OTG2_HS_HOST_OTG_HS_HCCHAR8_EPNUM          (0xFUL << 11) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR8_EPNUM_VAL(X) (((uint32_t)(X) & 0xFUL) << 11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR8_EPDIR          (0x1UL << 15) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR8_EPDIR_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define OTG2_HS_HOST_OTG_HS_HCCHAR8_LSDEV          (0x1UL << 17) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR8_LSDEV_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define OTG2_HS_HOST_OTG_HS_HCCHAR8_EPTYP          (0x3UL << 18) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR8_EPTYP_VAL(X) (((uint32_t)(X) & 0x3UL) << 18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR8_MC          (0x3UL << 20) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR8_MC_VAL(X) (((uint32_t)(X) & 0x3UL) << 20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR8_DAD          (0x7FUL << 22) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR8_DAD_VAL(X) (((uint32_t)(X) & 0x7FUL) << 22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR8_ODDFRM          (0x1UL << 29) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR8_ODDFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define OTG2_HS_HOST_OTG_HS_HCCHAR8_CHDIS          (0x1UL << 30) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR8_CHDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define OTG2_HS_HOST_OTG_HS_HCCHAR8_CHENA          (0x1UL << 31) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR8_CHENA_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG2_HS_HOST_OTG_HS_HCCHAR9_MPSIZ          (0x7FFUL << 0) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR9_MPSIZ_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 0)
#define OTG2_HS_HOST_OTG_HS_HCCHAR9_EPNUM          (0xFUL << 11) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR9_EPNUM_VAL(X) (((uint32_t)(X) & 0xFUL) << 11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR9_EPDIR          (0x1UL << 15) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR9_EPDIR_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define OTG2_HS_HOST_OTG_HS_HCCHAR9_LSDEV          (0x1UL << 17) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR9_LSDEV_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define OTG2_HS_HOST_OTG_HS_HCCHAR9_EPTYP          (0x3UL << 18) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR9_EPTYP_VAL(X) (((uint32_t)(X) & 0x3UL) << 18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR9_MC          (0x3UL << 20) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR9_MC_VAL(X) (((uint32_t)(X) & 0x3UL) << 20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR9_DAD          (0x7FUL << 22) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR9_DAD_VAL(X) (((uint32_t)(X) & 0x7FUL) << 22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR9_ODDFRM          (0x1UL << 29) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR9_ODDFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define OTG2_HS_HOST_OTG_HS_HCCHAR9_CHDIS          (0x1UL << 30) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR9_CHDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define OTG2_HS_HOST_OTG_HS_HCCHAR9_CHENA          (0x1UL << 31) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR9_CHENA_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG2_HS_HOST_OTG_HS_HCCHAR10_MPSIZ          (0x7FFUL << 0) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR10_MPSIZ_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 0)
#define OTG2_HS_HOST_OTG_HS_HCCHAR10_EPNUM          (0xFUL << 11) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR10_EPNUM_VAL(X) (((uint32_t)(X) & 0xFUL) << 11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR10_EPDIR          (0x1UL << 15) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR10_EPDIR_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define OTG2_HS_HOST_OTG_HS_HCCHAR10_LSDEV          (0x1UL << 17) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR10_LSDEV_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define OTG2_HS_HOST_OTG_HS_HCCHAR10_EPTYP          (0x3UL << 18) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR10_EPTYP_VAL(X) (((uint32_t)(X) & 0x3UL) << 18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR10_MC          (0x3UL << 20) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR10_MC_VAL(X) (((uint32_t)(X) & 0x3UL) << 20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR10_DAD          (0x7FUL << 22) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR10_DAD_VAL(X) (((uint32_t)(X) & 0x7FUL) << 22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR10_ODDFRM          (0x1UL << 29) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR10_ODDFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define OTG2_HS_HOST_OTG_HS_HCCHAR10_CHDIS          (0x1UL << 30) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR10_CHDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define OTG2_HS_HOST_OTG_HS_HCCHAR10_CHENA          (0x1UL << 31) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR10_CHENA_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG2_HS_HOST_OTG_HS_HCCHAR11_MPSIZ          (0x7FFUL << 0) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR11_MPSIZ_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 0)
#define OTG2_HS_HOST_OTG_HS_HCCHAR11_EPNUM          (0xFUL << 11) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR11_EPNUM_VAL(X) (((uint32_t)(X) & 0xFUL) << 11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR11_EPDIR          (0x1UL << 15) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR11_EPDIR_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define OTG2_HS_HOST_OTG_HS_HCCHAR11_LSDEV          (0x1UL << 17) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR11_LSDEV_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define OTG2_HS_HOST_OTG_HS_HCCHAR11_EPTYP          (0x3UL << 18) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR11_EPTYP_VAL(X) (((uint32_t)(X) & 0x3UL) << 18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR11_MC          (0x3UL << 20) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR11_MC_VAL(X) (((uint32_t)(X) & 0x3UL) << 20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR11_DAD          (0x7FUL << 22) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR11_DAD_VAL(X) (((uint32_t)(X) & 0x7FUL) << 22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR11_ODDFRM          (0x1UL << 29) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR11_ODDFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define OTG2_HS_HOST_OTG_HS_HCCHAR11_CHDIS          (0x1UL << 30) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR11_CHDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define OTG2_HS_HOST_OTG_HS_HCCHAR11_CHENA          (0x1UL << 31) 
#define OTG2_HS_HOST_OTG_HS_HCCHAR11_CHENA_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG2_HS_HOST_OTG_HS_HCSPLT0_PRTADDR          (0x7FUL << 0) 
#define OTG2_HS_HOST_OTG_HS_HCSPLT0_PRTADDR_VAL(X) (((uint32_t)(X) & 0x7FUL) << 0)
#define OTG2_HS_HOST_OTG_HS_HCSPLT0_HUBADDR          (0x7FUL << 7) 
#define OTG2_HS_HOST_OTG_HS_HCSPLT0_HUBADDR_VAL(X) (((uint32_t)(X) & 0x7FUL) << 7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT0_XACTPOS          (0x3UL << 14) 
#define OTG2_HS_HOST_OTG_HS_HCSPLT0_XACTPOS_VAL(X) (((uint32_t)(X) & 0x3UL) << 14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT0_COMPLSPLT          (0x1UL << 16) 
#define OTG2_HS_HOST_OTG_HS_HCSPLT0_COMPLSPLT_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define OTG2_HS_HOST_OTG_HS_HCSPLT0_SPLITEN          (0x1UL << 31) 
#define OTG2_HS_HOST_OTG_HS_HCSPLT0_SPLITEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG2_HS_HOST_OTG_HS_HCSPLT1_PRTADDR          (0x7FUL << 0) 
#define OTG2_HS_HOST_OTG_HS_HCSPLT1_PRTADDR_VAL(X) (((uint32_t)(X) & 0x7FUL) << 0)
#define OTG2_HS_HOST_OTG_HS_HCSPLT1_HUBADDR          (0x7FUL << 7) 
#define OTG2_HS_HOST_OTG_HS_HCSPLT1_HUBADDR_VAL(X) (((uint32_t)(X) & 0x7FUL) << 7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT1_XACTPOS          (0x3UL << 14) 
#define OTG2_HS_HOST_OTG_HS_HCSPLT1_XACTPOS_VAL(X) (((uint32_t)(X) & 0x3UL) << 14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT1_COMPLSPLT          (0x1UL << 16) 
#define OTG2_HS_HOST_OTG_HS_HCSPLT1_COMPLSPLT_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define OTG2_HS_HOST_OTG_HS_HCSPLT1_SPLITEN          (0x1UL << 31) 
#define OTG2_HS_HOST_OTG_HS_HCSPLT1_SPLITEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG2_HS_HOST_OTG_HS_HCSPLT2_PRTADDR          (0x7FUL << 0) 
#define OTG2_HS_HOST_OTG_HS_HCSPLT2_PRTADDR_VAL(X) (((uint32_t)(X) & 0x7FUL) << 0)
#define OTG2_HS_HOST_OTG_HS_HCSPLT2_HUBADDR          (0x7FUL << 7) 
#define OTG2_HS_HOST_OTG_HS_HCSPLT2_HUBADDR_VAL(X) (((uint32_t)(X) & 0x7FUL) << 7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT2_XACTPOS          (0x3UL << 14) 
#define OTG2_HS_HOST_OTG_HS_HCSPLT2_XACTPOS_VAL(X) (((uint32_t)(X) & 0x3UL) << 14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT2_COMPLSPLT          (0x1UL << 16) 
#define OTG2_HS_HOST_OTG_HS_HCSPLT2_COMPLSPLT_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define OTG2_HS_HOST_OTG_HS_HCSPLT2_SPLITEN          (0x1UL << 31) 
#define OTG2_HS_HOST_OTG_HS_HCSPLT2_SPLITEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG2_HS_HOST_OTG_HS_HCSPLT3_PRTADDR          (0x7FUL << 0) 
#define OTG2_HS_HOST_OTG_HS_HCSPLT3_PRTADDR_VAL(X) (((uint32_t)(X) & 0x7FUL) << 0)
#define OTG2_HS_HOST_OTG_HS_HCSPLT3_HUBADDR          (0x7FUL << 7) 
#define OTG2_HS_HOST_OTG_HS_HCSPLT3_HUBADDR_VAL(X) (((uint32_t)(X) & 0x7FUL) << 7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT3_XACTPOS          (0x3UL << 14) 
#define OTG2_HS_HOST_OTG_HS_HCSPLT3_XACTPOS_VAL(X) (((uint32_t)(X) & 0x3UL) << 14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT3_COMPLSPLT          (0x1UL << 16) 
#define OTG2_HS_HOST_OTG_HS_HCSPLT3_COMPLSPLT_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define OTG2_HS_HOST_OTG_HS_HCSPLT3_SPLITEN          (0x1UL << 31) 
#define OTG2_HS_HOST_OTG_HS_HCSPLT3_SPLITEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
