via/viaems/src/platforms/stm32h743/device.h
#define OTG2_HS_HOST_OTG_HS_HCINT11_NAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG2_HS_HOST_OTG_HS_HCINT11_ACK          (0x1UL << 5) 
#define OTG2_HS_HOST_OTG_HS_HCINT11_ACK_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define OTG2_HS_HOST_OTG_HS_HCINT11_NYET          (0x1UL << 6) 
#define OTG2_HS_HOST_OTG_HS_HCINT11_NYET_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG2_HS_HOST_OTG_HS_HCINT11_TXERR          (0x1UL << 7) 
#define OTG2_HS_HOST_OTG_HS_HCINT11_TXERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define OTG2_HS_HOST_OTG_HS_HCINT11_BBERR          (0x1UL << 8) 
#define OTG2_HS_HOST_OTG_HS_HCINT11_BBERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OTG2_HS_HOST_OTG_HS_HCINT11_FRMOR          (0x1UL << 9) 
#define OTG2_HS_HOST_OTG_HS_HCINT11_FRMOR_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define OTG2_HS_HOST_OTG_HS_HCINT11_DTERR          (0x1UL << 10) 
#define OTG2_HS_HOST_OTG_HS_HCINT11_DTERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK0_XFRCM          (0x1UL << 0) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK0_XFRCM_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK0_CHHM          (0x1UL << 1) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK0_CHHM_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK0_AHBERR          (0x1UL << 2) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK0_AHBERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK0_STALLM          (0x1UL << 3) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK0_STALLM_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK0_NAKM          (0x1UL << 4) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK0_NAKM_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK0_ACKM          (0x1UL << 5) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK0_ACKM_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK0_NYET          (0x1UL << 6) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK0_NYET_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK0_TXERRM          (0x1UL << 7) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK0_TXERRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK0_BBERRM          (0x1UL << 8) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK0_BBERRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK0_FRMORM          (0x1UL << 9) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK0_FRMORM_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK0_DTERRM          (0x1UL << 10) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK0_DTERRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK1_XFRCM          (0x1UL << 0) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK1_XFRCM_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK1_CHHM          (0x1UL << 1) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK1_CHHM_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK1_AHBERR          (0x1UL << 2) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK1_AHBERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK1_STALLM          (0x1UL << 3) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK1_STALLM_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK1_NAKM          (0x1UL << 4) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK1_NAKM_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK1_ACKM          (0x1UL << 5) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK1_ACKM_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK1_NYET          (0x1UL << 6) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK1_NYET_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK1_TXERRM          (0x1UL << 7) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK1_TXERRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK1_BBERRM          (0x1UL << 8) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK1_BBERRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK1_FRMORM          (0x1UL << 9) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK1_FRMORM_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK1_DTERRM          (0x1UL << 10) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK1_DTERRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK2_XFRCM          (0x1UL << 0) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK2_XFRCM_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK2_CHHM          (0x1UL << 1) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK2_CHHM_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK2_AHBERR          (0x1UL << 2) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK2_AHBERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK2_STALLM          (0x1UL << 3) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK2_STALLM_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK2_NAKM          (0x1UL << 4) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK2_NAKM_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK2_ACKM          (0x1UL << 5) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK2_ACKM_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK2_NYET          (0x1UL << 6) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK2_NYET_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK2_TXERRM          (0x1UL << 7) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK2_TXERRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK2_BBERRM          (0x1UL << 8) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK2_BBERRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK2_FRMORM          (0x1UL << 9) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK2_FRMORM_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK2_DTERRM          (0x1UL << 10) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK2_DTERRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK3_XFRCM          (0x1UL << 0) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK3_XFRCM_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK3_CHHM          (0x1UL << 1) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK3_CHHM_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK3_AHBERR          (0x1UL << 2) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK3_AHBERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK3_STALLM          (0x1UL << 3) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK3_STALLM_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK3_NAKM          (0x1UL << 4) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK3_NAKM_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK3_ACKM          (0x1UL << 5) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK3_ACKM_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK3_NYET          (0x1UL << 6) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK3_NYET_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK3_TXERRM          (0x1UL << 7) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK3_TXERRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK3_BBERRM          (0x1UL << 8) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK3_BBERRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK3_FRMORM          (0x1UL << 9) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK3_FRMORM_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK3_DTERRM          (0x1UL << 10) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK3_DTERRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK4_XFRCM          (0x1UL << 0) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK4_XFRCM_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK4_CHHM          (0x1UL << 1) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK4_CHHM_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK4_AHBERR          (0x1UL << 2) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK4_AHBERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK4_STALLM          (0x1UL << 3) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK4_STALLM_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK4_NAKM          (0x1UL << 4) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK4_NAKM_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK4_ACKM          (0x1UL << 5) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK4_ACKM_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK4_NYET          (0x1UL << 6) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK4_NYET_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK4_TXERRM          (0x1UL << 7) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK4_TXERRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK4_BBERRM          (0x1UL << 8) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK4_BBERRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK4_FRMORM          (0x1UL << 9) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK4_FRMORM_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK4_DTERRM          (0x1UL << 10) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK4_DTERRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK5_XFRCM          (0x1UL << 0) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK5_XFRCM_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK5_CHHM          (0x1UL << 1) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK5_CHHM_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK5_AHBERR          (0x1UL << 2) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK5_AHBERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK5_STALLM          (0x1UL << 3) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK5_STALLM_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK5_NAKM          (0x1UL << 4) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK5_NAKM_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK5_ACKM          (0x1UL << 5) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK5_ACKM_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK5_NYET          (0x1UL << 6) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK5_NYET_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK5_TXERRM          (0x1UL << 7) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK5_TXERRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK5_BBERRM          (0x1UL << 8) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK5_BBERRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK5_FRMORM          (0x1UL << 9) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK5_FRMORM_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK5_DTERRM          (0x1UL << 10) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK5_DTERRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK6_XFRCM          (0x1UL << 0) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK6_XFRCM_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK6_CHHM          (0x1UL << 1) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK6_CHHM_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK6_AHBERR          (0x1UL << 2) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK6_AHBERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK6_STALLM          (0x1UL << 3) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK6_STALLM_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK6_NAKM          (0x1UL << 4) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK6_NAKM_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK6_ACKM          (0x1UL << 5) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK6_ACKM_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK6_NYET          (0x1UL << 6) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK6_NYET_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK6_TXERRM          (0x1UL << 7) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK6_TXERRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK6_BBERRM          (0x1UL << 8) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK6_BBERRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK6_FRMORM          (0x1UL << 9) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK6_FRMORM_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK6_DTERRM          (0x1UL << 10) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK6_DTERRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_XFRCM          (0x1UL << 0) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_XFRCM_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_CHHM          (0x1UL << 1) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_CHHM_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_AHBERR          (0x1UL << 2) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_AHBERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_STALLM          (0x1UL << 3) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_STALLM_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_NAKM          (0x1UL << 4) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_NAKM_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_ACKM          (0x1UL << 5) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_ACKM_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_NYET          (0x1UL << 6) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_NYET_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_TXERRM          (0x1UL << 7) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_TXERRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_BBERRM          (0x1UL << 8) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_BBERRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_FRMORM          (0x1UL << 9) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_FRMORM_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_DTERRM          (0x1UL << 10) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_DTERRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK8_XFRCM          (0x1UL << 0) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK8_XFRCM_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK8_CHHM          (0x1UL << 1) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK8_CHHM_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK8_AHBERR          (0x1UL << 2) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK8_AHBERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK8_STALLM          (0x1UL << 3) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK8_STALLM_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK8_NAKM          (0x1UL << 4) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK8_NAKM_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK8_ACKM          (0x1UL << 5) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK8_ACKM_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK8_NYET          (0x1UL << 6) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK8_NYET_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK8_TXERRM          (0x1UL << 7) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK8_TXERRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK8_BBERRM          (0x1UL << 8) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK8_BBERRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK8_FRMORM          (0x1UL << 9) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK8_FRMORM_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK8_DTERRM          (0x1UL << 10) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK8_DTERRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK9_XFRCM          (0x1UL << 0) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK9_XFRCM_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK9_CHHM          (0x1UL << 1) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK9_CHHM_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK9_AHBERR          (0x1UL << 2) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK9_AHBERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK9_STALLM          (0x1UL << 3) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK9_STALLM_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK9_NAKM          (0x1UL << 4) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK9_NAKM_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK9_ACKM          (0x1UL << 5) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK9_ACKM_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK9_NYET          (0x1UL << 6) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK9_NYET_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK9_TXERRM          (0x1UL << 7) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK9_TXERRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK9_BBERRM          (0x1UL << 8) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK9_BBERRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK9_FRMORM          (0x1UL << 9) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK9_FRMORM_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK9_DTERRM          (0x1UL << 10) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK9_DTERRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK10_XFRCM          (0x1UL << 0) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK10_XFRCM_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK10_CHHM          (0x1UL << 1) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK10_CHHM_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK10_AHBERR          (0x1UL << 2) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK10_AHBERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK10_STALLM          (0x1UL << 3) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK10_STALLM_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK10_NAKM          (0x1UL << 4) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK10_NAKM_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK10_ACKM          (0x1UL << 5) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK10_ACKM_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK10_NYET          (0x1UL << 6) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK10_NYET_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK10_TXERRM          (0x1UL << 7) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK10_TXERRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK10_BBERRM          (0x1UL << 8) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK10_BBERRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK10_FRMORM          (0x1UL << 9) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK10_FRMORM_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK10_DTERRM          (0x1UL << 10) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK10_DTERRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK11_XFRCM          (0x1UL << 0) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK11_XFRCM_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK11_CHHM          (0x1UL << 1) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK11_CHHM_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK11_AHBERR          (0x1UL << 2) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK11_AHBERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK11_STALLM          (0x1UL << 3) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK11_STALLM_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK11_NAKM          (0x1UL << 4) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK11_NAKM_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK11_ACKM          (0x1UL << 5) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK11_ACKM_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK11_NYET          (0x1UL << 6) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK11_NYET_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK11_TXERRM          (0x1UL << 7) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK11_TXERRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK11_BBERRM          (0x1UL << 8) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK11_BBERRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK11_FRMORM          (0x1UL << 9) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK11_FRMORM_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK11_DTERRM          (0x1UL << 10) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK11_DTERRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ0_XFRSIZ          (0x7FFFFUL << 0) 
#define OTG2_HS_HOST_OTG_HS_HCTSIZ0_XFRSIZ_VAL(X) (((uint32_t)(X) & 0x7FFFFUL) << 0)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ0_PKTCNT          (0x3FFUL << 19) 
#define OTG2_HS_HOST_OTG_HS_HCTSIZ0_PKTCNT_VAL(X) (((uint32_t)(X) & 0x3FFUL) << 19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ0_DPID          (0x3UL << 29) 
#define OTG2_HS_HOST_OTG_HS_HCTSIZ0_DPID_VAL(X) (((uint32_t)(X) & 0x3UL) << 29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ1_XFRSIZ          (0x7FFFFUL << 0) 
#define OTG2_HS_HOST_OTG_HS_HCTSIZ1_XFRSIZ_VAL(X) (((uint32_t)(X) & 0x7FFFFUL) << 0)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ1_PKTCNT          (0x3FFUL << 19) 
#define OTG2_HS_HOST_OTG_HS_HCTSIZ1_PKTCNT_VAL(X) (((uint32_t)(X) & 0x3FFUL) << 19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ1_DPID          (0x3UL << 29) 
#define OTG2_HS_HOST_OTG_HS_HCTSIZ1_DPID_VAL(X) (((uint32_t)(X) & 0x3UL) << 29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ2_XFRSIZ          (0x7FFFFUL << 0) 
#define OTG2_HS_HOST_OTG_HS_HCTSIZ2_XFRSIZ_VAL(X) (((uint32_t)(X) & 0x7FFFFUL) << 0)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ2_PKTCNT          (0x3FFUL << 19) 
#define OTG2_HS_HOST_OTG_HS_HCTSIZ2_PKTCNT_VAL(X) (((uint32_t)(X) & 0x3FFUL) << 19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ2_DPID          (0x3UL << 29) 
#define OTG2_HS_HOST_OTG_HS_HCTSIZ2_DPID_VAL(X) (((uint32_t)(X) & 0x3UL) << 29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ3_XFRSIZ          (0x7FFFFUL << 0) 
#define OTG2_HS_HOST_OTG_HS_HCTSIZ3_XFRSIZ_VAL(X) (((uint32_t)(X) & 0x7FFFFUL) << 0)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ3_PKTCNT          (0x3FFUL << 19) 
#define OTG2_HS_HOST_OTG_HS_HCTSIZ3_PKTCNT_VAL(X) (((uint32_t)(X) & 0x3FFUL) << 19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ3_DPID          (0x3UL << 29) 
#define OTG2_HS_HOST_OTG_HS_HCTSIZ3_DPID_VAL(X) (((uint32_t)(X) & 0x3UL) << 29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ4_XFRSIZ          (0x7FFFFUL << 0) 
#define OTG2_HS_HOST_OTG_HS_HCTSIZ4_XFRSIZ_VAL(X) (((uint32_t)(X) & 0x7FFFFUL) << 0)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ4_PKTCNT          (0x3FFUL << 19) 
#define OTG2_HS_HOST_OTG_HS_HCTSIZ4_PKTCNT_VAL(X) (((uint32_t)(X) & 0x3FFUL) << 19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ4_DPID          (0x3UL << 29) 
#define OTG2_HS_HOST_OTG_HS_HCTSIZ4_DPID_VAL(X) (((uint32_t)(X) & 0x3UL) << 29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ5_XFRSIZ          (0x7FFFFUL << 0) 
#define OTG2_HS_HOST_OTG_HS_HCTSIZ5_XFRSIZ_VAL(X) (((uint32_t)(X) & 0x7FFFFUL) << 0)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ5_PKTCNT          (0x3FFUL << 19) 
#define OTG2_HS_HOST_OTG_HS_HCTSIZ5_PKTCNT_VAL(X) (((uint32_t)(X) & 0x3FFUL) << 19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ5_DPID          (0x3UL << 29) 
#define OTG2_HS_HOST_OTG_HS_HCTSIZ5_DPID_VAL(X) (((uint32_t)(X) & 0x3UL) << 29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ6_XFRSIZ          (0x7FFFFUL << 0) 
#define OTG2_HS_HOST_OTG_HS_HCTSIZ6_XFRSIZ_VAL(X) (((uint32_t)(X) & 0x7FFFFUL) << 0)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ6_PKTCNT          (0x3FFUL << 19) 
#define OTG2_HS_HOST_OTG_HS_HCTSIZ6_PKTCNT_VAL(X) (((uint32_t)(X) & 0x3FFUL) << 19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ6_DPID          (0x3UL << 29) 
#define OTG2_HS_HOST_OTG_HS_HCTSIZ6_DPID_VAL(X) (((uint32_t)(X) & 0x3UL) << 29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ7_XFRSIZ          (0x7FFFFUL << 0) 
