via/viaems/src/platforms/stm32h743/device.h
#define OTG2_HS_HOST_OTG_HS_HCCHAR15_CHENA_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG2_HS_HOST_OTG_HS_HCSPLT15_PRTADDR          (0x7FUL << 0) 
#define OTG2_HS_HOST_OTG_HS_HCSPLT15_PRTADDR_VAL(X) (((uint32_t)(X) & 0x7FUL) << 0)
#define OTG2_HS_HOST_OTG_HS_HCSPLT15_HUBADDR          (0x7FUL << 7) 
#define OTG2_HS_HOST_OTG_HS_HCSPLT15_HUBADDR_VAL(X) (((uint32_t)(X) & 0x7FUL) << 7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT15_XACTPOS          (0x3UL << 14) 
#define OTG2_HS_HOST_OTG_HS_HCSPLT15_XACTPOS_VAL(X) (((uint32_t)(X) & 0x3UL) << 14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT15_COMPLSPLT          (0x1UL << 16) 
#define OTG2_HS_HOST_OTG_HS_HCSPLT15_COMPLSPLT_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define OTG2_HS_HOST_OTG_HS_HCSPLT15_SPLITEN          (0x1UL << 31) 
#define OTG2_HS_HOST_OTG_HS_HCSPLT15_SPLITEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG2_HS_HOST_OTG_HS_HCINT15_XFRC          (0x1UL << 0) 
#define OTG2_HS_HOST_OTG_HS_HCINT15_XFRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG2_HS_HOST_OTG_HS_HCINT15_CHH          (0x1UL << 1) 
#define OTG2_HS_HOST_OTG_HS_HCINT15_CHH_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG2_HS_HOST_OTG_HS_HCINT15_AHBERR          (0x1UL << 2) 
#define OTG2_HS_HOST_OTG_HS_HCINT15_AHBERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define OTG2_HS_HOST_OTG_HS_HCINT15_STALL          (0x1UL << 3) 
#define OTG2_HS_HOST_OTG_HS_HCINT15_STALL_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG2_HS_HOST_OTG_HS_HCINT15_NAK          (0x1UL << 4) 
#define OTG2_HS_HOST_OTG_HS_HCINT15_NAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG2_HS_HOST_OTG_HS_HCINT15_ACK          (0x1UL << 5) 
#define OTG2_HS_HOST_OTG_HS_HCINT15_ACK_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define OTG2_HS_HOST_OTG_HS_HCINT15_NYET          (0x1UL << 6) 
#define OTG2_HS_HOST_OTG_HS_HCINT15_NYET_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG2_HS_HOST_OTG_HS_HCINT15_TXERR          (0x1UL << 7) 
#define OTG2_HS_HOST_OTG_HS_HCINT15_TXERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define OTG2_HS_HOST_OTG_HS_HCINT15_BBERR          (0x1UL << 8) 
#define OTG2_HS_HOST_OTG_HS_HCINT15_BBERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OTG2_HS_HOST_OTG_HS_HCINT15_FRMOR          (0x1UL << 9) 
#define OTG2_HS_HOST_OTG_HS_HCINT15_FRMOR_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define OTG2_HS_HOST_OTG_HS_HCINT15_DTERR          (0x1UL << 10) 
#define OTG2_HS_HOST_OTG_HS_HCINT15_DTERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK15_XFRCM          (0x1UL << 0) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK15_XFRCM_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK15_CHHM          (0x1UL << 1) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK15_CHHM_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK15_AHBERR          (0x1UL << 2) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK15_AHBERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK15_STALL          (0x1UL << 3) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK15_STALL_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK15_NAKM          (0x1UL << 4) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK15_NAKM_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK15_ACKM          (0x1UL << 5) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK15_ACKM_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK15_NYET          (0x1UL << 6) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK15_NYET_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK15_TXERRM          (0x1UL << 7) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK15_TXERRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK15_BBERRM          (0x1UL << 8) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK15_BBERRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK15_FRMORM          (0x1UL << 9) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK15_FRMORM_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK15_DTERRM          (0x1UL << 10) 
#define OTG2_HS_HOST_OTG_HS_HCINTMSK15_DTERRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ15_XFRSIZ          (0x7FFFFUL << 0) 
#define OTG2_HS_HOST_OTG_HS_HCTSIZ15_XFRSIZ_VAL(X) (((uint32_t)(X) & 0x7FFFFUL) << 0)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ15_PKTCNT          (0x3FFUL << 19) 
#define OTG2_HS_HOST_OTG_HS_HCTSIZ15_PKTCNT_VAL(X) (((uint32_t)(X) & 0x3FFUL) << 19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ15_DPID          (0x3UL << 29) 
#define OTG2_HS_HOST_OTG_HS_HCTSIZ15_DPID_VAL(X) (((uint32_t)(X) & 0x3UL) << 29)
#define OTG2_HS_HOST_OTG_HS_HCDMA15_DMAADDR          (0xFFFFFFFFUL << 0) 
#define OTG2_HS_HOST_OTG_HS_HCDMA15_DMAADDR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)

#define OTG2_HS_HOST  ((struct OTG2_HS_HOST*)(0x40080400UL))
struct OTG1_HS_DEVICE {
  volatile uint32_t OTG_HS_DCFG;
  volatile uint32_t OTG_HS_DCTL;
  volatile const uint32_t OTG_HS_DSTS;
  const volatile uint32_t RESERVED16[1];
  volatile uint32_t OTG_HS_DIEPMSK;
  volatile uint32_t OTG_HS_DOEPMSK;
  volatile const uint32_t OTG_HS_DAINT;
  volatile uint32_t OTG_HS_DAINTMSK;
  const volatile uint32_t RESERVED40[2];
  volatile uint32_t OTG_HS_DVBUSDIS;
  volatile uint32_t OTG_HS_DVBUSPULSE;
  volatile uint32_t OTG_HS_DTHRCTL;
  volatile uint32_t OTG_HS_DIEPEMPMSK;
  volatile uint32_t OTG_HS_DEACHINT;
  volatile uint32_t OTG_HS_DEACHINTMSK;
  const volatile uint32_t RESERVED256[48];
  volatile uint32_t OTG_HS_DIEPCTL0;
  const volatile uint32_t RESERVED264[1];
  volatile uint32_t OTG_HS_DIEPINT0;
  const volatile uint32_t RESERVED272[1];
  volatile uint32_t OTG_HS_DIEPTSIZ0;
  volatile uint32_t OTG_HS_DIEPDMA1;
  volatile const uint32_t OTG_HS_DTXFSTS0;
  const volatile uint32_t RESERVED288[1];
  volatile uint32_t OTG_HS_DIEPCTL1;
  const volatile uint32_t RESERVED296[1];
  volatile uint32_t OTG_HS_DIEPINT1;
  const volatile uint32_t RESERVED304[1];
  volatile uint32_t OTG_HS_DIEPTSIZ1;
  volatile uint32_t OTG_HS_DIEPDMA2;
  volatile const uint32_t OTG_HS_DTXFSTS1;
  const volatile uint32_t RESERVED320[1];
  volatile uint32_t OTG_HS_DIEPCTL2;
  const volatile uint32_t RESERVED328[1];
  volatile uint32_t OTG_HS_DIEPINT2;
  const volatile uint32_t RESERVED336[1];
  volatile uint32_t OTG_HS_DIEPTSIZ2;
  volatile uint32_t OTG_HS_DIEPDMA3;
  volatile const uint32_t OTG_HS_DTXFSTS2;
  const volatile uint32_t RESERVED352[1];
  volatile uint32_t OTG_HS_DIEPCTL3;
  const volatile uint32_t RESERVED360[1];
  volatile uint32_t OTG_HS_DIEPINT3;
  const volatile uint32_t RESERVED368[1];
  volatile uint32_t OTG_HS_DIEPTSIZ3;
  volatile uint32_t OTG_HS_DIEPDMA4;
  volatile const uint32_t OTG_HS_DTXFSTS3;
  const volatile uint32_t RESERVED384[1];
  volatile uint32_t OTG_HS_DIEPCTL4;
  const volatile uint32_t RESERVED392[1];
  volatile uint32_t OTG_HS_DIEPINT4;
  const volatile uint32_t RESERVED400[1];
  volatile uint32_t OTG_HS_DIEPTSIZ4;
  volatile uint32_t OTG_HS_DIEPDMA5;
  volatile const uint32_t OTG_HS_DTXFSTS4;
  const volatile uint32_t RESERVED416[1];
  volatile uint32_t OTG_HS_DIEPCTL5;
  volatile uint32_t OTG_HS_DIEPTSIZ6;
  volatile uint32_t OTG_HS_DTXFSTS6;
  volatile uint32_t OTG_HS_DIEPINT5;
  volatile uint32_t OTG_HS_DIEPTSIZ7;
  volatile uint32_t OTG_HS_DTXFSTS7;
  volatile uint32_t OTG_HS_DIEPTSIZ5;
  const volatile uint32_t RESERVED440[1];
  volatile const uint32_t OTG_HS_DTXFSTS5;
  const volatile uint32_t RESERVED448[1];
  volatile uint32_t OTG_HS_DIEPCTL6;
  const volatile uint32_t RESERVED456[1];
  volatile uint32_t OTG_HS_DIEPINT6;
  const volatile uint32_t RESERVED480[5];
  volatile uint32_t OTG_HS_DIEPCTL7;
  const volatile uint32_t RESERVED488[1];
  volatile uint32_t OTG_HS_DIEPINT7;
  const volatile uint32_t RESERVED768[69];
  volatile uint32_t OTG_HS_DOEPCTL0;
  const volatile uint32_t RESERVED776[1];
  volatile uint32_t OTG_HS_DOEPINT0;
  const volatile uint32_t RESERVED784[1];
  volatile uint32_t OTG_HS_DOEPTSIZ0;
  const volatile uint32_t RESERVED800[3];
  volatile uint32_t OTG_HS_DOEPCTL1;
  const volatile uint32_t RESERVED808[1];
  volatile uint32_t OTG_HS_DOEPINT1;
  const volatile uint32_t RESERVED816[1];
  volatile uint32_t OTG_HS_DOEPTSIZ1;
  const volatile uint32_t RESERVED832[3];
  volatile uint32_t OTG_HS_DOEPCTL2;
  const volatile uint32_t RESERVED840[1];
  volatile uint32_t OTG_HS_DOEPINT2;
  const volatile uint32_t RESERVED848[1];
  volatile uint32_t OTG_HS_DOEPTSIZ2;
  const volatile uint32_t RESERVED864[3];
  volatile uint32_t OTG_HS_DOEPCTL3;
  const volatile uint32_t RESERVED872[1];
  volatile uint32_t OTG_HS_DOEPINT3;
  const volatile uint32_t RESERVED880[1];
  volatile uint32_t OTG_HS_DOEPTSIZ3;
  const volatile uint32_t RESERVED896[3];
  volatile uint32_t OTG_HS_DOEPCTL4;
  const volatile uint32_t RESERVED904[1];
  volatile uint32_t OTG_HS_DOEPINT4;
  const volatile uint32_t RESERVED912[1];
  volatile uint32_t OTG_HS_DOEPTSIZ4;
  const volatile uint32_t RESERVED928[3];
  volatile uint32_t OTG_HS_DOEPCTL5;
  const volatile uint32_t RESERVED936[1];
  volatile uint32_t OTG_HS_DOEPINT5;
  const volatile uint32_t RESERVED944[1];
  volatile uint32_t OTG_HS_DOEPTSIZ5;
  const volatile uint32_t RESERVED960[3];
  volatile uint32_t OTG_HS_DOEPCTL6;
  const volatile uint32_t RESERVED968[1];
  volatile uint32_t OTG_HS_DOEPINT6;
  const volatile uint32_t RESERVED976[1];
  volatile uint32_t OTG_HS_DOEPTSIZ6;
  const volatile uint32_t RESERVED992[3];
  volatile uint32_t OTG_HS_DOEPCTL7;
  const volatile uint32_t RESERVED1000[1];
  volatile uint32_t OTG_HS_DOEPINT7;
  const volatile uint32_t RESERVED1008[1];
  volatile uint32_t OTG_HS_DOEPTSIZ7;
};
