via/viaems/src/platforms/stm32h743/device.h
#define OTG1_HS_DEVICE_OTG_HS_DCFG_DSPD          (0x3UL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DCFG_DSPD_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DCFG_NZLSOHSK          (0x1UL << 2) 
#define OTG1_HS_DEVICE_OTG_HS_DCFG_NZLSOHSK_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define OTG1_HS_DEVICE_OTG_HS_DCFG_DAD          (0x7FUL << 4) 
#define OTG1_HS_DEVICE_OTG_HS_DCFG_DAD_VAL(X) (((uint32_t)(X) & 0x7FUL) << 4)
#define OTG1_HS_DEVICE_OTG_HS_DCFG_PFIVL          (0x3UL << 11) 
#define OTG1_HS_DEVICE_OTG_HS_DCFG_PFIVL_VAL(X) (((uint32_t)(X) & 0x3UL) << 11)
#define OTG1_HS_DEVICE_OTG_HS_DCFG_PERSCHIVL          (0x3UL << 24) 
#define OTG1_HS_DEVICE_OTG_HS_DCFG_PERSCHIVL_VAL(X) (((uint32_t)(X) & 0x3UL) << 24)
#define OTG1_HS_DEVICE_OTG_HS_DCTL_RWUSIG          (0x1UL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DCTL_RWUSIG_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DCTL_SDIS          (0x1UL << 1) 
#define OTG1_HS_DEVICE_OTG_HS_DCTL_SDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG1_HS_DEVICE_OTG_HS_DCTL_GINSTS          (0x1UL << 2) 
#define OTG1_HS_DEVICE_OTG_HS_DCTL_GINSTS_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define OTG1_HS_DEVICE_OTG_HS_DCTL_GONSTS          (0x1UL << 3) 
#define OTG1_HS_DEVICE_OTG_HS_DCTL_GONSTS_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG1_HS_DEVICE_OTG_HS_DCTL_TCTL          (0x7UL << 4) 
#define OTG1_HS_DEVICE_OTG_HS_DCTL_TCTL_VAL(X) (((uint32_t)(X) & 0x7UL) << 4)
#define OTG1_HS_DEVICE_OTG_HS_DCTL_SGINAK          (0x1UL << 7) 
#define OTG1_HS_DEVICE_OTG_HS_DCTL_SGINAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define OTG1_HS_DEVICE_OTG_HS_DCTL_CGINAK          (0x1UL << 8) 
#define OTG1_HS_DEVICE_OTG_HS_DCTL_CGINAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OTG1_HS_DEVICE_OTG_HS_DCTL_SGONAK          (0x1UL << 9) 
#define OTG1_HS_DEVICE_OTG_HS_DCTL_SGONAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define OTG1_HS_DEVICE_OTG_HS_DCTL_CGONAK          (0x1UL << 10) 
#define OTG1_HS_DEVICE_OTG_HS_DCTL_CGONAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define OTG1_HS_DEVICE_OTG_HS_DCTL_POPRGDNE          (0x1UL << 11) 
#define OTG1_HS_DEVICE_OTG_HS_DCTL_POPRGDNE_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define OTG1_HS_DEVICE_OTG_HS_DSTS_SUSPSTS          (0x1UL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DSTS_SUSPSTS_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DSTS_ENUMSPD          (0x3UL << 1) 
#define OTG1_HS_DEVICE_OTG_HS_DSTS_ENUMSPD_VAL(X) (((uint32_t)(X) & 0x3UL) << 1)
#define OTG1_HS_DEVICE_OTG_HS_DSTS_EERR          (0x1UL << 3) 
#define OTG1_HS_DEVICE_OTG_HS_DSTS_EERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG1_HS_DEVICE_OTG_HS_DSTS_FNSOF          (0x3FFFUL << 8) 
#define OTG1_HS_DEVICE_OTG_HS_DSTS_FNSOF_VAL(X) (((uint32_t)(X) & 0x3FFFUL) << 8)
#define OTG1_HS_DEVICE_OTG_HS_DIEPMSK_XFRCM          (0x1UL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPMSK_XFRCM_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPMSK_EPDM          (0x1UL << 1) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPMSK_EPDM_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG1_HS_DEVICE_OTG_HS_DIEPMSK_TOM          (0x1UL << 3) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPMSK_TOM_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG1_HS_DEVICE_OTG_HS_DIEPMSK_ITTXFEMSK          (0x1UL << 4) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPMSK_ITTXFEMSK_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG1_HS_DEVICE_OTG_HS_DIEPMSK_INEPNMM          (0x1UL << 5) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPMSK_INEPNMM_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define OTG1_HS_DEVICE_OTG_HS_DIEPMSK_INEPNEM          (0x1UL << 6) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPMSK_INEPNEM_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG1_HS_DEVICE_OTG_HS_DIEPMSK_TXFURM          (0x1UL << 8) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPMSK_TXFURM_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OTG1_HS_DEVICE_OTG_HS_DIEPMSK_BIM          (0x1UL << 9) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPMSK_BIM_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define OTG1_HS_DEVICE_OTG_HS_DOEPMSK_XFRCM          (0x1UL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPMSK_XFRCM_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPMSK_EPDM          (0x1UL << 1) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPMSK_EPDM_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG1_HS_DEVICE_OTG_HS_DOEPMSK_STUPM          (0x1UL << 3) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPMSK_STUPM_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG1_HS_DEVICE_OTG_HS_DOEPMSK_OTEPDM          (0x1UL << 4) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPMSK_OTEPDM_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG1_HS_DEVICE_OTG_HS_DOEPMSK_B2BSTUP          (0x1UL << 6) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPMSK_B2BSTUP_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG1_HS_DEVICE_OTG_HS_DOEPMSK_OPEM          (0x1UL << 8) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPMSK_OPEM_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OTG1_HS_DEVICE_OTG_HS_DOEPMSK_BOIM          (0x1UL << 9) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPMSK_BOIM_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define OTG1_HS_DEVICE_OTG_HS_DAINT_IEPINT          (0xFFFFUL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DAINT_IEPINT_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DAINT_OEPINT          (0xFFFFUL << 16) 
#define OTG1_HS_DEVICE_OTG_HS_DAINT_OEPINT_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define OTG1_HS_DEVICE_OTG_HS_DAINTMSK_IEPM          (0xFFFFUL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DAINTMSK_IEPM_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DAINTMSK_OEPM          (0xFFFFUL << 16) 
#define OTG1_HS_DEVICE_OTG_HS_DAINTMSK_OEPM_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define OTG1_HS_DEVICE_OTG_HS_DVBUSDIS_VBUSDT          (0xFFFFUL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DVBUSDIS_VBUSDT_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DVBUSPULSE_DVBUSP          (0xFFFUL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DVBUSPULSE_DVBUSP_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DTHRCTL_NONISOTHREN          (0x1UL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DTHRCTL_NONISOTHREN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DTHRCTL_ISOTHREN          (0x1UL << 1) 
#define OTG1_HS_DEVICE_OTG_HS_DTHRCTL_ISOTHREN_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG1_HS_DEVICE_OTG_HS_DTHRCTL_TXTHRLEN          (0x1FFUL << 2) 
#define OTG1_HS_DEVICE_OTG_HS_DTHRCTL_TXTHRLEN_VAL(X) (((uint32_t)(X) & 0x1FFUL) << 2)
#define OTG1_HS_DEVICE_OTG_HS_DTHRCTL_RXTHREN          (0x1UL << 16) 
#define OTG1_HS_DEVICE_OTG_HS_DTHRCTL_RXTHREN_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define OTG1_HS_DEVICE_OTG_HS_DTHRCTL_RXTHRLEN          (0x1FFUL << 17) 
#define OTG1_HS_DEVICE_OTG_HS_DTHRCTL_RXTHRLEN_VAL(X) (((uint32_t)(X) & 0x1FFUL) << 17)
#define OTG1_HS_DEVICE_OTG_HS_DTHRCTL_ARPEN          (0x1UL << 27) 
#define OTG1_HS_DEVICE_OTG_HS_DTHRCTL_ARPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define OTG1_HS_DEVICE_OTG_HS_DIEPEMPMSK_INEPTXFEM          (0xFFFFUL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPEMPMSK_INEPTXFEM_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DEACHINT_IEP1INT          (0x1UL << 1) 
#define OTG1_HS_DEVICE_OTG_HS_DEACHINT_IEP1INT_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG1_HS_DEVICE_OTG_HS_DEACHINT_OEP1INT          (0x1UL << 17) 
#define OTG1_HS_DEVICE_OTG_HS_DEACHINT_OEP1INT_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define OTG1_HS_DEVICE_OTG_HS_DEACHINTMSK_IEP1INTM          (0x1UL << 1) 
#define OTG1_HS_DEVICE_OTG_HS_DEACHINTMSK_IEP1INTM_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG1_HS_DEVICE_OTG_HS_DEACHINTMSK_OEP1INTM          (0x1UL << 17) 
#define OTG1_HS_DEVICE_OTG_HS_DEACHINTMSK_OEP1INTM_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_MPSIZ          (0x7FFUL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_MPSIZ_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_USBAEP          (0x1UL << 15) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_USBAEP_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_EONUM_DPID          (0x1UL << 16) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_EONUM_DPID_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_NAKSTS          (0x1UL << 17) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_NAKSTS_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_EPTYP          (0x3UL << 18) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_EPTYP_VAL(X) (((uint32_t)(X) & 0x3UL) << 18)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_Stall          (0x1UL << 21) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_Stall_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_TXFNUM          (0xFUL << 22) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_TXFNUM_VAL(X) (((uint32_t)(X) & 0xFUL) << 22)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_CNAK          (0x1UL << 26) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_CNAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_SNAK          (0x1UL << 27) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_SNAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_SD0PID_SEVNFRM          (0x1UL << 28) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_SD0PID_SEVNFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_SODDFRM          (0x1UL << 29) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_SODDFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_EPDIS          (0x1UL << 30) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_EPDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_EPENA          (0x1UL << 31) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_EPENA_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_MPSIZ          (0x7FFUL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_MPSIZ_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_USBAEP          (0x1UL << 15) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_USBAEP_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_EONUM_DPID          (0x1UL << 16) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_EONUM_DPID_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_NAKSTS          (0x1UL << 17) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_NAKSTS_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_EPTYP          (0x3UL << 18) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_EPTYP_VAL(X) (((uint32_t)(X) & 0x3UL) << 18)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_Stall          (0x1UL << 21) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_Stall_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_TXFNUM          (0xFUL << 22) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_TXFNUM_VAL(X) (((uint32_t)(X) & 0xFUL) << 22)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_CNAK          (0x1UL << 26) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_CNAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_SNAK          (0x1UL << 27) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_SNAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_SD0PID_SEVNFRM          (0x1UL << 28) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_SD0PID_SEVNFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_SODDFRM          (0x1UL << 29) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_SODDFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_EPDIS          (0x1UL << 30) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_EPDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_EPENA          (0x1UL << 31) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_EPENA_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL2_MPSIZ          (0x7FFUL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL2_MPSIZ_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL2_USBAEP          (0x1UL << 15) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL2_USBAEP_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL2_EONUM_DPID          (0x1UL << 16) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL2_EONUM_DPID_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL2_NAKSTS          (0x1UL << 17) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL2_NAKSTS_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL2_EPTYP          (0x3UL << 18) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL2_EPTYP_VAL(X) (((uint32_t)(X) & 0x3UL) << 18)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL2_Stall          (0x1UL << 21) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL2_Stall_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL2_TXFNUM          (0xFUL << 22) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL2_TXFNUM_VAL(X) (((uint32_t)(X) & 0xFUL) << 22)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL2_CNAK          (0x1UL << 26) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL2_CNAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL2_SNAK          (0x1UL << 27) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL2_SNAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL2_SD0PID_SEVNFRM          (0x1UL << 28) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL2_SD0PID_SEVNFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL2_SODDFRM          (0x1UL << 29) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL2_SODDFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL2_EPDIS          (0x1UL << 30) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL2_EPDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL2_EPENA          (0x1UL << 31) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL2_EPENA_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL3_MPSIZ          (0x7FFUL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL3_MPSIZ_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL3_USBAEP          (0x1UL << 15) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL3_USBAEP_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL3_EONUM_DPID          (0x1UL << 16) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL3_EONUM_DPID_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL3_NAKSTS          (0x1UL << 17) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL3_NAKSTS_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL3_EPTYP          (0x3UL << 18) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL3_EPTYP_VAL(X) (((uint32_t)(X) & 0x3UL) << 18)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL3_Stall          (0x1UL << 21) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL3_Stall_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL3_TXFNUM          (0xFUL << 22) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL3_TXFNUM_VAL(X) (((uint32_t)(X) & 0xFUL) << 22)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL3_CNAK          (0x1UL << 26) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL3_CNAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL3_SNAK          (0x1UL << 27) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL3_SNAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL3_SD0PID_SEVNFRM          (0x1UL << 28) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL3_SD0PID_SEVNFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL3_SODDFRM          (0x1UL << 29) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL3_SODDFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL3_EPDIS          (0x1UL << 30) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL3_EPDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL3_EPENA          (0x1UL << 31) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL3_EPENA_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_MPSIZ          (0x7FFUL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_MPSIZ_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_USBAEP          (0x1UL << 15) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_USBAEP_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_EONUM_DPID          (0x1UL << 16) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_EONUM_DPID_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_NAKSTS          (0x1UL << 17) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_NAKSTS_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_EPTYP          (0x3UL << 18) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_EPTYP_VAL(X) (((uint32_t)(X) & 0x3UL) << 18)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_Stall          (0x1UL << 21) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_Stall_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_TXFNUM          (0xFUL << 22) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_TXFNUM_VAL(X) (((uint32_t)(X) & 0xFUL) << 22)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_CNAK          (0x1UL << 26) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_CNAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_SNAK          (0x1UL << 27) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_SNAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_SD0PID_SEVNFRM          (0x1UL << 28) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_SD0PID_SEVNFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_SODDFRM          (0x1UL << 29) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_SODDFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_EPDIS          (0x1UL << 30) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_EPDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_EPENA          (0x1UL << 31) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_EPENA_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_MPSIZ          (0x7FFUL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_MPSIZ_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_USBAEP          (0x1UL << 15) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_USBAEP_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_EONUM_DPID          (0x1UL << 16) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_EONUM_DPID_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_NAKSTS          (0x1UL << 17) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_NAKSTS_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_EPTYP          (0x3UL << 18) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_EPTYP_VAL(X) (((uint32_t)(X) & 0x3UL) << 18)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_Stall          (0x1UL << 21) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_Stall_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_TXFNUM          (0xFUL << 22) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_TXFNUM_VAL(X) (((uint32_t)(X) & 0xFUL) << 22)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_CNAK          (0x1UL << 26) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_CNAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_SNAK          (0x1UL << 27) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_SNAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_SD0PID_SEVNFRM          (0x1UL << 28) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_SD0PID_SEVNFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_SODDFRM          (0x1UL << 29) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_SODDFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_EPDIS          (0x1UL << 30) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_EPDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_EPENA          (0x1UL << 31) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_EPENA_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_MPSIZ          (0x7FFUL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_MPSIZ_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_USBAEP          (0x1UL << 15) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_USBAEP_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_EONUM_DPID          (0x1UL << 16) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_EONUM_DPID_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_NAKSTS          (0x1UL << 17) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_NAKSTS_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_EPTYP          (0x3UL << 18) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_EPTYP_VAL(X) (((uint32_t)(X) & 0x3UL) << 18)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_Stall          (0x1UL << 21) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_Stall_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_TXFNUM          (0xFUL << 22) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_TXFNUM_VAL(X) (((uint32_t)(X) & 0xFUL) << 22)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_CNAK          (0x1UL << 26) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_CNAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_SNAK          (0x1UL << 27) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_SNAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_SD0PID_SEVNFRM          (0x1UL << 28) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_SD0PID_SEVNFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_SODDFRM          (0x1UL << 29) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_SODDFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_EPDIS          (0x1UL << 30) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_EPDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_EPENA          (0x1UL << 31) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_EPENA_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_MPSIZ          (0x7FFUL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_MPSIZ_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_USBAEP          (0x1UL << 15) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_USBAEP_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_EONUM_DPID          (0x1UL << 16) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_EONUM_DPID_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_NAKSTS          (0x1UL << 17) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_NAKSTS_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_EPTYP          (0x3UL << 18) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_EPTYP_VAL(X) (((uint32_t)(X) & 0x3UL) << 18)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_Stall          (0x1UL << 21) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_Stall_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_TXFNUM          (0xFUL << 22) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_TXFNUM_VAL(X) (((uint32_t)(X) & 0xFUL) << 22)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_CNAK          (0x1UL << 26) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_CNAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_SNAK          (0x1UL << 27) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_SNAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_SD0PID_SEVNFRM          (0x1UL << 28) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_SD0PID_SEVNFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_SODDFRM          (0x1UL << 29) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_SODDFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_EPDIS          (0x1UL << 30) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_EPDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_EPENA          (0x1UL << 31) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_EPENA_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT0_XFRC          (0x1UL << 0) 
