via/viaems/src/platforms/stm32h743/device.h
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT0_XFRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT0_EPDISD          (0x1UL << 1) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT0_EPDISD_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT0_TOC          (0x1UL << 3) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT0_TOC_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT0_ITTXFE          (0x1UL << 4) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT0_ITTXFE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT0_INEPNE          (0x1UL << 6) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT0_INEPNE_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT0_TXFE          (0x1UL << 7) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT0_TXFE_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT0_TXFIFOUDRN          (0x1UL << 8) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT0_TXFIFOUDRN_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT0_BNA          (0x1UL << 9) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT0_BNA_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT0_PKTDRPSTS          (0x1UL << 11) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT0_PKTDRPSTS_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT0_BERR          (0x1UL << 12) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT0_BERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT0_NAK          (0x1UL << 13) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT0_NAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT1_XFRC          (0x1UL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT1_XFRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT1_EPDISD          (0x1UL << 1) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT1_EPDISD_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT1_TOC          (0x1UL << 3) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT1_TOC_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT1_ITTXFE          (0x1UL << 4) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT1_ITTXFE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT1_INEPNE          (0x1UL << 6) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT1_INEPNE_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT1_TXFE          (0x1UL << 7) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT1_TXFE_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT1_TXFIFOUDRN          (0x1UL << 8) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT1_TXFIFOUDRN_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT1_BNA          (0x1UL << 9) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT1_BNA_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT1_PKTDRPSTS          (0x1UL << 11) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT1_PKTDRPSTS_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT1_BERR          (0x1UL << 12) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT1_BERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT1_NAK          (0x1UL << 13) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT1_NAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT2_XFRC          (0x1UL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT2_XFRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT2_EPDISD          (0x1UL << 1) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT2_EPDISD_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT2_TOC          (0x1UL << 3) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT2_TOC_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT2_ITTXFE          (0x1UL << 4) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT2_ITTXFE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT2_INEPNE          (0x1UL << 6) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT2_INEPNE_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT2_TXFE          (0x1UL << 7) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT2_TXFE_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT2_TXFIFOUDRN          (0x1UL << 8) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT2_TXFIFOUDRN_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT2_BNA          (0x1UL << 9) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT2_BNA_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT2_PKTDRPSTS          (0x1UL << 11) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT2_PKTDRPSTS_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT2_BERR          (0x1UL << 12) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT2_BERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT2_NAK          (0x1UL << 13) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT2_NAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT3_XFRC          (0x1UL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT3_XFRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT3_EPDISD          (0x1UL << 1) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT3_EPDISD_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT3_TOC          (0x1UL << 3) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT3_TOC_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT3_ITTXFE          (0x1UL << 4) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT3_ITTXFE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT3_INEPNE          (0x1UL << 6) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT3_INEPNE_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT3_TXFE          (0x1UL << 7) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT3_TXFE_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT3_TXFIFOUDRN          (0x1UL << 8) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT3_TXFIFOUDRN_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT3_BNA          (0x1UL << 9) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT3_BNA_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT3_PKTDRPSTS          (0x1UL << 11) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT3_PKTDRPSTS_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT3_BERR          (0x1UL << 12) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT3_BERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT3_NAK          (0x1UL << 13) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT3_NAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT4_XFRC          (0x1UL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT4_XFRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT4_EPDISD          (0x1UL << 1) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT4_EPDISD_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT4_TOC          (0x1UL << 3) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT4_TOC_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT4_ITTXFE          (0x1UL << 4) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT4_ITTXFE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT4_INEPNE          (0x1UL << 6) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT4_INEPNE_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT4_TXFE          (0x1UL << 7) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT4_TXFE_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT4_TXFIFOUDRN          (0x1UL << 8) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT4_TXFIFOUDRN_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT4_BNA          (0x1UL << 9) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT4_BNA_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT4_PKTDRPSTS          (0x1UL << 11) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT4_PKTDRPSTS_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT4_BERR          (0x1UL << 12) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT4_BERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT4_NAK          (0x1UL << 13) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT4_NAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT5_XFRC          (0x1UL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT5_XFRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT5_EPDISD          (0x1UL << 1) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT5_EPDISD_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT5_TOC          (0x1UL << 3) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT5_TOC_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT5_ITTXFE          (0x1UL << 4) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT5_ITTXFE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT5_INEPNE          (0x1UL << 6) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT5_INEPNE_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT5_TXFE          (0x1UL << 7) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT5_TXFE_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT5_TXFIFOUDRN          (0x1UL << 8) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT5_TXFIFOUDRN_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT5_BNA          (0x1UL << 9) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT5_BNA_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT5_PKTDRPSTS          (0x1UL << 11) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT5_PKTDRPSTS_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT5_BERR          (0x1UL << 12) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT5_BERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT5_NAK          (0x1UL << 13) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT5_NAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT6_XFRC          (0x1UL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT6_XFRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT6_EPDISD          (0x1UL << 1) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT6_EPDISD_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT6_TOC          (0x1UL << 3) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT6_TOC_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT6_ITTXFE          (0x1UL << 4) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT6_ITTXFE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT6_INEPNE          (0x1UL << 6) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT6_INEPNE_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT6_TXFE          (0x1UL << 7) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT6_TXFE_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT6_TXFIFOUDRN          (0x1UL << 8) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT6_TXFIFOUDRN_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT6_BNA          (0x1UL << 9) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT6_BNA_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT6_PKTDRPSTS          (0x1UL << 11) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT6_PKTDRPSTS_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT6_BERR          (0x1UL << 12) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT6_BERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT6_NAK          (0x1UL << 13) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT6_NAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT7_XFRC          (0x1UL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT7_XFRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT7_EPDISD          (0x1UL << 1) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT7_EPDISD_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT7_TOC          (0x1UL << 3) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT7_TOC_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT7_ITTXFE          (0x1UL << 4) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT7_ITTXFE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT7_INEPNE          (0x1UL << 6) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT7_INEPNE_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT7_TXFE          (0x1UL << 7) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT7_TXFE_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT7_TXFIFOUDRN          (0x1UL << 8) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT7_TXFIFOUDRN_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT7_BNA          (0x1UL << 9) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT7_BNA_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT7_PKTDRPSTS          (0x1UL << 11) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT7_PKTDRPSTS_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT7_BERR          (0x1UL << 12) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT7_BERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT7_NAK          (0x1UL << 13) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT7_NAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ0_XFRSIZ          (0x7FUL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ0_XFRSIZ_VAL(X) (((uint32_t)(X) & 0x7FUL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ0_PKTCNT          (0x3UL << 19) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ0_PKTCNT_VAL(X) (((uint32_t)(X) & 0x3UL) << 19)
#define OTG1_HS_DEVICE_OTG_HS_DIEPDMA1_DMAADDR          (0xFFFFFFFFUL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPDMA1_DMAADDR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPDMA2_DMAADDR          (0xFFFFFFFFUL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPDMA2_DMAADDR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPDMA3_DMAADDR          (0xFFFFFFFFUL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPDMA3_DMAADDR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPDMA4_DMAADDR          (0xFFFFFFFFUL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPDMA4_DMAADDR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPDMA5_DMAADDR          (0xFFFFFFFFUL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPDMA5_DMAADDR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DTXFSTS0_INEPTFSAV          (0xFFFFUL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DTXFSTS0_INEPTFSAV_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DTXFSTS1_INEPTFSAV          (0xFFFFUL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DTXFSTS1_INEPTFSAV_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DTXFSTS2_INEPTFSAV          (0xFFFFUL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DTXFSTS2_INEPTFSAV_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DTXFSTS3_INEPTFSAV          (0xFFFFUL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DTXFSTS3_INEPTFSAV_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DTXFSTS4_INEPTFSAV          (0xFFFFUL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DTXFSTS4_INEPTFSAV_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DTXFSTS5_INEPTFSAV          (0xFFFFUL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DTXFSTS5_INEPTFSAV_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ1_XFRSIZ          (0x7FFFFUL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ1_XFRSIZ_VAL(X) (((uint32_t)(X) & 0x7FFFFUL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ1_PKTCNT          (0x3FFUL << 19) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ1_PKTCNT_VAL(X) (((uint32_t)(X) & 0x3FFUL) << 19)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ1_MCNT          (0x3UL << 29) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ1_MCNT_VAL(X) (((uint32_t)(X) & 0x3UL) << 29)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ2_XFRSIZ          (0x7FFFFUL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ2_XFRSIZ_VAL(X) (((uint32_t)(X) & 0x7FFFFUL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ2_PKTCNT          (0x3FFUL << 19) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ2_PKTCNT_VAL(X) (((uint32_t)(X) & 0x3FFUL) << 19)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ2_MCNT          (0x3UL << 29) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ2_MCNT_VAL(X) (((uint32_t)(X) & 0x3UL) << 29)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ3_XFRSIZ          (0x7FFFFUL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ3_XFRSIZ_VAL(X) (((uint32_t)(X) & 0x7FFFFUL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ3_PKTCNT          (0x3FFUL << 19) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ3_PKTCNT_VAL(X) (((uint32_t)(X) & 0x3FFUL) << 19)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ3_MCNT          (0x3UL << 29) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ3_MCNT_VAL(X) (((uint32_t)(X) & 0x3UL) << 29)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ4_XFRSIZ          (0x7FFFFUL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ4_XFRSIZ_VAL(X) (((uint32_t)(X) & 0x7FFFFUL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ4_PKTCNT          (0x3FFUL << 19) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ4_PKTCNT_VAL(X) (((uint32_t)(X) & 0x3FFUL) << 19)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ4_MCNT          (0x3UL << 29) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ4_MCNT_VAL(X) (((uint32_t)(X) & 0x3UL) << 29)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ5_XFRSIZ          (0x7FFFFUL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ5_XFRSIZ_VAL(X) (((uint32_t)(X) & 0x7FFFFUL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ5_PKTCNT          (0x3FFUL << 19) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ5_PKTCNT_VAL(X) (((uint32_t)(X) & 0x3FFUL) << 19)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ5_MCNT          (0x3UL << 29) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ5_MCNT_VAL(X) (((uint32_t)(X) & 0x3UL) << 29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL0_MPSIZ          (0x3UL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL0_MPSIZ_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL0_USBAEP          (0x1UL << 15) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL0_USBAEP_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL0_NAKSTS          (0x1UL << 17) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL0_NAKSTS_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL0_EPTYP          (0x3UL << 18) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL0_EPTYP_VAL(X) (((uint32_t)(X) & 0x3UL) << 18)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL0_SNPM          (0x1UL << 20) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL0_SNPM_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL0_Stall          (0x1UL << 21) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL0_Stall_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL0_CNAK          (0x1UL << 26) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL0_CNAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL0_SNAK          (0x1UL << 27) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL0_SNAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL0_EPDIS          (0x1UL << 30) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL0_EPDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL0_EPENA          (0x1UL << 31) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL0_EPENA_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_MPSIZ          (0x7FFUL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_MPSIZ_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_USBAEP          (0x1UL << 15) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_USBAEP_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_EONUM_DPID          (0x1UL << 16) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_EONUM_DPID_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_NAKSTS          (0x1UL << 17) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_NAKSTS_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_EPTYP          (0x3UL << 18) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_EPTYP_VAL(X) (((uint32_t)(X) & 0x3UL) << 18)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_SNPM          (0x1UL << 20) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_SNPM_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_Stall          (0x1UL << 21) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_Stall_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_CNAK          (0x1UL << 26) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_CNAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_SNAK          (0x1UL << 27) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_SNAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_SD0PID_SEVNFRM          (0x1UL << 28) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_SD0PID_SEVNFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_SODDFRM          (0x1UL << 29) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_SODDFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_EPDIS          (0x1UL << 30) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_EPDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_EPENA          (0x1UL << 31) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_EPENA_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_MPSIZ          (0x7FFUL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_MPSIZ_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_USBAEP          (0x1UL << 15) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_USBAEP_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_EONUM_DPID          (0x1UL << 16) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_EONUM_DPID_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_NAKSTS          (0x1UL << 17) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_NAKSTS_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_EPTYP          (0x3UL << 18) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_EPTYP_VAL(X) (((uint32_t)(X) & 0x3UL) << 18)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_SNPM          (0x1UL << 20) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_SNPM_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_Stall          (0x1UL << 21) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_Stall_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_CNAK          (0x1UL << 26) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_CNAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_SNAK          (0x1UL << 27) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_SNAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_SD0PID_SEVNFRM          (0x1UL << 28) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_SD0PID_SEVNFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_SODDFRM          (0x1UL << 29) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_SODDFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_EPDIS          (0x1UL << 30) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_EPDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_EPENA          (0x1UL << 31) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_EPENA_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_MPSIZ          (0x7FFUL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_MPSIZ_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_USBAEP          (0x1UL << 15) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_USBAEP_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_EONUM_DPID          (0x1UL << 16) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_EONUM_DPID_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_NAKSTS          (0x1UL << 17) 
