via/viaems/src/platforms/stm32h743/device.h
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_NAKSTS_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_EPTYP          (0x3UL << 18) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_EPTYP_VAL(X) (((uint32_t)(X) & 0x3UL) << 18)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_SNPM          (0x1UL << 20) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_SNPM_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_Stall          (0x1UL << 21) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_Stall_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_CNAK          (0x1UL << 26) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_CNAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_SNAK          (0x1UL << 27) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_SNAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_SD0PID_SEVNFRM          (0x1UL << 28) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_SD0PID_SEVNFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_SODDFRM          (0x1UL << 29) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_SODDFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_EPDIS          (0x1UL << 30) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_EPDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_EPENA          (0x1UL << 31) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_EPENA_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT0_XFRC          (0x1UL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT0_XFRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT0_EPDISD          (0x1UL << 1) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT0_EPDISD_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT0_STUP          (0x1UL << 3) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT0_STUP_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT0_OTEPDIS          (0x1UL << 4) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT0_OTEPDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT0_B2BSTUP          (0x1UL << 6) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT0_B2BSTUP_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT0_NYET          (0x1UL << 14) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT0_NYET_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT1_XFRC          (0x1UL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT1_XFRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT1_EPDISD          (0x1UL << 1) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT1_EPDISD_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT1_STUP          (0x1UL << 3) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT1_STUP_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT1_OTEPDIS          (0x1UL << 4) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT1_OTEPDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT1_B2BSTUP          (0x1UL << 6) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT1_B2BSTUP_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT1_NYET          (0x1UL << 14) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT1_NYET_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT2_XFRC          (0x1UL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT2_XFRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT2_EPDISD          (0x1UL << 1) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT2_EPDISD_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT2_STUP          (0x1UL << 3) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT2_STUP_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT2_OTEPDIS          (0x1UL << 4) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT2_OTEPDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT2_B2BSTUP          (0x1UL << 6) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT2_B2BSTUP_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT2_NYET          (0x1UL << 14) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT2_NYET_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT3_XFRC          (0x1UL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT3_XFRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT3_EPDISD          (0x1UL << 1) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT3_EPDISD_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT3_STUP          (0x1UL << 3) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT3_STUP_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT3_OTEPDIS          (0x1UL << 4) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT3_OTEPDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT3_B2BSTUP          (0x1UL << 6) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT3_B2BSTUP_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT3_NYET          (0x1UL << 14) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT3_NYET_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT4_XFRC          (0x1UL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT4_XFRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT4_EPDISD          (0x1UL << 1) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT4_EPDISD_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT4_STUP          (0x1UL << 3) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT4_STUP_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT4_OTEPDIS          (0x1UL << 4) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT4_OTEPDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT4_B2BSTUP          (0x1UL << 6) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT4_B2BSTUP_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT4_NYET          (0x1UL << 14) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT4_NYET_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT5_XFRC          (0x1UL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT5_XFRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT5_EPDISD          (0x1UL << 1) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT5_EPDISD_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT5_STUP          (0x1UL << 3) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT5_STUP_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT5_OTEPDIS          (0x1UL << 4) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT5_OTEPDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT5_B2BSTUP          (0x1UL << 6) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT5_B2BSTUP_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT5_NYET          (0x1UL << 14) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT5_NYET_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT6_XFRC          (0x1UL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT6_XFRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT6_EPDISD          (0x1UL << 1) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT6_EPDISD_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT6_STUP          (0x1UL << 3) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT6_STUP_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT6_OTEPDIS          (0x1UL << 4) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT6_OTEPDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT6_B2BSTUP          (0x1UL << 6) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT6_B2BSTUP_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT6_NYET          (0x1UL << 14) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT6_NYET_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT7_XFRC          (0x1UL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT7_XFRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT7_EPDISD          (0x1UL << 1) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT7_EPDISD_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT7_STUP          (0x1UL << 3) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT7_STUP_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT7_OTEPDIS          (0x1UL << 4) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT7_OTEPDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT7_B2BSTUP          (0x1UL << 6) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT7_B2BSTUP_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT7_NYET          (0x1UL << 14) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT7_NYET_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ0_XFRSIZ          (0x7FUL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ0_XFRSIZ_VAL(X) (((uint32_t)(X) & 0x7FUL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ0_PKTCNT          (0x1UL << 19) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ0_PKTCNT_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ0_STUPCNT          (0x3UL << 29) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ0_STUPCNT_VAL(X) (((uint32_t)(X) & 0x3UL) << 29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ1_XFRSIZ          (0x7FFFFUL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ1_XFRSIZ_VAL(X) (((uint32_t)(X) & 0x7FFFFUL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ1_PKTCNT          (0x3FFUL << 19) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ1_PKTCNT_VAL(X) (((uint32_t)(X) & 0x3FFUL) << 19)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ1_RXDPID_STUPCNT          (0x3UL << 29) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ1_RXDPID_STUPCNT_VAL(X) (((uint32_t)(X) & 0x3UL) << 29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ2_XFRSIZ          (0x7FFFFUL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ2_XFRSIZ_VAL(X) (((uint32_t)(X) & 0x7FFFFUL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ2_PKTCNT          (0x3FFUL << 19) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ2_PKTCNT_VAL(X) (((uint32_t)(X) & 0x3FFUL) << 19)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ2_RXDPID_STUPCNT          (0x3UL << 29) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ2_RXDPID_STUPCNT_VAL(X) (((uint32_t)(X) & 0x3UL) << 29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ3_XFRSIZ          (0x7FFFFUL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ3_XFRSIZ_VAL(X) (((uint32_t)(X) & 0x7FFFFUL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ3_PKTCNT          (0x3FFUL << 19) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ3_PKTCNT_VAL(X) (((uint32_t)(X) & 0x3FFUL) << 19)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ3_RXDPID_STUPCNT          (0x3UL << 29) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ3_RXDPID_STUPCNT_VAL(X) (((uint32_t)(X) & 0x3UL) << 29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ4_XFRSIZ          (0x7FFFFUL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ4_XFRSIZ_VAL(X) (((uint32_t)(X) & 0x7FFFFUL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ4_PKTCNT          (0x3FFUL << 19) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ4_PKTCNT_VAL(X) (((uint32_t)(X) & 0x3FFUL) << 19)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ4_RXDPID_STUPCNT          (0x3UL << 29) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ4_RXDPID_STUPCNT_VAL(X) (((uint32_t)(X) & 0x3UL) << 29)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ6_XFRSIZ          (0x7FFFFUL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ6_XFRSIZ_VAL(X) (((uint32_t)(X) & 0x7FFFFUL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ6_PKTCNT          (0x3FFUL << 19) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ6_PKTCNT_VAL(X) (((uint32_t)(X) & 0x3FFUL) << 19)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ6_MCNT          (0x3UL << 29) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ6_MCNT_VAL(X) (((uint32_t)(X) & 0x3UL) << 29)
#define OTG1_HS_DEVICE_OTG_HS_DTXFSTS6_INEPTFSAV          (0xFFFFUL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DTXFSTS6_INEPTFSAV_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ7_XFRSIZ          (0x7FFFFUL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ7_XFRSIZ_VAL(X) (((uint32_t)(X) & 0x7FFFFUL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ7_PKTCNT          (0x3FFUL << 19) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ7_PKTCNT_VAL(X) (((uint32_t)(X) & 0x3FFUL) << 19)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ7_MCNT          (0x3UL << 29) 
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ7_MCNT_VAL(X) (((uint32_t)(X) & 0x3UL) << 29)
#define OTG1_HS_DEVICE_OTG_HS_DTXFSTS7_INEPTFSAV          (0xFFFFUL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DTXFSTS7_INEPTFSAV_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_MPSIZ          (0x7FFUL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_MPSIZ_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_USBAEP          (0x1UL << 15) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_USBAEP_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_EONUM_DPID          (0x1UL << 16) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_EONUM_DPID_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_NAKSTS          (0x1UL << 17) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_NAKSTS_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_EPTYP          (0x3UL << 18) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_EPTYP_VAL(X) (((uint32_t)(X) & 0x3UL) << 18)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_SNPM          (0x1UL << 20) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_SNPM_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_Stall          (0x1UL << 21) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_Stall_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_CNAK          (0x1UL << 26) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_CNAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_SNAK          (0x1UL << 27) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_SNAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_SD0PID_SEVNFRM          (0x1UL << 28) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_SD0PID_SEVNFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_SODDFRM          (0x1UL << 29) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_SODDFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_EPDIS          (0x1UL << 30) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_EPDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_EPENA          (0x1UL << 31) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_EPENA_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_MPSIZ          (0x7FFUL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_MPSIZ_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_USBAEP          (0x1UL << 15) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_USBAEP_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_EONUM_DPID          (0x1UL << 16) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_EONUM_DPID_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_NAKSTS          (0x1UL << 17) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_NAKSTS_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_EPTYP          (0x3UL << 18) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_EPTYP_VAL(X) (((uint32_t)(X) & 0x3UL) << 18)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_SNPM          (0x1UL << 20) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_SNPM_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_Stall          (0x1UL << 21) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_Stall_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_CNAK          (0x1UL << 26) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_CNAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_SNAK          (0x1UL << 27) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_SNAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_SD0PID_SEVNFRM          (0x1UL << 28) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_SD0PID_SEVNFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_SODDFRM          (0x1UL << 29) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_SODDFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_EPDIS          (0x1UL << 30) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_EPDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_EPENA          (0x1UL << 31) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_EPENA_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_MPSIZ          (0x7FFUL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_MPSIZ_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_USBAEP          (0x1UL << 15) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_USBAEP_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_EONUM_DPID          (0x1UL << 16) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_EONUM_DPID_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_NAKSTS          (0x1UL << 17) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_NAKSTS_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_EPTYP          (0x3UL << 18) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_EPTYP_VAL(X) (((uint32_t)(X) & 0x3UL) << 18)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_SNPM          (0x1UL << 20) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_SNPM_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_Stall          (0x1UL << 21) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_Stall_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_CNAK          (0x1UL << 26) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_CNAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_SNAK          (0x1UL << 27) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_SNAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_SD0PID_SEVNFRM          (0x1UL << 28) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_SD0PID_SEVNFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_SODDFRM          (0x1UL << 29) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_SODDFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_EPDIS          (0x1UL << 30) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_EPDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_EPENA          (0x1UL << 31) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_EPENA_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_MPSIZ          (0x7FFUL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_MPSIZ_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_USBAEP          (0x1UL << 15) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_USBAEP_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_EONUM_DPID          (0x1UL << 16) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_EONUM_DPID_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_NAKSTS          (0x1UL << 17) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_NAKSTS_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_EPTYP          (0x3UL << 18) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_EPTYP_VAL(X) (((uint32_t)(X) & 0x3UL) << 18)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_SNPM          (0x1UL << 20) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_SNPM_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_Stall          (0x1UL << 21) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_Stall_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_CNAK          (0x1UL << 26) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_CNAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_SNAK          (0x1UL << 27) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_SNAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_SD0PID_SEVNFRM          (0x1UL << 28) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_SD0PID_SEVNFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_SODDFRM          (0x1UL << 29) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_SODDFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_EPDIS          (0x1UL << 30) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_EPDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_EPENA          (0x1UL << 31) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_EPENA_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ5_XFRSIZ          (0x7FFFFUL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ5_XFRSIZ_VAL(X) (((uint32_t)(X) & 0x7FFFFUL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ5_PKTCNT          (0x3FFUL << 19) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ5_PKTCNT_VAL(X) (((uint32_t)(X) & 0x3FFUL) << 19)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ5_RXDPID_STUPCNT          (0x3UL << 29) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ5_RXDPID_STUPCNT_VAL(X) (((uint32_t)(X) & 0x3UL) << 29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ6_XFRSIZ          (0x7FFFFUL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ6_XFRSIZ_VAL(X) (((uint32_t)(X) & 0x7FFFFUL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ6_PKTCNT          (0x3FFUL << 19) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ6_PKTCNT_VAL(X) (((uint32_t)(X) & 0x3FFUL) << 19)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ6_RXDPID_STUPCNT          (0x3UL << 29) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ6_RXDPID_STUPCNT_VAL(X) (((uint32_t)(X) & 0x3UL) << 29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ7_XFRSIZ          (0x7FFFFUL << 0) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ7_XFRSIZ_VAL(X) (((uint32_t)(X) & 0x7FFFFUL) << 0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ7_PKTCNT          (0x3FFUL << 19) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ7_PKTCNT_VAL(X) (((uint32_t)(X) & 0x3FFUL) << 19)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ7_RXDPID_STUPCNT          (0x3UL << 29) 
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ7_RXDPID_STUPCNT_VAL(X) (((uint32_t)(X) & 0x3UL) << 29)

