via/viaems/src/platforms/stm32h743/device.h
#define OTG1_HS_DEVICE  ((struct OTG1_HS_DEVICE*)(0x40040800UL))
struct OTG2_HS_DEVICE {
  volatile uint32_t OTG_HS_DCFG;
  volatile uint32_t OTG_HS_DCTL;
  volatile const uint32_t OTG_HS_DSTS;
  const volatile uint32_t RESERVED16[1];
  volatile uint32_t OTG_HS_DIEPMSK;
  volatile uint32_t OTG_HS_DOEPMSK;
  volatile const uint32_t OTG_HS_DAINT;
  volatile uint32_t OTG_HS_DAINTMSK;
  const volatile uint32_t RESERVED40[2];
  volatile uint32_t OTG_HS_DVBUSDIS;
  volatile uint32_t OTG_HS_DVBUSPULSE;
  volatile uint32_t OTG_HS_DTHRCTL;
  volatile uint32_t OTG_HS_DIEPEMPMSK;
  volatile uint32_t OTG_HS_DEACHINT;
  volatile uint32_t OTG_HS_DEACHINTMSK;
  const volatile uint32_t RESERVED256[48];
  volatile uint32_t OTG_HS_DIEPCTL0;
  const volatile uint32_t RESERVED264[1];
  volatile uint32_t OTG_HS_DIEPINT0;
  const volatile uint32_t RESERVED272[1];
  volatile uint32_t OTG_HS_DIEPTSIZ0;
  volatile uint32_t OTG_HS_DIEPDMA1;
  volatile const uint32_t OTG_HS_DTXFSTS0;
  const volatile uint32_t RESERVED288[1];
  volatile uint32_t OTG_HS_DIEPCTL1;
  const volatile uint32_t RESERVED296[1];
  volatile uint32_t OTG_HS_DIEPINT1;
  const volatile uint32_t RESERVED304[1];
  volatile uint32_t OTG_HS_DIEPTSIZ1;
  volatile uint32_t OTG_HS_DIEPDMA2;
  volatile const uint32_t OTG_HS_DTXFSTS1;
  const volatile uint32_t RESERVED320[1];
  volatile uint32_t OTG_HS_DIEPCTL2;
  const volatile uint32_t RESERVED328[1];
  volatile uint32_t OTG_HS_DIEPINT2;
  const volatile uint32_t RESERVED336[1];
  volatile uint32_t OTG_HS_DIEPTSIZ2;
  volatile uint32_t OTG_HS_DIEPDMA3;
  volatile const uint32_t OTG_HS_DTXFSTS2;
  const volatile uint32_t RESERVED352[1];
  volatile uint32_t OTG_HS_DIEPCTL3;
  const volatile uint32_t RESERVED360[1];
  volatile uint32_t OTG_HS_DIEPINT3;
  const volatile uint32_t RESERVED368[1];
  volatile uint32_t OTG_HS_DIEPTSIZ3;
  volatile uint32_t OTG_HS_DIEPDMA4;
  volatile const uint32_t OTG_HS_DTXFSTS3;
  const volatile uint32_t RESERVED384[1];
  volatile uint32_t OTG_HS_DIEPCTL4;
  const volatile uint32_t RESERVED392[1];
  volatile uint32_t OTG_HS_DIEPINT4;
  const volatile uint32_t RESERVED400[1];
  volatile uint32_t OTG_HS_DIEPTSIZ4;
  volatile uint32_t OTG_HS_DIEPDMA5;
  volatile const uint32_t OTG_HS_DTXFSTS4;
  const volatile uint32_t RESERVED416[1];
  volatile uint32_t OTG_HS_DIEPCTL5;
  volatile uint32_t OTG_HS_DIEPTSIZ6;
  volatile uint32_t OTG_HS_DTXFSTS6;
  volatile uint32_t OTG_HS_DIEPINT5;
  volatile uint32_t OTG_HS_DIEPTSIZ7;
  volatile uint32_t OTG_HS_DTXFSTS7;
  volatile uint32_t OTG_HS_DIEPTSIZ5;
  const volatile uint32_t RESERVED440[1];
  volatile const uint32_t OTG_HS_DTXFSTS5;
  const volatile uint32_t RESERVED448[1];
  volatile uint32_t OTG_HS_DIEPCTL6;
  const volatile uint32_t RESERVED456[1];
  volatile uint32_t OTG_HS_DIEPINT6;
  const volatile uint32_t RESERVED480[5];
  volatile uint32_t OTG_HS_DIEPCTL7;
  const volatile uint32_t RESERVED488[1];
  volatile uint32_t OTG_HS_DIEPINT7;
  const volatile uint32_t RESERVED768[69];
  volatile uint32_t OTG_HS_DOEPCTL0;
  const volatile uint32_t RESERVED776[1];
  volatile uint32_t OTG_HS_DOEPINT0;
  const volatile uint32_t RESERVED784[1];
  volatile uint32_t OTG_HS_DOEPTSIZ0;
  const volatile uint32_t RESERVED800[3];
  volatile uint32_t OTG_HS_DOEPCTL1;
  const volatile uint32_t RESERVED808[1];
  volatile uint32_t OTG_HS_DOEPINT1;
  const volatile uint32_t RESERVED816[1];
  volatile uint32_t OTG_HS_DOEPTSIZ1;
  const volatile uint32_t RESERVED832[3];
  volatile uint32_t OTG_HS_DOEPCTL2;
  const volatile uint32_t RESERVED840[1];
  volatile uint32_t OTG_HS_DOEPINT2;
  const volatile uint32_t RESERVED848[1];
  volatile uint32_t OTG_HS_DOEPTSIZ2;
  const volatile uint32_t RESERVED864[3];
  volatile uint32_t OTG_HS_DOEPCTL3;
  const volatile uint32_t RESERVED872[1];
  volatile uint32_t OTG_HS_DOEPINT3;
  const volatile uint32_t RESERVED880[1];
  volatile uint32_t OTG_HS_DOEPTSIZ3;
  const volatile uint32_t RESERVED896[3];
  volatile uint32_t OTG_HS_DOEPCTL4;
  const volatile uint32_t RESERVED904[1];
  volatile uint32_t OTG_HS_DOEPINT4;
  const volatile uint32_t RESERVED912[1];
  volatile uint32_t OTG_HS_DOEPTSIZ4;
  const volatile uint32_t RESERVED928[3];
  volatile uint32_t OTG_HS_DOEPCTL5;
  const volatile uint32_t RESERVED936[1];
  volatile uint32_t OTG_HS_DOEPINT5;
  const volatile uint32_t RESERVED944[1];
  volatile uint32_t OTG_HS_DOEPTSIZ5;
  const volatile uint32_t RESERVED960[3];
  volatile uint32_t OTG_HS_DOEPCTL6;
  const volatile uint32_t RESERVED968[1];
  volatile uint32_t OTG_HS_DOEPINT6;
  const volatile uint32_t RESERVED976[1];
  volatile uint32_t OTG_HS_DOEPTSIZ6;
  const volatile uint32_t RESERVED992[3];
  volatile uint32_t OTG_HS_DOEPCTL7;
  const volatile uint32_t RESERVED1000[1];
  volatile uint32_t OTG_HS_DOEPINT7;
  const volatile uint32_t RESERVED1008[1];
  volatile uint32_t OTG_HS_DOEPTSIZ7;
};
#define OTG2_HS_DEVICE_OTG_HS_DCFG_DSPD          (0x3UL << 0) 
#define OTG2_HS_DEVICE_OTG_HS_DCFG_DSPD_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define OTG2_HS_DEVICE_OTG_HS_DCFG_NZLSOHSK          (0x1UL << 2) 
#define OTG2_HS_DEVICE_OTG_HS_DCFG_NZLSOHSK_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define OTG2_HS_DEVICE_OTG_HS_DCFG_DAD          (0x7FUL << 4) 
#define OTG2_HS_DEVICE_OTG_HS_DCFG_DAD_VAL(X) (((uint32_t)(X) & 0x7FUL) << 4)
#define OTG2_HS_DEVICE_OTG_HS_DCFG_PFIVL          (0x3UL << 11) 
#define OTG2_HS_DEVICE_OTG_HS_DCFG_PFIVL_VAL(X) (((uint32_t)(X) & 0x3UL) << 11)
#define OTG2_HS_DEVICE_OTG_HS_DCFG_PERSCHIVL          (0x3UL << 24) 
#define OTG2_HS_DEVICE_OTG_HS_DCFG_PERSCHIVL_VAL(X) (((uint32_t)(X) & 0x3UL) << 24)
#define OTG2_HS_DEVICE_OTG_HS_DCTL_RWUSIG          (0x1UL << 0) 
#define OTG2_HS_DEVICE_OTG_HS_DCTL_RWUSIG_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG2_HS_DEVICE_OTG_HS_DCTL_SDIS          (0x1UL << 1) 
#define OTG2_HS_DEVICE_OTG_HS_DCTL_SDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG2_HS_DEVICE_OTG_HS_DCTL_GINSTS          (0x1UL << 2) 
#define OTG2_HS_DEVICE_OTG_HS_DCTL_GINSTS_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define OTG2_HS_DEVICE_OTG_HS_DCTL_GONSTS          (0x1UL << 3) 
#define OTG2_HS_DEVICE_OTG_HS_DCTL_GONSTS_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG2_HS_DEVICE_OTG_HS_DCTL_TCTL          (0x7UL << 4) 
#define OTG2_HS_DEVICE_OTG_HS_DCTL_TCTL_VAL(X) (((uint32_t)(X) & 0x7UL) << 4)
#define OTG2_HS_DEVICE_OTG_HS_DCTL_SGINAK          (0x1UL << 7) 
#define OTG2_HS_DEVICE_OTG_HS_DCTL_SGINAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define OTG2_HS_DEVICE_OTG_HS_DCTL_CGINAK          (0x1UL << 8) 
#define OTG2_HS_DEVICE_OTG_HS_DCTL_CGINAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OTG2_HS_DEVICE_OTG_HS_DCTL_SGONAK          (0x1UL << 9) 
#define OTG2_HS_DEVICE_OTG_HS_DCTL_SGONAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define OTG2_HS_DEVICE_OTG_HS_DCTL_CGONAK          (0x1UL << 10) 
#define OTG2_HS_DEVICE_OTG_HS_DCTL_CGONAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define OTG2_HS_DEVICE_OTG_HS_DCTL_POPRGDNE          (0x1UL << 11) 
#define OTG2_HS_DEVICE_OTG_HS_DCTL_POPRGDNE_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define OTG2_HS_DEVICE_OTG_HS_DSTS_SUSPSTS          (0x1UL << 0) 
#define OTG2_HS_DEVICE_OTG_HS_DSTS_SUSPSTS_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG2_HS_DEVICE_OTG_HS_DSTS_ENUMSPD          (0x3UL << 1) 
#define OTG2_HS_DEVICE_OTG_HS_DSTS_ENUMSPD_VAL(X) (((uint32_t)(X) & 0x3UL) << 1)
#define OTG2_HS_DEVICE_OTG_HS_DSTS_EERR          (0x1UL << 3) 
#define OTG2_HS_DEVICE_OTG_HS_DSTS_EERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG2_HS_DEVICE_OTG_HS_DSTS_FNSOF          (0x3FFFUL << 8) 
#define OTG2_HS_DEVICE_OTG_HS_DSTS_FNSOF_VAL(X) (((uint32_t)(X) & 0x3FFFUL) << 8)
#define OTG2_HS_DEVICE_OTG_HS_DIEPMSK_XFRCM          (0x1UL << 0) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPMSK_XFRCM_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG2_HS_DEVICE_OTG_HS_DIEPMSK_EPDM          (0x1UL << 1) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPMSK_EPDM_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG2_HS_DEVICE_OTG_HS_DIEPMSK_TOM          (0x1UL << 3) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPMSK_TOM_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG2_HS_DEVICE_OTG_HS_DIEPMSK_ITTXFEMSK          (0x1UL << 4) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPMSK_ITTXFEMSK_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG2_HS_DEVICE_OTG_HS_DIEPMSK_INEPNMM          (0x1UL << 5) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPMSK_INEPNMM_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define OTG2_HS_DEVICE_OTG_HS_DIEPMSK_INEPNEM          (0x1UL << 6) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPMSK_INEPNEM_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG2_HS_DEVICE_OTG_HS_DIEPMSK_TXFURM          (0x1UL << 8) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPMSK_TXFURM_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OTG2_HS_DEVICE_OTG_HS_DIEPMSK_BIM          (0x1UL << 9) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPMSK_BIM_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define OTG2_HS_DEVICE_OTG_HS_DOEPMSK_XFRCM          (0x1UL << 0) 
#define OTG2_HS_DEVICE_OTG_HS_DOEPMSK_XFRCM_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG2_HS_DEVICE_OTG_HS_DOEPMSK_EPDM          (0x1UL << 1) 
#define OTG2_HS_DEVICE_OTG_HS_DOEPMSK_EPDM_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG2_HS_DEVICE_OTG_HS_DOEPMSK_STUPM          (0x1UL << 3) 
#define OTG2_HS_DEVICE_OTG_HS_DOEPMSK_STUPM_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define OTG2_HS_DEVICE_OTG_HS_DOEPMSK_OTEPDM          (0x1UL << 4) 
#define OTG2_HS_DEVICE_OTG_HS_DOEPMSK_OTEPDM_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define OTG2_HS_DEVICE_OTG_HS_DOEPMSK_B2BSTUP          (0x1UL << 6) 
#define OTG2_HS_DEVICE_OTG_HS_DOEPMSK_B2BSTUP_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define OTG2_HS_DEVICE_OTG_HS_DOEPMSK_OPEM          (0x1UL << 8) 
#define OTG2_HS_DEVICE_OTG_HS_DOEPMSK_OPEM_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OTG2_HS_DEVICE_OTG_HS_DOEPMSK_BOIM          (0x1UL << 9) 
#define OTG2_HS_DEVICE_OTG_HS_DOEPMSK_BOIM_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define OTG2_HS_DEVICE_OTG_HS_DAINT_IEPINT          (0xFFFFUL << 0) 
#define OTG2_HS_DEVICE_OTG_HS_DAINT_IEPINT_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define OTG2_HS_DEVICE_OTG_HS_DAINT_OEPINT          (0xFFFFUL << 16) 
#define OTG2_HS_DEVICE_OTG_HS_DAINT_OEPINT_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define OTG2_HS_DEVICE_OTG_HS_DAINTMSK_IEPM          (0xFFFFUL << 0) 
#define OTG2_HS_DEVICE_OTG_HS_DAINTMSK_IEPM_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define OTG2_HS_DEVICE_OTG_HS_DAINTMSK_OEPM          (0xFFFFUL << 16) 
#define OTG2_HS_DEVICE_OTG_HS_DAINTMSK_OEPM_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define OTG2_HS_DEVICE_OTG_HS_DVBUSDIS_VBUSDT          (0xFFFFUL << 0) 
#define OTG2_HS_DEVICE_OTG_HS_DVBUSDIS_VBUSDT_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define OTG2_HS_DEVICE_OTG_HS_DVBUSPULSE_DVBUSP          (0xFFFUL << 0) 
#define OTG2_HS_DEVICE_OTG_HS_DVBUSPULSE_DVBUSP_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 0)
#define OTG2_HS_DEVICE_OTG_HS_DTHRCTL_NONISOTHREN          (0x1UL << 0) 
#define OTG2_HS_DEVICE_OTG_HS_DTHRCTL_NONISOTHREN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG2_HS_DEVICE_OTG_HS_DTHRCTL_ISOTHREN          (0x1UL << 1) 
#define OTG2_HS_DEVICE_OTG_HS_DTHRCTL_ISOTHREN_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG2_HS_DEVICE_OTG_HS_DTHRCTL_TXTHRLEN          (0x1FFUL << 2) 
#define OTG2_HS_DEVICE_OTG_HS_DTHRCTL_TXTHRLEN_VAL(X) (((uint32_t)(X) & 0x1FFUL) << 2)
#define OTG2_HS_DEVICE_OTG_HS_DTHRCTL_RXTHREN          (0x1UL << 16) 
#define OTG2_HS_DEVICE_OTG_HS_DTHRCTL_RXTHREN_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define OTG2_HS_DEVICE_OTG_HS_DTHRCTL_RXTHRLEN          (0x1FFUL << 17) 
#define OTG2_HS_DEVICE_OTG_HS_DTHRCTL_RXTHRLEN_VAL(X) (((uint32_t)(X) & 0x1FFUL) << 17)
#define OTG2_HS_DEVICE_OTG_HS_DTHRCTL_ARPEN          (0x1UL << 27) 
#define OTG2_HS_DEVICE_OTG_HS_DTHRCTL_ARPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define OTG2_HS_DEVICE_OTG_HS_DIEPEMPMSK_INEPTXFEM          (0xFFFFUL << 0) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPEMPMSK_INEPTXFEM_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define OTG2_HS_DEVICE_OTG_HS_DEACHINT_IEP1INT          (0x1UL << 1) 
#define OTG2_HS_DEVICE_OTG_HS_DEACHINT_IEP1INT_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG2_HS_DEVICE_OTG_HS_DEACHINT_OEP1INT          (0x1UL << 17) 
#define OTG2_HS_DEVICE_OTG_HS_DEACHINT_OEP1INT_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define OTG2_HS_DEVICE_OTG_HS_DEACHINTMSK_IEP1INTM          (0x1UL << 1) 
#define OTG2_HS_DEVICE_OTG_HS_DEACHINTMSK_IEP1INTM_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG2_HS_DEVICE_OTG_HS_DEACHINTMSK_OEP1INTM          (0x1UL << 17) 
#define OTG2_HS_DEVICE_OTG_HS_DEACHINTMSK_OEP1INTM_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_MPSIZ          (0x7FFUL << 0) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_MPSIZ_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 0)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_USBAEP          (0x1UL << 15) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_USBAEP_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_EONUM_DPID          (0x1UL << 16) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_EONUM_DPID_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_NAKSTS          (0x1UL << 17) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_NAKSTS_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_EPTYP          (0x3UL << 18) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_EPTYP_VAL(X) (((uint32_t)(X) & 0x3UL) << 18)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_Stall          (0x1UL << 21) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_Stall_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_TXFNUM          (0xFUL << 22) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_TXFNUM_VAL(X) (((uint32_t)(X) & 0xFUL) << 22)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_CNAK          (0x1UL << 26) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_CNAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_SNAK          (0x1UL << 27) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_SNAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_SD0PID_SEVNFRM          (0x1UL << 28) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_SD0PID_SEVNFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_SODDFRM          (0x1UL << 29) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_SODDFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_EPDIS          (0x1UL << 30) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_EPDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_EPENA          (0x1UL << 31) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_EPENA_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL1_MPSIZ          (0x7FFUL << 0) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL1_MPSIZ_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 0)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL1_USBAEP          (0x1UL << 15) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL1_USBAEP_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL1_EONUM_DPID          (0x1UL << 16) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL1_EONUM_DPID_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL1_NAKSTS          (0x1UL << 17) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL1_NAKSTS_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL1_EPTYP          (0x3UL << 18) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL1_EPTYP_VAL(X) (((uint32_t)(X) & 0x3UL) << 18)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL1_Stall          (0x1UL << 21) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL1_Stall_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL1_TXFNUM          (0xFUL << 22) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL1_TXFNUM_VAL(X) (((uint32_t)(X) & 0xFUL) << 22)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL1_CNAK          (0x1UL << 26) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL1_CNAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL1_SNAK          (0x1UL << 27) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL1_SNAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL1_SD0PID_SEVNFRM          (0x1UL << 28) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL1_SD0PID_SEVNFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL1_SODDFRM          (0x1UL << 29) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL1_SODDFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL1_EPDIS          (0x1UL << 30) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL1_EPDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL1_EPENA          (0x1UL << 31) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL1_EPENA_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL2_MPSIZ          (0x7FFUL << 0) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL2_MPSIZ_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 0)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL2_USBAEP          (0x1UL << 15) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL2_USBAEP_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL2_EONUM_DPID          (0x1UL << 16) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL2_EONUM_DPID_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL2_NAKSTS          (0x1UL << 17) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL2_NAKSTS_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL2_EPTYP          (0x3UL << 18) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL2_EPTYP_VAL(X) (((uint32_t)(X) & 0x3UL) << 18)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL2_Stall          (0x1UL << 21) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL2_Stall_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL2_TXFNUM          (0xFUL << 22) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL2_TXFNUM_VAL(X) (((uint32_t)(X) & 0xFUL) << 22)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL2_CNAK          (0x1UL << 26) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL2_CNAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL2_SNAK          (0x1UL << 27) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL2_SNAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL2_SD0PID_SEVNFRM          (0x1UL << 28) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL2_SD0PID_SEVNFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL2_SODDFRM          (0x1UL << 29) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL2_SODDFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL2_EPDIS          (0x1UL << 30) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL2_EPDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL2_EPENA          (0x1UL << 31) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL2_EPENA_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL3_MPSIZ          (0x7FFUL << 0) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL3_MPSIZ_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 0)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL3_USBAEP          (0x1UL << 15) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL3_USBAEP_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL3_EONUM_DPID          (0x1UL << 16) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL3_EONUM_DPID_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL3_NAKSTS          (0x1UL << 17) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL3_NAKSTS_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL3_EPTYP          (0x3UL << 18) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL3_EPTYP_VAL(X) (((uint32_t)(X) & 0x3UL) << 18)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL3_Stall          (0x1UL << 21) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL3_Stall_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL3_TXFNUM          (0xFUL << 22) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL3_TXFNUM_VAL(X) (((uint32_t)(X) & 0xFUL) << 22)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL3_CNAK          (0x1UL << 26) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL3_CNAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL3_SNAK          (0x1UL << 27) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL3_SNAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL3_SD0PID_SEVNFRM          (0x1UL << 28) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL3_SD0PID_SEVNFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL3_SODDFRM          (0x1UL << 29) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL3_SODDFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL3_EPDIS          (0x1UL << 30) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL3_EPDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL3_EPENA          (0x1UL << 31) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL3_EPENA_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL4_MPSIZ          (0x7FFUL << 0) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL4_MPSIZ_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 0)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL4_USBAEP          (0x1UL << 15) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL4_USBAEP_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL4_EONUM_DPID          (0x1UL << 16) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL4_EONUM_DPID_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL4_NAKSTS          (0x1UL << 17) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL4_NAKSTS_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL4_EPTYP          (0x3UL << 18) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL4_EPTYP_VAL(X) (((uint32_t)(X) & 0x3UL) << 18)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL4_Stall          (0x1UL << 21) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL4_Stall_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL4_TXFNUM          (0xFUL << 22) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL4_TXFNUM_VAL(X) (((uint32_t)(X) & 0xFUL) << 22)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL4_CNAK          (0x1UL << 26) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL4_CNAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL4_SNAK          (0x1UL << 27) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL4_SNAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL4_SD0PID_SEVNFRM          (0x1UL << 28) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL4_SD0PID_SEVNFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL4_SODDFRM          (0x1UL << 29) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL4_SODDFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL4_EPDIS          (0x1UL << 30) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL4_EPDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL4_EPENA          (0x1UL << 31) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL4_EPENA_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL5_MPSIZ          (0x7FFUL << 0) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL5_MPSIZ_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 0)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL5_USBAEP          (0x1UL << 15) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL5_USBAEP_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL5_EONUM_DPID          (0x1UL << 16) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL5_EONUM_DPID_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL5_NAKSTS          (0x1UL << 17) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL5_NAKSTS_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL5_EPTYP          (0x3UL << 18) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL5_EPTYP_VAL(X) (((uint32_t)(X) & 0x3UL) << 18)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL5_Stall          (0x1UL << 21) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL5_Stall_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL5_TXFNUM          (0xFUL << 22) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL5_TXFNUM_VAL(X) (((uint32_t)(X) & 0xFUL) << 22)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL5_CNAK          (0x1UL << 26) 
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL5_CNAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL5_SNAK          (0x1UL << 27) 
