via/viaems/src/platforms/stm32h743/device.h
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_NAKSTS_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_EPTYP          (0x3UL << 18) 
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_EPTYP_VAL(X) (((uint32_t)(X) & 0x3UL) << 18)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_SNPM          (0x1UL << 20) 
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_SNPM_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_Stall          (0x1UL << 21) 
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_Stall_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_CNAK          (0x1UL << 26) 
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_CNAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_SNAK          (0x1UL << 27) 
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_SNAK_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_SD0PID_SEVNFRM          (0x1UL << 28) 
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_SD0PID_SEVNFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_SODDFRM          (0x1UL << 29) 
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_SODDFRM_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_EPDIS          (0x1UL << 30) 
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_EPDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_EPENA          (0x1UL << 31) 
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_EPENA_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ5_XFRSIZ          (0x7FFFFUL << 0) 
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ5_XFRSIZ_VAL(X) (((uint32_t)(X) & 0x7FFFFUL) << 0)
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ5_PKTCNT          (0x3FFUL << 19) 
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ5_PKTCNT_VAL(X) (((uint32_t)(X) & 0x3FFUL) << 19)
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ5_RXDPID_STUPCNT          (0x3UL << 29) 
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ5_RXDPID_STUPCNT_VAL(X) (((uint32_t)(X) & 0x3UL) << 29)
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ6_XFRSIZ          (0x7FFFFUL << 0) 
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ6_XFRSIZ_VAL(X) (((uint32_t)(X) & 0x7FFFFUL) << 0)
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ6_PKTCNT          (0x3FFUL << 19) 
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ6_PKTCNT_VAL(X) (((uint32_t)(X) & 0x3FFUL) << 19)
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ6_RXDPID_STUPCNT          (0x3UL << 29) 
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ6_RXDPID_STUPCNT_VAL(X) (((uint32_t)(X) & 0x3UL) << 29)
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ7_XFRSIZ          (0x7FFFFUL << 0) 
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ7_XFRSIZ_VAL(X) (((uint32_t)(X) & 0x7FFFFUL) << 0)
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ7_PKTCNT          (0x3FFUL << 19) 
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ7_PKTCNT_VAL(X) (((uint32_t)(X) & 0x3FFUL) << 19)
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ7_RXDPID_STUPCNT          (0x3UL << 29) 
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ7_RXDPID_STUPCNT_VAL(X) (((uint32_t)(X) & 0x3UL) << 29)

#define OTG2_HS_DEVICE  ((struct OTG2_HS_DEVICE*)(0x40080800UL))
struct OTG1_HS_PWRCLK {
  volatile uint32_t OTG_HS_PCGCR;
};
#define OTG1_HS_PWRCLK_OTG_HS_PCGCR_STPPCLK          (0x1UL << 0) 
#define OTG1_HS_PWRCLK_OTG_HS_PCGCR_STPPCLK_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG1_HS_PWRCLK_OTG_HS_PCGCR_GATEHCLK          (0x1UL << 1) 
#define OTG1_HS_PWRCLK_OTG_HS_PCGCR_GATEHCLK_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG1_HS_PWRCLK_OTG_HS_PCGCR_PHYSUSP          (0x1UL << 4) 
#define OTG1_HS_PWRCLK_OTG_HS_PCGCR_PHYSUSP_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)

#define OTG1_HS_PWRCLK  ((struct OTG1_HS_PWRCLK*)(0x40040E00UL))
struct OTG2_HS_PWRCLK {
  volatile uint32_t OTG_HS_PCGCR;
};
#define OTG2_HS_PWRCLK_OTG_HS_PCGCR_STPPCLK          (0x1UL << 0) 
#define OTG2_HS_PWRCLK_OTG_HS_PCGCR_STPPCLK_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OTG2_HS_PWRCLK_OTG_HS_PCGCR_GATEHCLK          (0x1UL << 1) 
#define OTG2_HS_PWRCLK_OTG_HS_PCGCR_GATEHCLK_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OTG2_HS_PWRCLK_OTG_HS_PCGCR_PHYSUSP          (0x1UL << 4) 
#define OTG2_HS_PWRCLK_OTG_HS_PCGCR_PHYSUSP_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)

#define OTG2_HS_PWRCLK  ((struct OTG2_HS_PWRCLK*)(0x40080E00UL))
struct Ethernet_DMA {
  volatile uint32_t DMAMR;
  volatile uint32_t DMASBMR;
  volatile const uint32_t DMAISR;
  volatile const uint32_t DMADSR;
  const volatile uint32_t RESERVED256[60];
  volatile uint32_t DMACCR;
  volatile uint32_t DMACTxCR;
  volatile uint32_t DMACRxCR;
  const volatile uint32_t RESERVED276[2];
  volatile uint32_t DMACTxDLAR;
  const volatile uint32_t RESERVED284[1];
  volatile uint32_t DMACRxDLAR;
  volatile uint32_t DMACTxDTPR;
  const volatile uint32_t RESERVED296[1];
  volatile uint32_t DMACRxDTPR;
  volatile uint32_t DMACTxRLR;
  volatile uint32_t DMACRxRLR;
  volatile uint32_t DMACIER;
  volatile uint32_t DMACRxIWTR;
  const volatile uint32_t RESERVED324[2];
  volatile const uint32_t DMACCATxDR;
  const volatile uint32_t RESERVED332[1];
  volatile const uint32_t DMACCARxDR;
  const volatile uint32_t RESERVED340[1];
  volatile const uint32_t DMACCATxBR;
  const volatile uint32_t RESERVED348[1];
  volatile const uint32_t DMACCARxBR;
  volatile uint32_t DMACSR;
  const volatile uint32_t RESERVED364[2];
  volatile const uint32_t DMACMFCR;
};
#define Ethernet_DMA_DMAMR_SWR          (0x1UL << 0) 
#define Ethernet_DMA_DMAMR_SWR_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define Ethernet_DMA_DMAMR_DA          (0x1UL << 1) 
#define Ethernet_DMA_DMAMR_DA_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define Ethernet_DMA_DMAMR_TXPR          (0x1UL << 11) 
#define Ethernet_DMA_DMAMR_TXPR_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define Ethernet_DMA_DMAMR_PR          (0x7UL << 12) 
#define Ethernet_DMA_DMAMR_PR_VAL(X) (((uint32_t)(X) & 0x7UL) << 12)
#define Ethernet_DMA_DMAMR_INTM          (0x1UL << 16) 
#define Ethernet_DMA_DMAMR_INTM_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define Ethernet_DMA_DMASBMR_FB          (0x1UL << 0) 
#define Ethernet_DMA_DMASBMR_FB_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define Ethernet_DMA_DMASBMR_AAL          (0x1UL << 12) 
#define Ethernet_DMA_DMASBMR_AAL_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define Ethernet_DMA_DMASBMR_MB          (0x1UL << 14) 
#define Ethernet_DMA_DMASBMR_MB_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define Ethernet_DMA_DMASBMR_RB          (0x1UL << 15) 
#define Ethernet_DMA_DMASBMR_RB_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define Ethernet_DMA_DMAISR_DC0IS          (0x1UL << 0) 
#define Ethernet_DMA_DMAISR_DC0IS_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define Ethernet_DMA_DMAISR_MTLIS          (0x1UL << 16) 
#define Ethernet_DMA_DMAISR_MTLIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define Ethernet_DMA_DMAISR_MACIS          (0x1UL << 17) 
#define Ethernet_DMA_DMAISR_MACIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define Ethernet_DMA_DMADSR_AXWHSTS          (0x1UL << 0) 
#define Ethernet_DMA_DMADSR_AXWHSTS_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define Ethernet_DMA_DMADSR_RPS0          (0xFUL << 8) 
#define Ethernet_DMA_DMADSR_RPS0_VAL(X) (((uint32_t)(X) & 0xFUL) << 8)
#define Ethernet_DMA_DMADSR_TPS0          (0xFUL << 12) 
#define Ethernet_DMA_DMADSR_TPS0_VAL(X) (((uint32_t)(X) & 0xFUL) << 12)
#define Ethernet_DMA_DMACCR_MSS          (0x3FFFUL << 0) 
#define Ethernet_DMA_DMACCR_MSS_VAL(X) (((uint32_t)(X) & 0x3FFFUL) << 0)
#define Ethernet_DMA_DMACCR_PBLX8          (0x1UL << 16) 
#define Ethernet_DMA_DMACCR_PBLX8_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define Ethernet_DMA_DMACCR_DSL          (0x7UL << 18) 
#define Ethernet_DMA_DMACCR_DSL_VAL(X) (((uint32_t)(X) & 0x7UL) << 18)
#define Ethernet_DMA_DMACTxCR_ST          (0x1UL << 0) 
#define Ethernet_DMA_DMACTxCR_ST_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define Ethernet_DMA_DMACTxCR_OSF          (0x1UL << 4) 
#define Ethernet_DMA_DMACTxCR_OSF_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define Ethernet_DMA_DMACTxCR_TSE          (0x1UL << 12) 
#define Ethernet_DMA_DMACTxCR_TSE_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define Ethernet_DMA_DMACTxCR_TXPBL          (0x3FUL << 16) 
#define Ethernet_DMA_DMACTxCR_TXPBL_VAL(X) (((uint32_t)(X) & 0x3FUL) << 16)
#define Ethernet_DMA_DMACRxCR_SR          (0x1UL << 0) 
#define Ethernet_DMA_DMACRxCR_SR_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define Ethernet_DMA_DMACRxCR_RBSZ          (0x3FFFUL << 1) 
#define Ethernet_DMA_DMACRxCR_RBSZ_VAL(X) (((uint32_t)(X) & 0x3FFFUL) << 1)
#define Ethernet_DMA_DMACRxCR_RXPBL          (0x3FUL << 16) 
#define Ethernet_DMA_DMACRxCR_RXPBL_VAL(X) (((uint32_t)(X) & 0x3FUL) << 16)
#define Ethernet_DMA_DMACRxCR_RPF          (0x1UL << 31) 
#define Ethernet_DMA_DMACRxCR_RPF_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define Ethernet_DMA_DMACTxDLAR_TDESLA          (0x3FFFFFFFUL << 2) 
#define Ethernet_DMA_DMACTxDLAR_TDESLA_VAL(X) (((uint32_t)(X) & 0x3FFFFFFFUL) << 2)
#define Ethernet_DMA_DMACRxDLAR_RDESLA          (0x3FFFFFFFUL << 2) 
#define Ethernet_DMA_DMACRxDLAR_RDESLA_VAL(X) (((uint32_t)(X) & 0x3FFFFFFFUL) << 2)
#define Ethernet_DMA_DMACTxDTPR_TDT          (0x3FFFFFFFUL << 2) 
#define Ethernet_DMA_DMACTxDTPR_TDT_VAL(X) (((uint32_t)(X) & 0x3FFFFFFFUL) << 2)
#define Ethernet_DMA_DMACRxDTPR_RDT          (0x3FFFFFFFUL << 2) 
#define Ethernet_DMA_DMACRxDTPR_RDT_VAL(X) (((uint32_t)(X) & 0x3FFFFFFFUL) << 2)
#define Ethernet_DMA_DMACTxRLR_TDRL          (0x3FFUL << 0) 
#define Ethernet_DMA_DMACTxRLR_TDRL_VAL(X) (((uint32_t)(X) & 0x3FFUL) << 0)
#define Ethernet_DMA_DMACRxRLR_RDRL          (0x3FFUL << 0) 
#define Ethernet_DMA_DMACRxRLR_RDRL_VAL(X) (((uint32_t)(X) & 0x3FFUL) << 0)
#define Ethernet_DMA_DMACIER_TIE          (0x1UL << 0) 
#define Ethernet_DMA_DMACIER_TIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define Ethernet_DMA_DMACIER_TXSE          (0x1UL << 1) 
#define Ethernet_DMA_DMACIER_TXSE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define Ethernet_DMA_DMACIER_TBUE          (0x1UL << 2) 
#define Ethernet_DMA_DMACIER_TBUE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define Ethernet_DMA_DMACIER_RIE          (0x1UL << 6) 
#define Ethernet_DMA_DMACIER_RIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define Ethernet_DMA_DMACIER_RBUE          (0x1UL << 7) 
#define Ethernet_DMA_DMACIER_RBUE_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define Ethernet_DMA_DMACIER_RSE          (0x1UL << 8) 
#define Ethernet_DMA_DMACIER_RSE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define Ethernet_DMA_DMACIER_RWTE          (0x1UL << 9) 
#define Ethernet_DMA_DMACIER_RWTE_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define Ethernet_DMA_DMACIER_ETIE          (0x1UL << 10) 
#define Ethernet_DMA_DMACIER_ETIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define Ethernet_DMA_DMACIER_ERIE          (0x1UL << 11) 
#define Ethernet_DMA_DMACIER_ERIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define Ethernet_DMA_DMACIER_FBEE          (0x1UL << 12) 
#define Ethernet_DMA_DMACIER_FBEE_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define Ethernet_DMA_DMACIER_CDEE          (0x1UL << 13) 
#define Ethernet_DMA_DMACIER_CDEE_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define Ethernet_DMA_DMACIER_AIE          (0x1UL << 14) 
#define Ethernet_DMA_DMACIER_AIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define Ethernet_DMA_DMACIER_NIE          (0x1UL << 15) 
#define Ethernet_DMA_DMACIER_NIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define Ethernet_DMA_DMACRxIWTR_RWT          (0xFFUL << 0) 
#define Ethernet_DMA_DMACRxIWTR_RWT_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define Ethernet_DMA_DMACCATxDR_CURTDESAPTR          (0xFFFFFFFFUL << 0) 
#define Ethernet_DMA_DMACCATxDR_CURTDESAPTR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define Ethernet_DMA_DMACCARxDR_CURRDESAPTR          (0xFFFFFFFFUL << 0) 
#define Ethernet_DMA_DMACCARxDR_CURRDESAPTR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define Ethernet_DMA_DMACCATxBR_CURTBUFAPTR          (0xFFFFFFFFUL << 0) 
#define Ethernet_DMA_DMACCATxBR_CURTBUFAPTR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define Ethernet_DMA_DMACCARxBR_CURRBUFAPTR          (0xFFFFFFFFUL << 0) 
#define Ethernet_DMA_DMACCARxBR_CURRBUFAPTR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define Ethernet_DMA_DMACSR_TI          (0x1UL << 0) 
#define Ethernet_DMA_DMACSR_TI_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define Ethernet_DMA_DMACSR_TPS          (0x1UL << 1) 
#define Ethernet_DMA_DMACSR_TPS_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define Ethernet_DMA_DMACSR_TBU          (0x1UL << 2) 
#define Ethernet_DMA_DMACSR_TBU_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define Ethernet_DMA_DMACSR_RI          (0x1UL << 6) 
#define Ethernet_DMA_DMACSR_RI_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define Ethernet_DMA_DMACSR_RBU          (0x1UL << 7) 
#define Ethernet_DMA_DMACSR_RBU_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define Ethernet_DMA_DMACSR_RPS          (0x1UL << 8) 
#define Ethernet_DMA_DMACSR_RPS_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define Ethernet_DMA_DMACSR_RWT          (0x1UL << 9) 
#define Ethernet_DMA_DMACSR_RWT_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define Ethernet_DMA_DMACSR_ET          (0x1UL << 10) 
#define Ethernet_DMA_DMACSR_ET_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define Ethernet_DMA_DMACSR_ER          (0x1UL << 11) 
#define Ethernet_DMA_DMACSR_ER_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define Ethernet_DMA_DMACSR_FBE          (0x1UL << 12) 
#define Ethernet_DMA_DMACSR_FBE_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define Ethernet_DMA_DMACSR_CDE          (0x1UL << 13) 
#define Ethernet_DMA_DMACSR_CDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define Ethernet_DMA_DMACSR_AIS          (0x1UL << 14) 
#define Ethernet_DMA_DMACSR_AIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define Ethernet_DMA_DMACSR_NIS          (0x1UL << 15) 
#define Ethernet_DMA_DMACSR_NIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define Ethernet_DMA_DMACSR_TEB          (0x7UL << 16) 
#define Ethernet_DMA_DMACSR_TEB_VAL(X) (((uint32_t)(X) & 0x7UL) << 16)
#define Ethernet_DMA_DMACSR_REB          (0x7UL << 19) 
#define Ethernet_DMA_DMACSR_REB_VAL(X) (((uint32_t)(X) & 0x7UL) << 19)
#define Ethernet_DMA_DMACMFCR_MFC          (0x7FFUL << 0) 
#define Ethernet_DMA_DMACMFCR_MFC_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 0)
#define Ethernet_DMA_DMACMFCR_MFCO          (0x1UL << 15) 
#define Ethernet_DMA_DMACMFCR_MFCO_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)

#define Ethernet_DMA  ((struct Ethernet_DMA*)(0x40029000UL))
struct Ethernet_MTL {
  volatile uint32_t MTLOMR;
  const volatile uint32_t RESERVED32[7];
  volatile const uint32_t MTLISR;
  const volatile uint32_t RESERVED256[55];
  volatile uint32_t MTLTxQOMR;
  volatile const uint32_t MTLTxQUR;
  volatile const uint32_t MTLTxQDR;
  const volatile uint32_t RESERVED300[8];
  volatile uint32_t MTLQICSR;
  volatile uint32_t MTLRxQOMR;
  volatile const uint32_t MTLRxQMPOCR;
  volatile const uint32_t MTLRxQDR;
};
#define Ethernet_MTL_MTLOMR_DTXSTS          (0x1UL << 1) 
#define Ethernet_MTL_MTLOMR_DTXSTS_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define Ethernet_MTL_MTLOMR_CNTPRST          (0x1UL << 8) 
#define Ethernet_MTL_MTLOMR_CNTPRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define Ethernet_MTL_MTLOMR_CNTCLR          (0x1UL << 9) 
#define Ethernet_MTL_MTLOMR_CNTCLR_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define Ethernet_MTL_MTLISR_Q0IS          (0x1UL << 0) 
#define Ethernet_MTL_MTLISR_Q0IS_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define Ethernet_MTL_MTLTxQOMR_FTQ          (0x1UL << 0) 
#define Ethernet_MTL_MTLTxQOMR_FTQ_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define Ethernet_MTL_MTLTxQOMR_TSF          (0x1UL << 1) 
#define Ethernet_MTL_MTLTxQOMR_TSF_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define Ethernet_MTL_MTLTxQOMR_TXQEN          (0x3UL << 2) 
#define Ethernet_MTL_MTLTxQOMR_TXQEN_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define Ethernet_MTL_MTLTxQOMR_TTC          (0x7UL << 4) 
#define Ethernet_MTL_MTLTxQOMR_TTC_VAL(X) (((uint32_t)(X) & 0x7UL) << 4)
#define Ethernet_MTL_MTLTxQOMR_TQS          (0x7UL << 16) 
#define Ethernet_MTL_MTLTxQOMR_TQS_VAL(X) (((uint32_t)(X) & 0x7UL) << 16)
#define Ethernet_MTL_MTLTxQUR_UFFRMCNT          (0x7FFUL << 0) 
#define Ethernet_MTL_MTLTxQUR_UFFRMCNT_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 0)
#define Ethernet_MTL_MTLTxQUR_UFCNTOVF          (0x1UL << 11) 
#define Ethernet_MTL_MTLTxQUR_UFCNTOVF_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define Ethernet_MTL_MTLTxQDR_TXQPAUSED          (0x1UL << 0) 
#define Ethernet_MTL_MTLTxQDR_TXQPAUSED_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define Ethernet_MTL_MTLTxQDR_TRCSTS          (0x3UL << 1) 
#define Ethernet_MTL_MTLTxQDR_TRCSTS_VAL(X) (((uint32_t)(X) & 0x3UL) << 1)
#define Ethernet_MTL_MTLTxQDR_TWCSTS          (0x1UL << 3) 
#define Ethernet_MTL_MTLTxQDR_TWCSTS_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define Ethernet_MTL_MTLTxQDR_TXQSTS          (0x1UL << 4) 
#define Ethernet_MTL_MTLTxQDR_TXQSTS_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define Ethernet_MTL_MTLTxQDR_TXSTSFSTS          (0x1UL << 5) 
#define Ethernet_MTL_MTLTxQDR_TXSTSFSTS_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define Ethernet_MTL_MTLTxQDR_PTXQ          (0x7UL << 16) 
#define Ethernet_MTL_MTLTxQDR_PTXQ_VAL(X) (((uint32_t)(X) & 0x7UL) << 16)
#define Ethernet_MTL_MTLTxQDR_STXSTSF          (0x7UL << 20) 
#define Ethernet_MTL_MTLTxQDR_STXSTSF_VAL(X) (((uint32_t)(X) & 0x7UL) << 20)
#define Ethernet_MTL_MTLQICSR_TXUNFIS          (0x1UL << 0) 
#define Ethernet_MTL_MTLQICSR_TXUNFIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define Ethernet_MTL_MTLQICSR_TXUIE          (0x1UL << 8) 
#define Ethernet_MTL_MTLQICSR_TXUIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define Ethernet_MTL_MTLQICSR_RXOVFIS          (0x1UL << 16) 
#define Ethernet_MTL_MTLQICSR_RXOVFIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define Ethernet_MTL_MTLQICSR_RXOIE          (0x1UL << 24) 
#define Ethernet_MTL_MTLQICSR_RXOIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define Ethernet_MTL_MTLRxQOMR_RTC          (0x3UL << 0) 
#define Ethernet_MTL_MTLRxQOMR_RTC_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define Ethernet_MTL_MTLRxQOMR_FUP          (0x1UL << 3) 
#define Ethernet_MTL_MTLRxQOMR_FUP_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define Ethernet_MTL_MTLRxQOMR_FEP          (0x1UL << 4) 
#define Ethernet_MTL_MTLRxQOMR_FEP_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define Ethernet_MTL_MTLRxQOMR_RSF          (0x1UL << 5) 
#define Ethernet_MTL_MTLRxQOMR_RSF_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define Ethernet_MTL_MTLRxQOMR_DIS_TCP_EF          (0x1UL << 6) 
#define Ethernet_MTL_MTLRxQOMR_DIS_TCP_EF_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define Ethernet_MTL_MTLRxQOMR_EHFC          (0x1UL << 7) 
#define Ethernet_MTL_MTLRxQOMR_EHFC_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define Ethernet_MTL_MTLRxQOMR_RFA          (0x7UL << 8) 
#define Ethernet_MTL_MTLRxQOMR_RFA_VAL(X) (((uint32_t)(X) & 0x7UL) << 8)
#define Ethernet_MTL_MTLRxQOMR_RFD          (0x7UL << 14) 
#define Ethernet_MTL_MTLRxQOMR_RFD_VAL(X) (((uint32_t)(X) & 0x7UL) << 14)
#define Ethernet_MTL_MTLRxQOMR_RQS          (0x7UL << 20) 
#define Ethernet_MTL_MTLRxQOMR_RQS_VAL(X) (((uint32_t)(X) & 0x7UL) << 20)
#define Ethernet_MTL_MTLRxQMPOCR_OVFPKTCNT          (0x7FFUL << 0) 
#define Ethernet_MTL_MTLRxQMPOCR_OVFPKTCNT_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 0)
#define Ethernet_MTL_MTLRxQMPOCR_OVFCNTOVF          (0x1UL << 11) 
#define Ethernet_MTL_MTLRxQMPOCR_OVFCNTOVF_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define Ethernet_MTL_MTLRxQMPOCR_MISPKTCNT          (0x7FFUL << 16) 
#define Ethernet_MTL_MTLRxQMPOCR_MISPKTCNT_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 16)
#define Ethernet_MTL_MTLRxQMPOCR_MISCNTOVF          (0x1UL << 27) 
#define Ethernet_MTL_MTLRxQMPOCR_MISCNTOVF_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define Ethernet_MTL_MTLRxQDR_RWCSTS          (0x1UL << 0) 
#define Ethernet_MTL_MTLRxQDR_RWCSTS_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define Ethernet_MTL_MTLRxQDR_RRCSTS          (0x3UL << 1) 
#define Ethernet_MTL_MTLRxQDR_RRCSTS_VAL(X) (((uint32_t)(X) & 0x3UL) << 1)
#define Ethernet_MTL_MTLRxQDR_RXQSTS          (0x3UL << 4) 
#define Ethernet_MTL_MTLRxQDR_RXQSTS_VAL(X) (((uint32_t)(X) & 0x3UL) << 4)
#define Ethernet_MTL_MTLRxQDR_PRXQ          (0x3FFFUL << 16) 
#define Ethernet_MTL_MTLRxQDR_PRXQ_VAL(X) (((uint32_t)(X) & 0x3FFFUL) << 16)

