via/viaems/src/platforms/stm32h743/device.h
#define Ethernet_MTL  ((struct Ethernet_MTL*)(0x40028C00UL))
struct Ethernet_MAC {
  volatile uint32_t MACCR;
  volatile uint32_t MACECR;
  volatile uint32_t MACPFR;
  volatile uint32_t MACWTR;
  volatile uint32_t MACHT0R;
  volatile uint32_t MACHT1R;
  const volatile uint32_t RESERVED80[14];
  volatile uint32_t MACVTR;
  const volatile uint32_t RESERVED88[1];
  volatile uint32_t MACVHTR;
  const volatile uint32_t RESERVED96[1];
  volatile uint32_t MACVIR;
  volatile uint32_t MACIVIR;
  const volatile uint32_t RESERVED112[2];
  volatile uint32_t MACQTxFCR;
  const volatile uint32_t RESERVED144[7];
  volatile uint32_t MACRxFCR;
  const volatile uint32_t RESERVED176[7];
  volatile const uint32_t MACISR;
  volatile uint32_t MACIER;
  volatile const uint32_t MACRxTxSR;
  const volatile uint32_t RESERVED192[1];
  volatile uint32_t MACPCSR;
  volatile uint32_t MACRWKPFR;
  const volatile uint32_t RESERVED208[2];
  volatile uint32_t MACLCSR;
  volatile uint32_t MACLTCR;
  volatile uint32_t MACLETR;
  volatile uint32_t MAC1USTCR;
  const volatile uint32_t RESERVED272[12];
  volatile const uint32_t MACVR;
  volatile const uint32_t MACDR;
  const volatile uint32_t RESERVED288[2];
  volatile const uint32_t MACHWF1R;
  volatile const uint32_t MACHWF2R;
  const volatile uint32_t RESERVED512[54];
  volatile uint32_t MACMDIOAR;
  volatile uint32_t MACMDIODR;
  const volatile uint32_t RESERVED768[62];
  volatile uint32_t MACA0HR;
  volatile uint32_t MACA0LR;
  volatile uint32_t MACA1HR;
  volatile uint32_t MACA1LR;
  volatile uint32_t MACA2HR;
  volatile uint32_t MACA2LR;
  volatile uint32_t MACA3HR;
  volatile uint32_t MACA3LR;
  const volatile uint32_t RESERVED1792[248];
  volatile uint32_t MMC_CONTROL;
  volatile const uint32_t MMC_RX_INTERRUPT;
  volatile const uint32_t MMC_TX_INTERRUPT;
  volatile uint32_t MMC_RX_INTERRUPT_MASK;
  volatile uint32_t MMC_TX_INTERRUPT_MASK;
  const volatile uint32_t RESERVED1868[14];
  volatile const uint32_t TX_SINGLE_COLLISION_GOOD_PACKETS;
  volatile const uint32_t TX_MULTIPLE_COLLISION_GOOD_PACKETS;
  const volatile uint32_t RESERVED1896[5];
  volatile const uint32_t TX_PACKET_COUNT_GOOD;
  const volatile uint32_t RESERVED1940[10];
  volatile const uint32_t RX_CRC_ERROR_PACKETS;
  volatile const uint32_t RX_ALIGNMENT_ERROR_PACKETS;
  const volatile uint32_t RESERVED1988[10];
  volatile const uint32_t RX_UNICAST_PACKETS_GOOD;
  const volatile uint32_t RESERVED2028[9];
  volatile const uint32_t TX_LPI_USEC_CNTR;
  volatile const uint32_t TX_LPI_TRAN_CNTR;
  volatile const uint32_t RX_LPI_USEC_CNTR;
  volatile const uint32_t RX_LPI_TRAN_CNTR;
  const volatile uint32_t RESERVED2304[65];
  volatile uint32_t MACL3L4C0R;
  volatile uint32_t MACL4A0R;
  const volatile uint32_t RESERVED2320[2];
  volatile uint32_t MACL3A00R;
  volatile uint32_t MACL3A10R;
  volatile uint32_t MACL3A20;
  volatile uint32_t MACL3A30;
  const volatile uint32_t RESERVED2352[4];
  volatile uint32_t MACL3L4C1R;
  volatile uint32_t MACL4A1R;
  const volatile uint32_t RESERVED2368[2];
  volatile uint32_t MACL3A01R;
  volatile uint32_t MACL3A11R;
  volatile uint32_t MACL3A21R;
  volatile uint32_t MACL3A31R;
  const volatile uint32_t RESERVED2784[100];
  volatile uint32_t MACARPAR;
  const volatile uint32_t RESERVED2816[7];
  volatile uint32_t MACTSCR;
  volatile uint32_t MACSSIR;
  volatile const uint32_t MACSTSR;
  volatile const uint32_t MACSTNR;
  volatile uint32_t MACSTSUR;
  volatile uint32_t MACSTNUR;
  volatile uint32_t MACTSAR;
  const volatile uint32_t RESERVED2848[1];
  volatile const uint32_t MACTSSR;
  const volatile uint32_t RESERVED2864[3];
  volatile const uint32_t MACTxTSSNR;
  volatile const uint32_t MACTxTSSSR;
  const volatile uint32_t RESERVED2880[2];
  volatile uint32_t MACACR;
  const volatile uint32_t RESERVED2888[1];
  volatile const uint32_t MACATSNR;
  volatile const uint32_t MACATSSR;
  volatile uint32_t MACTSIACR;
  volatile uint32_t MACTSEACR;
  volatile uint32_t MACTSICNR;
  volatile uint32_t MACTSECNR;
  const volatile uint32_t RESERVED2928[4];
  volatile uint32_t MACPPSCR;
  const volatile uint32_t RESERVED2944[3];
  volatile uint32_t MACPPSTTSR;
  volatile uint32_t MACPPSTTNR;
  volatile uint32_t MACPPSIR;
  volatile uint32_t MACPPSWR;
  const volatile uint32_t RESERVED3008[12];
  volatile uint32_t MACPOCR;
  volatile uint32_t MACSPI0R;
  volatile uint32_t MACSPI1R;
  volatile uint32_t MACSPI2R;
  volatile uint32_t MACLMIR;
};
#define Ethernet_MAC_MACCR_RE          (0x1UL << 0) 
#define Ethernet_MAC_MACCR_RE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define Ethernet_MAC_MACCR_TE          (0x1UL << 1) 
#define Ethernet_MAC_MACCR_TE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define Ethernet_MAC_MACCR_PRELEN          (0x3UL << 2) 
#define Ethernet_MAC_MACCR_PRELEN_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define Ethernet_MAC_MACCR_DC          (0x1UL << 4) 
#define Ethernet_MAC_MACCR_DC_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define Ethernet_MAC_MACCR_BL          (0x3UL << 5) 
#define Ethernet_MAC_MACCR_BL_VAL(X) (((uint32_t)(X) & 0x3UL) << 5)
#define Ethernet_MAC_MACCR_DR          (0x1UL << 8) 
#define Ethernet_MAC_MACCR_DR_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define Ethernet_MAC_MACCR_DCRS          (0x1UL << 9) 
#define Ethernet_MAC_MACCR_DCRS_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define Ethernet_MAC_MACCR_DO          (0x1UL << 10) 
#define Ethernet_MAC_MACCR_DO_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define Ethernet_MAC_MACCR_ECRSFD          (0x1UL << 11) 
#define Ethernet_MAC_MACCR_ECRSFD_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define Ethernet_MAC_MACCR_LM          (0x1UL << 12) 
#define Ethernet_MAC_MACCR_LM_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define Ethernet_MAC_MACCR_DM          (0x1UL << 13) 
#define Ethernet_MAC_MACCR_DM_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define Ethernet_MAC_MACCR_FES          (0x1UL << 14) 
#define Ethernet_MAC_MACCR_FES_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define Ethernet_MAC_MACCR_JE          (0x1UL << 16) 
#define Ethernet_MAC_MACCR_JE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define Ethernet_MAC_MACCR_JD          (0x1UL << 17) 
#define Ethernet_MAC_MACCR_JD_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define Ethernet_MAC_MACCR_WD          (0x1UL << 19) 
#define Ethernet_MAC_MACCR_WD_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define Ethernet_MAC_MACCR_ACS          (0x1UL << 20) 
#define Ethernet_MAC_MACCR_ACS_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define Ethernet_MAC_MACCR_CST          (0x1UL << 21) 
#define Ethernet_MAC_MACCR_CST_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define Ethernet_MAC_MACCR_S2KP          (0x1UL << 22) 
#define Ethernet_MAC_MACCR_S2KP_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define Ethernet_MAC_MACCR_GPSLCE          (0x1UL << 23) 
#define Ethernet_MAC_MACCR_GPSLCE_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define Ethernet_MAC_MACCR_IPG          (0x7UL << 24) 
#define Ethernet_MAC_MACCR_IPG_VAL(X) (((uint32_t)(X) & 0x7UL) << 24)
#define Ethernet_MAC_MACCR_IPC          (0x1UL << 27) 
#define Ethernet_MAC_MACCR_IPC_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define Ethernet_MAC_MACCR_SARC          (0x7UL << 28) 
#define Ethernet_MAC_MACCR_SARC_VAL(X) (((uint32_t)(X) & 0x7UL) << 28)
#define Ethernet_MAC_MACCR_ARPEN          (0x1UL << 31) 
#define Ethernet_MAC_MACCR_ARPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define Ethernet_MAC_MACECR_GPSL          (0x3FFFUL << 0) 
#define Ethernet_MAC_MACECR_GPSL_VAL(X) (((uint32_t)(X) & 0x3FFFUL) << 0)
#define Ethernet_MAC_MACECR_DCRCC          (0x1UL << 16) 
#define Ethernet_MAC_MACECR_DCRCC_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define Ethernet_MAC_MACECR_SPEN          (0x1UL << 17) 
#define Ethernet_MAC_MACECR_SPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define Ethernet_MAC_MACECR_USP          (0x1UL << 18) 
#define Ethernet_MAC_MACECR_USP_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define Ethernet_MAC_MACECR_EIPGEN          (0x1UL << 24) 
#define Ethernet_MAC_MACECR_EIPGEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define Ethernet_MAC_MACECR_EIPG          (0x1FUL << 25) 
#define Ethernet_MAC_MACECR_EIPG_VAL(X) (((uint32_t)(X) & 0x1FUL) << 25)
#define Ethernet_MAC_MACPFR_PR          (0x1UL << 0) 
#define Ethernet_MAC_MACPFR_PR_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define Ethernet_MAC_MACPFR_HUC          (0x1UL << 1) 
#define Ethernet_MAC_MACPFR_HUC_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define Ethernet_MAC_MACPFR_HMC          (0x1UL << 2) 
#define Ethernet_MAC_MACPFR_HMC_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define Ethernet_MAC_MACPFR_DAIF          (0x1UL << 3) 
#define Ethernet_MAC_MACPFR_DAIF_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define Ethernet_MAC_MACPFR_PM          (0x1UL << 4) 
#define Ethernet_MAC_MACPFR_PM_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define Ethernet_MAC_MACPFR_DBF          (0x1UL << 5) 
#define Ethernet_MAC_MACPFR_DBF_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define Ethernet_MAC_MACPFR_PCF          (0x3UL << 6) 
#define Ethernet_MAC_MACPFR_PCF_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define Ethernet_MAC_MACPFR_SAIF          (0x1UL << 8) 
#define Ethernet_MAC_MACPFR_SAIF_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define Ethernet_MAC_MACPFR_SAF          (0x1UL << 9) 
#define Ethernet_MAC_MACPFR_SAF_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define Ethernet_MAC_MACPFR_HPF          (0x1UL << 10) 
#define Ethernet_MAC_MACPFR_HPF_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define Ethernet_MAC_MACPFR_VTFE          (0x1UL << 16) 
#define Ethernet_MAC_MACPFR_VTFE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define Ethernet_MAC_MACPFR_IPFE          (0x1UL << 20) 
#define Ethernet_MAC_MACPFR_IPFE_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define Ethernet_MAC_MACPFR_DNTU          (0x1UL << 21) 
#define Ethernet_MAC_MACPFR_DNTU_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define Ethernet_MAC_MACPFR_RA          (0x1UL << 31) 
#define Ethernet_MAC_MACPFR_RA_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define Ethernet_MAC_MACWTR_WTO          (0xFUL << 0) 
#define Ethernet_MAC_MACWTR_WTO_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define Ethernet_MAC_MACWTR_PWE          (0x1UL << 8) 
#define Ethernet_MAC_MACWTR_PWE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define Ethernet_MAC_MACHT0R_HT31T0          (0xFFFFFFFFUL << 0) 
#define Ethernet_MAC_MACHT0R_HT31T0_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define Ethernet_MAC_MACHT1R_HT63T32          (0xFFFFFFFFUL << 0) 
#define Ethernet_MAC_MACHT1R_HT63T32_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define Ethernet_MAC_MACVTR_VL          (0xFFFFUL << 0) 
#define Ethernet_MAC_MACVTR_VL_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define Ethernet_MAC_MACVTR_ETV          (0x1UL << 16) 
#define Ethernet_MAC_MACVTR_ETV_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define Ethernet_MAC_MACVTR_VTIM          (0x1UL << 17) 
#define Ethernet_MAC_MACVTR_VTIM_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define Ethernet_MAC_MACVTR_ESVL          (0x1UL << 18) 
#define Ethernet_MAC_MACVTR_ESVL_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define Ethernet_MAC_MACVTR_ERSVLM          (0x1UL << 19) 
#define Ethernet_MAC_MACVTR_ERSVLM_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define Ethernet_MAC_MACVTR_DOVLTC          (0x1UL << 20) 
#define Ethernet_MAC_MACVTR_DOVLTC_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define Ethernet_MAC_MACVTR_EVLS          (0x3UL << 21) 
#define Ethernet_MAC_MACVTR_EVLS_VAL(X) (((uint32_t)(X) & 0x3UL) << 21)
#define Ethernet_MAC_MACVTR_EVLRXS          (0x1UL << 24) 
#define Ethernet_MAC_MACVTR_EVLRXS_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define Ethernet_MAC_MACVTR_VTHM          (0x1UL << 25) 
#define Ethernet_MAC_MACVTR_VTHM_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define Ethernet_MAC_MACVTR_EDVLP          (0x1UL << 26) 
#define Ethernet_MAC_MACVTR_EDVLP_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define Ethernet_MAC_MACVTR_ERIVLT          (0x1UL << 27) 
#define Ethernet_MAC_MACVTR_ERIVLT_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define Ethernet_MAC_MACVTR_EIVLS          (0x3UL << 28) 
#define Ethernet_MAC_MACVTR_EIVLS_VAL(X) (((uint32_t)(X) & 0x3UL) << 28)
#define Ethernet_MAC_MACVTR_EIVLRXS          (0x1UL << 31) 
#define Ethernet_MAC_MACVTR_EIVLRXS_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define Ethernet_MAC_MACVHTR_VLHT          (0xFFFFUL << 0) 
#define Ethernet_MAC_MACVHTR_VLHT_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define Ethernet_MAC_MACVIR_VLT          (0xFFFFUL << 0) 
#define Ethernet_MAC_MACVIR_VLT_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define Ethernet_MAC_MACVIR_VLC          (0x3UL << 16) 
#define Ethernet_MAC_MACVIR_VLC_VAL(X) (((uint32_t)(X) & 0x3UL) << 16)
#define Ethernet_MAC_MACVIR_VLP          (0x1UL << 18) 
#define Ethernet_MAC_MACVIR_VLP_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define Ethernet_MAC_MACVIR_CSVL          (0x1UL << 19) 
#define Ethernet_MAC_MACVIR_CSVL_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define Ethernet_MAC_MACVIR_VLTI          (0x1UL << 20) 
#define Ethernet_MAC_MACVIR_VLTI_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define Ethernet_MAC_MACIVIR_VLT          (0xFFFFUL << 0) 
#define Ethernet_MAC_MACIVIR_VLT_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define Ethernet_MAC_MACIVIR_VLC          (0x3UL << 16) 
#define Ethernet_MAC_MACIVIR_VLC_VAL(X) (((uint32_t)(X) & 0x3UL) << 16)
#define Ethernet_MAC_MACIVIR_VLP          (0x1UL << 18) 
#define Ethernet_MAC_MACIVIR_VLP_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define Ethernet_MAC_MACIVIR_CSVL          (0x1UL << 19) 
#define Ethernet_MAC_MACIVIR_CSVL_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define Ethernet_MAC_MACIVIR_VLTI          (0x1UL << 20) 
#define Ethernet_MAC_MACIVIR_VLTI_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define Ethernet_MAC_MACQTxFCR_FCB_BPA          (0x1UL << 0) 
#define Ethernet_MAC_MACQTxFCR_FCB_BPA_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define Ethernet_MAC_MACQTxFCR_TFE          (0x1UL << 1) 
#define Ethernet_MAC_MACQTxFCR_TFE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define Ethernet_MAC_MACQTxFCR_PLT          (0x7UL << 4) 
#define Ethernet_MAC_MACQTxFCR_PLT_VAL(X) (((uint32_t)(X) & 0x7UL) << 4)
#define Ethernet_MAC_MACQTxFCR_DZPQ          (0x1UL << 7) 
#define Ethernet_MAC_MACQTxFCR_DZPQ_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define Ethernet_MAC_MACQTxFCR_PT          (0xFFFFUL << 16) 
#define Ethernet_MAC_MACQTxFCR_PT_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define Ethernet_MAC_MACRxFCR_RFE          (0x1UL << 0) 
#define Ethernet_MAC_MACRxFCR_RFE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define Ethernet_MAC_MACRxFCR_UP          (0x1UL << 1) 
#define Ethernet_MAC_MACRxFCR_UP_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define Ethernet_MAC_MACISR_PHYIS          (0x1UL << 3) 
#define Ethernet_MAC_MACISR_PHYIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define Ethernet_MAC_MACISR_PMTIS          (0x1UL << 4) 
#define Ethernet_MAC_MACISR_PMTIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define Ethernet_MAC_MACISR_LPIIS          (0x1UL << 5) 
#define Ethernet_MAC_MACISR_LPIIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define Ethernet_MAC_MACISR_MMCIS          (0x1UL << 8) 
#define Ethernet_MAC_MACISR_MMCIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define Ethernet_MAC_MACISR_MMCRXIS          (0x1UL << 9) 
#define Ethernet_MAC_MACISR_MMCRXIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define Ethernet_MAC_MACISR_MMCTXIS          (0x1UL << 10) 
#define Ethernet_MAC_MACISR_MMCTXIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define Ethernet_MAC_MACISR_TSIS          (0x1UL << 12) 
#define Ethernet_MAC_MACISR_TSIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define Ethernet_MAC_MACISR_TXSTSIS          (0x1UL << 13) 
#define Ethernet_MAC_MACISR_TXSTSIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define Ethernet_MAC_MACISR_RXSTSIS          (0x1UL << 14) 
#define Ethernet_MAC_MACISR_RXSTSIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define Ethernet_MAC_MACIER_PHYIE          (0x1UL << 3) 
#define Ethernet_MAC_MACIER_PHYIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define Ethernet_MAC_MACIER_PMTIE          (0x1UL << 4) 
#define Ethernet_MAC_MACIER_PMTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define Ethernet_MAC_MACIER_LPIIE          (0x1UL << 5) 
#define Ethernet_MAC_MACIER_LPIIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define Ethernet_MAC_MACIER_TSIE          (0x1UL << 12) 
#define Ethernet_MAC_MACIER_TSIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define Ethernet_MAC_MACIER_TXSTSIE          (0x1UL << 13) 
#define Ethernet_MAC_MACIER_TXSTSIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define Ethernet_MAC_MACIER_RXSTSIE          (0x1UL << 14) 
#define Ethernet_MAC_MACIER_RXSTSIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define Ethernet_MAC_MACRxTxSR_TJT          (0x1UL << 0) 
#define Ethernet_MAC_MACRxTxSR_TJT_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define Ethernet_MAC_MACRxTxSR_NCARR          (0x1UL << 1) 
#define Ethernet_MAC_MACRxTxSR_NCARR_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define Ethernet_MAC_MACRxTxSR_LCARR          (0x1UL << 2) 
#define Ethernet_MAC_MACRxTxSR_LCARR_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define Ethernet_MAC_MACRxTxSR_EXDEF          (0x1UL << 3) 
#define Ethernet_MAC_MACRxTxSR_EXDEF_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define Ethernet_MAC_MACRxTxSR_LCOL          (0x1UL << 4) 
#define Ethernet_MAC_MACRxTxSR_LCOL_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define Ethernet_MAC_MACRxTxSR_EXCOL          (0x1UL << 5) 
#define Ethernet_MAC_MACRxTxSR_EXCOL_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define Ethernet_MAC_MACRxTxSR_RWT          (0x1UL << 8) 
#define Ethernet_MAC_MACRxTxSR_RWT_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define Ethernet_MAC_MACPCSR_PWRDWN          (0x1UL << 0) 
#define Ethernet_MAC_MACPCSR_PWRDWN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define Ethernet_MAC_MACPCSR_MGKPKTEN          (0x1UL << 1) 
#define Ethernet_MAC_MACPCSR_MGKPKTEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define Ethernet_MAC_MACPCSR_RWKPKTEN          (0x1UL << 2) 
#define Ethernet_MAC_MACPCSR_RWKPKTEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define Ethernet_MAC_MACPCSR_MGKPRCVD          (0x1UL << 5) 
#define Ethernet_MAC_MACPCSR_MGKPRCVD_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define Ethernet_MAC_MACPCSR_RWKPRCVD          (0x1UL << 6) 
#define Ethernet_MAC_MACPCSR_RWKPRCVD_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define Ethernet_MAC_MACPCSR_GLBLUCAST          (0x1UL << 9) 
#define Ethernet_MAC_MACPCSR_GLBLUCAST_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define Ethernet_MAC_MACPCSR_RWKPFE          (0x1UL << 10) 
#define Ethernet_MAC_MACPCSR_RWKPFE_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define Ethernet_MAC_MACPCSR_RWKPTR          (0x1FUL << 24) 
#define Ethernet_MAC_MACPCSR_RWKPTR_VAL(X) (((uint32_t)(X) & 0x1FUL) << 24)
#define Ethernet_MAC_MACPCSR_RWKFILTRST          (0x1UL << 31) 
#define Ethernet_MAC_MACPCSR_RWKFILTRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define Ethernet_MAC_MACRWKPFR_MACRWKPFR          (0xFFFFFFFFUL << 0) 
#define Ethernet_MAC_MACRWKPFR_MACRWKPFR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define Ethernet_MAC_MACLCSR_TLPIEN          (0x1UL << 0) 
#define Ethernet_MAC_MACLCSR_TLPIEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define Ethernet_MAC_MACLCSR_TLPIEX          (0x1UL << 1) 
#define Ethernet_MAC_MACLCSR_TLPIEX_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define Ethernet_MAC_MACLCSR_RLPIEN          (0x1UL << 2) 
#define Ethernet_MAC_MACLCSR_RLPIEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define Ethernet_MAC_MACLCSR_RLPIEX          (0x1UL << 3) 
#define Ethernet_MAC_MACLCSR_RLPIEX_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define Ethernet_MAC_MACLCSR_TLPIST          (0x1UL << 8) 
#define Ethernet_MAC_MACLCSR_TLPIST_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define Ethernet_MAC_MACLCSR_RLPIST          (0x1UL << 9) 
#define Ethernet_MAC_MACLCSR_RLPIST_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define Ethernet_MAC_MACLCSR_LPIEN          (0x1UL << 16) 
#define Ethernet_MAC_MACLCSR_LPIEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define Ethernet_MAC_MACLCSR_PLS          (0x1UL << 17) 
#define Ethernet_MAC_MACLCSR_PLS_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define Ethernet_MAC_MACLCSR_PLSEN          (0x1UL << 18) 
#define Ethernet_MAC_MACLCSR_PLSEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define Ethernet_MAC_MACLCSR_LPITXA          (0x1UL << 19) 
#define Ethernet_MAC_MACLCSR_LPITXA_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define Ethernet_MAC_MACLCSR_LPITE          (0x1UL << 20) 
#define Ethernet_MAC_MACLCSR_LPITE_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define Ethernet_MAC_MACLTCR_TWT          (0xFFFFUL << 0) 
#define Ethernet_MAC_MACLTCR_TWT_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define Ethernet_MAC_MACLTCR_LST          (0x3FFUL << 16) 
#define Ethernet_MAC_MACLTCR_LST_VAL(X) (((uint32_t)(X) & 0x3FFUL) << 16)
#define Ethernet_MAC_MACLETR_LPIET          (0x1FFFFUL << 0) 
#define Ethernet_MAC_MACLETR_LPIET_VAL(X) (((uint32_t)(X) & 0x1FFFFUL) << 0)
#define Ethernet_MAC_MAC1USTCR_TIC_1US_CNTR          (0xFFFUL << 0) 
#define Ethernet_MAC_MAC1USTCR_TIC_1US_CNTR_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 0)
#define Ethernet_MAC_MACVR_SNPSVER          (0xFFUL << 0) 
#define Ethernet_MAC_MACVR_SNPSVER_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define Ethernet_MAC_MACVR_USERVER          (0xFFUL << 8) 
#define Ethernet_MAC_MACVR_USERVER_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define Ethernet_MAC_MACDR_RPESTS          (0x1UL << 0) 
#define Ethernet_MAC_MACDR_RPESTS_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define Ethernet_MAC_MACDR_RFCFCSTS          (0x3UL << 1) 
#define Ethernet_MAC_MACDR_RFCFCSTS_VAL(X) (((uint32_t)(X) & 0x3UL) << 1)
#define Ethernet_MAC_MACDR_TPESTS          (0x1UL << 16) 
#define Ethernet_MAC_MACDR_TPESTS_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define Ethernet_MAC_MACDR_TFCSTS          (0x3UL << 17) 
#define Ethernet_MAC_MACDR_TFCSTS_VAL(X) (((uint32_t)(X) & 0x3UL) << 17)
#define Ethernet_MAC_MACHWF1R_RXFIFOSIZE          (0x1FUL << 0) 
#define Ethernet_MAC_MACHWF1R_RXFIFOSIZE_VAL(X) (((uint32_t)(X) & 0x1FUL) << 0)
#define Ethernet_MAC_MACHWF1R_TXFIFOSIZE          (0x1FUL << 6) 
#define Ethernet_MAC_MACHWF1R_TXFIFOSIZE_VAL(X) (((uint32_t)(X) & 0x1FUL) << 6)
#define Ethernet_MAC_MACHWF1R_OSTEN          (0x1UL << 11) 
#define Ethernet_MAC_MACHWF1R_OSTEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define Ethernet_MAC_MACHWF1R_PTOEN          (0x1UL << 12) 
#define Ethernet_MAC_MACHWF1R_PTOEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define Ethernet_MAC_MACHWF1R_ADVTHWORD          (0x1UL << 13) 
#define Ethernet_MAC_MACHWF1R_ADVTHWORD_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define Ethernet_MAC_MACHWF1R_ADDR64          (0x3UL << 14) 
#define Ethernet_MAC_MACHWF1R_ADDR64_VAL(X) (((uint32_t)(X) & 0x3UL) << 14)
#define Ethernet_MAC_MACHWF1R_DCBEN          (0x1UL << 16) 
#define Ethernet_MAC_MACHWF1R_DCBEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define Ethernet_MAC_MACHWF1R_SPHEN          (0x1UL << 17) 
#define Ethernet_MAC_MACHWF1R_SPHEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define Ethernet_MAC_MACHWF1R_TSOEN          (0x1UL << 18) 
#define Ethernet_MAC_MACHWF1R_TSOEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define Ethernet_MAC_MACHWF1R_DBGMEMA          (0x1UL << 19) 
#define Ethernet_MAC_MACHWF1R_DBGMEMA_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define Ethernet_MAC_MACHWF1R_AVSEL          (0x1UL << 20) 
#define Ethernet_MAC_MACHWF1R_AVSEL_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define Ethernet_MAC_MACHWF1R_HASHTBLSZ          (0x3UL << 24) 
#define Ethernet_MAC_MACHWF1R_HASHTBLSZ_VAL(X) (((uint32_t)(X) & 0x3UL) << 24)
#define Ethernet_MAC_MACHWF1R_L3L4FNUM          (0xFUL << 27) 
#define Ethernet_MAC_MACHWF1R_L3L4FNUM_VAL(X) (((uint32_t)(X) & 0xFUL) << 27)
#define Ethernet_MAC_MACHWF2R_RXQCNT          (0xFUL << 0) 
#define Ethernet_MAC_MACHWF2R_RXQCNT_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define Ethernet_MAC_MACHWF2R_TXQCNT          (0xFUL << 6) 
#define Ethernet_MAC_MACHWF2R_TXQCNT_VAL(X) (((uint32_t)(X) & 0xFUL) << 6)
#define Ethernet_MAC_MACHWF2R_RXCHCNT          (0xFUL << 12) 
#define Ethernet_MAC_MACHWF2R_RXCHCNT_VAL(X) (((uint32_t)(X) & 0xFUL) << 12)
#define Ethernet_MAC_MACHWF2R_TXCHCNT          (0xFUL << 18) 
#define Ethernet_MAC_MACHWF2R_TXCHCNT_VAL(X) (((uint32_t)(X) & 0xFUL) << 18)
#define Ethernet_MAC_MACHWF2R_PPSOUTNUM          (0x7UL << 24) 
