via/viaems/src/platforms/stm32h743/device.h
#define Ethernet_MAC_MACHWF2R_PPSOUTNUM_VAL(X) (((uint32_t)(X) & 0x7UL) << 24)
#define Ethernet_MAC_MACHWF2R_AUXSNAPNUM          (0x7UL << 28) 
#define Ethernet_MAC_MACHWF2R_AUXSNAPNUM_VAL(X) (((uint32_t)(X) & 0x7UL) << 28)
#define Ethernet_MAC_MACMDIOAR_MB          (0x1UL << 0) 
#define Ethernet_MAC_MACMDIOAR_MB_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define Ethernet_MAC_MACMDIOAR_C45E          (0x1UL << 1) 
#define Ethernet_MAC_MACMDIOAR_C45E_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define Ethernet_MAC_MACMDIOAR_GOC          (0x3UL << 2) 
#define Ethernet_MAC_MACMDIOAR_GOC_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define Ethernet_MAC_MACMDIOAR_SKAP          (0x1UL << 4) 
#define Ethernet_MAC_MACMDIOAR_SKAP_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define Ethernet_MAC_MACMDIOAR_CR          (0xFUL << 8) 
#define Ethernet_MAC_MACMDIOAR_CR_VAL(X) (((uint32_t)(X) & 0xFUL) << 8)
#define Ethernet_MAC_MACMDIOAR_NTC          (0x7UL << 12) 
#define Ethernet_MAC_MACMDIOAR_NTC_VAL(X) (((uint32_t)(X) & 0x7UL) << 12)
#define Ethernet_MAC_MACMDIOAR_RDA          (0x1FUL << 16) 
#define Ethernet_MAC_MACMDIOAR_RDA_VAL(X) (((uint32_t)(X) & 0x1FUL) << 16)
#define Ethernet_MAC_MACMDIOAR_PA          (0x1FUL << 21) 
#define Ethernet_MAC_MACMDIOAR_PA_VAL(X) (((uint32_t)(X) & 0x1FUL) << 21)
#define Ethernet_MAC_MACMDIOAR_BTB          (0x1UL << 26) 
#define Ethernet_MAC_MACMDIOAR_BTB_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define Ethernet_MAC_MACMDIOAR_PSE          (0x1UL << 27) 
#define Ethernet_MAC_MACMDIOAR_PSE_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define Ethernet_MAC_MACMDIODR_MD          (0xFFFFUL << 0) 
#define Ethernet_MAC_MACMDIODR_MD_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define Ethernet_MAC_MACMDIODR_RA          (0xFFFFUL << 16) 
#define Ethernet_MAC_MACMDIODR_RA_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define Ethernet_MAC_MACARPAR_ARPPA          (0xFFFFFFFFUL << 0) 
#define Ethernet_MAC_MACARPAR_ARPPA_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define Ethernet_MAC_MACA0HR_ADDRHI          (0xFFFFUL << 0) 
#define Ethernet_MAC_MACA0HR_ADDRHI_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define Ethernet_MAC_MACA0HR_AE          (0x1UL << 31) 
#define Ethernet_MAC_MACA0HR_AE_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define Ethernet_MAC_MACA0LR_ADDRLO          (0xFFFFFFFFUL << 0) 
#define Ethernet_MAC_MACA0LR_ADDRLO_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define Ethernet_MAC_MACA1LR_ADDRLO          (0xFFFFFFFFUL << 0) 
#define Ethernet_MAC_MACA1LR_ADDRLO_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define Ethernet_MAC_MACA2LR_ADDRLO          (0xFFFFFFFFUL << 0) 
#define Ethernet_MAC_MACA2LR_ADDRLO_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define Ethernet_MAC_MACA1HR_ADDRHI          (0xFFFFUL << 0) 
#define Ethernet_MAC_MACA1HR_ADDRHI_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define Ethernet_MAC_MACA1HR_MBC          (0x3FUL << 24) 
#define Ethernet_MAC_MACA1HR_MBC_VAL(X) (((uint32_t)(X) & 0x3FUL) << 24)
#define Ethernet_MAC_MACA1HR_SA          (0x1UL << 30) 
#define Ethernet_MAC_MACA1HR_SA_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define Ethernet_MAC_MACA1HR_AE          (0x1UL << 31) 
#define Ethernet_MAC_MACA1HR_AE_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define Ethernet_MAC_MACA2HR_ADDRHI          (0xFFFFUL << 0) 
#define Ethernet_MAC_MACA2HR_ADDRHI_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define Ethernet_MAC_MACA2HR_MBC          (0x3FUL << 24) 
#define Ethernet_MAC_MACA2HR_MBC_VAL(X) (((uint32_t)(X) & 0x3FUL) << 24)
#define Ethernet_MAC_MACA2HR_SA          (0x1UL << 30) 
#define Ethernet_MAC_MACA2HR_SA_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define Ethernet_MAC_MACA2HR_AE          (0x1UL << 31) 
#define Ethernet_MAC_MACA2HR_AE_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define Ethernet_MAC_MACA3HR_ADDRHI          (0xFFFFUL << 0) 
#define Ethernet_MAC_MACA3HR_ADDRHI_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define Ethernet_MAC_MACA3HR_MBC          (0x3FUL << 24) 
#define Ethernet_MAC_MACA3HR_MBC_VAL(X) (((uint32_t)(X) & 0x3FUL) << 24)
#define Ethernet_MAC_MACA3HR_SA          (0x1UL << 30) 
#define Ethernet_MAC_MACA3HR_SA_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define Ethernet_MAC_MACA3HR_AE          (0x1UL << 31) 
#define Ethernet_MAC_MACA3HR_AE_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define Ethernet_MAC_MACA3LR_ADDRLO          (0xFFFFFFFFUL << 0) 
#define Ethernet_MAC_MACA3LR_ADDRLO_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define Ethernet_MAC_MMC_CONTROL_CNTRST          (0x1UL << 0) 
#define Ethernet_MAC_MMC_CONTROL_CNTRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define Ethernet_MAC_MMC_CONTROL_CNTSTOPRO          (0x1UL << 1) 
#define Ethernet_MAC_MMC_CONTROL_CNTSTOPRO_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define Ethernet_MAC_MMC_CONTROL_RSTONRD          (0x1UL << 2) 
#define Ethernet_MAC_MMC_CONTROL_RSTONRD_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define Ethernet_MAC_MMC_CONTROL_CNTFREEZ          (0x1UL << 3) 
#define Ethernet_MAC_MMC_CONTROL_CNTFREEZ_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define Ethernet_MAC_MMC_CONTROL_CNTPRST          (0x1UL << 4) 
#define Ethernet_MAC_MMC_CONTROL_CNTPRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define Ethernet_MAC_MMC_CONTROL_CNTPRSTLVL          (0x1UL << 5) 
#define Ethernet_MAC_MMC_CONTROL_CNTPRSTLVL_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define Ethernet_MAC_MMC_CONTROL_UCDBC          (0x1UL << 8) 
#define Ethernet_MAC_MMC_CONTROL_UCDBC_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define Ethernet_MAC_MMC_RX_INTERRUPT_RXCRCERPIS          (0x1UL << 5) 
#define Ethernet_MAC_MMC_RX_INTERRUPT_RXCRCERPIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define Ethernet_MAC_MMC_RX_INTERRUPT_RXALGNERPIS          (0x1UL << 6) 
#define Ethernet_MAC_MMC_RX_INTERRUPT_RXALGNERPIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define Ethernet_MAC_MMC_RX_INTERRUPT_RXUCGPIS          (0x1UL << 17) 
#define Ethernet_MAC_MMC_RX_INTERRUPT_RXUCGPIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define Ethernet_MAC_MMC_RX_INTERRUPT_RXLPIUSCIS          (0x1UL << 26) 
#define Ethernet_MAC_MMC_RX_INTERRUPT_RXLPIUSCIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define Ethernet_MAC_MMC_RX_INTERRUPT_RXLPITRCIS          (0x1UL << 27) 
#define Ethernet_MAC_MMC_RX_INTERRUPT_RXLPITRCIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define Ethernet_MAC_MMC_TX_INTERRUPT_TXSCOLGPIS          (0x1UL << 14) 
#define Ethernet_MAC_MMC_TX_INTERRUPT_TXSCOLGPIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define Ethernet_MAC_MMC_TX_INTERRUPT_TXMCOLGPIS          (0x1UL << 15) 
#define Ethernet_MAC_MMC_TX_INTERRUPT_TXMCOLGPIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define Ethernet_MAC_MMC_TX_INTERRUPT_TXGPKTIS          (0x1UL << 21) 
#define Ethernet_MAC_MMC_TX_INTERRUPT_TXGPKTIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define Ethernet_MAC_MMC_TX_INTERRUPT_TXLPIUSCIS          (0x1UL << 26) 
#define Ethernet_MAC_MMC_TX_INTERRUPT_TXLPIUSCIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define Ethernet_MAC_MMC_TX_INTERRUPT_TXLPITRCIS          (0x1UL << 27) 
#define Ethernet_MAC_MMC_TX_INTERRUPT_TXLPITRCIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define Ethernet_MAC_MMC_RX_INTERRUPT_MASK_RXCRCERPIM          (0x1UL << 5) 
#define Ethernet_MAC_MMC_RX_INTERRUPT_MASK_RXCRCERPIM_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define Ethernet_MAC_MMC_RX_INTERRUPT_MASK_RXALGNERPIM          (0x1UL << 6) 
#define Ethernet_MAC_MMC_RX_INTERRUPT_MASK_RXALGNERPIM_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define Ethernet_MAC_MMC_RX_INTERRUPT_MASK_RXUCGPIM          (0x1UL << 17) 
#define Ethernet_MAC_MMC_RX_INTERRUPT_MASK_RXUCGPIM_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define Ethernet_MAC_MMC_RX_INTERRUPT_MASK_RXLPIUSCIM          (0x1UL << 26) 
#define Ethernet_MAC_MMC_RX_INTERRUPT_MASK_RXLPIUSCIM_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define Ethernet_MAC_MMC_RX_INTERRUPT_MASK_RXLPITRCIM          (0x1UL << 27) 
#define Ethernet_MAC_MMC_RX_INTERRUPT_MASK_RXLPITRCIM_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define Ethernet_MAC_MMC_TX_INTERRUPT_MASK_TXSCOLGPIM          (0x1UL << 14) 
#define Ethernet_MAC_MMC_TX_INTERRUPT_MASK_TXSCOLGPIM_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define Ethernet_MAC_MMC_TX_INTERRUPT_MASK_TXMCOLGPIM          (0x1UL << 15) 
#define Ethernet_MAC_MMC_TX_INTERRUPT_MASK_TXMCOLGPIM_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define Ethernet_MAC_MMC_TX_INTERRUPT_MASK_TXGPKTIM          (0x1UL << 21) 
#define Ethernet_MAC_MMC_TX_INTERRUPT_MASK_TXGPKTIM_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define Ethernet_MAC_MMC_TX_INTERRUPT_MASK_TXLPIUSCIM          (0x1UL << 26) 
#define Ethernet_MAC_MMC_TX_INTERRUPT_MASK_TXLPIUSCIM_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define Ethernet_MAC_MMC_TX_INTERRUPT_MASK_TXLPITRCIM          (0x1UL << 27) 
#define Ethernet_MAC_MMC_TX_INTERRUPT_MASK_TXLPITRCIM_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define Ethernet_MAC_TX_SINGLE_COLLISION_GOOD_PACKETS_TXSNGLCOLG          (0xFFFFFFFFUL << 0) 
#define Ethernet_MAC_TX_SINGLE_COLLISION_GOOD_PACKETS_TXSNGLCOLG_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define Ethernet_MAC_TX_MULTIPLE_COLLISION_GOOD_PACKETS_TXMULTCOLG          (0xFFFFFFFFUL << 0) 
#define Ethernet_MAC_TX_MULTIPLE_COLLISION_GOOD_PACKETS_TXMULTCOLG_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define Ethernet_MAC_TX_PACKET_COUNT_GOOD_TXPKTG          (0xFFFFFFFFUL << 0) 
#define Ethernet_MAC_TX_PACKET_COUNT_GOOD_TXPKTG_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define Ethernet_MAC_RX_CRC_ERROR_PACKETS_RXCRCERR          (0xFFFFFFFFUL << 0) 
#define Ethernet_MAC_RX_CRC_ERROR_PACKETS_RXCRCERR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define Ethernet_MAC_RX_ALIGNMENT_ERROR_PACKETS_RXALGNERR          (0xFFFFFFFFUL << 0) 
#define Ethernet_MAC_RX_ALIGNMENT_ERROR_PACKETS_RXALGNERR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define Ethernet_MAC_RX_UNICAST_PACKETS_GOOD_RXUCASTG          (0xFFFFFFFFUL << 0) 
#define Ethernet_MAC_RX_UNICAST_PACKETS_GOOD_RXUCASTG_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define Ethernet_MAC_TX_LPI_USEC_CNTR_TXLPIUSC          (0xFFFFFFFFUL << 0) 
#define Ethernet_MAC_TX_LPI_USEC_CNTR_TXLPIUSC_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define Ethernet_MAC_TX_LPI_TRAN_CNTR_TXLPITRC          (0xFFFFFFFFUL << 0) 
#define Ethernet_MAC_TX_LPI_TRAN_CNTR_TXLPITRC_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define Ethernet_MAC_RX_LPI_USEC_CNTR_RXLPIUSC          (0xFFFFFFFFUL << 0) 
#define Ethernet_MAC_RX_LPI_USEC_CNTR_RXLPIUSC_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define Ethernet_MAC_RX_LPI_TRAN_CNTR_RXLPITRC          (0xFFFFFFFFUL << 0) 
#define Ethernet_MAC_RX_LPI_TRAN_CNTR_RXLPITRC_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define Ethernet_MAC_MACL3L4C0R_L3PEN0          (0x1UL << 0) 
#define Ethernet_MAC_MACL3L4C0R_L3PEN0_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define Ethernet_MAC_MACL3L4C0R_L3SAM0          (0x1UL << 2) 
#define Ethernet_MAC_MACL3L4C0R_L3SAM0_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define Ethernet_MAC_MACL3L4C0R_L3SAIM0          (0x1UL << 3) 
#define Ethernet_MAC_MACL3L4C0R_L3SAIM0_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define Ethernet_MAC_MACL3L4C0R_L3DAM0          (0x1UL << 4) 
#define Ethernet_MAC_MACL3L4C0R_L3DAM0_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define Ethernet_MAC_MACL3L4C0R_L3DAIM0          (0x1UL << 5) 
#define Ethernet_MAC_MACL3L4C0R_L3DAIM0_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define Ethernet_MAC_MACL3L4C0R_L3HSBM0          (0x1FUL << 6) 
#define Ethernet_MAC_MACL3L4C0R_L3HSBM0_VAL(X) (((uint32_t)(X) & 0x1FUL) << 6)
#define Ethernet_MAC_MACL3L4C0R_L3HDBM0          (0x1FUL << 11) 
#define Ethernet_MAC_MACL3L4C0R_L3HDBM0_VAL(X) (((uint32_t)(X) & 0x1FUL) << 11)
#define Ethernet_MAC_MACL3L4C0R_L4PEN0          (0x1UL << 16) 
#define Ethernet_MAC_MACL3L4C0R_L4PEN0_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define Ethernet_MAC_MACL3L4C0R_L4SPM0          (0x1UL << 18) 
#define Ethernet_MAC_MACL3L4C0R_L4SPM0_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define Ethernet_MAC_MACL3L4C0R_L4SPIM0          (0x1UL << 19) 
#define Ethernet_MAC_MACL3L4C0R_L4SPIM0_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define Ethernet_MAC_MACL3L4C0R_L4DPM0          (0x1UL << 20) 
#define Ethernet_MAC_MACL3L4C0R_L4DPM0_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define Ethernet_MAC_MACL3L4C0R_L4DPIM0          (0x1UL << 21) 
#define Ethernet_MAC_MACL3L4C0R_L4DPIM0_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define Ethernet_MAC_MACL4A0R_L4SP0          (0xFFFFUL << 0) 
#define Ethernet_MAC_MACL4A0R_L4SP0_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define Ethernet_MAC_MACL4A0R_L4DP0          (0xFFFFUL << 16) 
#define Ethernet_MAC_MACL4A0R_L4DP0_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define Ethernet_MAC_MACL3A00R_L3A00          (0xFFFFFFFFUL << 0) 
#define Ethernet_MAC_MACL3A00R_L3A00_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define Ethernet_MAC_MACL3A10R_L3A10          (0xFFFFFFFFUL << 0) 
#define Ethernet_MAC_MACL3A10R_L3A10_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define Ethernet_MAC_MACL3A20_L3A20          (0xFFFFFFFFUL << 0) 
#define Ethernet_MAC_MACL3A20_L3A20_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define Ethernet_MAC_MACL3A30_L3A30          (0xFFFFFFFFUL << 0) 
#define Ethernet_MAC_MACL3A30_L3A30_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define Ethernet_MAC_MACL3L4C1R_L3PEN1          (0x1UL << 0) 
#define Ethernet_MAC_MACL3L4C1R_L3PEN1_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define Ethernet_MAC_MACL3L4C1R_L3SAM1          (0x1UL << 2) 
#define Ethernet_MAC_MACL3L4C1R_L3SAM1_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define Ethernet_MAC_MACL3L4C1R_L3SAIM1          (0x1UL << 3) 
#define Ethernet_MAC_MACL3L4C1R_L3SAIM1_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define Ethernet_MAC_MACL3L4C1R_L3DAM1          (0x1UL << 4) 
#define Ethernet_MAC_MACL3L4C1R_L3DAM1_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define Ethernet_MAC_MACL3L4C1R_L3DAIM1          (0x1UL << 5) 
#define Ethernet_MAC_MACL3L4C1R_L3DAIM1_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define Ethernet_MAC_MACL3L4C1R_L3HSBM1          (0x1FUL << 6) 
#define Ethernet_MAC_MACL3L4C1R_L3HSBM1_VAL(X) (((uint32_t)(X) & 0x1FUL) << 6)
#define Ethernet_MAC_MACL3L4C1R_L3HDBM1          (0x1FUL << 11) 
#define Ethernet_MAC_MACL3L4C1R_L3HDBM1_VAL(X) (((uint32_t)(X) & 0x1FUL) << 11)
#define Ethernet_MAC_MACL3L4C1R_L4PEN1          (0x1UL << 16) 
#define Ethernet_MAC_MACL3L4C1R_L4PEN1_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define Ethernet_MAC_MACL3L4C1R_L4SPM1          (0x1UL << 18) 
#define Ethernet_MAC_MACL3L4C1R_L4SPM1_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define Ethernet_MAC_MACL3L4C1R_L4SPIM1          (0x1UL << 19) 
#define Ethernet_MAC_MACL3L4C1R_L4SPIM1_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define Ethernet_MAC_MACL3L4C1R_L4DPM1          (0x1UL << 20) 
#define Ethernet_MAC_MACL3L4C1R_L4DPM1_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define Ethernet_MAC_MACL3L4C1R_L4DPIM1          (0x1UL << 21) 
#define Ethernet_MAC_MACL3L4C1R_L4DPIM1_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define Ethernet_MAC_MACL4A1R_L4SP1          (0xFFFFUL << 0) 
#define Ethernet_MAC_MACL4A1R_L4SP1_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define Ethernet_MAC_MACL4A1R_L4DP1          (0xFFFFUL << 16) 
#define Ethernet_MAC_MACL4A1R_L4DP1_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define Ethernet_MAC_MACL3A01R_L3A01          (0xFFFFFFFFUL << 0) 
#define Ethernet_MAC_MACL3A01R_L3A01_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define Ethernet_MAC_MACL3A11R_L3A11          (0xFFFFFFFFUL << 0) 
#define Ethernet_MAC_MACL3A11R_L3A11_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define Ethernet_MAC_MACL3A21R_L3A21          (0xFFFFFFFFUL << 0) 
#define Ethernet_MAC_MACL3A21R_L3A21_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define Ethernet_MAC_MACL3A31R_L3A31          (0xFFFFFFFFUL << 0) 
#define Ethernet_MAC_MACL3A31R_L3A31_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define Ethernet_MAC_MACTSCR_TSENA          (0x1UL << 0) 
#define Ethernet_MAC_MACTSCR_TSENA_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define Ethernet_MAC_MACTSCR_TSCFUPDT          (0x1UL << 1) 
#define Ethernet_MAC_MACTSCR_TSCFUPDT_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define Ethernet_MAC_MACTSCR_TSINIT          (0x1UL << 2) 
#define Ethernet_MAC_MACTSCR_TSINIT_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define Ethernet_MAC_MACTSCR_TSUPDT          (0x1UL << 3) 
#define Ethernet_MAC_MACTSCR_TSUPDT_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define Ethernet_MAC_MACTSCR_TSADDREG          (0x1UL << 5) 
#define Ethernet_MAC_MACTSCR_TSADDREG_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define Ethernet_MAC_MACTSCR_TSENALL          (0x1UL << 8) 
#define Ethernet_MAC_MACTSCR_TSENALL_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define Ethernet_MAC_MACTSCR_TSCTRLSSR          (0x1UL << 9) 
#define Ethernet_MAC_MACTSCR_TSCTRLSSR_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define Ethernet_MAC_MACTSCR_TSVER2ENA          (0x1UL << 10) 
#define Ethernet_MAC_MACTSCR_TSVER2ENA_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define Ethernet_MAC_MACTSCR_TSIPENA          (0x1UL << 11) 
#define Ethernet_MAC_MACTSCR_TSIPENA_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define Ethernet_MAC_MACTSCR_TSIPV6ENA          (0x1UL << 12) 
#define Ethernet_MAC_MACTSCR_TSIPV6ENA_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define Ethernet_MAC_MACTSCR_TSIPV4ENA          (0x1UL << 13) 
#define Ethernet_MAC_MACTSCR_TSIPV4ENA_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define Ethernet_MAC_MACTSCR_TSEVNTENA          (0x1UL << 14) 
#define Ethernet_MAC_MACTSCR_TSEVNTENA_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define Ethernet_MAC_MACTSCR_TSMSTRENA          (0x1UL << 15) 
#define Ethernet_MAC_MACTSCR_TSMSTRENA_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define Ethernet_MAC_MACTSCR_SNAPTYPSEL          (0x3UL << 16) 
#define Ethernet_MAC_MACTSCR_SNAPTYPSEL_VAL(X) (((uint32_t)(X) & 0x3UL) << 16)
#define Ethernet_MAC_MACTSCR_TSENMACADDR          (0x1UL << 18) 
#define Ethernet_MAC_MACTSCR_TSENMACADDR_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define Ethernet_MAC_MACTSCR_CSC          (0x1UL << 19) 
#define Ethernet_MAC_MACTSCR_CSC_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define Ethernet_MAC_MACTSCR_TXTSSTSM          (0x1UL << 24) 
#define Ethernet_MAC_MACTSCR_TXTSSTSM_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define Ethernet_MAC_MACSSIR_SNSINC          (0xFFUL << 8) 
#define Ethernet_MAC_MACSSIR_SNSINC_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define Ethernet_MAC_MACSSIR_SSINC          (0xFFUL << 16) 
#define Ethernet_MAC_MACSSIR_SSINC_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define Ethernet_MAC_MACSTSR_TSS          (0xFFFFFFFFUL << 0) 
#define Ethernet_MAC_MACSTSR_TSS_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define Ethernet_MAC_MACSTNR_TSSS          (0x7FFFFFFFUL << 0) 
#define Ethernet_MAC_MACSTNR_TSSS_VAL(X) (((uint32_t)(X) & 0x7FFFFFFFUL) << 0)
#define Ethernet_MAC_MACSTSUR_TSS          (0xFFFFFFFFUL << 0) 
#define Ethernet_MAC_MACSTSUR_TSS_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define Ethernet_MAC_MACSTNUR_TSSS          (0x7FFFFFFFUL << 0) 
#define Ethernet_MAC_MACSTNUR_TSSS_VAL(X) (((uint32_t)(X) & 0x7FFFFFFFUL) << 0)
#define Ethernet_MAC_MACSTNUR_ADDSUB          (0x1UL << 31) 
#define Ethernet_MAC_MACSTNUR_ADDSUB_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define Ethernet_MAC_MACTSAR_TSAR          (0xFFFFFFFFUL << 0) 
#define Ethernet_MAC_MACTSAR_TSAR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define Ethernet_MAC_MACTSSR_TSSOVF          (0x1UL << 0) 
#define Ethernet_MAC_MACTSSR_TSSOVF_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define Ethernet_MAC_MACTSSR_TSTARGT0          (0x1UL << 1) 
#define Ethernet_MAC_MACTSSR_TSTARGT0_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define Ethernet_MAC_MACTSSR_AUXTSTRIG          (0x1UL << 2) 
#define Ethernet_MAC_MACTSSR_AUXTSTRIG_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define Ethernet_MAC_MACTSSR_TSTRGTERR0          (0x1UL << 3) 
#define Ethernet_MAC_MACTSSR_TSTRGTERR0_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define Ethernet_MAC_MACTSSR_TXTSSIS          (0x1UL << 15) 
#define Ethernet_MAC_MACTSSR_TXTSSIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define Ethernet_MAC_MACTSSR_ATSSTN          (0xFUL << 16) 
#define Ethernet_MAC_MACTSSR_ATSSTN_VAL(X) (((uint32_t)(X) & 0xFUL) << 16)
#define Ethernet_MAC_MACTSSR_ATSSTM          (0x1UL << 24) 
#define Ethernet_MAC_MACTSSR_ATSSTM_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define Ethernet_MAC_MACTSSR_ATSNS          (0x1FUL << 25) 
#define Ethernet_MAC_MACTSSR_ATSNS_VAL(X) (((uint32_t)(X) & 0x1FUL) << 25)
#define Ethernet_MAC_MACTxTSSNR_TXTSSLO          (0x7FFFFFFFUL << 0) 
#define Ethernet_MAC_MACTxTSSNR_TXTSSLO_VAL(X) (((uint32_t)(X) & 0x7FFFFFFFUL) << 0)
#define Ethernet_MAC_MACTxTSSNR_TXTSSMIS          (0x1UL << 31) 
#define Ethernet_MAC_MACTxTSSNR_TXTSSMIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define Ethernet_MAC_MACTxTSSSR_TXTSSHI          (0xFFFFFFFFUL << 0) 
#define Ethernet_MAC_MACTxTSSSR_TXTSSHI_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define Ethernet_MAC_MACACR_ATSFC          (0x1UL << 0) 
#define Ethernet_MAC_MACACR_ATSFC_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define Ethernet_MAC_MACACR_ATSEN0          (0x1UL << 4) 
#define Ethernet_MAC_MACACR_ATSEN0_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define Ethernet_MAC_MACACR_ATSEN1          (0x1UL << 5) 
#define Ethernet_MAC_MACACR_ATSEN1_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define Ethernet_MAC_MACACR_ATSEN2          (0x1UL << 6) 
#define Ethernet_MAC_MACACR_ATSEN2_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define Ethernet_MAC_MACACR_ATSEN3          (0x1UL << 7) 
#define Ethernet_MAC_MACACR_ATSEN3_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define Ethernet_MAC_MACATSNR_AUXTSLO          (0x7FFFFFFFUL << 0) 
#define Ethernet_MAC_MACATSNR_AUXTSLO_VAL(X) (((uint32_t)(X) & 0x7FFFFFFFUL) << 0)
#define Ethernet_MAC_MACATSSR_AUXTSHI          (0xFFFFFFFFUL << 0) 
#define Ethernet_MAC_MACATSSR_AUXTSHI_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define Ethernet_MAC_MACTSIACR_OSTIAC          (0xFFFFFFFFUL << 0) 
#define Ethernet_MAC_MACTSIACR_OSTIAC_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define Ethernet_MAC_MACTSEACR_OSTEAC          (0xFFFFFFFFUL << 0) 
#define Ethernet_MAC_MACTSEACR_OSTEAC_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define Ethernet_MAC_MACTSICNR_TSIC          (0xFFFFFFFFUL << 0) 
#define Ethernet_MAC_MACTSICNR_TSIC_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define Ethernet_MAC_MACTSECNR_TSEC          (0xFFFFFFFFUL << 0) 
#define Ethernet_MAC_MACTSECNR_TSEC_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define Ethernet_MAC_MACPPSCR_PPSCTRL          (0xFUL << 0) 
#define Ethernet_MAC_MACPPSCR_PPSCTRL_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define Ethernet_MAC_MACPPSCR_PPSEN0          (0x1UL << 4) 
#define Ethernet_MAC_MACPPSCR_PPSEN0_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define Ethernet_MAC_MACPPSCR_TRGTMODSEL0          (0x3UL << 5) 
#define Ethernet_MAC_MACPPSCR_TRGTMODSEL0_VAL(X) (((uint32_t)(X) & 0x3UL) << 5)
#define Ethernet_MAC_MACPPSTTSR_TSTRH0          (0x7FFFFFFFUL << 0) 
#define Ethernet_MAC_MACPPSTTSR_TSTRH0_VAL(X) (((uint32_t)(X) & 0x7FFFFFFFUL) << 0)
#define Ethernet_MAC_MACPPSTTNR_TTSL0          (0x7FFFFFFFUL << 0) 
#define Ethernet_MAC_MACPPSTTNR_TTSL0_VAL(X) (((uint32_t)(X) & 0x7FFFFFFFUL) << 0)
#define Ethernet_MAC_MACPPSTTNR_TRGTBUSY0          (0x1UL << 31) 
#define Ethernet_MAC_MACPPSTTNR_TRGTBUSY0_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define Ethernet_MAC_MACPPSIR_PPSINT0          (0xFFFFFFFFUL << 0) 
#define Ethernet_MAC_MACPPSIR_PPSINT0_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define Ethernet_MAC_MACPPSWR_PPSWIDTH0          (0xFFFFFFFFUL << 0) 
#define Ethernet_MAC_MACPPSWR_PPSWIDTH0_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define Ethernet_MAC_MACPOCR_PTOEN          (0x1UL << 0) 
#define Ethernet_MAC_MACPOCR_PTOEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define Ethernet_MAC_MACPOCR_ASYNCEN          (0x1UL << 1) 
#define Ethernet_MAC_MACPOCR_ASYNCEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define Ethernet_MAC_MACPOCR_APDREQEN          (0x1UL << 2) 
#define Ethernet_MAC_MACPOCR_APDREQEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define Ethernet_MAC_MACPOCR_ASYNCTRIG          (0x1UL << 4) 
#define Ethernet_MAC_MACPOCR_ASYNCTRIG_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define Ethernet_MAC_MACPOCR_APDREQTRIG          (0x1UL << 5) 
