via/viaems/src/platforms/stm32h743/device.h
#define Ethernet_MAC_MACPOCR_APDREQTRIG_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define Ethernet_MAC_MACPOCR_DRRDIS          (0x1UL << 6) 
#define Ethernet_MAC_MACPOCR_DRRDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define Ethernet_MAC_MACPOCR_DN          (0xFFUL << 8) 
#define Ethernet_MAC_MACPOCR_DN_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define Ethernet_MAC_MACSPI0R_SPI0          (0xFFFFFFFFUL << 0) 
#define Ethernet_MAC_MACSPI0R_SPI0_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define Ethernet_MAC_MACSPI1R_SPI1          (0xFFFFFFFFUL << 0) 
#define Ethernet_MAC_MACSPI1R_SPI1_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define Ethernet_MAC_MACSPI2R_SPI2          (0xFFFFUL << 0) 
#define Ethernet_MAC_MACSPI2R_SPI2_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define Ethernet_MAC_MACLMIR_LSI          (0xFFUL << 0) 
#define Ethernet_MAC_MACLMIR_LSI_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define Ethernet_MAC_MACLMIR_DRSYNCR          (0x7UL << 8) 
#define Ethernet_MAC_MACLMIR_DRSYNCR_VAL(X) (((uint32_t)(X) & 0x7UL) << 8)
#define Ethernet_MAC_MACLMIR_LMPDRI          (0xFFUL << 24) 
#define Ethernet_MAC_MACLMIR_LMPDRI_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)

#define Ethernet_MAC  ((struct Ethernet_MAC*)(0x40028000UL))
struct DMA1 {
  volatile const uint32_t LISR;
  volatile const uint32_t HISR;
  volatile uint32_t LIFCR;
  volatile uint32_t HIFCR;
  volatile uint32_t S0CR;
  volatile uint32_t S0NDTR;
  volatile uint32_t S0PAR;
  volatile uint32_t S0M0AR;
  volatile uint32_t S0M1AR;
  volatile uint32_t S0FCR;
  volatile uint32_t S1CR;
  volatile uint32_t S1NDTR;
  volatile uint32_t S1PAR;
  volatile uint32_t S1M0AR;
  volatile uint32_t S1M1AR;
  volatile uint32_t S1FCR;
  volatile uint32_t S2CR;
  volatile uint32_t S2NDTR;
  volatile uint32_t S2PAR;
  volatile uint32_t S2M0AR;
  volatile uint32_t S2M1AR;
  volatile uint32_t S2FCR;
  volatile uint32_t S3CR;
  volatile uint32_t S3NDTR;
  volatile uint32_t S3PAR;
  volatile uint32_t S3M0AR;
  volatile uint32_t S3M1AR;
  volatile uint32_t S3FCR;
  volatile uint32_t S4CR;
  volatile uint32_t S4NDTR;
  volatile uint32_t S4PAR;
  volatile uint32_t S4M0AR;
  volatile uint32_t S4M1AR;
  volatile uint32_t S4FCR;
  volatile uint32_t S5CR;
  volatile uint32_t S5NDTR;
  volatile uint32_t S5PAR;
  volatile uint32_t S5M0AR;
  volatile uint32_t S5M1AR;
  volatile uint32_t S5FCR;
  volatile uint32_t S6CR;
  volatile uint32_t S6NDTR;
  volatile uint32_t S6PAR;
  volatile uint32_t S6M0AR;
  volatile uint32_t S6M1AR;
  volatile uint32_t S6FCR;
  volatile uint32_t S7CR;
  volatile uint32_t S7NDTR;
  volatile uint32_t S7PAR;
  volatile uint32_t S7M0AR;
  volatile uint32_t S7M1AR;
  volatile uint32_t S7FCR;
};
#define DMA1_LISR_TCIF3          (0x1UL << 27) 
#define DMA1_LISR_TCIF3_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define DMA1_LISR_HTIF3          (0x1UL << 26) 
#define DMA1_LISR_HTIF3_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define DMA1_LISR_TEIF3          (0x1UL << 25) 
#define DMA1_LISR_TEIF3_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define DMA1_LISR_DMEIF3          (0x1UL << 24) 
#define DMA1_LISR_DMEIF3_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define DMA1_LISR_FEIF3          (0x1UL << 22) 
#define DMA1_LISR_FEIF3_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define DMA1_LISR_TCIF2          (0x1UL << 21) 
#define DMA1_LISR_TCIF2_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define DMA1_LISR_HTIF2          (0x1UL << 20) 
#define DMA1_LISR_HTIF2_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define DMA1_LISR_TEIF2          (0x1UL << 19) 
#define DMA1_LISR_TEIF2_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define DMA1_LISR_DMEIF2          (0x1UL << 18) 
#define DMA1_LISR_DMEIF2_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define DMA1_LISR_FEIF2          (0x1UL << 16) 
#define DMA1_LISR_FEIF2_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define DMA1_LISR_TCIF1          (0x1UL << 11) 
#define DMA1_LISR_TCIF1_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define DMA1_LISR_HTIF1          (0x1UL << 10) 
#define DMA1_LISR_HTIF1_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define DMA1_LISR_TEIF1          (0x1UL << 9) 
#define DMA1_LISR_TEIF1_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define DMA1_LISR_DMEIF1          (0x1UL << 8) 
#define DMA1_LISR_DMEIF1_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DMA1_LISR_FEIF1          (0x1UL << 6) 
#define DMA1_LISR_FEIF1_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define DMA1_LISR_TCIF0          (0x1UL << 5) 
#define DMA1_LISR_TCIF0_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define DMA1_LISR_HTIF0          (0x1UL << 4) 
#define DMA1_LISR_HTIF0_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define DMA1_LISR_TEIF0          (0x1UL << 3) 
#define DMA1_LISR_TEIF0_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define DMA1_LISR_DMEIF0          (0x1UL << 2) 
#define DMA1_LISR_DMEIF0_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define DMA1_LISR_FEIF0          (0x1UL << 0) 
#define DMA1_LISR_FEIF0_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define DMA1_HISR_TCIF7          (0x1UL << 27) 
#define DMA1_HISR_TCIF7_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define DMA1_HISR_HTIF7          (0x1UL << 26) 
#define DMA1_HISR_HTIF7_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define DMA1_HISR_TEIF7          (0x1UL << 25) 
#define DMA1_HISR_TEIF7_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define DMA1_HISR_DMEIF7          (0x1UL << 24) 
#define DMA1_HISR_DMEIF7_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define DMA1_HISR_FEIF7          (0x1UL << 22) 
#define DMA1_HISR_FEIF7_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define DMA1_HISR_TCIF6          (0x1UL << 21) 
#define DMA1_HISR_TCIF6_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define DMA1_HISR_HTIF6          (0x1UL << 20) 
#define DMA1_HISR_HTIF6_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define DMA1_HISR_TEIF6          (0x1UL << 19) 
#define DMA1_HISR_TEIF6_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define DMA1_HISR_DMEIF6          (0x1UL << 18) 
#define DMA1_HISR_DMEIF6_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define DMA1_HISR_FEIF6          (0x1UL << 16) 
#define DMA1_HISR_FEIF6_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define DMA1_HISR_TCIF5          (0x1UL << 11) 
#define DMA1_HISR_TCIF5_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define DMA1_HISR_HTIF5          (0x1UL << 10) 
#define DMA1_HISR_HTIF5_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define DMA1_HISR_TEIF5          (0x1UL << 9) 
#define DMA1_HISR_TEIF5_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define DMA1_HISR_DMEIF5          (0x1UL << 8) 
#define DMA1_HISR_DMEIF5_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DMA1_HISR_FEIF5          (0x1UL << 6) 
#define DMA1_HISR_FEIF5_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define DMA1_HISR_TCIF4          (0x1UL << 5) 
#define DMA1_HISR_TCIF4_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define DMA1_HISR_HTIF4          (0x1UL << 4) 
#define DMA1_HISR_HTIF4_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define DMA1_HISR_TEIF4          (0x1UL << 3) 
#define DMA1_HISR_TEIF4_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define DMA1_HISR_DMEIF4          (0x1UL << 2) 
#define DMA1_HISR_DMEIF4_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define DMA1_HISR_FEIF4          (0x1UL << 0) 
#define DMA1_HISR_FEIF4_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define DMA1_LIFCR_CTCIF3          (0x1UL << 27) 
#define DMA1_LIFCR_CTCIF3_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define DMA1_LIFCR_CHTIF3          (0x1UL << 26) 
#define DMA1_LIFCR_CHTIF3_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define DMA1_LIFCR_CTEIF3          (0x1UL << 25) 
#define DMA1_LIFCR_CTEIF3_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define DMA1_LIFCR_CDMEIF3          (0x1UL << 24) 
#define DMA1_LIFCR_CDMEIF3_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define DMA1_LIFCR_CFEIF3          (0x1UL << 22) 
#define DMA1_LIFCR_CFEIF3_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define DMA1_LIFCR_CTCIF2          (0x1UL << 21) 
#define DMA1_LIFCR_CTCIF2_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define DMA1_LIFCR_CHTIF2          (0x1UL << 20) 
#define DMA1_LIFCR_CHTIF2_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define DMA1_LIFCR_CTEIF2          (0x1UL << 19) 
#define DMA1_LIFCR_CTEIF2_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define DMA1_LIFCR_CDMEIF2          (0x1UL << 18) 
#define DMA1_LIFCR_CDMEIF2_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define DMA1_LIFCR_CFEIF2          (0x1UL << 16) 
#define DMA1_LIFCR_CFEIF2_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define DMA1_LIFCR_CTCIF1          (0x1UL << 11) 
#define DMA1_LIFCR_CTCIF1_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define DMA1_LIFCR_CHTIF1          (0x1UL << 10) 
#define DMA1_LIFCR_CHTIF1_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define DMA1_LIFCR_CTEIF1          (0x1UL << 9) 
#define DMA1_LIFCR_CTEIF1_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define DMA1_LIFCR_CDMEIF1          (0x1UL << 8) 
#define DMA1_LIFCR_CDMEIF1_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DMA1_LIFCR_CFEIF1          (0x1UL << 6) 
#define DMA1_LIFCR_CFEIF1_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define DMA1_LIFCR_CTCIF0          (0x1UL << 5) 
#define DMA1_LIFCR_CTCIF0_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define DMA1_LIFCR_CHTIF0          (0x1UL << 4) 
#define DMA1_LIFCR_CHTIF0_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define DMA1_LIFCR_CTEIF0          (0x1UL << 3) 
#define DMA1_LIFCR_CTEIF0_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define DMA1_LIFCR_CDMEIF0          (0x1UL << 2) 
#define DMA1_LIFCR_CDMEIF0_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define DMA1_LIFCR_CFEIF0          (0x1UL << 0) 
#define DMA1_LIFCR_CFEIF0_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define DMA1_HIFCR_CTCIF7          (0x1UL << 27) 
#define DMA1_HIFCR_CTCIF7_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define DMA1_HIFCR_CHTIF7          (0x1UL << 26) 
#define DMA1_HIFCR_CHTIF7_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define DMA1_HIFCR_CTEIF7          (0x1UL << 25) 
#define DMA1_HIFCR_CTEIF7_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define DMA1_HIFCR_CDMEIF7          (0x1UL << 24) 
#define DMA1_HIFCR_CDMEIF7_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define DMA1_HIFCR_CFEIF7          (0x1UL << 22) 
#define DMA1_HIFCR_CFEIF7_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define DMA1_HIFCR_CTCIF6          (0x1UL << 21) 
#define DMA1_HIFCR_CTCIF6_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define DMA1_HIFCR_CHTIF6          (0x1UL << 20) 
#define DMA1_HIFCR_CHTIF6_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define DMA1_HIFCR_CTEIF6          (0x1UL << 19) 
#define DMA1_HIFCR_CTEIF6_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define DMA1_HIFCR_CDMEIF6          (0x1UL << 18) 
#define DMA1_HIFCR_CDMEIF6_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define DMA1_HIFCR_CFEIF6          (0x1UL << 16) 
#define DMA1_HIFCR_CFEIF6_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define DMA1_HIFCR_CTCIF5          (0x1UL << 11) 
#define DMA1_HIFCR_CTCIF5_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define DMA1_HIFCR_CHTIF5          (0x1UL << 10) 
#define DMA1_HIFCR_CHTIF5_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define DMA1_HIFCR_CTEIF5          (0x1UL << 9) 
#define DMA1_HIFCR_CTEIF5_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define DMA1_HIFCR_CDMEIF5          (0x1UL << 8) 
#define DMA1_HIFCR_CDMEIF5_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DMA1_HIFCR_CFEIF5          (0x1UL << 6) 
#define DMA1_HIFCR_CFEIF5_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define DMA1_HIFCR_CTCIF4          (0x1UL << 5) 
#define DMA1_HIFCR_CTCIF4_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define DMA1_HIFCR_CHTIF4          (0x1UL << 4) 
#define DMA1_HIFCR_CHTIF4_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define DMA1_HIFCR_CTEIF4          (0x1UL << 3) 
#define DMA1_HIFCR_CTEIF4_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define DMA1_HIFCR_CDMEIF4          (0x1UL << 2) 
#define DMA1_HIFCR_CDMEIF4_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define DMA1_HIFCR_CFEIF4          (0x1UL << 0) 
#define DMA1_HIFCR_CFEIF4_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define DMA1_S0CR_MBURST          (0x3UL << 23) 
#define DMA1_S0CR_MBURST_VAL(X) (((uint32_t)(X) & 0x3UL) << 23)
#define DMA1_S0CR_PBURST          (0x3UL << 21) 
#define DMA1_S0CR_PBURST_VAL(X) (((uint32_t)(X) & 0x3UL) << 21)
#define DMA1_S0CR_CT          (0x1UL << 19) 
#define DMA1_S0CR_CT_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define DMA1_S0CR_DBM          (0x1UL << 18) 
#define DMA1_S0CR_DBM_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define DMA1_S0CR_PL          (0x3UL << 16) 
#define DMA1_S0CR_PL_VAL(X) (((uint32_t)(X) & 0x3UL) << 16)
#define DMA1_S0CR_PINCOS          (0x1UL << 15) 
#define DMA1_S0CR_PINCOS_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define DMA1_S0CR_MSIZE          (0x3UL << 13) 
#define DMA1_S0CR_MSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 13)
#define DMA1_S0CR_PSIZE          (0x3UL << 11) 
#define DMA1_S0CR_PSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 11)
#define DMA1_S0CR_MINC          (0x1UL << 10) 
#define DMA1_S0CR_MINC_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define DMA1_S0CR_PINC          (0x1UL << 9) 
#define DMA1_S0CR_PINC_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define DMA1_S0CR_CIRC          (0x1UL << 8) 
#define DMA1_S0CR_CIRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DMA1_S0CR_DIR          (0x3UL << 6) 
#define DMA1_S0CR_DIR_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define DMA1_S0CR_PFCTRL          (0x1UL << 5) 
#define DMA1_S0CR_PFCTRL_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define DMA1_S0CR_TCIE          (0x1UL << 4) 
#define DMA1_S0CR_TCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define DMA1_S0CR_HTIE          (0x1UL << 3) 
#define DMA1_S0CR_HTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define DMA1_S0CR_TEIE          (0x1UL << 2) 
#define DMA1_S0CR_TEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define DMA1_S0CR_DMEIE          (0x1UL << 1) 
#define DMA1_S0CR_DMEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define DMA1_S0CR_EN          (0x1UL << 0) 
#define DMA1_S0CR_EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define DMA1_S0NDTR_NDT          (0xFFFFUL << 0) 
#define DMA1_S0NDTR_NDT_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define DMA1_S0PAR_PA          (0xFFFFFFFFUL << 0) 
#define DMA1_S0PAR_PA_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define DMA1_S0M0AR_M0A          (0xFFFFFFFFUL << 0) 
#define DMA1_S0M0AR_M0A_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define DMA1_S0M1AR_M1A          (0xFFFFFFFFUL << 0) 
#define DMA1_S0M1AR_M1A_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define DMA1_S0FCR_FEIE          (0x1UL << 7) 
#define DMA1_S0FCR_FEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define DMA1_S0FCR_FS          (0x7UL << 3) 
#define DMA1_S0FCR_FS_VAL(X) (((uint32_t)(X) & 0x7UL) << 3)
#define DMA1_S0FCR_DMDIS          (0x1UL << 2) 
#define DMA1_S0FCR_DMDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define DMA1_S0FCR_FTH          (0x3UL << 0) 
#define DMA1_S0FCR_FTH_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define DMA1_S1CR_MBURST          (0x3UL << 23) 
#define DMA1_S1CR_MBURST_VAL(X) (((uint32_t)(X) & 0x3UL) << 23)
#define DMA1_S1CR_PBURST          (0x3UL << 21) 
#define DMA1_S1CR_PBURST_VAL(X) (((uint32_t)(X) & 0x3UL) << 21)
#define DMA1_S1CR_ACK          (0x1UL << 20) 
#define DMA1_S1CR_ACK_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define DMA1_S1CR_CT          (0x1UL << 19) 
#define DMA1_S1CR_CT_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define DMA1_S1CR_DBM          (0x1UL << 18) 
#define DMA1_S1CR_DBM_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define DMA1_S1CR_PL          (0x3UL << 16) 
#define DMA1_S1CR_PL_VAL(X) (((uint32_t)(X) & 0x3UL) << 16)
#define DMA1_S1CR_PINCOS          (0x1UL << 15) 
#define DMA1_S1CR_PINCOS_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define DMA1_S1CR_MSIZE          (0x3UL << 13) 
#define DMA1_S1CR_MSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 13)
#define DMA1_S1CR_PSIZE          (0x3UL << 11) 
#define DMA1_S1CR_PSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 11)
#define DMA1_S1CR_MINC          (0x1UL << 10) 
#define DMA1_S1CR_MINC_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define DMA1_S1CR_PINC          (0x1UL << 9) 
#define DMA1_S1CR_PINC_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define DMA1_S1CR_CIRC          (0x1UL << 8) 
#define DMA1_S1CR_CIRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DMA1_S1CR_DIR          (0x3UL << 6) 
#define DMA1_S1CR_DIR_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define DMA1_S1CR_PFCTRL          (0x1UL << 5) 
#define DMA1_S1CR_PFCTRL_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define DMA1_S1CR_TCIE          (0x1UL << 4) 
#define DMA1_S1CR_TCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define DMA1_S1CR_HTIE          (0x1UL << 3) 
#define DMA1_S1CR_HTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define DMA1_S1CR_TEIE          (0x1UL << 2) 
#define DMA1_S1CR_TEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define DMA1_S1CR_DMEIE          (0x1UL << 1) 
#define DMA1_S1CR_DMEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define DMA1_S1CR_EN          (0x1UL << 0) 
#define DMA1_S1CR_EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define DMA1_S1NDTR_NDT          (0xFFFFUL << 0) 
#define DMA1_S1NDTR_NDT_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define DMA1_S1PAR_PA          (0xFFFFFFFFUL << 0) 
#define DMA1_S1PAR_PA_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define DMA1_S1M0AR_M0A          (0xFFFFFFFFUL << 0) 
#define DMA1_S1M0AR_M0A_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define DMA1_S1M1AR_M1A          (0xFFFFFFFFUL << 0) 
#define DMA1_S1M1AR_M1A_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define DMA1_S1FCR_FEIE          (0x1UL << 7) 
#define DMA1_S1FCR_FEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define DMA1_S1FCR_FS          (0x7UL << 3) 
#define DMA1_S1FCR_FS_VAL(X) (((uint32_t)(X) & 0x7UL) << 3)
#define DMA1_S1FCR_DMDIS          (0x1UL << 2) 
#define DMA1_S1FCR_DMDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define DMA1_S1FCR_FTH          (0x3UL << 0) 
#define DMA1_S1FCR_FTH_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define DMA1_S2CR_MBURST          (0x3UL << 23) 
#define DMA1_S2CR_MBURST_VAL(X) (((uint32_t)(X) & 0x3UL) << 23)
#define DMA1_S2CR_PBURST          (0x3UL << 21) 
#define DMA1_S2CR_PBURST_VAL(X) (((uint32_t)(X) & 0x3UL) << 21)
#define DMA1_S2CR_ACK          (0x1UL << 20) 
#define DMA1_S2CR_ACK_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define DMA1_S2CR_CT          (0x1UL << 19) 
#define DMA1_S2CR_CT_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define DMA1_S2CR_DBM          (0x1UL << 18) 
#define DMA1_S2CR_DBM_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define DMA1_S2CR_PL          (0x3UL << 16) 
#define DMA1_S2CR_PL_VAL(X) (((uint32_t)(X) & 0x3UL) << 16)
#define DMA1_S2CR_PINCOS          (0x1UL << 15) 
#define DMA1_S2CR_PINCOS_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define DMA1_S2CR_MSIZE          (0x3UL << 13) 
#define DMA1_S2CR_MSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 13)
#define DMA1_S2CR_PSIZE          (0x3UL << 11) 
#define DMA1_S2CR_PSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 11)
#define DMA1_S2CR_MINC          (0x1UL << 10) 
#define DMA1_S2CR_MINC_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define DMA1_S2CR_PINC          (0x1UL << 9) 
#define DMA1_S2CR_PINC_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define DMA1_S2CR_CIRC          (0x1UL << 8) 
#define DMA1_S2CR_CIRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DMA1_S2CR_DIR          (0x3UL << 6) 
#define DMA1_S2CR_DIR_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define DMA1_S2CR_PFCTRL          (0x1UL << 5) 
#define DMA1_S2CR_PFCTRL_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define DMA1_S2CR_TCIE          (0x1UL << 4) 
#define DMA1_S2CR_TCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define DMA1_S2CR_HTIE          (0x1UL << 3) 
#define DMA1_S2CR_HTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define DMA1_S2CR_TEIE          (0x1UL << 2) 
#define DMA1_S2CR_TEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define DMA1_S2CR_DMEIE          (0x1UL << 1) 
#define DMA1_S2CR_DMEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define DMA1_S2CR_EN          (0x1UL << 0) 
#define DMA1_S2CR_EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define DMA1_S2NDTR_NDT          (0xFFFFUL << 0) 
#define DMA1_S2NDTR_NDT_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define DMA1_S2PAR_PA          (0xFFFFFFFFUL << 0) 
#define DMA1_S2PAR_PA_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define DMA1_S2M0AR_M0A          (0xFFFFFFFFUL << 0) 
#define DMA1_S2M0AR_M0A_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define DMA1_S2M1AR_M1A          (0xFFFFFFFFUL << 0) 
#define DMA1_S2M1AR_M1A_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define DMA1_S2FCR_FEIE          (0x1UL << 7) 
#define DMA1_S2FCR_FEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define DMA1_S2FCR_FS          (0x7UL << 3) 
#define DMA1_S2FCR_FS_VAL(X) (((uint32_t)(X) & 0x7UL) << 3)
#define DMA1_S2FCR_DMDIS          (0x1UL << 2) 
#define DMA1_S2FCR_DMDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define DMA1_S2FCR_FTH          (0x3UL << 0) 
#define DMA1_S2FCR_FTH_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define DMA1_S3CR_MBURST          (0x3UL << 23) 
#define DMA1_S3CR_MBURST_VAL(X) (((uint32_t)(X) & 0x3UL) << 23)
#define DMA1_S3CR_PBURST          (0x3UL << 21) 
#define DMA1_S3CR_PBURST_VAL(X) (((uint32_t)(X) & 0x3UL) << 21)
#define DMA1_S3CR_ACK          (0x1UL << 20) 
#define DMA1_S3CR_ACK_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define DMA1_S3CR_CT          (0x1UL << 19) 
#define DMA1_S3CR_CT_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define DMA1_S3CR_DBM          (0x1UL << 18) 
#define DMA1_S3CR_DBM_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define DMA1_S3CR_PL          (0x3UL << 16) 
#define DMA1_S3CR_PL_VAL(X) (((uint32_t)(X) & 0x3UL) << 16)
#define DMA1_S3CR_PINCOS          (0x1UL << 15) 
#define DMA1_S3CR_PINCOS_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define DMA1_S3CR_MSIZE          (0x3UL << 13) 
#define DMA1_S3CR_MSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 13)
#define DMA1_S3CR_PSIZE          (0x3UL << 11) 
#define DMA1_S3CR_PSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 11)
#define DMA1_S3CR_MINC          (0x1UL << 10) 
#define DMA1_S3CR_MINC_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define DMA1_S3CR_PINC          (0x1UL << 9) 
#define DMA1_S3CR_PINC_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define DMA1_S3CR_CIRC          (0x1UL << 8) 
#define DMA1_S3CR_CIRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DMA1_S3CR_DIR          (0x3UL << 6) 
#define DMA1_S3CR_DIR_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define DMA1_S3CR_PFCTRL          (0x1UL << 5) 
#define DMA1_S3CR_PFCTRL_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define DMA1_S3CR_TCIE          (0x1UL << 4) 
#define DMA1_S3CR_TCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define DMA1_S3CR_HTIE          (0x1UL << 3) 
#define DMA1_S3CR_HTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define DMA1_S3CR_TEIE          (0x1UL << 2) 
#define DMA1_S3CR_TEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define DMA1_S3CR_DMEIE          (0x1UL << 1) 
#define DMA1_S3CR_DMEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define DMA1_S3CR_EN          (0x1UL << 0) 
#define DMA1_S3CR_EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define DMA1_S3NDTR_NDT          (0xFFFFUL << 0) 
#define DMA1_S3NDTR_NDT_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define DMA1_S3PAR_PA          (0xFFFFFFFFUL << 0) 
#define DMA1_S3PAR_PA_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define DMA1_S3M0AR_M0A          (0xFFFFFFFFUL << 0) 
#define DMA1_S3M0AR_M0A_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define DMA1_S3M1AR_M1A          (0xFFFFFFFFUL << 0) 
#define DMA1_S3M1AR_M1A_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define DMA1_S3FCR_FEIE          (0x1UL << 7) 
#define DMA1_S3FCR_FEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define DMA1_S3FCR_FS          (0x7UL << 3) 
#define DMA1_S3FCR_FS_VAL(X) (((uint32_t)(X) & 0x7UL) << 3)
#define DMA1_S3FCR_DMDIS          (0x1UL << 2) 
#define DMA1_S3FCR_DMDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define DMA1_S3FCR_FTH          (0x3UL << 0) 
#define DMA1_S3FCR_FTH_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define DMA1_S4CR_MBURST          (0x3UL << 23) 
#define DMA1_S4CR_MBURST_VAL(X) (((uint32_t)(X) & 0x3UL) << 23)
#define DMA1_S4CR_PBURST          (0x3UL << 21) 
#define DMA1_S4CR_PBURST_VAL(X) (((uint32_t)(X) & 0x3UL) << 21)
#define DMA1_S4CR_ACK          (0x1UL << 20) 
#define DMA1_S4CR_ACK_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define DMA1_S4CR_CT          (0x1UL << 19) 
#define DMA1_S4CR_CT_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define DMA1_S4CR_DBM          (0x1UL << 18) 
#define DMA1_S4CR_DBM_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
