via/viaems/src/platforms/stm32h743/device.h
#define DMA1_S4CR_PL          (0x3UL << 16) 
#define DMA1_S4CR_PL_VAL(X) (((uint32_t)(X) & 0x3UL) << 16)
#define DMA1_S4CR_PINCOS          (0x1UL << 15) 
#define DMA1_S4CR_PINCOS_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define DMA1_S4CR_MSIZE          (0x3UL << 13) 
#define DMA1_S4CR_MSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 13)
#define DMA1_S4CR_PSIZE          (0x3UL << 11) 
#define DMA1_S4CR_PSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 11)
#define DMA1_S4CR_MINC          (0x1UL << 10) 
#define DMA1_S4CR_MINC_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define DMA1_S4CR_PINC          (0x1UL << 9) 
#define DMA1_S4CR_PINC_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define DMA1_S4CR_CIRC          (0x1UL << 8) 
#define DMA1_S4CR_CIRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DMA1_S4CR_DIR          (0x3UL << 6) 
#define DMA1_S4CR_DIR_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define DMA1_S4CR_PFCTRL          (0x1UL << 5) 
#define DMA1_S4CR_PFCTRL_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define DMA1_S4CR_TCIE          (0x1UL << 4) 
#define DMA1_S4CR_TCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define DMA1_S4CR_HTIE          (0x1UL << 3) 
#define DMA1_S4CR_HTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define DMA1_S4CR_TEIE          (0x1UL << 2) 
#define DMA1_S4CR_TEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define DMA1_S4CR_DMEIE          (0x1UL << 1) 
#define DMA1_S4CR_DMEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define DMA1_S4CR_EN          (0x1UL << 0) 
#define DMA1_S4CR_EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define DMA1_S4NDTR_NDT          (0xFFFFUL << 0) 
#define DMA1_S4NDTR_NDT_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define DMA1_S4PAR_PA          (0xFFFFFFFFUL << 0) 
#define DMA1_S4PAR_PA_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define DMA1_S4M0AR_M0A          (0xFFFFFFFFUL << 0) 
#define DMA1_S4M0AR_M0A_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define DMA1_S4M1AR_M1A          (0xFFFFFFFFUL << 0) 
#define DMA1_S4M1AR_M1A_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define DMA1_S4FCR_FEIE          (0x1UL << 7) 
#define DMA1_S4FCR_FEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define DMA1_S4FCR_FS          (0x7UL << 3) 
#define DMA1_S4FCR_FS_VAL(X) (((uint32_t)(X) & 0x7UL) << 3)
#define DMA1_S4FCR_DMDIS          (0x1UL << 2) 
#define DMA1_S4FCR_DMDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define DMA1_S4FCR_FTH          (0x3UL << 0) 
#define DMA1_S4FCR_FTH_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define DMA1_S5CR_MBURST          (0x3UL << 23) 
#define DMA1_S5CR_MBURST_VAL(X) (((uint32_t)(X) & 0x3UL) << 23)
#define DMA1_S5CR_PBURST          (0x3UL << 21) 
#define DMA1_S5CR_PBURST_VAL(X) (((uint32_t)(X) & 0x3UL) << 21)
#define DMA1_S5CR_ACK          (0x1UL << 20) 
#define DMA1_S5CR_ACK_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define DMA1_S5CR_CT          (0x1UL << 19) 
#define DMA1_S5CR_CT_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define DMA1_S5CR_DBM          (0x1UL << 18) 
#define DMA1_S5CR_DBM_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define DMA1_S5CR_PL          (0x3UL << 16) 
#define DMA1_S5CR_PL_VAL(X) (((uint32_t)(X) & 0x3UL) << 16)
#define DMA1_S5CR_PINCOS          (0x1UL << 15) 
#define DMA1_S5CR_PINCOS_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define DMA1_S5CR_MSIZE          (0x3UL << 13) 
#define DMA1_S5CR_MSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 13)
#define DMA1_S5CR_PSIZE          (0x3UL << 11) 
#define DMA1_S5CR_PSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 11)
#define DMA1_S5CR_MINC          (0x1UL << 10) 
#define DMA1_S5CR_MINC_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define DMA1_S5CR_PINC          (0x1UL << 9) 
#define DMA1_S5CR_PINC_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define DMA1_S5CR_CIRC          (0x1UL << 8) 
#define DMA1_S5CR_CIRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DMA1_S5CR_DIR          (0x3UL << 6) 
#define DMA1_S5CR_DIR_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define DMA1_S5CR_PFCTRL          (0x1UL << 5) 
#define DMA1_S5CR_PFCTRL_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define DMA1_S5CR_TCIE          (0x1UL << 4) 
#define DMA1_S5CR_TCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define DMA1_S5CR_HTIE          (0x1UL << 3) 
#define DMA1_S5CR_HTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define DMA1_S5CR_TEIE          (0x1UL << 2) 
#define DMA1_S5CR_TEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define DMA1_S5CR_DMEIE          (0x1UL << 1) 
#define DMA1_S5CR_DMEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define DMA1_S5CR_EN          (0x1UL << 0) 
#define DMA1_S5CR_EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define DMA1_S5NDTR_NDT          (0xFFFFUL << 0) 
#define DMA1_S5NDTR_NDT_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define DMA1_S5PAR_PA          (0xFFFFFFFFUL << 0) 
#define DMA1_S5PAR_PA_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define DMA1_S5M0AR_M0A          (0xFFFFFFFFUL << 0) 
#define DMA1_S5M0AR_M0A_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define DMA1_S5M1AR_M1A          (0xFFFFFFFFUL << 0) 
#define DMA1_S5M1AR_M1A_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define DMA1_S5FCR_FEIE          (0x1UL << 7) 
#define DMA1_S5FCR_FEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define DMA1_S5FCR_FS          (0x7UL << 3) 
#define DMA1_S5FCR_FS_VAL(X) (((uint32_t)(X) & 0x7UL) << 3)
#define DMA1_S5FCR_DMDIS          (0x1UL << 2) 
#define DMA1_S5FCR_DMDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define DMA1_S5FCR_FTH          (0x3UL << 0) 
#define DMA1_S5FCR_FTH_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define DMA1_S6CR_MBURST          (0x3UL << 23) 
#define DMA1_S6CR_MBURST_VAL(X) (((uint32_t)(X) & 0x3UL) << 23)
#define DMA1_S6CR_PBURST          (0x3UL << 21) 
#define DMA1_S6CR_PBURST_VAL(X) (((uint32_t)(X) & 0x3UL) << 21)
#define DMA1_S6CR_ACK          (0x1UL << 20) 
#define DMA1_S6CR_ACK_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define DMA1_S6CR_CT          (0x1UL << 19) 
#define DMA1_S6CR_CT_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define DMA1_S6CR_DBM          (0x1UL << 18) 
#define DMA1_S6CR_DBM_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define DMA1_S6CR_PL          (0x3UL << 16) 
#define DMA1_S6CR_PL_VAL(X) (((uint32_t)(X) & 0x3UL) << 16)
#define DMA1_S6CR_PINCOS          (0x1UL << 15) 
#define DMA1_S6CR_PINCOS_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define DMA1_S6CR_MSIZE          (0x3UL << 13) 
#define DMA1_S6CR_MSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 13)
#define DMA1_S6CR_PSIZE          (0x3UL << 11) 
#define DMA1_S6CR_PSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 11)
#define DMA1_S6CR_MINC          (0x1UL << 10) 
#define DMA1_S6CR_MINC_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define DMA1_S6CR_PINC          (0x1UL << 9) 
#define DMA1_S6CR_PINC_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define DMA1_S6CR_CIRC          (0x1UL << 8) 
#define DMA1_S6CR_CIRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DMA1_S6CR_DIR          (0x3UL << 6) 
#define DMA1_S6CR_DIR_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define DMA1_S6CR_PFCTRL          (0x1UL << 5) 
#define DMA1_S6CR_PFCTRL_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define DMA1_S6CR_TCIE          (0x1UL << 4) 
#define DMA1_S6CR_TCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define DMA1_S6CR_HTIE          (0x1UL << 3) 
#define DMA1_S6CR_HTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define DMA1_S6CR_TEIE          (0x1UL << 2) 
#define DMA1_S6CR_TEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define DMA1_S6CR_DMEIE          (0x1UL << 1) 
#define DMA1_S6CR_DMEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define DMA1_S6CR_EN          (0x1UL << 0) 
#define DMA1_S6CR_EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define DMA1_S6NDTR_NDT          (0xFFFFUL << 0) 
#define DMA1_S6NDTR_NDT_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define DMA1_S6PAR_PA          (0xFFFFFFFFUL << 0) 
#define DMA1_S6PAR_PA_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define DMA1_S6M0AR_M0A          (0xFFFFFFFFUL << 0) 
#define DMA1_S6M0AR_M0A_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define DMA1_S6M1AR_M1A          (0xFFFFFFFFUL << 0) 
#define DMA1_S6M1AR_M1A_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define DMA1_S6FCR_FEIE          (0x1UL << 7) 
#define DMA1_S6FCR_FEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define DMA1_S6FCR_FS          (0x7UL << 3) 
#define DMA1_S6FCR_FS_VAL(X) (((uint32_t)(X) & 0x7UL) << 3)
#define DMA1_S6FCR_DMDIS          (0x1UL << 2) 
#define DMA1_S6FCR_DMDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define DMA1_S6FCR_FTH          (0x3UL << 0) 
#define DMA1_S6FCR_FTH_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define DMA1_S7CR_MBURST          (0x3UL << 23) 
#define DMA1_S7CR_MBURST_VAL(X) (((uint32_t)(X) & 0x3UL) << 23)
#define DMA1_S7CR_PBURST          (0x3UL << 21) 
#define DMA1_S7CR_PBURST_VAL(X) (((uint32_t)(X) & 0x3UL) << 21)
#define DMA1_S7CR_ACK          (0x1UL << 20) 
#define DMA1_S7CR_ACK_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define DMA1_S7CR_CT          (0x1UL << 19) 
#define DMA1_S7CR_CT_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define DMA1_S7CR_DBM          (0x1UL << 18) 
#define DMA1_S7CR_DBM_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define DMA1_S7CR_PL          (0x3UL << 16) 
#define DMA1_S7CR_PL_VAL(X) (((uint32_t)(X) & 0x3UL) << 16)
#define DMA1_S7CR_PINCOS          (0x1UL << 15) 
#define DMA1_S7CR_PINCOS_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define DMA1_S7CR_MSIZE          (0x3UL << 13) 
#define DMA1_S7CR_MSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 13)
#define DMA1_S7CR_PSIZE          (0x3UL << 11) 
#define DMA1_S7CR_PSIZE_VAL(X) (((uint32_t)(X) & 0x3UL) << 11)
#define DMA1_S7CR_MINC          (0x1UL << 10) 
#define DMA1_S7CR_MINC_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define DMA1_S7CR_PINC          (0x1UL << 9) 
#define DMA1_S7CR_PINC_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define DMA1_S7CR_CIRC          (0x1UL << 8) 
#define DMA1_S7CR_CIRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DMA1_S7CR_DIR          (0x3UL << 6) 
#define DMA1_S7CR_DIR_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define DMA1_S7CR_PFCTRL          (0x1UL << 5) 
#define DMA1_S7CR_PFCTRL_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define DMA1_S7CR_TCIE          (0x1UL << 4) 
#define DMA1_S7CR_TCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define DMA1_S7CR_HTIE          (0x1UL << 3) 
#define DMA1_S7CR_HTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define DMA1_S7CR_TEIE          (0x1UL << 2) 
#define DMA1_S7CR_TEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define DMA1_S7CR_DMEIE          (0x1UL << 1) 
#define DMA1_S7CR_DMEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define DMA1_S7CR_EN          (0x1UL << 0) 
#define DMA1_S7CR_EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define DMA1_S7NDTR_NDT          (0xFFFFUL << 0) 
#define DMA1_S7NDTR_NDT_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define DMA1_S7PAR_PA          (0xFFFFFFFFUL << 0) 
#define DMA1_S7PAR_PA_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define DMA1_S7M0AR_M0A          (0xFFFFFFFFUL << 0) 
#define DMA1_S7M0AR_M0A_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define DMA1_S7M1AR_M1A          (0xFFFFFFFFUL << 0) 
#define DMA1_S7M1AR_M1A_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define DMA1_S7FCR_FEIE          (0x1UL << 7) 
#define DMA1_S7FCR_FEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define DMA1_S7FCR_FS          (0x7UL << 3) 
#define DMA1_S7FCR_FS_VAL(X) (((uint32_t)(X) & 0x7UL) << 3)
#define DMA1_S7FCR_DMDIS          (0x1UL << 2) 
#define DMA1_S7FCR_DMDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define DMA1_S7FCR_FTH          (0x3UL << 0) 
#define DMA1_S7FCR_FTH_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)

#define DMA1  ((struct DMA1*)(0x40020000UL))
struct DMA2 {
  volatile const uint32_t LISR;
  volatile const uint32_t HISR;
  volatile uint32_t LIFCR;
  volatile uint32_t HIFCR;
  volatile uint32_t S0CR;
  volatile uint32_t S0NDTR;
  volatile uint32_t S0PAR;
  volatile uint32_t S0M0AR;
  volatile uint32_t S0M1AR;
  volatile uint32_t S0FCR;
  volatile uint32_t S1CR;
  volatile uint32_t S1NDTR;
  volatile uint32_t S1PAR;
  volatile uint32_t S1M0AR;
  volatile uint32_t S1M1AR;
  volatile uint32_t S1FCR;
  volatile uint32_t S2CR;
  volatile uint32_t S2NDTR;
  volatile uint32_t S2PAR;
  volatile uint32_t S2M0AR;
  volatile uint32_t S2M1AR;
  volatile uint32_t S2FCR;
  volatile uint32_t S3CR;
  volatile uint32_t S3NDTR;
  volatile uint32_t S3PAR;
  volatile uint32_t S3M0AR;
  volatile uint32_t S3M1AR;
  volatile uint32_t S3FCR;
  volatile uint32_t S4CR;
  volatile uint32_t S4NDTR;
  volatile uint32_t S4PAR;
  volatile uint32_t S4M0AR;
  volatile uint32_t S4M1AR;
  volatile uint32_t S4FCR;
  volatile uint32_t S5CR;
  volatile uint32_t S5NDTR;
  volatile uint32_t S5PAR;
  volatile uint32_t S5M0AR;
  volatile uint32_t S5M1AR;
  volatile uint32_t S5FCR;
  volatile uint32_t S6CR;
  volatile uint32_t S6NDTR;
  volatile uint32_t S6PAR;
  volatile uint32_t S6M0AR;
  volatile uint32_t S6M1AR;
  volatile uint32_t S6FCR;
  volatile uint32_t S7CR;
  volatile uint32_t S7NDTR;
  volatile uint32_t S7PAR;
  volatile uint32_t S7M0AR;
  volatile uint32_t S7M1AR;
  volatile uint32_t S7FCR;
};
