via/viaems/src/platforms/stm32h743/device.h
#define HRTIM_Master_MCR_BRSTDMA          (0x3UL << 30) 
#define HRTIM_Master_MCR_BRSTDMA_VAL(X) (((uint32_t)(X) & 0x3UL) << 30)
#define HRTIM_Master_MCR_MREPU          (0x1UL << 29) 
#define HRTIM_Master_MCR_MREPU_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define HRTIM_Master_MCR_PREEN          (0x1UL << 27) 
#define HRTIM_Master_MCR_PREEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define HRTIM_Master_MCR_DACSYNC          (0x3UL << 25) 
#define HRTIM_Master_MCR_DACSYNC_VAL(X) (((uint32_t)(X) & 0x3UL) << 25)
#define HRTIM_Master_MCR_TECEN          (0x1UL << 21) 
#define HRTIM_Master_MCR_TECEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define HRTIM_Master_MCR_TDCEN          (0x1UL << 20) 
#define HRTIM_Master_MCR_TDCEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define HRTIM_Master_MCR_TCCEN          (0x1UL << 19) 
#define HRTIM_Master_MCR_TCCEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define HRTIM_Master_MCR_TBCEN          (0x1UL << 18) 
#define HRTIM_Master_MCR_TBCEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HRTIM_Master_MCR_TACEN          (0x1UL << 17) 
#define HRTIM_Master_MCR_TACEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HRTIM_Master_MCR_MCEN          (0x1UL << 16) 
#define HRTIM_Master_MCR_MCEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define HRTIM_Master_MCR_SYNC_SRC          (0x3UL << 14) 
#define HRTIM_Master_MCR_SYNC_SRC_VAL(X) (((uint32_t)(X) & 0x3UL) << 14)
#define HRTIM_Master_MCR_SYNC_OUT          (0x3UL << 12) 
#define HRTIM_Master_MCR_SYNC_OUT_VAL(X) (((uint32_t)(X) & 0x3UL) << 12)
#define HRTIM_Master_MCR_SYNCSTRTM          (0x1UL << 11) 
#define HRTIM_Master_MCR_SYNCSTRTM_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define HRTIM_Master_MCR_SYNCRSTM          (0x1UL << 10) 
#define HRTIM_Master_MCR_SYNCRSTM_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define HRTIM_Master_MCR_SYNC_IN          (0x3UL << 8) 
#define HRTIM_Master_MCR_SYNC_IN_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define HRTIM_Master_MCR_HALF          (0x1UL << 5) 
#define HRTIM_Master_MCR_HALF_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define HRTIM_Master_MCR_RETRIG          (0x1UL << 4) 
#define HRTIM_Master_MCR_RETRIG_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_Master_MCR_CONT          (0x1UL << 3) 
#define HRTIM_Master_MCR_CONT_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_Master_MCR_CK_PSC          (0x7UL << 0) 
#define HRTIM_Master_MCR_CK_PSC_VAL(X) (((uint32_t)(X) & 0x7UL) << 0)
#define HRTIM_Master_MISR_MUPD          (0x1UL << 6) 
#define HRTIM_Master_MISR_MUPD_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_Master_MISR_SYNC          (0x1UL << 5) 
#define HRTIM_Master_MISR_SYNC_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define HRTIM_Master_MISR_MREP          (0x1UL << 4) 
#define HRTIM_Master_MISR_MREP_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_Master_MISR_MCMP4          (0x1UL << 3) 
#define HRTIM_Master_MISR_MCMP4_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_Master_MISR_MCMP3          (0x1UL << 2) 
#define HRTIM_Master_MISR_MCMP3_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_Master_MISR_MCMP2          (0x1UL << 1) 
#define HRTIM_Master_MISR_MCMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_Master_MISR_MCMP1          (0x1UL << 0) 
#define HRTIM_Master_MISR_MCMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_Master_MICR_MUPDC          (0x1UL << 6) 
#define HRTIM_Master_MICR_MUPDC_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_Master_MICR_SYNCC          (0x1UL << 5) 
#define HRTIM_Master_MICR_SYNCC_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define HRTIM_Master_MICR_MREPC          (0x1UL << 4) 
#define HRTIM_Master_MICR_MREPC_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_Master_MICR_MCMP4C          (0x1UL << 3) 
#define HRTIM_Master_MICR_MCMP4C_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_Master_MICR_MCMP3C          (0x1UL << 2) 
#define HRTIM_Master_MICR_MCMP3C_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_Master_MICR_MCMP2C          (0x1UL << 1) 
#define HRTIM_Master_MICR_MCMP2C_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_Master_MICR_MCMP1C          (0x1UL << 0) 
#define HRTIM_Master_MICR_MCMP1C_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_Master_MDIER4_MUPDDE          (0x1UL << 22) 
#define HRTIM_Master_MDIER4_MUPDDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define HRTIM_Master_MDIER4_SYNCDE          (0x1UL << 21) 
#define HRTIM_Master_MDIER4_SYNCDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define HRTIM_Master_MDIER4_MREPDE          (0x1UL << 20) 
#define HRTIM_Master_MDIER4_MREPDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define HRTIM_Master_MDIER4_MCMP4DE          (0x1UL << 19) 
#define HRTIM_Master_MDIER4_MCMP4DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define HRTIM_Master_MDIER4_MCMP3DE          (0x1UL << 18) 
#define HRTIM_Master_MDIER4_MCMP3DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HRTIM_Master_MDIER4_MCMP2DE          (0x1UL << 17) 
#define HRTIM_Master_MDIER4_MCMP2DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HRTIM_Master_MDIER4_MCMP1DE          (0x1UL << 16) 
#define HRTIM_Master_MDIER4_MCMP1DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define HRTIM_Master_MDIER4_MUPDIE          (0x1UL << 6) 
#define HRTIM_Master_MDIER4_MUPDIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_Master_MDIER4_SYNCIE          (0x1UL << 5) 
#define HRTIM_Master_MDIER4_SYNCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define HRTIM_Master_MDIER4_MREPIE          (0x1UL << 4) 
#define HRTIM_Master_MDIER4_MREPIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_Master_MDIER4_MCMP4IE          (0x1UL << 3) 
#define HRTIM_Master_MDIER4_MCMP4IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_Master_MDIER4_MCMP3IE          (0x1UL << 2) 
#define HRTIM_Master_MDIER4_MCMP3IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_Master_MDIER4_MCMP2IE          (0x1UL << 1) 
#define HRTIM_Master_MDIER4_MCMP2IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_Master_MDIER4_MCMP1IE          (0x1UL << 0) 
#define HRTIM_Master_MDIER4_MCMP1IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_Master_MCNTR_MCNT          (0xFFFFUL << 0) 
#define HRTIM_Master_MCNTR_MCNT_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define HRTIM_Master_MPER_MPER          (0xFFFFUL << 0) 
#define HRTIM_Master_MPER_MPER_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define HRTIM_Master_MREP_MREP          (0xFFUL << 0) 
#define HRTIM_Master_MREP_MREP_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HRTIM_Master_MCMP1R_MCMP1          (0xFFFFUL << 0) 
#define HRTIM_Master_MCMP1R_MCMP1_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define HRTIM_Master_MCMP2R_MCMP2          (0xFFFFUL << 0) 
#define HRTIM_Master_MCMP2R_MCMP2_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define HRTIM_Master_MCMP3R_MCMP3          (0xFFFFUL << 0) 
#define HRTIM_Master_MCMP3R_MCMP3_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define HRTIM_Master_MCMP4R_MCMP4          (0xFFFFUL << 0) 
#define HRTIM_Master_MCMP4R_MCMP4_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)

#define HRTIM_Master  ((struct HRTIM_Master*)(0x40017400UL))
struct HRTIM_TIMA {
  volatile uint32_t TIMACR;
  volatile const uint32_t TIMAISR;
  volatile uint32_t TIMAICR;
  volatile uint32_t TIMADIER5;
  volatile uint32_t CNTAR;
  volatile uint32_t PERAR;
  volatile uint32_t REPAR;
  volatile uint32_t CMP1AR;
  volatile uint32_t CMP1CAR;
  volatile uint32_t CMP2AR;
  volatile uint32_t CMP3AR;
  volatile uint32_t CMP4AR;
  volatile const uint32_t CPT1AR;
  volatile const uint32_t CPT2AR;
  volatile uint32_t DTAR;
  volatile uint32_t SETA1R;
  volatile uint32_t RSTA1R;
  volatile uint32_t SETA2R;
  volatile uint32_t RSTA2R;
  volatile uint32_t EEFAR1;
  volatile uint32_t EEFAR2;
  volatile uint32_t RSTAR;
  volatile uint32_t CHPAR;
  volatile uint32_t CPT1ACR;
  volatile uint32_t CPT2ACR;
  volatile uint32_t OUTAR;
  volatile uint32_t FLTAR;
};
