via/viaems/src/platforms/stm32h743/device.h
#define HRTIM_TIMA_TIMACR_UPDGAT          (0xFUL << 28) 
#define HRTIM_TIMA_TIMACR_UPDGAT_VAL(X) (((uint32_t)(X) & 0xFUL) << 28)
#define HRTIM_TIMA_TIMACR_PREEN          (0x1UL << 27) 
#define HRTIM_TIMA_TIMACR_PREEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define HRTIM_TIMA_TIMACR_DACSYNC          (0x3UL << 25) 
#define HRTIM_TIMA_TIMACR_DACSYNC_VAL(X) (((uint32_t)(X) & 0x3UL) << 25)
#define HRTIM_TIMA_TIMACR_MSTU          (0x1UL << 24) 
#define HRTIM_TIMA_TIMACR_MSTU_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define HRTIM_TIMA_TIMACR_TEU          (0x1UL << 23) 
#define HRTIM_TIMA_TIMACR_TEU_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define HRTIM_TIMA_TIMACR_TDU          (0x1UL << 22) 
#define HRTIM_TIMA_TIMACR_TDU_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define HRTIM_TIMA_TIMACR_TCU          (0x1UL << 21) 
#define HRTIM_TIMA_TIMACR_TCU_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define HRTIM_TIMA_TIMACR_TBU          (0x1UL << 20) 
#define HRTIM_TIMA_TIMACR_TBU_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define HRTIM_TIMA_TIMACR_TxRSTU          (0x1UL << 18) 
#define HRTIM_TIMA_TIMACR_TxRSTU_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HRTIM_TIMA_TIMACR_TxREPU          (0x1UL << 17) 
#define HRTIM_TIMA_TIMACR_TxREPU_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HRTIM_TIMA_TIMACR_DELCMP4          (0x3UL << 14) 
#define HRTIM_TIMA_TIMACR_DELCMP4_VAL(X) (((uint32_t)(X) & 0x3UL) << 14)
#define HRTIM_TIMA_TIMACR_DELCMP2          (0x3UL << 12) 
#define HRTIM_TIMA_TIMACR_DELCMP2_VAL(X) (((uint32_t)(X) & 0x3UL) << 12)
#define HRTIM_TIMA_TIMACR_SYNCSTRTx          (0x1UL << 11) 
#define HRTIM_TIMA_TIMACR_SYNCSTRTx_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define HRTIM_TIMA_TIMACR_SYNCRSTx          (0x1UL << 10) 
#define HRTIM_TIMA_TIMACR_SYNCRSTx_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define HRTIM_TIMA_TIMACR_PSHPLL          (0x1UL << 6) 
#define HRTIM_TIMA_TIMACR_PSHPLL_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_TIMA_TIMACR_HALF          (0x1UL << 5) 
#define HRTIM_TIMA_TIMACR_HALF_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define HRTIM_TIMA_TIMACR_RETRIG          (0x1UL << 4) 
#define HRTIM_TIMA_TIMACR_RETRIG_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_TIMA_TIMACR_CONT          (0x1UL << 3) 
#define HRTIM_TIMA_TIMACR_CONT_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_TIMA_TIMACR_CK_PSCx          (0x7UL << 0) 
#define HRTIM_TIMA_TIMACR_CK_PSCx_VAL(X) (((uint32_t)(X) & 0x7UL) << 0)
#define HRTIM_TIMA_TIMAISR_O2STAT          (0x1UL << 19) 
#define HRTIM_TIMA_TIMAISR_O2STAT_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define HRTIM_TIMA_TIMAISR_O1STAT          (0x1UL << 18) 
#define HRTIM_TIMA_TIMAISR_O1STAT_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HRTIM_TIMA_TIMAISR_IPPSTAT          (0x1UL << 17) 
#define HRTIM_TIMA_TIMAISR_IPPSTAT_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HRTIM_TIMA_TIMAISR_CPPSTAT          (0x1UL << 16) 
#define HRTIM_TIMA_TIMAISR_CPPSTAT_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define HRTIM_TIMA_TIMAISR_DLYPRT          (0x1UL << 14) 
#define HRTIM_TIMA_TIMAISR_DLYPRT_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define HRTIM_TIMA_TIMAISR_RST          (0x1UL << 13) 
#define HRTIM_TIMA_TIMAISR_RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define HRTIM_TIMA_TIMAISR_RSTx2          (0x1UL << 12) 
#define HRTIM_TIMA_TIMAISR_RSTx2_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define HRTIM_TIMA_TIMAISR_SETx2          (0x1UL << 11) 
#define HRTIM_TIMA_TIMAISR_SETx2_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define HRTIM_TIMA_TIMAISR_RSTx1          (0x1UL << 10) 
#define HRTIM_TIMA_TIMAISR_RSTx1_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define HRTIM_TIMA_TIMAISR_SETx1          (0x1UL << 9) 
#define HRTIM_TIMA_TIMAISR_SETx1_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HRTIM_TIMA_TIMAISR_CPT2          (0x1UL << 8) 
#define HRTIM_TIMA_TIMAISR_CPT2_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HRTIM_TIMA_TIMAISR_CPT1          (0x1UL << 7) 
#define HRTIM_TIMA_TIMAISR_CPT1_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define HRTIM_TIMA_TIMAISR_UPD          (0x1UL << 6) 
#define HRTIM_TIMA_TIMAISR_UPD_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_TIMA_TIMAISR_REP          (0x1UL << 4) 
#define HRTIM_TIMA_TIMAISR_REP_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_TIMA_TIMAISR_CMP4          (0x1UL << 3) 
#define HRTIM_TIMA_TIMAISR_CMP4_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_TIMA_TIMAISR_CMP3          (0x1UL << 2) 
#define HRTIM_TIMA_TIMAISR_CMP3_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_TIMA_TIMAISR_CMP2          (0x1UL << 1) 
#define HRTIM_TIMA_TIMAISR_CMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_TIMA_TIMAISR_CMP1          (0x1UL << 0) 
#define HRTIM_TIMA_TIMAISR_CMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_TIMA_TIMAICR_DLYPRTC          (0x1UL << 14) 
#define HRTIM_TIMA_TIMAICR_DLYPRTC_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define HRTIM_TIMA_TIMAICR_RSTC          (0x1UL << 13) 
#define HRTIM_TIMA_TIMAICR_RSTC_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define HRTIM_TIMA_TIMAICR_RSTx2C          (0x1UL << 12) 
#define HRTIM_TIMA_TIMAICR_RSTx2C_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define HRTIM_TIMA_TIMAICR_SET2xC          (0x1UL << 11) 
#define HRTIM_TIMA_TIMAICR_SET2xC_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define HRTIM_TIMA_TIMAICR_RSTx1C          (0x1UL << 10) 
#define HRTIM_TIMA_TIMAICR_RSTx1C_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define HRTIM_TIMA_TIMAICR_SET1xC          (0x1UL << 9) 
#define HRTIM_TIMA_TIMAICR_SET1xC_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HRTIM_TIMA_TIMAICR_CPT2C          (0x1UL << 8) 
#define HRTIM_TIMA_TIMAICR_CPT2C_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HRTIM_TIMA_TIMAICR_CPT1C          (0x1UL << 7) 
#define HRTIM_TIMA_TIMAICR_CPT1C_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define HRTIM_TIMA_TIMAICR_UPDC          (0x1UL << 6) 
#define HRTIM_TIMA_TIMAICR_UPDC_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_TIMA_TIMAICR_REPC          (0x1UL << 4) 
#define HRTIM_TIMA_TIMAICR_REPC_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_TIMA_TIMAICR_CMP4C          (0x1UL << 3) 
#define HRTIM_TIMA_TIMAICR_CMP4C_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_TIMA_TIMAICR_CMP3C          (0x1UL << 2) 
#define HRTIM_TIMA_TIMAICR_CMP3C_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_TIMA_TIMAICR_CMP2C          (0x1UL << 1) 
#define HRTIM_TIMA_TIMAICR_CMP2C_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_TIMA_TIMAICR_CMP1C          (0x1UL << 0) 
#define HRTIM_TIMA_TIMAICR_CMP1C_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_TIMA_TIMADIER5_DLYPRTDE          (0x1UL << 30) 
#define HRTIM_TIMA_TIMADIER5_DLYPRTDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define HRTIM_TIMA_TIMADIER5_RSTDE          (0x1UL << 29) 
#define HRTIM_TIMA_TIMADIER5_RSTDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define HRTIM_TIMA_TIMADIER5_RSTx2DE          (0x1UL << 28) 
#define HRTIM_TIMA_TIMADIER5_RSTx2DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define HRTIM_TIMA_TIMADIER5_SETx2DE          (0x1UL << 27) 
#define HRTIM_TIMA_TIMADIER5_SETx2DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define HRTIM_TIMA_TIMADIER5_RSTx1DE          (0x1UL << 26) 
#define HRTIM_TIMA_TIMADIER5_RSTx1DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define HRTIM_TIMA_TIMADIER5_SET1xDE          (0x1UL << 25) 
#define HRTIM_TIMA_TIMADIER5_SET1xDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define HRTIM_TIMA_TIMADIER5_CPT2DE          (0x1UL << 24) 
#define HRTIM_TIMA_TIMADIER5_CPT2DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define HRTIM_TIMA_TIMADIER5_CPT1DE          (0x1UL << 23) 
#define HRTIM_TIMA_TIMADIER5_CPT1DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define HRTIM_TIMA_TIMADIER5_UPDDE          (0x1UL << 22) 
#define HRTIM_TIMA_TIMADIER5_UPDDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define HRTIM_TIMA_TIMADIER5_REPDE          (0x1UL << 20) 
#define HRTIM_TIMA_TIMADIER5_REPDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define HRTIM_TIMA_TIMADIER5_CMP4DE          (0x1UL << 19) 
#define HRTIM_TIMA_TIMADIER5_CMP4DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define HRTIM_TIMA_TIMADIER5_CMP3DE          (0x1UL << 18) 
#define HRTIM_TIMA_TIMADIER5_CMP3DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HRTIM_TIMA_TIMADIER5_CMP2DE          (0x1UL << 17) 
#define HRTIM_TIMA_TIMADIER5_CMP2DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HRTIM_TIMA_TIMADIER5_CMP1DE          (0x1UL << 16) 
#define HRTIM_TIMA_TIMADIER5_CMP1DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define HRTIM_TIMA_TIMADIER5_DLYPRTIE          (0x1UL << 14) 
#define HRTIM_TIMA_TIMADIER5_DLYPRTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define HRTIM_TIMA_TIMADIER5_RSTIE          (0x1UL << 13) 
#define HRTIM_TIMA_TIMADIER5_RSTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define HRTIM_TIMA_TIMADIER5_RSTx2IE          (0x1UL << 12) 
#define HRTIM_TIMA_TIMADIER5_RSTx2IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define HRTIM_TIMA_TIMADIER5_SETx2IE          (0x1UL << 11) 
#define HRTIM_TIMA_TIMADIER5_SETx2IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define HRTIM_TIMA_TIMADIER5_RSTx1IE          (0x1UL << 10) 
#define HRTIM_TIMA_TIMADIER5_RSTx1IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define HRTIM_TIMA_TIMADIER5_SET1xIE          (0x1UL << 9) 
#define HRTIM_TIMA_TIMADIER5_SET1xIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HRTIM_TIMA_TIMADIER5_CPT2IE          (0x1UL << 8) 
#define HRTIM_TIMA_TIMADIER5_CPT2IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HRTIM_TIMA_TIMADIER5_CPT1IE          (0x1UL << 7) 
#define HRTIM_TIMA_TIMADIER5_CPT1IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define HRTIM_TIMA_TIMADIER5_UPDIE          (0x1UL << 6) 
#define HRTIM_TIMA_TIMADIER5_UPDIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_TIMA_TIMADIER5_REPIE          (0x1UL << 4) 
#define HRTIM_TIMA_TIMADIER5_REPIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_TIMA_TIMADIER5_CMP4IE          (0x1UL << 3) 
#define HRTIM_TIMA_TIMADIER5_CMP4IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_TIMA_TIMADIER5_CMP3IE          (0x1UL << 2) 
#define HRTIM_TIMA_TIMADIER5_CMP3IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_TIMA_TIMADIER5_CMP2IE          (0x1UL << 1) 
#define HRTIM_TIMA_TIMADIER5_CMP2IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_TIMA_TIMADIER5_CMP1IE          (0x1UL << 0) 
#define HRTIM_TIMA_TIMADIER5_CMP1IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_TIMA_CNTAR_CNTx          (0xFFFFUL << 0) 
#define HRTIM_TIMA_CNTAR_CNTx_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define HRTIM_TIMA_PERAR_PERx          (0xFFFFUL << 0) 
#define HRTIM_TIMA_PERAR_PERx_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define HRTIM_TIMA_REPAR_REPx          (0xFFUL << 0) 
#define HRTIM_TIMA_REPAR_REPx_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HRTIM_TIMA_CMP1AR_CMP1x          (0xFFFFUL << 0) 
#define HRTIM_TIMA_CMP1AR_CMP1x_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define HRTIM_TIMA_CMP1CAR_REPx          (0xFFUL << 16) 
#define HRTIM_TIMA_CMP1CAR_REPx_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define HRTIM_TIMA_CMP1CAR_CMP1x          (0xFFFFUL << 0) 
#define HRTIM_TIMA_CMP1CAR_CMP1x_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define HRTIM_TIMA_CMP2AR_CMP2x          (0xFFFFUL << 0) 
#define HRTIM_TIMA_CMP2AR_CMP2x_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define HRTIM_TIMA_CMP3AR_CMP3x          (0xFFFFUL << 0) 
#define HRTIM_TIMA_CMP3AR_CMP3x_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define HRTIM_TIMA_CMP4AR_CMP4x          (0xFFFFUL << 0) 
#define HRTIM_TIMA_CMP4AR_CMP4x_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define HRTIM_TIMA_CPT1AR_CPT1x          (0xFFFFUL << 0) 
#define HRTIM_TIMA_CPT1AR_CPT1x_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define HRTIM_TIMA_CPT2AR_CPT2x          (0xFFFFUL << 0) 
#define HRTIM_TIMA_CPT2AR_CPT2x_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define HRTIM_TIMA_DTAR_DTFLKx          (0x1UL << 31) 
#define HRTIM_TIMA_DTAR_DTFLKx_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HRTIM_TIMA_DTAR_DTFSLKx          (0x1UL << 30) 
#define HRTIM_TIMA_DTAR_DTFSLKx_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define HRTIM_TIMA_DTAR_SDTFx          (0x1UL << 25) 
#define HRTIM_TIMA_DTAR_SDTFx_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define HRTIM_TIMA_DTAR_DTFx          (0x1FFUL << 16) 
#define HRTIM_TIMA_DTAR_DTFx_VAL(X) (((uint32_t)(X) & 0x1FFUL) << 16)
#define HRTIM_TIMA_DTAR_DTRLKx          (0x1UL << 15) 
#define HRTIM_TIMA_DTAR_DTRLKx_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define HRTIM_TIMA_DTAR_DTRSLKx          (0x1UL << 14) 
#define HRTIM_TIMA_DTAR_DTRSLKx_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define HRTIM_TIMA_DTAR_DTPRSC          (0x7UL << 10) 
#define HRTIM_TIMA_DTAR_DTPRSC_VAL(X) (((uint32_t)(X) & 0x7UL) << 10)
#define HRTIM_TIMA_DTAR_SDTRx          (0x1UL << 9) 
#define HRTIM_TIMA_DTAR_SDTRx_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HRTIM_TIMA_DTAR_DTRx          (0x1FFUL << 0) 
#define HRTIM_TIMA_DTAR_DTRx_VAL(X) (((uint32_t)(X) & 0x1FFUL) << 0)
#define HRTIM_TIMA_SETA1R_UPDATE          (0x1UL << 31) 
#define HRTIM_TIMA_SETA1R_UPDATE_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HRTIM_TIMA_SETA1R_EXTEVNT10          (0x1UL << 30) 
#define HRTIM_TIMA_SETA1R_EXTEVNT10_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define HRTIM_TIMA_SETA1R_EXTEVNT9          (0x1UL << 29) 
#define HRTIM_TIMA_SETA1R_EXTEVNT9_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define HRTIM_TIMA_SETA1R_EXTEVNT8          (0x1UL << 28) 
#define HRTIM_TIMA_SETA1R_EXTEVNT8_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define HRTIM_TIMA_SETA1R_EXTEVNT7          (0x1UL << 27) 
#define HRTIM_TIMA_SETA1R_EXTEVNT7_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define HRTIM_TIMA_SETA1R_EXTEVNT6          (0x1UL << 26) 
#define HRTIM_TIMA_SETA1R_EXTEVNT6_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define HRTIM_TIMA_SETA1R_EXTEVNT5          (0x1UL << 25) 
#define HRTIM_TIMA_SETA1R_EXTEVNT5_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define HRTIM_TIMA_SETA1R_EXTEVNT4          (0x1UL << 24) 
#define HRTIM_TIMA_SETA1R_EXTEVNT4_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define HRTIM_TIMA_SETA1R_EXTEVNT3          (0x1UL << 23) 
#define HRTIM_TIMA_SETA1R_EXTEVNT3_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define HRTIM_TIMA_SETA1R_EXTEVNT2          (0x1UL << 22) 
#define HRTIM_TIMA_SETA1R_EXTEVNT2_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define HRTIM_TIMA_SETA1R_EXTEVNT1          (0x1UL << 21) 
#define HRTIM_TIMA_SETA1R_EXTEVNT1_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define HRTIM_TIMA_SETA1R_TIMEVNT9          (0x1UL << 20) 
#define HRTIM_TIMA_SETA1R_TIMEVNT9_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define HRTIM_TIMA_SETA1R_TIMEVNT8          (0x1UL << 19) 
#define HRTIM_TIMA_SETA1R_TIMEVNT8_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define HRTIM_TIMA_SETA1R_TIMEVNT7          (0x1UL << 18) 
#define HRTIM_TIMA_SETA1R_TIMEVNT7_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HRTIM_TIMA_SETA1R_TIMEVNT6          (0x1UL << 17) 
#define HRTIM_TIMA_SETA1R_TIMEVNT6_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HRTIM_TIMA_SETA1R_TIMEVNT5          (0x1UL << 16) 
#define HRTIM_TIMA_SETA1R_TIMEVNT5_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define HRTIM_TIMA_SETA1R_TIMEVNT4          (0x1UL << 15) 
#define HRTIM_TIMA_SETA1R_TIMEVNT4_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define HRTIM_TIMA_SETA1R_TIMEVNT3          (0x1UL << 14) 
#define HRTIM_TIMA_SETA1R_TIMEVNT3_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define HRTIM_TIMA_SETA1R_TIMEVNT2          (0x1UL << 13) 
#define HRTIM_TIMA_SETA1R_TIMEVNT2_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define HRTIM_TIMA_SETA1R_TIMEVNT1          (0x1UL << 12) 
#define HRTIM_TIMA_SETA1R_TIMEVNT1_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define HRTIM_TIMA_SETA1R_MSTCMP4          (0x1UL << 11) 
#define HRTIM_TIMA_SETA1R_MSTCMP4_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define HRTIM_TIMA_SETA1R_MSTCMP3          (0x1UL << 10) 
#define HRTIM_TIMA_SETA1R_MSTCMP3_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define HRTIM_TIMA_SETA1R_MSTCMP2          (0x1UL << 9) 
#define HRTIM_TIMA_SETA1R_MSTCMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HRTIM_TIMA_SETA1R_MSTCMP1          (0x1UL << 8) 
#define HRTIM_TIMA_SETA1R_MSTCMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HRTIM_TIMA_SETA1R_MSTPER          (0x1UL << 7) 
#define HRTIM_TIMA_SETA1R_MSTPER_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define HRTIM_TIMA_SETA1R_CMP4          (0x1UL << 6) 
#define HRTIM_TIMA_SETA1R_CMP4_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_TIMA_SETA1R_CMP3          (0x1UL << 5) 
#define HRTIM_TIMA_SETA1R_CMP3_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define HRTIM_TIMA_SETA1R_CMP2          (0x1UL << 4) 
#define HRTIM_TIMA_SETA1R_CMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_TIMA_SETA1R_CMP1          (0x1UL << 3) 
#define HRTIM_TIMA_SETA1R_CMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_TIMA_SETA1R_PER          (0x1UL << 2) 
#define HRTIM_TIMA_SETA1R_PER_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_TIMA_SETA1R_RESYNC          (0x1UL << 1) 
#define HRTIM_TIMA_SETA1R_RESYNC_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_TIMA_SETA1R_SST          (0x1UL << 0) 
#define HRTIM_TIMA_SETA1R_SST_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_TIMA_RSTA1R_UPDATE          (0x1UL << 31) 
#define HRTIM_TIMA_RSTA1R_UPDATE_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HRTIM_TIMA_RSTA1R_EXTEVNT10          (0x1UL << 30) 
#define HRTIM_TIMA_RSTA1R_EXTEVNT10_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define HRTIM_TIMA_RSTA1R_EXTEVNT9          (0x1UL << 29) 
#define HRTIM_TIMA_RSTA1R_EXTEVNT9_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define HRTIM_TIMA_RSTA1R_EXTEVNT8          (0x1UL << 28) 
#define HRTIM_TIMA_RSTA1R_EXTEVNT8_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define HRTIM_TIMA_RSTA1R_EXTEVNT7          (0x1UL << 27) 
#define HRTIM_TIMA_RSTA1R_EXTEVNT7_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define HRTIM_TIMA_RSTA1R_EXTEVNT6          (0x1UL << 26) 
#define HRTIM_TIMA_RSTA1R_EXTEVNT6_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define HRTIM_TIMA_RSTA1R_EXTEVNT5          (0x1UL << 25) 
#define HRTIM_TIMA_RSTA1R_EXTEVNT5_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define HRTIM_TIMA_RSTA1R_EXTEVNT4          (0x1UL << 24) 
#define HRTIM_TIMA_RSTA1R_EXTEVNT4_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define HRTIM_TIMA_RSTA1R_EXTEVNT3          (0x1UL << 23) 
#define HRTIM_TIMA_RSTA1R_EXTEVNT3_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define HRTIM_TIMA_RSTA1R_EXTEVNT2          (0x1UL << 22) 
#define HRTIM_TIMA_RSTA1R_EXTEVNT2_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define HRTIM_TIMA_RSTA1R_EXTEVNT1          (0x1UL << 21) 
#define HRTIM_TIMA_RSTA1R_EXTEVNT1_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define HRTIM_TIMA_RSTA1R_TIMEVNT9          (0x1UL << 20) 
#define HRTIM_TIMA_RSTA1R_TIMEVNT9_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define HRTIM_TIMA_RSTA1R_TIMEVNT8          (0x1UL << 19) 
#define HRTIM_TIMA_RSTA1R_TIMEVNT8_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define HRTIM_TIMA_RSTA1R_TIMEVNT7          (0x1UL << 18) 
#define HRTIM_TIMA_RSTA1R_TIMEVNT7_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HRTIM_TIMA_RSTA1R_TIMEVNT6          (0x1UL << 17) 
#define HRTIM_TIMA_RSTA1R_TIMEVNT6_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HRTIM_TIMA_RSTA1R_TIMEVNT5          (0x1UL << 16) 
#define HRTIM_TIMA_RSTA1R_TIMEVNT5_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define HRTIM_TIMA_RSTA1R_TIMEVNT4          (0x1UL << 15) 
#define HRTIM_TIMA_RSTA1R_TIMEVNT4_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define HRTIM_TIMA_RSTA1R_TIMEVNT3          (0x1UL << 14) 
#define HRTIM_TIMA_RSTA1R_TIMEVNT3_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define HRTIM_TIMA_RSTA1R_TIMEVNT2          (0x1UL << 13) 
#define HRTIM_TIMA_RSTA1R_TIMEVNT2_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define HRTIM_TIMA_RSTA1R_TIMEVNT1          (0x1UL << 12) 
#define HRTIM_TIMA_RSTA1R_TIMEVNT1_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define HRTIM_TIMA_RSTA1R_MSTCMP4          (0x1UL << 11) 
#define HRTIM_TIMA_RSTA1R_MSTCMP4_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define HRTIM_TIMA_RSTA1R_MSTCMP3          (0x1UL << 10) 
#define HRTIM_TIMA_RSTA1R_MSTCMP3_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define HRTIM_TIMA_RSTA1R_MSTCMP2          (0x1UL << 9) 
#define HRTIM_TIMA_RSTA1R_MSTCMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HRTIM_TIMA_RSTA1R_MSTCMP1          (0x1UL << 8) 
#define HRTIM_TIMA_RSTA1R_MSTCMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HRTIM_TIMA_RSTA1R_MSTPER          (0x1UL << 7) 
#define HRTIM_TIMA_RSTA1R_MSTPER_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define HRTIM_TIMA_RSTA1R_CMP4          (0x1UL << 6) 
#define HRTIM_TIMA_RSTA1R_CMP4_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_TIMA_RSTA1R_CMP3          (0x1UL << 5) 
#define HRTIM_TIMA_RSTA1R_CMP3_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define HRTIM_TIMA_RSTA1R_CMP2          (0x1UL << 4) 
#define HRTIM_TIMA_RSTA1R_CMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_TIMA_RSTA1R_CMP1          (0x1UL << 3) 
#define HRTIM_TIMA_RSTA1R_CMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_TIMA_RSTA1R_PER          (0x1UL << 2) 
#define HRTIM_TIMA_RSTA1R_PER_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_TIMA_RSTA1R_RESYNC          (0x1UL << 1) 
#define HRTIM_TIMA_RSTA1R_RESYNC_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_TIMA_RSTA1R_SRT          (0x1UL << 0) 
#define HRTIM_TIMA_RSTA1R_SRT_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_TIMA_SETA2R_UPDATE          (0x1UL << 31) 
#define HRTIM_TIMA_SETA2R_UPDATE_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HRTIM_TIMA_SETA2R_EXTEVNT10          (0x1UL << 30) 
#define HRTIM_TIMA_SETA2R_EXTEVNT10_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define HRTIM_TIMA_SETA2R_EXTEVNT9          (0x1UL << 29) 
#define HRTIM_TIMA_SETA2R_EXTEVNT9_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define HRTIM_TIMA_SETA2R_EXTEVNT8          (0x1UL << 28) 
#define HRTIM_TIMA_SETA2R_EXTEVNT8_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define HRTIM_TIMA_SETA2R_EXTEVNT7          (0x1UL << 27) 
#define HRTIM_TIMA_SETA2R_EXTEVNT7_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define HRTIM_TIMA_SETA2R_EXTEVNT6          (0x1UL << 26) 
#define HRTIM_TIMA_SETA2R_EXTEVNT6_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define HRTIM_TIMA_SETA2R_EXTEVNT5          (0x1UL << 25) 
#define HRTIM_TIMA_SETA2R_EXTEVNT5_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define HRTIM_TIMA_SETA2R_EXTEVNT4          (0x1UL << 24) 
#define HRTIM_TIMA_SETA2R_EXTEVNT4_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define HRTIM_TIMA_SETA2R_EXTEVNT3          (0x1UL << 23) 
#define HRTIM_TIMA_SETA2R_EXTEVNT3_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define HRTIM_TIMA_SETA2R_EXTEVNT2          (0x1UL << 22) 
#define HRTIM_TIMA_SETA2R_EXTEVNT2_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define HRTIM_TIMA_SETA2R_EXTEVNT1          (0x1UL << 21) 
#define HRTIM_TIMA_SETA2R_EXTEVNT1_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define HRTIM_TIMA_SETA2R_TIMEVNT9          (0x1UL << 20) 
#define HRTIM_TIMA_SETA2R_TIMEVNT9_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define HRTIM_TIMA_SETA2R_TIMEVNT8          (0x1UL << 19) 
#define HRTIM_TIMA_SETA2R_TIMEVNT8_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define HRTIM_TIMA_SETA2R_TIMEVNT7          (0x1UL << 18) 
#define HRTIM_TIMA_SETA2R_TIMEVNT7_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HRTIM_TIMA_SETA2R_TIMEVNT6          (0x1UL << 17) 
#define HRTIM_TIMA_SETA2R_TIMEVNT6_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HRTIM_TIMA_SETA2R_TIMEVNT5          (0x1UL << 16) 
#define HRTIM_TIMA_SETA2R_TIMEVNT5_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define HRTIM_TIMA_SETA2R_TIMEVNT4          (0x1UL << 15) 
#define HRTIM_TIMA_SETA2R_TIMEVNT4_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define HRTIM_TIMA_SETA2R_TIMEVNT3          (0x1UL << 14) 
#define HRTIM_TIMA_SETA2R_TIMEVNT3_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define HRTIM_TIMA_SETA2R_TIMEVNT2          (0x1UL << 13) 
#define HRTIM_TIMA_SETA2R_TIMEVNT2_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define HRTIM_TIMA_SETA2R_TIMEVNT1          (0x1UL << 12) 
#define HRTIM_TIMA_SETA2R_TIMEVNT1_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define HRTIM_TIMA_SETA2R_MSTCMP4          (0x1UL << 11) 
#define HRTIM_TIMA_SETA2R_MSTCMP4_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
