via/viaems/src/platforms/stm32h743/device.h
#define HRTIM_TIMA_SETA2R_MSTCMP3          (0x1UL << 10) 
#define HRTIM_TIMA_SETA2R_MSTCMP3_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define HRTIM_TIMA_SETA2R_MSTCMP2          (0x1UL << 9) 
#define HRTIM_TIMA_SETA2R_MSTCMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HRTIM_TIMA_SETA2R_MSTCMP1          (0x1UL << 8) 
#define HRTIM_TIMA_SETA2R_MSTCMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HRTIM_TIMA_SETA2R_MSTPER          (0x1UL << 7) 
#define HRTIM_TIMA_SETA2R_MSTPER_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define HRTIM_TIMA_SETA2R_CMP4          (0x1UL << 6) 
#define HRTIM_TIMA_SETA2R_CMP4_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_TIMA_SETA2R_CMP3          (0x1UL << 5) 
#define HRTIM_TIMA_SETA2R_CMP3_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define HRTIM_TIMA_SETA2R_CMP2          (0x1UL << 4) 
#define HRTIM_TIMA_SETA2R_CMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_TIMA_SETA2R_CMP1          (0x1UL << 3) 
#define HRTIM_TIMA_SETA2R_CMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_TIMA_SETA2R_PER          (0x1UL << 2) 
#define HRTIM_TIMA_SETA2R_PER_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_TIMA_SETA2R_RESYNC          (0x1UL << 1) 
#define HRTIM_TIMA_SETA2R_RESYNC_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_TIMA_SETA2R_SST          (0x1UL << 0) 
#define HRTIM_TIMA_SETA2R_SST_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_TIMA_RSTA2R_UPDATE          (0x1UL << 31) 
#define HRTIM_TIMA_RSTA2R_UPDATE_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HRTIM_TIMA_RSTA2R_EXTEVNT10          (0x1UL << 30) 
#define HRTIM_TIMA_RSTA2R_EXTEVNT10_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define HRTIM_TIMA_RSTA2R_EXTEVNT9          (0x1UL << 29) 
#define HRTIM_TIMA_RSTA2R_EXTEVNT9_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define HRTIM_TIMA_RSTA2R_EXTEVNT8          (0x1UL << 28) 
#define HRTIM_TIMA_RSTA2R_EXTEVNT8_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define HRTIM_TIMA_RSTA2R_EXTEVNT7          (0x1UL << 27) 
#define HRTIM_TIMA_RSTA2R_EXTEVNT7_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define HRTIM_TIMA_RSTA2R_EXTEVNT6          (0x1UL << 26) 
#define HRTIM_TIMA_RSTA2R_EXTEVNT6_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define HRTIM_TIMA_RSTA2R_EXTEVNT5          (0x1UL << 25) 
#define HRTIM_TIMA_RSTA2R_EXTEVNT5_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define HRTIM_TIMA_RSTA2R_EXTEVNT4          (0x1UL << 24) 
#define HRTIM_TIMA_RSTA2R_EXTEVNT4_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define HRTIM_TIMA_RSTA2R_EXTEVNT3          (0x1UL << 23) 
#define HRTIM_TIMA_RSTA2R_EXTEVNT3_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define HRTIM_TIMA_RSTA2R_EXTEVNT2          (0x1UL << 22) 
#define HRTIM_TIMA_RSTA2R_EXTEVNT2_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define HRTIM_TIMA_RSTA2R_EXTEVNT1          (0x1UL << 21) 
#define HRTIM_TIMA_RSTA2R_EXTEVNT1_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define HRTIM_TIMA_RSTA2R_TIMEVNT9          (0x1UL << 20) 
#define HRTIM_TIMA_RSTA2R_TIMEVNT9_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define HRTIM_TIMA_RSTA2R_TIMEVNT8          (0x1UL << 19) 
#define HRTIM_TIMA_RSTA2R_TIMEVNT8_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define HRTIM_TIMA_RSTA2R_TIMEVNT7          (0x1UL << 18) 
#define HRTIM_TIMA_RSTA2R_TIMEVNT7_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HRTIM_TIMA_RSTA2R_TIMEVNT6          (0x1UL << 17) 
#define HRTIM_TIMA_RSTA2R_TIMEVNT6_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HRTIM_TIMA_RSTA2R_TIMEVNT5          (0x1UL << 16) 
#define HRTIM_TIMA_RSTA2R_TIMEVNT5_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define HRTIM_TIMA_RSTA2R_TIMEVNT4          (0x1UL << 15) 
#define HRTIM_TIMA_RSTA2R_TIMEVNT4_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define HRTIM_TIMA_RSTA2R_TIMEVNT3          (0x1UL << 14) 
#define HRTIM_TIMA_RSTA2R_TIMEVNT3_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define HRTIM_TIMA_RSTA2R_TIMEVNT2          (0x1UL << 13) 
#define HRTIM_TIMA_RSTA2R_TIMEVNT2_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define HRTIM_TIMA_RSTA2R_TIMEVNT1          (0x1UL << 12) 
#define HRTIM_TIMA_RSTA2R_TIMEVNT1_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define HRTIM_TIMA_RSTA2R_MSTCMP4          (0x1UL << 11) 
#define HRTIM_TIMA_RSTA2R_MSTCMP4_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define HRTIM_TIMA_RSTA2R_MSTCMP3          (0x1UL << 10) 
#define HRTIM_TIMA_RSTA2R_MSTCMP3_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define HRTIM_TIMA_RSTA2R_MSTCMP2          (0x1UL << 9) 
#define HRTIM_TIMA_RSTA2R_MSTCMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HRTIM_TIMA_RSTA2R_MSTCMP1          (0x1UL << 8) 
#define HRTIM_TIMA_RSTA2R_MSTCMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HRTIM_TIMA_RSTA2R_MSTPER          (0x1UL << 7) 
#define HRTIM_TIMA_RSTA2R_MSTPER_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define HRTIM_TIMA_RSTA2R_CMP4          (0x1UL << 6) 
#define HRTIM_TIMA_RSTA2R_CMP4_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_TIMA_RSTA2R_CMP3          (0x1UL << 5) 
#define HRTIM_TIMA_RSTA2R_CMP3_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define HRTIM_TIMA_RSTA2R_CMP2          (0x1UL << 4) 
#define HRTIM_TIMA_RSTA2R_CMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_TIMA_RSTA2R_CMP1          (0x1UL << 3) 
#define HRTIM_TIMA_RSTA2R_CMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_TIMA_RSTA2R_PER          (0x1UL << 2) 
#define HRTIM_TIMA_RSTA2R_PER_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_TIMA_RSTA2R_RESYNC          (0x1UL << 1) 
#define HRTIM_TIMA_RSTA2R_RESYNC_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_TIMA_RSTA2R_SRT          (0x1UL << 0) 
#define HRTIM_TIMA_RSTA2R_SRT_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_TIMA_EEFAR1_EE5FLTR          (0xFUL << 25) 
#define HRTIM_TIMA_EEFAR1_EE5FLTR_VAL(X) (((uint32_t)(X) & 0xFUL) << 25)
#define HRTIM_TIMA_EEFAR1_EE5LTCH          (0x1UL << 24) 
#define HRTIM_TIMA_EEFAR1_EE5LTCH_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define HRTIM_TIMA_EEFAR1_EE4FLTR          (0xFUL << 19) 
#define HRTIM_TIMA_EEFAR1_EE4FLTR_VAL(X) (((uint32_t)(X) & 0xFUL) << 19)
#define HRTIM_TIMA_EEFAR1_EE4LTCH          (0x1UL << 18) 
#define HRTIM_TIMA_EEFAR1_EE4LTCH_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HRTIM_TIMA_EEFAR1_EE3FLTR          (0xFUL << 13) 
#define HRTIM_TIMA_EEFAR1_EE3FLTR_VAL(X) (((uint32_t)(X) & 0xFUL) << 13)
#define HRTIM_TIMA_EEFAR1_EE3LTCH          (0x1UL << 12) 
#define HRTIM_TIMA_EEFAR1_EE3LTCH_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define HRTIM_TIMA_EEFAR1_EE2FLTR          (0xFUL << 7) 
#define HRTIM_TIMA_EEFAR1_EE2FLTR_VAL(X) (((uint32_t)(X) & 0xFUL) << 7)
#define HRTIM_TIMA_EEFAR1_EE2LTCH          (0x1UL << 6) 
#define HRTIM_TIMA_EEFAR1_EE2LTCH_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_TIMA_EEFAR1_EE1FLTR          (0xFUL << 1) 
#define HRTIM_TIMA_EEFAR1_EE1FLTR_VAL(X) (((uint32_t)(X) & 0xFUL) << 1)
#define HRTIM_TIMA_EEFAR1_EE1LTCH          (0x1UL << 0) 
#define HRTIM_TIMA_EEFAR1_EE1LTCH_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_TIMA_EEFAR2_EE10FLTR          (0xFUL << 25) 
#define HRTIM_TIMA_EEFAR2_EE10FLTR_VAL(X) (((uint32_t)(X) & 0xFUL) << 25)
#define HRTIM_TIMA_EEFAR2_EE10LTCH          (0x1UL << 24) 
#define HRTIM_TIMA_EEFAR2_EE10LTCH_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define HRTIM_TIMA_EEFAR2_EE9FLTR          (0xFUL << 19) 
#define HRTIM_TIMA_EEFAR2_EE9FLTR_VAL(X) (((uint32_t)(X) & 0xFUL) << 19)
#define HRTIM_TIMA_EEFAR2_EE9LTCH          (0x1UL << 18) 
#define HRTIM_TIMA_EEFAR2_EE9LTCH_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HRTIM_TIMA_EEFAR2_EE8FLTR          (0xFUL << 13) 
#define HRTIM_TIMA_EEFAR2_EE8FLTR_VAL(X) (((uint32_t)(X) & 0xFUL) << 13)
#define HRTIM_TIMA_EEFAR2_EE8LTCH          (0x1UL << 12) 
#define HRTIM_TIMA_EEFAR2_EE8LTCH_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define HRTIM_TIMA_EEFAR2_EE7FLTR          (0xFUL << 7) 
#define HRTIM_TIMA_EEFAR2_EE7FLTR_VAL(X) (((uint32_t)(X) & 0xFUL) << 7)
#define HRTIM_TIMA_EEFAR2_EE7LTCH          (0x1UL << 6) 
#define HRTIM_TIMA_EEFAR2_EE7LTCH_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_TIMA_EEFAR2_EE6FLTR          (0xFUL << 1) 
#define HRTIM_TIMA_EEFAR2_EE6FLTR_VAL(X) (((uint32_t)(X) & 0xFUL) << 1)
#define HRTIM_TIMA_EEFAR2_EE6LTCH          (0x1UL << 0) 
#define HRTIM_TIMA_EEFAR2_EE6LTCH_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_TIMA_RSTAR_TIMECMP4          (0x1UL << 30) 
#define HRTIM_TIMA_RSTAR_TIMECMP4_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define HRTIM_TIMA_RSTAR_TIMECMP2          (0x1UL << 29) 
#define HRTIM_TIMA_RSTAR_TIMECMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define HRTIM_TIMA_RSTAR_TIMECMP1          (0x1UL << 28) 
#define HRTIM_TIMA_RSTAR_TIMECMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define HRTIM_TIMA_RSTAR_TIMDCMP4          (0x1UL << 27) 
#define HRTIM_TIMA_RSTAR_TIMDCMP4_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define HRTIM_TIMA_RSTAR_TIMDCMP2          (0x1UL << 26) 
#define HRTIM_TIMA_RSTAR_TIMDCMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define HRTIM_TIMA_RSTAR_TIMDCMP1          (0x1UL << 25) 
#define HRTIM_TIMA_RSTAR_TIMDCMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define HRTIM_TIMA_RSTAR_TIMCCMP4          (0x1UL << 24) 
#define HRTIM_TIMA_RSTAR_TIMCCMP4_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define HRTIM_TIMA_RSTAR_TIMCCMP2          (0x1UL << 23) 
#define HRTIM_TIMA_RSTAR_TIMCCMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define HRTIM_TIMA_RSTAR_TIMCCMP1          (0x1UL << 22) 
#define HRTIM_TIMA_RSTAR_TIMCCMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define HRTIM_TIMA_RSTAR_TIMBCMP4          (0x1UL << 21) 
#define HRTIM_TIMA_RSTAR_TIMBCMP4_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define HRTIM_TIMA_RSTAR_TIMBCMP2          (0x1UL << 20) 
#define HRTIM_TIMA_RSTAR_TIMBCMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define HRTIM_TIMA_RSTAR_TIMBCMP1          (0x1UL << 19) 
#define HRTIM_TIMA_RSTAR_TIMBCMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define HRTIM_TIMA_RSTAR_EXTEVNT10          (0x1UL << 18) 
#define HRTIM_TIMA_RSTAR_EXTEVNT10_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HRTIM_TIMA_RSTAR_EXTEVNT9          (0x1UL << 17) 
#define HRTIM_TIMA_RSTAR_EXTEVNT9_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HRTIM_TIMA_RSTAR_EXTEVNT8          (0x1UL << 16) 
#define HRTIM_TIMA_RSTAR_EXTEVNT8_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define HRTIM_TIMA_RSTAR_EXTEVNT7          (0x1UL << 15) 
#define HRTIM_TIMA_RSTAR_EXTEVNT7_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define HRTIM_TIMA_RSTAR_EXTEVNT6          (0x1UL << 14) 
#define HRTIM_TIMA_RSTAR_EXTEVNT6_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define HRTIM_TIMA_RSTAR_EXTEVNT5          (0x1UL << 13) 
#define HRTIM_TIMA_RSTAR_EXTEVNT5_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define HRTIM_TIMA_RSTAR_EXTEVNT4          (0x1UL << 12) 
#define HRTIM_TIMA_RSTAR_EXTEVNT4_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define HRTIM_TIMA_RSTAR_EXTEVNT3          (0x1UL << 11) 
#define HRTIM_TIMA_RSTAR_EXTEVNT3_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define HRTIM_TIMA_RSTAR_EXTEVNT2          (0x1UL << 10) 
#define HRTIM_TIMA_RSTAR_EXTEVNT2_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define HRTIM_TIMA_RSTAR_EXTEVNT1          (0x1UL << 9) 
#define HRTIM_TIMA_RSTAR_EXTEVNT1_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HRTIM_TIMA_RSTAR_MSTCMP4          (0x1UL << 8) 
#define HRTIM_TIMA_RSTAR_MSTCMP4_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HRTIM_TIMA_RSTAR_MSTCMP3          (0x1UL << 7) 
#define HRTIM_TIMA_RSTAR_MSTCMP3_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define HRTIM_TIMA_RSTAR_MSTCMP2          (0x1UL << 6) 
#define HRTIM_TIMA_RSTAR_MSTCMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_TIMA_RSTAR_MSTCMP1          (0x1UL << 5) 
#define HRTIM_TIMA_RSTAR_MSTCMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define HRTIM_TIMA_RSTAR_MSTPER          (0x1UL << 4) 
#define HRTIM_TIMA_RSTAR_MSTPER_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_TIMA_RSTAR_CMP4          (0x1UL << 3) 
#define HRTIM_TIMA_RSTAR_CMP4_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_TIMA_RSTAR_CMP2          (0x1UL << 2) 
#define HRTIM_TIMA_RSTAR_CMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_TIMA_RSTAR_UPDT          (0x1UL << 1) 
#define HRTIM_TIMA_RSTAR_UPDT_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_TIMA_CHPAR_STRTPW          (0xFUL << 7) 
#define HRTIM_TIMA_CHPAR_STRTPW_VAL(X) (((uint32_t)(X) & 0xFUL) << 7)
#define HRTIM_TIMA_CHPAR_CHPDTY          (0x7UL << 4) 
#define HRTIM_TIMA_CHPAR_CHPDTY_VAL(X) (((uint32_t)(X) & 0x7UL) << 4)
#define HRTIM_TIMA_CHPAR_CHPFRQ          (0xFUL << 0) 
#define HRTIM_TIMA_CHPAR_CHPFRQ_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define HRTIM_TIMA_CPT1ACR_TECMP2          (0x1UL << 31) 
#define HRTIM_TIMA_CPT1ACR_TECMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HRTIM_TIMA_CPT1ACR_TECMP1          (0x1UL << 30) 
#define HRTIM_TIMA_CPT1ACR_TECMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define HRTIM_TIMA_CPT1ACR_TE1RST          (0x1UL << 29) 
#define HRTIM_TIMA_CPT1ACR_TE1RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define HRTIM_TIMA_CPT1ACR_TE1SET          (0x1UL << 28) 
#define HRTIM_TIMA_CPT1ACR_TE1SET_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define HRTIM_TIMA_CPT1ACR_TDCMP2          (0x1UL << 27) 
#define HRTIM_TIMA_CPT1ACR_TDCMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define HRTIM_TIMA_CPT1ACR_TDCMP1          (0x1UL << 26) 
#define HRTIM_TIMA_CPT1ACR_TDCMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define HRTIM_TIMA_CPT1ACR_TD1RST          (0x1UL << 25) 
#define HRTIM_TIMA_CPT1ACR_TD1RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define HRTIM_TIMA_CPT1ACR_TD1SET          (0x1UL << 24) 
#define HRTIM_TIMA_CPT1ACR_TD1SET_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define HRTIM_TIMA_CPT1ACR_TCCMP2          (0x1UL << 23) 
#define HRTIM_TIMA_CPT1ACR_TCCMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define HRTIM_TIMA_CPT1ACR_TCCMP1          (0x1UL << 22) 
#define HRTIM_TIMA_CPT1ACR_TCCMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define HRTIM_TIMA_CPT1ACR_TC1RST          (0x1UL << 21) 
#define HRTIM_TIMA_CPT1ACR_TC1RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define HRTIM_TIMA_CPT1ACR_TC1SET          (0x1UL << 20) 
#define HRTIM_TIMA_CPT1ACR_TC1SET_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define HRTIM_TIMA_CPT1ACR_TBCMP2          (0x1UL << 19) 
#define HRTIM_TIMA_CPT1ACR_TBCMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define HRTIM_TIMA_CPT1ACR_TBCMP1          (0x1UL << 18) 
#define HRTIM_TIMA_CPT1ACR_TBCMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HRTIM_TIMA_CPT1ACR_TB1RST          (0x1UL << 17) 
#define HRTIM_TIMA_CPT1ACR_TB1RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HRTIM_TIMA_CPT1ACR_TB1SET          (0x1UL << 16) 
#define HRTIM_TIMA_CPT1ACR_TB1SET_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define HRTIM_TIMA_CPT1ACR_EXEV10CPT          (0x1UL << 11) 
#define HRTIM_TIMA_CPT1ACR_EXEV10CPT_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define HRTIM_TIMA_CPT1ACR_EXEV9CPT          (0x1UL << 10) 
#define HRTIM_TIMA_CPT1ACR_EXEV9CPT_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define HRTIM_TIMA_CPT1ACR_EXEV8CPT          (0x1UL << 9) 
#define HRTIM_TIMA_CPT1ACR_EXEV8CPT_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HRTIM_TIMA_CPT1ACR_EXEV7CPT          (0x1UL << 8) 
#define HRTIM_TIMA_CPT1ACR_EXEV7CPT_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HRTIM_TIMA_CPT1ACR_EXEV6CPT          (0x1UL << 7) 
#define HRTIM_TIMA_CPT1ACR_EXEV6CPT_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define HRTIM_TIMA_CPT1ACR_EXEV5CPT          (0x1UL << 6) 
#define HRTIM_TIMA_CPT1ACR_EXEV5CPT_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_TIMA_CPT1ACR_EXEV4CPT          (0x1UL << 5) 
#define HRTIM_TIMA_CPT1ACR_EXEV4CPT_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define HRTIM_TIMA_CPT1ACR_EXEV3CPT          (0x1UL << 4) 
#define HRTIM_TIMA_CPT1ACR_EXEV3CPT_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_TIMA_CPT1ACR_EXEV2CPT          (0x1UL << 3) 
#define HRTIM_TIMA_CPT1ACR_EXEV2CPT_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_TIMA_CPT1ACR_EXEV1CPT          (0x1UL << 2) 
#define HRTIM_TIMA_CPT1ACR_EXEV1CPT_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_TIMA_CPT1ACR_UDPCPT          (0x1UL << 1) 
#define HRTIM_TIMA_CPT1ACR_UDPCPT_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_TIMA_CPT1ACR_SWCPT          (0x1UL << 0) 
#define HRTIM_TIMA_CPT1ACR_SWCPT_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_TIMA_CPT2ACR_TECMP2          (0x1UL << 31) 
#define HRTIM_TIMA_CPT2ACR_TECMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HRTIM_TIMA_CPT2ACR_TECMP1          (0x1UL << 30) 
#define HRTIM_TIMA_CPT2ACR_TECMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define HRTIM_TIMA_CPT2ACR_TE1RST          (0x1UL << 29) 
#define HRTIM_TIMA_CPT2ACR_TE1RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define HRTIM_TIMA_CPT2ACR_TE1SET          (0x1UL << 28) 
#define HRTIM_TIMA_CPT2ACR_TE1SET_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define HRTIM_TIMA_CPT2ACR_TDCMP2          (0x1UL << 27) 
#define HRTIM_TIMA_CPT2ACR_TDCMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define HRTIM_TIMA_CPT2ACR_TDCMP1          (0x1UL << 26) 
#define HRTIM_TIMA_CPT2ACR_TDCMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define HRTIM_TIMA_CPT2ACR_TD1RST          (0x1UL << 25) 
#define HRTIM_TIMA_CPT2ACR_TD1RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define HRTIM_TIMA_CPT2ACR_TD1SET          (0x1UL << 24) 
#define HRTIM_TIMA_CPT2ACR_TD1SET_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define HRTIM_TIMA_CPT2ACR_TCCMP2          (0x1UL << 23) 
#define HRTIM_TIMA_CPT2ACR_TCCMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define HRTIM_TIMA_CPT2ACR_TCCMP1          (0x1UL << 22) 
#define HRTIM_TIMA_CPT2ACR_TCCMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define HRTIM_TIMA_CPT2ACR_TC1RST          (0x1UL << 21) 
#define HRTIM_TIMA_CPT2ACR_TC1RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define HRTIM_TIMA_CPT2ACR_TC1SET          (0x1UL << 20) 
#define HRTIM_TIMA_CPT2ACR_TC1SET_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define HRTIM_TIMA_CPT2ACR_TBCMP2          (0x1UL << 19) 
#define HRTIM_TIMA_CPT2ACR_TBCMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define HRTIM_TIMA_CPT2ACR_TBCMP1          (0x1UL << 18) 
#define HRTIM_TIMA_CPT2ACR_TBCMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HRTIM_TIMA_CPT2ACR_TB1RST          (0x1UL << 17) 
#define HRTIM_TIMA_CPT2ACR_TB1RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HRTIM_TIMA_CPT2ACR_TB1SET          (0x1UL << 16) 
#define HRTIM_TIMA_CPT2ACR_TB1SET_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define HRTIM_TIMA_CPT2ACR_EXEV10CPT          (0x1UL << 11) 
#define HRTIM_TIMA_CPT2ACR_EXEV10CPT_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define HRTIM_TIMA_CPT2ACR_EXEV9CPT          (0x1UL << 10) 
#define HRTIM_TIMA_CPT2ACR_EXEV9CPT_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define HRTIM_TIMA_CPT2ACR_EXEV8CPT          (0x1UL << 9) 
#define HRTIM_TIMA_CPT2ACR_EXEV8CPT_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HRTIM_TIMA_CPT2ACR_EXEV7CPT          (0x1UL << 8) 
#define HRTIM_TIMA_CPT2ACR_EXEV7CPT_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HRTIM_TIMA_CPT2ACR_EXEV6CPT          (0x1UL << 7) 
#define HRTIM_TIMA_CPT2ACR_EXEV6CPT_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define HRTIM_TIMA_CPT2ACR_EXEV5CPT          (0x1UL << 6) 
#define HRTIM_TIMA_CPT2ACR_EXEV5CPT_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_TIMA_CPT2ACR_EXEV4CPT          (0x1UL << 5) 
#define HRTIM_TIMA_CPT2ACR_EXEV4CPT_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define HRTIM_TIMA_CPT2ACR_EXEV3CPT          (0x1UL << 4) 
#define HRTIM_TIMA_CPT2ACR_EXEV3CPT_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_TIMA_CPT2ACR_EXEV2CPT          (0x1UL << 3) 
#define HRTIM_TIMA_CPT2ACR_EXEV2CPT_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_TIMA_CPT2ACR_EXEV1CPT          (0x1UL << 2) 
#define HRTIM_TIMA_CPT2ACR_EXEV1CPT_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_TIMA_CPT2ACR_UDPCPT          (0x1UL << 1) 
#define HRTIM_TIMA_CPT2ACR_UDPCPT_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_TIMA_CPT2ACR_SWCPT          (0x1UL << 0) 
#define HRTIM_TIMA_CPT2ACR_SWCPT_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_TIMA_OUTAR_DIDL2          (0x1UL << 23) 
#define HRTIM_TIMA_OUTAR_DIDL2_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define HRTIM_TIMA_OUTAR_CHP2          (0x1UL << 22) 
#define HRTIM_TIMA_OUTAR_CHP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define HRTIM_TIMA_OUTAR_FAULT2          (0x3UL << 20) 
#define HRTIM_TIMA_OUTAR_FAULT2_VAL(X) (((uint32_t)(X) & 0x3UL) << 20)
#define HRTIM_TIMA_OUTAR_IDLES2          (0x1UL << 19) 
#define HRTIM_TIMA_OUTAR_IDLES2_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define HRTIM_TIMA_OUTAR_IDLEM2          (0x1UL << 18) 
#define HRTIM_TIMA_OUTAR_IDLEM2_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HRTIM_TIMA_OUTAR_POL2          (0x1UL << 17) 
#define HRTIM_TIMA_OUTAR_POL2_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HRTIM_TIMA_OUTAR_DLYPRT          (0x7UL << 10) 
#define HRTIM_TIMA_OUTAR_DLYPRT_VAL(X) (((uint32_t)(X) & 0x7UL) << 10)
#define HRTIM_TIMA_OUTAR_DLYPRTEN          (0x1UL << 9) 
#define HRTIM_TIMA_OUTAR_DLYPRTEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HRTIM_TIMA_OUTAR_DTEN          (0x1UL << 8) 
#define HRTIM_TIMA_OUTAR_DTEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HRTIM_TIMA_OUTAR_DIDL1          (0x1UL << 7) 
#define HRTIM_TIMA_OUTAR_DIDL1_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define HRTIM_TIMA_OUTAR_CHP1          (0x1UL << 6) 
#define HRTIM_TIMA_OUTAR_CHP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_TIMA_OUTAR_FAULT1          (0x3UL << 4) 
#define HRTIM_TIMA_OUTAR_FAULT1_VAL(X) (((uint32_t)(X) & 0x3UL) << 4)
#define HRTIM_TIMA_OUTAR_IDLES1          (0x1UL << 3) 
#define HRTIM_TIMA_OUTAR_IDLES1_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_TIMA_OUTAR_IDLEM1          (0x1UL << 2) 
#define HRTIM_TIMA_OUTAR_IDLEM1_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_TIMA_OUTAR_POL1          (0x1UL << 1) 
#define HRTIM_TIMA_OUTAR_POL1_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_TIMA_FLTAR_FLTLCK          (0x1UL << 31) 
#define HRTIM_TIMA_FLTAR_FLTLCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HRTIM_TIMA_FLTAR_FLT5EN          (0x1UL << 4) 
#define HRTIM_TIMA_FLTAR_FLT5EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_TIMA_FLTAR_FLT4EN          (0x1UL << 3) 
#define HRTIM_TIMA_FLTAR_FLT4EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_TIMA_FLTAR_FLT3EN          (0x1UL << 2) 
#define HRTIM_TIMA_FLTAR_FLT3EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_TIMA_FLTAR_FLT2EN          (0x1UL << 1) 
#define HRTIM_TIMA_FLTAR_FLT2EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_TIMA_FLTAR_FLT1EN          (0x1UL << 0) 
#define HRTIM_TIMA_FLTAR_FLT1EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)

