via/viaems/src/platforms/stm32h743/device.h
#define HRTIM_TIMA  ((struct HRTIM_TIMA*)(0x40017480UL))
struct HRTIM_TIMB {
  volatile uint32_t TIMBCR;
  volatile const uint32_t TIMBISR;
  volatile uint32_t TIMBICR;
  volatile uint32_t TIMBDIER5;
  volatile uint32_t CNTR;
  volatile uint32_t PERBR;
  volatile uint32_t REPBR;
  volatile uint32_t CMP1BR;
  volatile uint32_t CMP1CBR;
  volatile uint32_t CMP2BR;
  volatile uint32_t CMP3BR;
  volatile uint32_t CMP4BR;
  volatile const uint32_t CPT1BR;
  volatile const uint32_t CPT2BR;
  volatile uint32_t DTBR;
  volatile uint32_t SETB1R;
  volatile uint32_t RSTB1R;
  volatile uint32_t SETB2R;
  volatile uint32_t RSTB2R;
  volatile uint32_t EEFBR1;
  volatile uint32_t EEFBR2;
  volatile uint32_t RSTBR;
  volatile uint32_t CHPBR;
  volatile uint32_t CPT1BCR;
  volatile uint32_t CPT2BCR;
  volatile uint32_t OUTBR;
  volatile uint32_t FLTBR;
};
#define HRTIM_TIMB_TIMBCR_UPDGAT          (0xFUL << 28) 
#define HRTIM_TIMB_TIMBCR_UPDGAT_VAL(X) (((uint32_t)(X) & 0xFUL) << 28)
#define HRTIM_TIMB_TIMBCR_PREEN          (0x1UL << 27) 
#define HRTIM_TIMB_TIMBCR_PREEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define HRTIM_TIMB_TIMBCR_DACSYNC          (0x3UL << 25) 
#define HRTIM_TIMB_TIMBCR_DACSYNC_VAL(X) (((uint32_t)(X) & 0x3UL) << 25)
#define HRTIM_TIMB_TIMBCR_MSTU          (0x1UL << 24) 
#define HRTIM_TIMB_TIMBCR_MSTU_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define HRTIM_TIMB_TIMBCR_TEU          (0x1UL << 23) 
#define HRTIM_TIMB_TIMBCR_TEU_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define HRTIM_TIMB_TIMBCR_TDU          (0x1UL << 22) 
#define HRTIM_TIMB_TIMBCR_TDU_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define HRTIM_TIMB_TIMBCR_TCU          (0x1UL << 21) 
#define HRTIM_TIMB_TIMBCR_TCU_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define HRTIM_TIMB_TIMBCR_TBU          (0x1UL << 20) 
#define HRTIM_TIMB_TIMBCR_TBU_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define HRTIM_TIMB_TIMBCR_TxRSTU          (0x1UL << 18) 
#define HRTIM_TIMB_TIMBCR_TxRSTU_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HRTIM_TIMB_TIMBCR_TxREPU          (0x1UL << 17) 
#define HRTIM_TIMB_TIMBCR_TxREPU_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HRTIM_TIMB_TIMBCR_DELCMP4          (0x3UL << 14) 
#define HRTIM_TIMB_TIMBCR_DELCMP4_VAL(X) (((uint32_t)(X) & 0x3UL) << 14)
#define HRTIM_TIMB_TIMBCR_DELCMP2          (0x3UL << 12) 
#define HRTIM_TIMB_TIMBCR_DELCMP2_VAL(X) (((uint32_t)(X) & 0x3UL) << 12)
#define HRTIM_TIMB_TIMBCR_SYNCSTRTx          (0x1UL << 11) 
#define HRTIM_TIMB_TIMBCR_SYNCSTRTx_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define HRTIM_TIMB_TIMBCR_SYNCRSTx          (0x1UL << 10) 
#define HRTIM_TIMB_TIMBCR_SYNCRSTx_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define HRTIM_TIMB_TIMBCR_PSHPLL          (0x1UL << 6) 
#define HRTIM_TIMB_TIMBCR_PSHPLL_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_TIMB_TIMBCR_HALF          (0x1UL << 5) 
#define HRTIM_TIMB_TIMBCR_HALF_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define HRTIM_TIMB_TIMBCR_RETRIG          (0x1UL << 4) 
#define HRTIM_TIMB_TIMBCR_RETRIG_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_TIMB_TIMBCR_CONT          (0x1UL << 3) 
#define HRTIM_TIMB_TIMBCR_CONT_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_TIMB_TIMBCR_CK_PSCx          (0x7UL << 0) 
#define HRTIM_TIMB_TIMBCR_CK_PSCx_VAL(X) (((uint32_t)(X) & 0x7UL) << 0)
#define HRTIM_TIMB_TIMBISR_O2STAT          (0x1UL << 19) 
#define HRTIM_TIMB_TIMBISR_O2STAT_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define HRTIM_TIMB_TIMBISR_O1STAT          (0x1UL << 18) 
#define HRTIM_TIMB_TIMBISR_O1STAT_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HRTIM_TIMB_TIMBISR_IPPSTAT          (0x1UL << 17) 
#define HRTIM_TIMB_TIMBISR_IPPSTAT_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HRTIM_TIMB_TIMBISR_CPPSTAT          (0x1UL << 16) 
#define HRTIM_TIMB_TIMBISR_CPPSTAT_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define HRTIM_TIMB_TIMBISR_DLYPRT          (0x1UL << 14) 
#define HRTIM_TIMB_TIMBISR_DLYPRT_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define HRTIM_TIMB_TIMBISR_RST          (0x1UL << 13) 
#define HRTIM_TIMB_TIMBISR_RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define HRTIM_TIMB_TIMBISR_RSTx2          (0x1UL << 12) 
#define HRTIM_TIMB_TIMBISR_RSTx2_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define HRTIM_TIMB_TIMBISR_SETx2          (0x1UL << 11) 
#define HRTIM_TIMB_TIMBISR_SETx2_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define HRTIM_TIMB_TIMBISR_RSTx1          (0x1UL << 10) 
#define HRTIM_TIMB_TIMBISR_RSTx1_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define HRTIM_TIMB_TIMBISR_SETx1          (0x1UL << 9) 
#define HRTIM_TIMB_TIMBISR_SETx1_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HRTIM_TIMB_TIMBISR_CPT2          (0x1UL << 8) 
#define HRTIM_TIMB_TIMBISR_CPT2_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HRTIM_TIMB_TIMBISR_CPT1          (0x1UL << 7) 
#define HRTIM_TIMB_TIMBISR_CPT1_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define HRTIM_TIMB_TIMBISR_UPD          (0x1UL << 6) 
#define HRTIM_TIMB_TIMBISR_UPD_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_TIMB_TIMBISR_REP          (0x1UL << 4) 
#define HRTIM_TIMB_TIMBISR_REP_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_TIMB_TIMBISR_CMP4          (0x1UL << 3) 
#define HRTIM_TIMB_TIMBISR_CMP4_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_TIMB_TIMBISR_CMP3          (0x1UL << 2) 
#define HRTIM_TIMB_TIMBISR_CMP3_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_TIMB_TIMBISR_CMP2          (0x1UL << 1) 
#define HRTIM_TIMB_TIMBISR_CMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_TIMB_TIMBISR_CMP1          (0x1UL << 0) 
#define HRTIM_TIMB_TIMBISR_CMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_TIMB_TIMBICR_DLYPRTC          (0x1UL << 14) 
#define HRTIM_TIMB_TIMBICR_DLYPRTC_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define HRTIM_TIMB_TIMBICR_RSTC          (0x1UL << 13) 
#define HRTIM_TIMB_TIMBICR_RSTC_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define HRTIM_TIMB_TIMBICR_RSTx2C          (0x1UL << 12) 
#define HRTIM_TIMB_TIMBICR_RSTx2C_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define HRTIM_TIMB_TIMBICR_SET2xC          (0x1UL << 11) 
#define HRTIM_TIMB_TIMBICR_SET2xC_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define HRTIM_TIMB_TIMBICR_RSTx1C          (0x1UL << 10) 
#define HRTIM_TIMB_TIMBICR_RSTx1C_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define HRTIM_TIMB_TIMBICR_SET1xC          (0x1UL << 9) 
#define HRTIM_TIMB_TIMBICR_SET1xC_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HRTIM_TIMB_TIMBICR_CPT2C          (0x1UL << 8) 
#define HRTIM_TIMB_TIMBICR_CPT2C_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HRTIM_TIMB_TIMBICR_CPT1C          (0x1UL << 7) 
#define HRTIM_TIMB_TIMBICR_CPT1C_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define HRTIM_TIMB_TIMBICR_UPDC          (0x1UL << 6) 
#define HRTIM_TIMB_TIMBICR_UPDC_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_TIMB_TIMBICR_REPC          (0x1UL << 4) 
#define HRTIM_TIMB_TIMBICR_REPC_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_TIMB_TIMBICR_CMP4C          (0x1UL << 3) 
#define HRTIM_TIMB_TIMBICR_CMP4C_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_TIMB_TIMBICR_CMP3C          (0x1UL << 2) 
#define HRTIM_TIMB_TIMBICR_CMP3C_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_TIMB_TIMBICR_CMP2C          (0x1UL << 1) 
#define HRTIM_TIMB_TIMBICR_CMP2C_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_TIMB_TIMBICR_CMP1C          (0x1UL << 0) 
#define HRTIM_TIMB_TIMBICR_CMP1C_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_TIMB_TIMBDIER5_DLYPRTDE          (0x1UL << 30) 
#define HRTIM_TIMB_TIMBDIER5_DLYPRTDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define HRTIM_TIMB_TIMBDIER5_RSTDE          (0x1UL << 29) 
#define HRTIM_TIMB_TIMBDIER5_RSTDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define HRTIM_TIMB_TIMBDIER5_RSTx2DE          (0x1UL << 28) 
#define HRTIM_TIMB_TIMBDIER5_RSTx2DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define HRTIM_TIMB_TIMBDIER5_SETx2DE          (0x1UL << 27) 
#define HRTIM_TIMB_TIMBDIER5_SETx2DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define HRTIM_TIMB_TIMBDIER5_RSTx1DE          (0x1UL << 26) 
#define HRTIM_TIMB_TIMBDIER5_RSTx1DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define HRTIM_TIMB_TIMBDIER5_SET1xDE          (0x1UL << 25) 
#define HRTIM_TIMB_TIMBDIER5_SET1xDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define HRTIM_TIMB_TIMBDIER5_CPT2DE          (0x1UL << 24) 
#define HRTIM_TIMB_TIMBDIER5_CPT2DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define HRTIM_TIMB_TIMBDIER5_CPT1DE          (0x1UL << 23) 
#define HRTIM_TIMB_TIMBDIER5_CPT1DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define HRTIM_TIMB_TIMBDIER5_UPDDE          (0x1UL << 22) 
#define HRTIM_TIMB_TIMBDIER5_UPDDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define HRTIM_TIMB_TIMBDIER5_REPDE          (0x1UL << 20) 
#define HRTIM_TIMB_TIMBDIER5_REPDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define HRTIM_TIMB_TIMBDIER5_CMP4DE          (0x1UL << 19) 
#define HRTIM_TIMB_TIMBDIER5_CMP4DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define HRTIM_TIMB_TIMBDIER5_CMP3DE          (0x1UL << 18) 
#define HRTIM_TIMB_TIMBDIER5_CMP3DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HRTIM_TIMB_TIMBDIER5_CMP2DE          (0x1UL << 17) 
#define HRTIM_TIMB_TIMBDIER5_CMP2DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HRTIM_TIMB_TIMBDIER5_CMP1DE          (0x1UL << 16) 
#define HRTIM_TIMB_TIMBDIER5_CMP1DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define HRTIM_TIMB_TIMBDIER5_DLYPRTIE          (0x1UL << 14) 
#define HRTIM_TIMB_TIMBDIER5_DLYPRTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define HRTIM_TIMB_TIMBDIER5_RSTIE          (0x1UL << 13) 
#define HRTIM_TIMB_TIMBDIER5_RSTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define HRTIM_TIMB_TIMBDIER5_RSTx2IE          (0x1UL << 12) 
#define HRTIM_TIMB_TIMBDIER5_RSTx2IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define HRTIM_TIMB_TIMBDIER5_SETx2IE          (0x1UL << 11) 
#define HRTIM_TIMB_TIMBDIER5_SETx2IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define HRTIM_TIMB_TIMBDIER5_RSTx1IE          (0x1UL << 10) 
#define HRTIM_TIMB_TIMBDIER5_RSTx1IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define HRTIM_TIMB_TIMBDIER5_SET1xIE          (0x1UL << 9) 
#define HRTIM_TIMB_TIMBDIER5_SET1xIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HRTIM_TIMB_TIMBDIER5_CPT2IE          (0x1UL << 8) 
#define HRTIM_TIMB_TIMBDIER5_CPT2IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HRTIM_TIMB_TIMBDIER5_CPT1IE          (0x1UL << 7) 
#define HRTIM_TIMB_TIMBDIER5_CPT1IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define HRTIM_TIMB_TIMBDIER5_UPDIE          (0x1UL << 6) 
#define HRTIM_TIMB_TIMBDIER5_UPDIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_TIMB_TIMBDIER5_REPIE          (0x1UL << 4) 
#define HRTIM_TIMB_TIMBDIER5_REPIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_TIMB_TIMBDIER5_CMP4IE          (0x1UL << 3) 
#define HRTIM_TIMB_TIMBDIER5_CMP4IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_TIMB_TIMBDIER5_CMP3IE          (0x1UL << 2) 
#define HRTIM_TIMB_TIMBDIER5_CMP3IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_TIMB_TIMBDIER5_CMP2IE          (0x1UL << 1) 
#define HRTIM_TIMB_TIMBDIER5_CMP2IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_TIMB_TIMBDIER5_CMP1IE          (0x1UL << 0) 
#define HRTIM_TIMB_TIMBDIER5_CMP1IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_TIMB_CNTR_CNTx          (0xFFFFUL << 0) 
#define HRTIM_TIMB_CNTR_CNTx_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define HRTIM_TIMB_PERBR_PERx          (0xFFFFUL << 0) 
#define HRTIM_TIMB_PERBR_PERx_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define HRTIM_TIMB_REPBR_REPx          (0xFFUL << 0) 
#define HRTIM_TIMB_REPBR_REPx_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HRTIM_TIMB_CMP1BR_CMP1x          (0xFFFFUL << 0) 
#define HRTIM_TIMB_CMP1BR_CMP1x_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define HRTIM_TIMB_CMP1CBR_REPx          (0xFFUL << 16) 
#define HRTIM_TIMB_CMP1CBR_REPx_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define HRTIM_TIMB_CMP1CBR_CMP1x          (0xFFFFUL << 0) 
#define HRTIM_TIMB_CMP1CBR_CMP1x_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define HRTIM_TIMB_CMP2BR_CMP2x          (0xFFFFUL << 0) 
#define HRTIM_TIMB_CMP2BR_CMP2x_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define HRTIM_TIMB_CMP3BR_CMP3x          (0xFFFFUL << 0) 
#define HRTIM_TIMB_CMP3BR_CMP3x_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define HRTIM_TIMB_CMP4BR_CMP4x          (0xFFFFUL << 0) 
#define HRTIM_TIMB_CMP4BR_CMP4x_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define HRTIM_TIMB_CPT1BR_CPT1x          (0xFFFFUL << 0) 
#define HRTIM_TIMB_CPT1BR_CPT1x_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define HRTIM_TIMB_CPT2BR_CPT2x          (0xFFFFUL << 0) 
#define HRTIM_TIMB_CPT2BR_CPT2x_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define HRTIM_TIMB_DTBR_DTFLKx          (0x1UL << 31) 
#define HRTIM_TIMB_DTBR_DTFLKx_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HRTIM_TIMB_DTBR_DTFSLKx          (0x1UL << 30) 
#define HRTIM_TIMB_DTBR_DTFSLKx_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define HRTIM_TIMB_DTBR_SDTFx          (0x1UL << 25) 
#define HRTIM_TIMB_DTBR_SDTFx_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define HRTIM_TIMB_DTBR_DTFx          (0x1FFUL << 16) 
#define HRTIM_TIMB_DTBR_DTFx_VAL(X) (((uint32_t)(X) & 0x1FFUL) << 16)
#define HRTIM_TIMB_DTBR_DTRLKx          (0x1UL << 15) 
#define HRTIM_TIMB_DTBR_DTRLKx_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define HRTIM_TIMB_DTBR_DTRSLKx          (0x1UL << 14) 
#define HRTIM_TIMB_DTBR_DTRSLKx_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define HRTIM_TIMB_DTBR_DTPRSC          (0x7UL << 10) 
#define HRTIM_TIMB_DTBR_DTPRSC_VAL(X) (((uint32_t)(X) & 0x7UL) << 10)
#define HRTIM_TIMB_DTBR_SDTRx          (0x1UL << 9) 
#define HRTIM_TIMB_DTBR_SDTRx_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HRTIM_TIMB_DTBR_DTRx          (0x1FFUL << 0) 
#define HRTIM_TIMB_DTBR_DTRx_VAL(X) (((uint32_t)(X) & 0x1FFUL) << 0)
#define HRTIM_TIMB_SETB1R_UPDATE          (0x1UL << 31) 
#define HRTIM_TIMB_SETB1R_UPDATE_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HRTIM_TIMB_SETB1R_EXTEVNT10          (0x1UL << 30) 
#define HRTIM_TIMB_SETB1R_EXTEVNT10_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define HRTIM_TIMB_SETB1R_EXTEVNT9          (0x1UL << 29) 
#define HRTIM_TIMB_SETB1R_EXTEVNT9_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define HRTIM_TIMB_SETB1R_EXTEVNT8          (0x1UL << 28) 
#define HRTIM_TIMB_SETB1R_EXTEVNT8_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define HRTIM_TIMB_SETB1R_EXTEVNT7          (0x1UL << 27) 
#define HRTIM_TIMB_SETB1R_EXTEVNT7_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define HRTIM_TIMB_SETB1R_EXTEVNT6          (0x1UL << 26) 
#define HRTIM_TIMB_SETB1R_EXTEVNT6_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define HRTIM_TIMB_SETB1R_EXTEVNT5          (0x1UL << 25) 
#define HRTIM_TIMB_SETB1R_EXTEVNT5_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define HRTIM_TIMB_SETB1R_EXTEVNT4          (0x1UL << 24) 
#define HRTIM_TIMB_SETB1R_EXTEVNT4_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define HRTIM_TIMB_SETB1R_EXTEVNT3          (0x1UL << 23) 
#define HRTIM_TIMB_SETB1R_EXTEVNT3_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define HRTIM_TIMB_SETB1R_EXTEVNT2          (0x1UL << 22) 
#define HRTIM_TIMB_SETB1R_EXTEVNT2_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define HRTIM_TIMB_SETB1R_EXTEVNT1          (0x1UL << 21) 
#define HRTIM_TIMB_SETB1R_EXTEVNT1_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define HRTIM_TIMB_SETB1R_TIMEVNT9          (0x1UL << 20) 
#define HRTIM_TIMB_SETB1R_TIMEVNT9_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define HRTIM_TIMB_SETB1R_TIMEVNT8          (0x1UL << 19) 
#define HRTIM_TIMB_SETB1R_TIMEVNT8_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define HRTIM_TIMB_SETB1R_TIMEVNT7          (0x1UL << 18) 
#define HRTIM_TIMB_SETB1R_TIMEVNT7_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HRTIM_TIMB_SETB1R_TIMEVNT6          (0x1UL << 17) 
#define HRTIM_TIMB_SETB1R_TIMEVNT6_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HRTIM_TIMB_SETB1R_TIMEVNT5          (0x1UL << 16) 
#define HRTIM_TIMB_SETB1R_TIMEVNT5_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define HRTIM_TIMB_SETB1R_TIMEVNT4          (0x1UL << 15) 
#define HRTIM_TIMB_SETB1R_TIMEVNT4_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define HRTIM_TIMB_SETB1R_TIMEVNT3          (0x1UL << 14) 
#define HRTIM_TIMB_SETB1R_TIMEVNT3_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define HRTIM_TIMB_SETB1R_TIMEVNT2          (0x1UL << 13) 
#define HRTIM_TIMB_SETB1R_TIMEVNT2_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define HRTIM_TIMB_SETB1R_TIMEVNT1          (0x1UL << 12) 
#define HRTIM_TIMB_SETB1R_TIMEVNT1_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define HRTIM_TIMB_SETB1R_MSTCMP4          (0x1UL << 11) 
#define HRTIM_TIMB_SETB1R_MSTCMP4_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define HRTIM_TIMB_SETB1R_MSTCMP3          (0x1UL << 10) 
#define HRTIM_TIMB_SETB1R_MSTCMP3_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define HRTIM_TIMB_SETB1R_MSTCMP2          (0x1UL << 9) 
#define HRTIM_TIMB_SETB1R_MSTCMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HRTIM_TIMB_SETB1R_MSTCMP1          (0x1UL << 8) 
#define HRTIM_TIMB_SETB1R_MSTCMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HRTIM_TIMB_SETB1R_MSTPER          (0x1UL << 7) 
#define HRTIM_TIMB_SETB1R_MSTPER_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define HRTIM_TIMB_SETB1R_CMP4          (0x1UL << 6) 
#define HRTIM_TIMB_SETB1R_CMP4_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_TIMB_SETB1R_CMP3          (0x1UL << 5) 
#define HRTIM_TIMB_SETB1R_CMP3_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define HRTIM_TIMB_SETB1R_CMP2          (0x1UL << 4) 
#define HRTIM_TIMB_SETB1R_CMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_TIMB_SETB1R_CMP1          (0x1UL << 3) 
#define HRTIM_TIMB_SETB1R_CMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_TIMB_SETB1R_PER          (0x1UL << 2) 
#define HRTIM_TIMB_SETB1R_PER_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_TIMB_SETB1R_RESYNC          (0x1UL << 1) 
#define HRTIM_TIMB_SETB1R_RESYNC_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_TIMB_SETB1R_SST          (0x1UL << 0) 
#define HRTIM_TIMB_SETB1R_SST_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_TIMB_RSTB1R_UPDATE          (0x1UL << 31) 
#define HRTIM_TIMB_RSTB1R_UPDATE_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HRTIM_TIMB_RSTB1R_EXTEVNT10          (0x1UL << 30) 
#define HRTIM_TIMB_RSTB1R_EXTEVNT10_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define HRTIM_TIMB_RSTB1R_EXTEVNT9          (0x1UL << 29) 
#define HRTIM_TIMB_RSTB1R_EXTEVNT9_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define HRTIM_TIMB_RSTB1R_EXTEVNT8          (0x1UL << 28) 
#define HRTIM_TIMB_RSTB1R_EXTEVNT8_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define HRTIM_TIMB_RSTB1R_EXTEVNT7          (0x1UL << 27) 
#define HRTIM_TIMB_RSTB1R_EXTEVNT7_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define HRTIM_TIMB_RSTB1R_EXTEVNT6          (0x1UL << 26) 
#define HRTIM_TIMB_RSTB1R_EXTEVNT6_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define HRTIM_TIMB_RSTB1R_EXTEVNT5          (0x1UL << 25) 
#define HRTIM_TIMB_RSTB1R_EXTEVNT5_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define HRTIM_TIMB_RSTB1R_EXTEVNT4          (0x1UL << 24) 
#define HRTIM_TIMB_RSTB1R_EXTEVNT4_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define HRTIM_TIMB_RSTB1R_EXTEVNT3          (0x1UL << 23) 
#define HRTIM_TIMB_RSTB1R_EXTEVNT3_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define HRTIM_TIMB_RSTB1R_EXTEVNT2          (0x1UL << 22) 
#define HRTIM_TIMB_RSTB1R_EXTEVNT2_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define HRTIM_TIMB_RSTB1R_EXTEVNT1          (0x1UL << 21) 
#define HRTIM_TIMB_RSTB1R_EXTEVNT1_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define HRTIM_TIMB_RSTB1R_TIMEVNT9          (0x1UL << 20) 
#define HRTIM_TIMB_RSTB1R_TIMEVNT9_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define HRTIM_TIMB_RSTB1R_TIMEVNT8          (0x1UL << 19) 
#define HRTIM_TIMB_RSTB1R_TIMEVNT8_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define HRTIM_TIMB_RSTB1R_TIMEVNT7          (0x1UL << 18) 
#define HRTIM_TIMB_RSTB1R_TIMEVNT7_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HRTIM_TIMB_RSTB1R_TIMEVNT6          (0x1UL << 17) 
#define HRTIM_TIMB_RSTB1R_TIMEVNT6_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HRTIM_TIMB_RSTB1R_TIMEVNT5          (0x1UL << 16) 
#define HRTIM_TIMB_RSTB1R_TIMEVNT5_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define HRTIM_TIMB_RSTB1R_TIMEVNT4          (0x1UL << 15) 
#define HRTIM_TIMB_RSTB1R_TIMEVNT4_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define HRTIM_TIMB_RSTB1R_TIMEVNT3          (0x1UL << 14) 
#define HRTIM_TIMB_RSTB1R_TIMEVNT3_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define HRTIM_TIMB_RSTB1R_TIMEVNT2          (0x1UL << 13) 
#define HRTIM_TIMB_RSTB1R_TIMEVNT2_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define HRTIM_TIMB_RSTB1R_TIMEVNT1          (0x1UL << 12) 
#define HRTIM_TIMB_RSTB1R_TIMEVNT1_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define HRTIM_TIMB_RSTB1R_MSTCMP4          (0x1UL << 11) 
#define HRTIM_TIMB_RSTB1R_MSTCMP4_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define HRTIM_TIMB_RSTB1R_MSTCMP3          (0x1UL << 10) 
#define HRTIM_TIMB_RSTB1R_MSTCMP3_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define HRTIM_TIMB_RSTB1R_MSTCMP2          (0x1UL << 9) 
#define HRTIM_TIMB_RSTB1R_MSTCMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HRTIM_TIMB_RSTB1R_MSTCMP1          (0x1UL << 8) 
#define HRTIM_TIMB_RSTB1R_MSTCMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HRTIM_TIMB_RSTB1R_MSTPER          (0x1UL << 7) 
#define HRTIM_TIMB_RSTB1R_MSTPER_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define HRTIM_TIMB_RSTB1R_CMP4          (0x1UL << 6) 
#define HRTIM_TIMB_RSTB1R_CMP4_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_TIMB_RSTB1R_CMP3          (0x1UL << 5) 
#define HRTIM_TIMB_RSTB1R_CMP3_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define HRTIM_TIMB_RSTB1R_CMP2          (0x1UL << 4) 
#define HRTIM_TIMB_RSTB1R_CMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_TIMB_RSTB1R_CMP1          (0x1UL << 3) 
#define HRTIM_TIMB_RSTB1R_CMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_TIMB_RSTB1R_PER          (0x1UL << 2) 
#define HRTIM_TIMB_RSTB1R_PER_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_TIMB_RSTB1R_RESYNC          (0x1UL << 1) 
#define HRTIM_TIMB_RSTB1R_RESYNC_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_TIMB_RSTB1R_SRT          (0x1UL << 0) 
#define HRTIM_TIMB_RSTB1R_SRT_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_TIMB_SETB2R_UPDATE          (0x1UL << 31) 
#define HRTIM_TIMB_SETB2R_UPDATE_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HRTIM_TIMB_SETB2R_EXTEVNT10          (0x1UL << 30) 
#define HRTIM_TIMB_SETB2R_EXTEVNT10_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define HRTIM_TIMB_SETB2R_EXTEVNT9          (0x1UL << 29) 
#define HRTIM_TIMB_SETB2R_EXTEVNT9_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define HRTIM_TIMB_SETB2R_EXTEVNT8          (0x1UL << 28) 
#define HRTIM_TIMB_SETB2R_EXTEVNT8_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define HRTIM_TIMB_SETB2R_EXTEVNT7          (0x1UL << 27) 
#define HRTIM_TIMB_SETB2R_EXTEVNT7_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define HRTIM_TIMB_SETB2R_EXTEVNT6          (0x1UL << 26) 
#define HRTIM_TIMB_SETB2R_EXTEVNT6_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define HRTIM_TIMB_SETB2R_EXTEVNT5          (0x1UL << 25) 
#define HRTIM_TIMB_SETB2R_EXTEVNT5_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define HRTIM_TIMB_SETB2R_EXTEVNT4          (0x1UL << 24) 
#define HRTIM_TIMB_SETB2R_EXTEVNT4_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define HRTIM_TIMB_SETB2R_EXTEVNT3          (0x1UL << 23) 
#define HRTIM_TIMB_SETB2R_EXTEVNT3_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define HRTIM_TIMB_SETB2R_EXTEVNT2          (0x1UL << 22) 
#define HRTIM_TIMB_SETB2R_EXTEVNT2_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define HRTIM_TIMB_SETB2R_EXTEVNT1          (0x1UL << 21) 
#define HRTIM_TIMB_SETB2R_EXTEVNT1_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define HRTIM_TIMB_SETB2R_TIMEVNT9          (0x1UL << 20) 
#define HRTIM_TIMB_SETB2R_TIMEVNT9_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define HRTIM_TIMB_SETB2R_TIMEVNT8          (0x1UL << 19) 
#define HRTIM_TIMB_SETB2R_TIMEVNT8_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define HRTIM_TIMB_SETB2R_TIMEVNT7          (0x1UL << 18) 
#define HRTIM_TIMB_SETB2R_TIMEVNT7_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HRTIM_TIMB_SETB2R_TIMEVNT6          (0x1UL << 17) 
