via/viaems/src/platforms/stm32h743/device.h
#define HRTIM_TIMB  ((struct HRTIM_TIMB*)(0x40017500UL))
struct HRTIM_TIMC {
  volatile uint32_t TIMCCR;
  volatile const uint32_t TIMCISR;
  volatile uint32_t TIMCICR;
  volatile uint32_t TIMCDIER5;
  volatile uint32_t CNTCR;
  volatile uint32_t PERCR;
  volatile uint32_t REPCR;
  volatile uint32_t CMP1CR;
  volatile uint32_t CMP1CCR;
  volatile uint32_t CMP2CR;
  volatile uint32_t CMP3CR;
  volatile uint32_t CMP4CR;
  volatile const uint32_t CPT1CR;
  volatile const uint32_t CPT2CR;
  volatile uint32_t DTCR;
  volatile uint32_t SETC1R;
  volatile uint32_t RSTC1R;
  volatile uint32_t SETC2R;
  volatile uint32_t RSTC2R;
  volatile uint32_t EEFCR1;
  volatile uint32_t EEFCR2;
  volatile uint32_t RSTCR;
  volatile uint32_t CHPCR;
  volatile uint32_t CPT1CCR;
  volatile uint32_t CPT2CCR;
  volatile uint32_t OUTCR;
  volatile uint32_t FLTCR;
};
#define HRTIM_TIMC_TIMCCR_UPDGAT          (0xFUL << 28) 
#define HRTIM_TIMC_TIMCCR_UPDGAT_VAL(X) (((uint32_t)(X) & 0xFUL) << 28)
#define HRTIM_TIMC_TIMCCR_PREEN          (0x1UL << 27) 
#define HRTIM_TIMC_TIMCCR_PREEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define HRTIM_TIMC_TIMCCR_DACSYNC          (0x3UL << 25) 
#define HRTIM_TIMC_TIMCCR_DACSYNC_VAL(X) (((uint32_t)(X) & 0x3UL) << 25)
#define HRTIM_TIMC_TIMCCR_MSTU          (0x1UL << 24) 
#define HRTIM_TIMC_TIMCCR_MSTU_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define HRTIM_TIMC_TIMCCR_TEU          (0x1UL << 23) 
#define HRTIM_TIMC_TIMCCR_TEU_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define HRTIM_TIMC_TIMCCR_TDU          (0x1UL << 22) 
#define HRTIM_TIMC_TIMCCR_TDU_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define HRTIM_TIMC_TIMCCR_TCU          (0x1UL << 21) 
#define HRTIM_TIMC_TIMCCR_TCU_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define HRTIM_TIMC_TIMCCR_TBU          (0x1UL << 20) 
#define HRTIM_TIMC_TIMCCR_TBU_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define HRTIM_TIMC_TIMCCR_TxRSTU          (0x1UL << 18) 
#define HRTIM_TIMC_TIMCCR_TxRSTU_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HRTIM_TIMC_TIMCCR_TxREPU          (0x1UL << 17) 
#define HRTIM_TIMC_TIMCCR_TxREPU_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HRTIM_TIMC_TIMCCR_DELCMP4          (0x3UL << 14) 
#define HRTIM_TIMC_TIMCCR_DELCMP4_VAL(X) (((uint32_t)(X) & 0x3UL) << 14)
#define HRTIM_TIMC_TIMCCR_DELCMP2          (0x3UL << 12) 
#define HRTIM_TIMC_TIMCCR_DELCMP2_VAL(X) (((uint32_t)(X) & 0x3UL) << 12)
#define HRTIM_TIMC_TIMCCR_SYNCSTRTx          (0x1UL << 11) 
#define HRTIM_TIMC_TIMCCR_SYNCSTRTx_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define HRTIM_TIMC_TIMCCR_SYNCRSTx          (0x1UL << 10) 
#define HRTIM_TIMC_TIMCCR_SYNCRSTx_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define HRTIM_TIMC_TIMCCR_PSHPLL          (0x1UL << 6) 
#define HRTIM_TIMC_TIMCCR_PSHPLL_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_TIMC_TIMCCR_HALF          (0x1UL << 5) 
#define HRTIM_TIMC_TIMCCR_HALF_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define HRTIM_TIMC_TIMCCR_RETRIG          (0x1UL << 4) 
#define HRTIM_TIMC_TIMCCR_RETRIG_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_TIMC_TIMCCR_CONT          (0x1UL << 3) 
#define HRTIM_TIMC_TIMCCR_CONT_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_TIMC_TIMCCR_CK_PSCx          (0x7UL << 0) 
#define HRTIM_TIMC_TIMCCR_CK_PSCx_VAL(X) (((uint32_t)(X) & 0x7UL) << 0)
#define HRTIM_TIMC_TIMCISR_O2STAT          (0x1UL << 19) 
#define HRTIM_TIMC_TIMCISR_O2STAT_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define HRTIM_TIMC_TIMCISR_O1STAT          (0x1UL << 18) 
#define HRTIM_TIMC_TIMCISR_O1STAT_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HRTIM_TIMC_TIMCISR_IPPSTAT          (0x1UL << 17) 
#define HRTIM_TIMC_TIMCISR_IPPSTAT_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HRTIM_TIMC_TIMCISR_CPPSTAT          (0x1UL << 16) 
#define HRTIM_TIMC_TIMCISR_CPPSTAT_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define HRTIM_TIMC_TIMCISR_DLYPRT          (0x1UL << 14) 
#define HRTIM_TIMC_TIMCISR_DLYPRT_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define HRTIM_TIMC_TIMCISR_RST          (0x1UL << 13) 
#define HRTIM_TIMC_TIMCISR_RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define HRTIM_TIMC_TIMCISR_RSTx2          (0x1UL << 12) 
#define HRTIM_TIMC_TIMCISR_RSTx2_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define HRTIM_TIMC_TIMCISR_SETx2          (0x1UL << 11) 
#define HRTIM_TIMC_TIMCISR_SETx2_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define HRTIM_TIMC_TIMCISR_RSTx1          (0x1UL << 10) 
#define HRTIM_TIMC_TIMCISR_RSTx1_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define HRTIM_TIMC_TIMCISR_SETx1          (0x1UL << 9) 
#define HRTIM_TIMC_TIMCISR_SETx1_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HRTIM_TIMC_TIMCISR_CPT2          (0x1UL << 8) 
#define HRTIM_TIMC_TIMCISR_CPT2_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HRTIM_TIMC_TIMCISR_CPT1          (0x1UL << 7) 
#define HRTIM_TIMC_TIMCISR_CPT1_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define HRTIM_TIMC_TIMCISR_UPD          (0x1UL << 6) 
#define HRTIM_TIMC_TIMCISR_UPD_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_TIMC_TIMCISR_REP          (0x1UL << 4) 
#define HRTIM_TIMC_TIMCISR_REP_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_TIMC_TIMCISR_CMP4          (0x1UL << 3) 
#define HRTIM_TIMC_TIMCISR_CMP4_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_TIMC_TIMCISR_CMP3          (0x1UL << 2) 
#define HRTIM_TIMC_TIMCISR_CMP3_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_TIMC_TIMCISR_CMP2          (0x1UL << 1) 
#define HRTIM_TIMC_TIMCISR_CMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_TIMC_TIMCISR_CMP1          (0x1UL << 0) 
#define HRTIM_TIMC_TIMCISR_CMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_TIMC_TIMCICR_DLYPRTC          (0x1UL << 14) 
#define HRTIM_TIMC_TIMCICR_DLYPRTC_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define HRTIM_TIMC_TIMCICR_RSTC          (0x1UL << 13) 
#define HRTIM_TIMC_TIMCICR_RSTC_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define HRTIM_TIMC_TIMCICR_RSTx2C          (0x1UL << 12) 
#define HRTIM_TIMC_TIMCICR_RSTx2C_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define HRTIM_TIMC_TIMCICR_SET2xC          (0x1UL << 11) 
#define HRTIM_TIMC_TIMCICR_SET2xC_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define HRTIM_TIMC_TIMCICR_RSTx1C          (0x1UL << 10) 
#define HRTIM_TIMC_TIMCICR_RSTx1C_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define HRTIM_TIMC_TIMCICR_SET1xC          (0x1UL << 9) 
#define HRTIM_TIMC_TIMCICR_SET1xC_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HRTIM_TIMC_TIMCICR_CPT2C          (0x1UL << 8) 
#define HRTIM_TIMC_TIMCICR_CPT2C_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HRTIM_TIMC_TIMCICR_CPT1C          (0x1UL << 7) 
#define HRTIM_TIMC_TIMCICR_CPT1C_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define HRTIM_TIMC_TIMCICR_UPDC          (0x1UL << 6) 
#define HRTIM_TIMC_TIMCICR_UPDC_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_TIMC_TIMCICR_REPC          (0x1UL << 4) 
#define HRTIM_TIMC_TIMCICR_REPC_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_TIMC_TIMCICR_CMP4C          (0x1UL << 3) 
#define HRTIM_TIMC_TIMCICR_CMP4C_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_TIMC_TIMCICR_CMP3C          (0x1UL << 2) 
#define HRTIM_TIMC_TIMCICR_CMP3C_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_TIMC_TIMCICR_CMP2C          (0x1UL << 1) 
#define HRTIM_TIMC_TIMCICR_CMP2C_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_TIMC_TIMCICR_CMP1C          (0x1UL << 0) 
#define HRTIM_TIMC_TIMCICR_CMP1C_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_TIMC_TIMCDIER5_DLYPRTDE          (0x1UL << 30) 
#define HRTIM_TIMC_TIMCDIER5_DLYPRTDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define HRTIM_TIMC_TIMCDIER5_RSTDE          (0x1UL << 29) 
#define HRTIM_TIMC_TIMCDIER5_RSTDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define HRTIM_TIMC_TIMCDIER5_RSTx2DE          (0x1UL << 28) 
#define HRTIM_TIMC_TIMCDIER5_RSTx2DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define HRTIM_TIMC_TIMCDIER5_SETx2DE          (0x1UL << 27) 
#define HRTIM_TIMC_TIMCDIER5_SETx2DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define HRTIM_TIMC_TIMCDIER5_RSTx1DE          (0x1UL << 26) 
#define HRTIM_TIMC_TIMCDIER5_RSTx1DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define HRTIM_TIMC_TIMCDIER5_SET1xDE          (0x1UL << 25) 
#define HRTIM_TIMC_TIMCDIER5_SET1xDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define HRTIM_TIMC_TIMCDIER5_CPT2DE          (0x1UL << 24) 
#define HRTIM_TIMC_TIMCDIER5_CPT2DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define HRTIM_TIMC_TIMCDIER5_CPT1DE          (0x1UL << 23) 
#define HRTIM_TIMC_TIMCDIER5_CPT1DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define HRTIM_TIMC_TIMCDIER5_UPDDE          (0x1UL << 22) 
#define HRTIM_TIMC_TIMCDIER5_UPDDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define HRTIM_TIMC_TIMCDIER5_REPDE          (0x1UL << 20) 
#define HRTIM_TIMC_TIMCDIER5_REPDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define HRTIM_TIMC_TIMCDIER5_CMP4DE          (0x1UL << 19) 
#define HRTIM_TIMC_TIMCDIER5_CMP4DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define HRTIM_TIMC_TIMCDIER5_CMP3DE          (0x1UL << 18) 
#define HRTIM_TIMC_TIMCDIER5_CMP3DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HRTIM_TIMC_TIMCDIER5_CMP2DE          (0x1UL << 17) 
#define HRTIM_TIMC_TIMCDIER5_CMP2DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HRTIM_TIMC_TIMCDIER5_CMP1DE          (0x1UL << 16) 
#define HRTIM_TIMC_TIMCDIER5_CMP1DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define HRTIM_TIMC_TIMCDIER5_DLYPRTIE          (0x1UL << 14) 
#define HRTIM_TIMC_TIMCDIER5_DLYPRTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define HRTIM_TIMC_TIMCDIER5_RSTIE          (0x1UL << 13) 
#define HRTIM_TIMC_TIMCDIER5_RSTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define HRTIM_TIMC_TIMCDIER5_RSTx2IE          (0x1UL << 12) 
#define HRTIM_TIMC_TIMCDIER5_RSTx2IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define HRTIM_TIMC_TIMCDIER5_SETx2IE          (0x1UL << 11) 
#define HRTIM_TIMC_TIMCDIER5_SETx2IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define HRTIM_TIMC_TIMCDIER5_RSTx1IE          (0x1UL << 10) 
#define HRTIM_TIMC_TIMCDIER5_RSTx1IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define HRTIM_TIMC_TIMCDIER5_SET1xIE          (0x1UL << 9) 
#define HRTIM_TIMC_TIMCDIER5_SET1xIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HRTIM_TIMC_TIMCDIER5_CPT2IE          (0x1UL << 8) 
#define HRTIM_TIMC_TIMCDIER5_CPT2IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HRTIM_TIMC_TIMCDIER5_CPT1IE          (0x1UL << 7) 
#define HRTIM_TIMC_TIMCDIER5_CPT1IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define HRTIM_TIMC_TIMCDIER5_UPDIE          (0x1UL << 6) 
#define HRTIM_TIMC_TIMCDIER5_UPDIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_TIMC_TIMCDIER5_REPIE          (0x1UL << 4) 
#define HRTIM_TIMC_TIMCDIER5_REPIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_TIMC_TIMCDIER5_CMP4IE          (0x1UL << 3) 
#define HRTIM_TIMC_TIMCDIER5_CMP4IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_TIMC_TIMCDIER5_CMP3IE          (0x1UL << 2) 
#define HRTIM_TIMC_TIMCDIER5_CMP3IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_TIMC_TIMCDIER5_CMP2IE          (0x1UL << 1) 
#define HRTIM_TIMC_TIMCDIER5_CMP2IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_TIMC_TIMCDIER5_CMP1IE          (0x1UL << 0) 
#define HRTIM_TIMC_TIMCDIER5_CMP1IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_TIMC_CNTCR_CNTx          (0xFFFFUL << 0) 
#define HRTIM_TIMC_CNTCR_CNTx_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define HRTIM_TIMC_PERCR_PERx          (0xFFFFUL << 0) 
#define HRTIM_TIMC_PERCR_PERx_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define HRTIM_TIMC_REPCR_REPx          (0xFFUL << 0) 
#define HRTIM_TIMC_REPCR_REPx_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HRTIM_TIMC_CMP1CR_CMP1x          (0xFFFFUL << 0) 
#define HRTIM_TIMC_CMP1CR_CMP1x_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define HRTIM_TIMC_CMP1CCR_REPx          (0xFFUL << 16) 
#define HRTIM_TIMC_CMP1CCR_REPx_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define HRTIM_TIMC_CMP1CCR_CMP1x          (0xFFFFUL << 0) 
#define HRTIM_TIMC_CMP1CCR_CMP1x_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define HRTIM_TIMC_CMP2CR_CMP2x          (0xFFFFUL << 0) 
#define HRTIM_TIMC_CMP2CR_CMP2x_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define HRTIM_TIMC_CMP3CR_CMP3x          (0xFFFFUL << 0) 
#define HRTIM_TIMC_CMP3CR_CMP3x_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define HRTIM_TIMC_CMP4CR_CMP4x          (0xFFFFUL << 0) 
#define HRTIM_TIMC_CMP4CR_CMP4x_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define HRTIM_TIMC_CPT1CR_CPT1x          (0xFFFFUL << 0) 
#define HRTIM_TIMC_CPT1CR_CPT1x_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define HRTIM_TIMC_CPT2CR_CPT2x          (0xFFFFUL << 0) 
#define HRTIM_TIMC_CPT2CR_CPT2x_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define HRTIM_TIMC_DTCR_DTFLKx          (0x1UL << 31) 
#define HRTIM_TIMC_DTCR_DTFLKx_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HRTIM_TIMC_DTCR_DTFSLKx          (0x1UL << 30) 
#define HRTIM_TIMC_DTCR_DTFSLKx_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define HRTIM_TIMC_DTCR_SDTFx          (0x1UL << 25) 
#define HRTIM_TIMC_DTCR_SDTFx_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define HRTIM_TIMC_DTCR_DTFx          (0x1FFUL << 16) 
#define HRTIM_TIMC_DTCR_DTFx_VAL(X) (((uint32_t)(X) & 0x1FFUL) << 16)
#define HRTIM_TIMC_DTCR_DTRLKx          (0x1UL << 15) 
#define HRTIM_TIMC_DTCR_DTRLKx_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define HRTIM_TIMC_DTCR_DTRSLKx          (0x1UL << 14) 
#define HRTIM_TIMC_DTCR_DTRSLKx_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define HRTIM_TIMC_DTCR_DTPRSC          (0x7UL << 10) 
#define HRTIM_TIMC_DTCR_DTPRSC_VAL(X) (((uint32_t)(X) & 0x7UL) << 10)
#define HRTIM_TIMC_DTCR_SDTRx          (0x1UL << 9) 
#define HRTIM_TIMC_DTCR_SDTRx_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HRTIM_TIMC_DTCR_DTRx          (0x1FFUL << 0) 
#define HRTIM_TIMC_DTCR_DTRx_VAL(X) (((uint32_t)(X) & 0x1FFUL) << 0)
#define HRTIM_TIMC_SETC1R_UPDATE          (0x1UL << 31) 
#define HRTIM_TIMC_SETC1R_UPDATE_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HRTIM_TIMC_SETC1R_EXTEVNT10          (0x1UL << 30) 
#define HRTIM_TIMC_SETC1R_EXTEVNT10_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define HRTIM_TIMC_SETC1R_EXTEVNT9          (0x1UL << 29) 
#define HRTIM_TIMC_SETC1R_EXTEVNT9_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define HRTIM_TIMC_SETC1R_EXTEVNT8          (0x1UL << 28) 
#define HRTIM_TIMC_SETC1R_EXTEVNT8_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define HRTIM_TIMC_SETC1R_EXTEVNT7          (0x1UL << 27) 
#define HRTIM_TIMC_SETC1R_EXTEVNT7_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define HRTIM_TIMC_SETC1R_EXTEVNT6          (0x1UL << 26) 
#define HRTIM_TIMC_SETC1R_EXTEVNT6_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define HRTIM_TIMC_SETC1R_EXTEVNT5          (0x1UL << 25) 
#define HRTIM_TIMC_SETC1R_EXTEVNT5_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define HRTIM_TIMC_SETC1R_EXTEVNT4          (0x1UL << 24) 
#define HRTIM_TIMC_SETC1R_EXTEVNT4_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define HRTIM_TIMC_SETC1R_EXTEVNT3          (0x1UL << 23) 
#define HRTIM_TIMC_SETC1R_EXTEVNT3_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define HRTIM_TIMC_SETC1R_EXTEVNT2          (0x1UL << 22) 
#define HRTIM_TIMC_SETC1R_EXTEVNT2_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define HRTIM_TIMC_SETC1R_EXTEVNT1          (0x1UL << 21) 
#define HRTIM_TIMC_SETC1R_EXTEVNT1_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define HRTIM_TIMC_SETC1R_TIMEVNT9          (0x1UL << 20) 
#define HRTIM_TIMC_SETC1R_TIMEVNT9_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define HRTIM_TIMC_SETC1R_TIMEVNT8          (0x1UL << 19) 
#define HRTIM_TIMC_SETC1R_TIMEVNT8_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define HRTIM_TIMC_SETC1R_TIMEVNT7          (0x1UL << 18) 
#define HRTIM_TIMC_SETC1R_TIMEVNT7_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HRTIM_TIMC_SETC1R_TIMEVNT6          (0x1UL << 17) 
#define HRTIM_TIMC_SETC1R_TIMEVNT6_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HRTIM_TIMC_SETC1R_TIMEVNT5          (0x1UL << 16) 
#define HRTIM_TIMC_SETC1R_TIMEVNT5_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define HRTIM_TIMC_SETC1R_TIMEVNT4          (0x1UL << 15) 
#define HRTIM_TIMC_SETC1R_TIMEVNT4_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define HRTIM_TIMC_SETC1R_TIMEVNT3          (0x1UL << 14) 
#define HRTIM_TIMC_SETC1R_TIMEVNT3_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define HRTIM_TIMC_SETC1R_TIMEVNT2          (0x1UL << 13) 
#define HRTIM_TIMC_SETC1R_TIMEVNT2_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define HRTIM_TIMC_SETC1R_TIMEVNT1          (0x1UL << 12) 
#define HRTIM_TIMC_SETC1R_TIMEVNT1_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define HRTIM_TIMC_SETC1R_MSTCMP4          (0x1UL << 11) 
#define HRTIM_TIMC_SETC1R_MSTCMP4_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define HRTIM_TIMC_SETC1R_MSTCMP3          (0x1UL << 10) 
#define HRTIM_TIMC_SETC1R_MSTCMP3_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define HRTIM_TIMC_SETC1R_MSTCMP2          (0x1UL << 9) 
#define HRTIM_TIMC_SETC1R_MSTCMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HRTIM_TIMC_SETC1R_MSTCMP1          (0x1UL << 8) 
#define HRTIM_TIMC_SETC1R_MSTCMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HRTIM_TIMC_SETC1R_MSTPER          (0x1UL << 7) 
#define HRTIM_TIMC_SETC1R_MSTPER_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define HRTIM_TIMC_SETC1R_CMP4          (0x1UL << 6) 
#define HRTIM_TIMC_SETC1R_CMP4_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_TIMC_SETC1R_CMP3          (0x1UL << 5) 
#define HRTIM_TIMC_SETC1R_CMP3_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define HRTIM_TIMC_SETC1R_CMP2          (0x1UL << 4) 
#define HRTIM_TIMC_SETC1R_CMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_TIMC_SETC1R_CMP1          (0x1UL << 3) 
#define HRTIM_TIMC_SETC1R_CMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_TIMC_SETC1R_PER          (0x1UL << 2) 
#define HRTIM_TIMC_SETC1R_PER_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_TIMC_SETC1R_RESYNC          (0x1UL << 1) 
#define HRTIM_TIMC_SETC1R_RESYNC_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_TIMC_SETC1R_SST          (0x1UL << 0) 
#define HRTIM_TIMC_SETC1R_SST_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_TIMC_RSTC1R_UPDATE          (0x1UL << 31) 
#define HRTIM_TIMC_RSTC1R_UPDATE_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HRTIM_TIMC_RSTC1R_EXTEVNT10          (0x1UL << 30) 
#define HRTIM_TIMC_RSTC1R_EXTEVNT10_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define HRTIM_TIMC_RSTC1R_EXTEVNT9          (0x1UL << 29) 
#define HRTIM_TIMC_RSTC1R_EXTEVNT9_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define HRTIM_TIMC_RSTC1R_EXTEVNT8          (0x1UL << 28) 
#define HRTIM_TIMC_RSTC1R_EXTEVNT8_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define HRTIM_TIMC_RSTC1R_EXTEVNT7          (0x1UL << 27) 
#define HRTIM_TIMC_RSTC1R_EXTEVNT7_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define HRTIM_TIMC_RSTC1R_EXTEVNT6          (0x1UL << 26) 
#define HRTIM_TIMC_RSTC1R_EXTEVNT6_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define HRTIM_TIMC_RSTC1R_EXTEVNT5          (0x1UL << 25) 
#define HRTIM_TIMC_RSTC1R_EXTEVNT5_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define HRTIM_TIMC_RSTC1R_EXTEVNT4          (0x1UL << 24) 
#define HRTIM_TIMC_RSTC1R_EXTEVNT4_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define HRTIM_TIMC_RSTC1R_EXTEVNT3          (0x1UL << 23) 
#define HRTIM_TIMC_RSTC1R_EXTEVNT3_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define HRTIM_TIMC_RSTC1R_EXTEVNT2          (0x1UL << 22) 
#define HRTIM_TIMC_RSTC1R_EXTEVNT2_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define HRTIM_TIMC_RSTC1R_EXTEVNT1          (0x1UL << 21) 
#define HRTIM_TIMC_RSTC1R_EXTEVNT1_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define HRTIM_TIMC_RSTC1R_TIMEVNT9          (0x1UL << 20) 
#define HRTIM_TIMC_RSTC1R_TIMEVNT9_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define HRTIM_TIMC_RSTC1R_TIMEVNT8          (0x1UL << 19) 
#define HRTIM_TIMC_RSTC1R_TIMEVNT8_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define HRTIM_TIMC_RSTC1R_TIMEVNT7          (0x1UL << 18) 
#define HRTIM_TIMC_RSTC1R_TIMEVNT7_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HRTIM_TIMC_RSTC1R_TIMEVNT6          (0x1UL << 17) 
#define HRTIM_TIMC_RSTC1R_TIMEVNT6_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HRTIM_TIMC_RSTC1R_TIMEVNT5          (0x1UL << 16) 
#define HRTIM_TIMC_RSTC1R_TIMEVNT5_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define HRTIM_TIMC_RSTC1R_TIMEVNT4          (0x1UL << 15) 
#define HRTIM_TIMC_RSTC1R_TIMEVNT4_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define HRTIM_TIMC_RSTC1R_TIMEVNT3          (0x1UL << 14) 
#define HRTIM_TIMC_RSTC1R_TIMEVNT3_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define HRTIM_TIMC_RSTC1R_TIMEVNT2          (0x1UL << 13) 
#define HRTIM_TIMC_RSTC1R_TIMEVNT2_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define HRTIM_TIMC_RSTC1R_TIMEVNT1          (0x1UL << 12) 
#define HRTIM_TIMC_RSTC1R_TIMEVNT1_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define HRTIM_TIMC_RSTC1R_MSTCMP4          (0x1UL << 11) 
#define HRTIM_TIMC_RSTC1R_MSTCMP4_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define HRTIM_TIMC_RSTC1R_MSTCMP3          (0x1UL << 10) 
#define HRTIM_TIMC_RSTC1R_MSTCMP3_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define HRTIM_TIMC_RSTC1R_MSTCMP2          (0x1UL << 9) 
#define HRTIM_TIMC_RSTC1R_MSTCMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HRTIM_TIMC_RSTC1R_MSTCMP1          (0x1UL << 8) 
#define HRTIM_TIMC_RSTC1R_MSTCMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HRTIM_TIMC_RSTC1R_MSTPER          (0x1UL << 7) 
#define HRTIM_TIMC_RSTC1R_MSTPER_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define HRTIM_TIMC_RSTC1R_CMP4          (0x1UL << 6) 
#define HRTIM_TIMC_RSTC1R_CMP4_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_TIMC_RSTC1R_CMP3          (0x1UL << 5) 
#define HRTIM_TIMC_RSTC1R_CMP3_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define HRTIM_TIMC_RSTC1R_CMP2          (0x1UL << 4) 
#define HRTIM_TIMC_RSTC1R_CMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_TIMC_RSTC1R_CMP1          (0x1UL << 3) 
#define HRTIM_TIMC_RSTC1R_CMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_TIMC_RSTC1R_PER          (0x1UL << 2) 
#define HRTIM_TIMC_RSTC1R_PER_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_TIMC_RSTC1R_RESYNC          (0x1UL << 1) 
#define HRTIM_TIMC_RSTC1R_RESYNC_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_TIMC_RSTC1R_SRT          (0x1UL << 0) 
#define HRTIM_TIMC_RSTC1R_SRT_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_TIMC_SETC2R_UPDATE          (0x1UL << 31) 
#define HRTIM_TIMC_SETC2R_UPDATE_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HRTIM_TIMC_SETC2R_EXTEVNT10          (0x1UL << 30) 
#define HRTIM_TIMC_SETC2R_EXTEVNT10_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define HRTIM_TIMC_SETC2R_EXTEVNT9          (0x1UL << 29) 
#define HRTIM_TIMC_SETC2R_EXTEVNT9_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define HRTIM_TIMC_SETC2R_EXTEVNT8          (0x1UL << 28) 
#define HRTIM_TIMC_SETC2R_EXTEVNT8_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define HRTIM_TIMC_SETC2R_EXTEVNT7          (0x1UL << 27) 
#define HRTIM_TIMC_SETC2R_EXTEVNT7_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define HRTIM_TIMC_SETC2R_EXTEVNT6          (0x1UL << 26) 
#define HRTIM_TIMC_SETC2R_EXTEVNT6_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define HRTIM_TIMC_SETC2R_EXTEVNT5          (0x1UL << 25) 
#define HRTIM_TIMC_SETC2R_EXTEVNT5_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define HRTIM_TIMC_SETC2R_EXTEVNT4          (0x1UL << 24) 
#define HRTIM_TIMC_SETC2R_EXTEVNT4_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define HRTIM_TIMC_SETC2R_EXTEVNT3          (0x1UL << 23) 
#define HRTIM_TIMC_SETC2R_EXTEVNT3_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define HRTIM_TIMC_SETC2R_EXTEVNT2          (0x1UL << 22) 
#define HRTIM_TIMC_SETC2R_EXTEVNT2_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define HRTIM_TIMC_SETC2R_EXTEVNT1          (0x1UL << 21) 
#define HRTIM_TIMC_SETC2R_EXTEVNT1_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define HRTIM_TIMC_SETC2R_TIMEVNT9          (0x1UL << 20) 
#define HRTIM_TIMC_SETC2R_TIMEVNT9_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define HRTIM_TIMC_SETC2R_TIMEVNT8          (0x1UL << 19) 
#define HRTIM_TIMC_SETC2R_TIMEVNT8_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define HRTIM_TIMC_SETC2R_TIMEVNT7          (0x1UL << 18) 
#define HRTIM_TIMC_SETC2R_TIMEVNT7_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HRTIM_TIMC_SETC2R_TIMEVNT6          (0x1UL << 17) 
