via/viaems/src/platforms/stm32h743/device.h
#define HRTIM_TIMC_SETC2R_TIMEVNT6_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HRTIM_TIMC_SETC2R_TIMEVNT5          (0x1UL << 16) 
#define HRTIM_TIMC_SETC2R_TIMEVNT5_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define HRTIM_TIMC_SETC2R_TIMEVNT4          (0x1UL << 15) 
#define HRTIM_TIMC_SETC2R_TIMEVNT4_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define HRTIM_TIMC_SETC2R_TIMEVNT3          (0x1UL << 14) 
#define HRTIM_TIMC_SETC2R_TIMEVNT3_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define HRTIM_TIMC_SETC2R_TIMEVNT2          (0x1UL << 13) 
#define HRTIM_TIMC_SETC2R_TIMEVNT2_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define HRTIM_TIMC_SETC2R_TIMEVNT1          (0x1UL << 12) 
#define HRTIM_TIMC_SETC2R_TIMEVNT1_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define HRTIM_TIMC_SETC2R_MSTCMP4          (0x1UL << 11) 
#define HRTIM_TIMC_SETC2R_MSTCMP4_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define HRTIM_TIMC_SETC2R_MSTCMP3          (0x1UL << 10) 
#define HRTIM_TIMC_SETC2R_MSTCMP3_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define HRTIM_TIMC_SETC2R_MSTCMP2          (0x1UL << 9) 
#define HRTIM_TIMC_SETC2R_MSTCMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HRTIM_TIMC_SETC2R_MSTCMP1          (0x1UL << 8) 
#define HRTIM_TIMC_SETC2R_MSTCMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HRTIM_TIMC_SETC2R_MSTPER          (0x1UL << 7) 
#define HRTIM_TIMC_SETC2R_MSTPER_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define HRTIM_TIMC_SETC2R_CMP4          (0x1UL << 6) 
#define HRTIM_TIMC_SETC2R_CMP4_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_TIMC_SETC2R_CMP3          (0x1UL << 5) 
#define HRTIM_TIMC_SETC2R_CMP3_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define HRTIM_TIMC_SETC2R_CMP2          (0x1UL << 4) 
#define HRTIM_TIMC_SETC2R_CMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_TIMC_SETC2R_CMP1          (0x1UL << 3) 
#define HRTIM_TIMC_SETC2R_CMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_TIMC_SETC2R_PER          (0x1UL << 2) 
#define HRTIM_TIMC_SETC2R_PER_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_TIMC_SETC2R_RESYNC          (0x1UL << 1) 
#define HRTIM_TIMC_SETC2R_RESYNC_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_TIMC_SETC2R_SST          (0x1UL << 0) 
#define HRTIM_TIMC_SETC2R_SST_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_TIMC_RSTC2R_UPDATE          (0x1UL << 31) 
#define HRTIM_TIMC_RSTC2R_UPDATE_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HRTIM_TIMC_RSTC2R_EXTEVNT10          (0x1UL << 30) 
#define HRTIM_TIMC_RSTC2R_EXTEVNT10_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define HRTIM_TIMC_RSTC2R_EXTEVNT9          (0x1UL << 29) 
#define HRTIM_TIMC_RSTC2R_EXTEVNT9_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define HRTIM_TIMC_RSTC2R_EXTEVNT8          (0x1UL << 28) 
#define HRTIM_TIMC_RSTC2R_EXTEVNT8_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define HRTIM_TIMC_RSTC2R_EXTEVNT7          (0x1UL << 27) 
#define HRTIM_TIMC_RSTC2R_EXTEVNT7_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define HRTIM_TIMC_RSTC2R_EXTEVNT6          (0x1UL << 26) 
#define HRTIM_TIMC_RSTC2R_EXTEVNT6_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define HRTIM_TIMC_RSTC2R_EXTEVNT5          (0x1UL << 25) 
#define HRTIM_TIMC_RSTC2R_EXTEVNT5_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define HRTIM_TIMC_RSTC2R_EXTEVNT4          (0x1UL << 24) 
#define HRTIM_TIMC_RSTC2R_EXTEVNT4_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define HRTIM_TIMC_RSTC2R_EXTEVNT3          (0x1UL << 23) 
#define HRTIM_TIMC_RSTC2R_EXTEVNT3_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define HRTIM_TIMC_RSTC2R_EXTEVNT2          (0x1UL << 22) 
#define HRTIM_TIMC_RSTC2R_EXTEVNT2_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define HRTIM_TIMC_RSTC2R_EXTEVNT1          (0x1UL << 21) 
#define HRTIM_TIMC_RSTC2R_EXTEVNT1_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define HRTIM_TIMC_RSTC2R_TIMEVNT9          (0x1UL << 20) 
#define HRTIM_TIMC_RSTC2R_TIMEVNT9_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define HRTIM_TIMC_RSTC2R_TIMEVNT8          (0x1UL << 19) 
#define HRTIM_TIMC_RSTC2R_TIMEVNT8_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define HRTIM_TIMC_RSTC2R_TIMEVNT7          (0x1UL << 18) 
#define HRTIM_TIMC_RSTC2R_TIMEVNT7_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HRTIM_TIMC_RSTC2R_TIMEVNT6          (0x1UL << 17) 
#define HRTIM_TIMC_RSTC2R_TIMEVNT6_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HRTIM_TIMC_RSTC2R_TIMEVNT5          (0x1UL << 16) 
#define HRTIM_TIMC_RSTC2R_TIMEVNT5_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define HRTIM_TIMC_RSTC2R_TIMEVNT4          (0x1UL << 15) 
#define HRTIM_TIMC_RSTC2R_TIMEVNT4_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define HRTIM_TIMC_RSTC2R_TIMEVNT3          (0x1UL << 14) 
#define HRTIM_TIMC_RSTC2R_TIMEVNT3_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define HRTIM_TIMC_RSTC2R_TIMEVNT2          (0x1UL << 13) 
#define HRTIM_TIMC_RSTC2R_TIMEVNT2_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define HRTIM_TIMC_RSTC2R_TIMEVNT1          (0x1UL << 12) 
#define HRTIM_TIMC_RSTC2R_TIMEVNT1_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define HRTIM_TIMC_RSTC2R_MSTCMP4          (0x1UL << 11) 
#define HRTIM_TIMC_RSTC2R_MSTCMP4_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define HRTIM_TIMC_RSTC2R_MSTCMP3          (0x1UL << 10) 
#define HRTIM_TIMC_RSTC2R_MSTCMP3_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define HRTIM_TIMC_RSTC2R_MSTCMP2          (0x1UL << 9) 
#define HRTIM_TIMC_RSTC2R_MSTCMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HRTIM_TIMC_RSTC2R_MSTCMP1          (0x1UL << 8) 
#define HRTIM_TIMC_RSTC2R_MSTCMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HRTIM_TIMC_RSTC2R_MSTPER          (0x1UL << 7) 
#define HRTIM_TIMC_RSTC2R_MSTPER_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define HRTIM_TIMC_RSTC2R_CMP4          (0x1UL << 6) 
#define HRTIM_TIMC_RSTC2R_CMP4_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_TIMC_RSTC2R_CMP3          (0x1UL << 5) 
#define HRTIM_TIMC_RSTC2R_CMP3_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define HRTIM_TIMC_RSTC2R_CMP2          (0x1UL << 4) 
#define HRTIM_TIMC_RSTC2R_CMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_TIMC_RSTC2R_CMP1          (0x1UL << 3) 
#define HRTIM_TIMC_RSTC2R_CMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_TIMC_RSTC2R_PER          (0x1UL << 2) 
#define HRTIM_TIMC_RSTC2R_PER_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_TIMC_RSTC2R_RESYNC          (0x1UL << 1) 
#define HRTIM_TIMC_RSTC2R_RESYNC_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_TIMC_RSTC2R_SRT          (0x1UL << 0) 
#define HRTIM_TIMC_RSTC2R_SRT_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_TIMC_EEFCR1_EE5FLTR          (0xFUL << 25) 
#define HRTIM_TIMC_EEFCR1_EE5FLTR_VAL(X) (((uint32_t)(X) & 0xFUL) << 25)
#define HRTIM_TIMC_EEFCR1_EE5LTCH          (0x1UL << 24) 
#define HRTIM_TIMC_EEFCR1_EE5LTCH_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define HRTIM_TIMC_EEFCR1_EE4FLTR          (0xFUL << 19) 
#define HRTIM_TIMC_EEFCR1_EE4FLTR_VAL(X) (((uint32_t)(X) & 0xFUL) << 19)
#define HRTIM_TIMC_EEFCR1_EE4LTCH          (0x1UL << 18) 
#define HRTIM_TIMC_EEFCR1_EE4LTCH_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HRTIM_TIMC_EEFCR1_EE3FLTR          (0xFUL << 13) 
#define HRTIM_TIMC_EEFCR1_EE3FLTR_VAL(X) (((uint32_t)(X) & 0xFUL) << 13)
#define HRTIM_TIMC_EEFCR1_EE3LTCH          (0x1UL << 12) 
#define HRTIM_TIMC_EEFCR1_EE3LTCH_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define HRTIM_TIMC_EEFCR1_EE2FLTR          (0xFUL << 7) 
#define HRTIM_TIMC_EEFCR1_EE2FLTR_VAL(X) (((uint32_t)(X) & 0xFUL) << 7)
#define HRTIM_TIMC_EEFCR1_EE2LTCH          (0x1UL << 6) 
#define HRTIM_TIMC_EEFCR1_EE2LTCH_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_TIMC_EEFCR1_EE1FLTR          (0xFUL << 1) 
#define HRTIM_TIMC_EEFCR1_EE1FLTR_VAL(X) (((uint32_t)(X) & 0xFUL) << 1)
#define HRTIM_TIMC_EEFCR1_EE1LTCH          (0x1UL << 0) 
#define HRTIM_TIMC_EEFCR1_EE1LTCH_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_TIMC_EEFCR2_EE10FLTR          (0xFUL << 25) 
#define HRTIM_TIMC_EEFCR2_EE10FLTR_VAL(X) (((uint32_t)(X) & 0xFUL) << 25)
#define HRTIM_TIMC_EEFCR2_EE10LTCH          (0x1UL << 24) 
#define HRTIM_TIMC_EEFCR2_EE10LTCH_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define HRTIM_TIMC_EEFCR2_EE9FLTR          (0xFUL << 19) 
#define HRTIM_TIMC_EEFCR2_EE9FLTR_VAL(X) (((uint32_t)(X) & 0xFUL) << 19)
#define HRTIM_TIMC_EEFCR2_EE9LTCH          (0x1UL << 18) 
#define HRTIM_TIMC_EEFCR2_EE9LTCH_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HRTIM_TIMC_EEFCR2_EE8FLTR          (0xFUL << 13) 
#define HRTIM_TIMC_EEFCR2_EE8FLTR_VAL(X) (((uint32_t)(X) & 0xFUL) << 13)
#define HRTIM_TIMC_EEFCR2_EE8LTCH          (0x1UL << 12) 
#define HRTIM_TIMC_EEFCR2_EE8LTCH_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define HRTIM_TIMC_EEFCR2_EE7FLTR          (0xFUL << 7) 
#define HRTIM_TIMC_EEFCR2_EE7FLTR_VAL(X) (((uint32_t)(X) & 0xFUL) << 7)
#define HRTIM_TIMC_EEFCR2_EE7LTCH          (0x1UL << 6) 
#define HRTIM_TIMC_EEFCR2_EE7LTCH_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_TIMC_EEFCR2_EE6FLTR          (0xFUL << 1) 
#define HRTIM_TIMC_EEFCR2_EE6FLTR_VAL(X) (((uint32_t)(X) & 0xFUL) << 1)
#define HRTIM_TIMC_EEFCR2_EE6LTCH          (0x1UL << 0) 
#define HRTIM_TIMC_EEFCR2_EE6LTCH_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_TIMC_RSTCR_TIMECMP4          (0x1UL << 30) 
#define HRTIM_TIMC_RSTCR_TIMECMP4_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define HRTIM_TIMC_RSTCR_TIMECMP2          (0x1UL << 29) 
#define HRTIM_TIMC_RSTCR_TIMECMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define HRTIM_TIMC_RSTCR_TIMECMP1          (0x1UL << 28) 
#define HRTIM_TIMC_RSTCR_TIMECMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define HRTIM_TIMC_RSTCR_TIMDCMP4          (0x1UL << 27) 
#define HRTIM_TIMC_RSTCR_TIMDCMP4_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define HRTIM_TIMC_RSTCR_TIMDCMP2          (0x1UL << 26) 
#define HRTIM_TIMC_RSTCR_TIMDCMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define HRTIM_TIMC_RSTCR_TIMDCMP1          (0x1UL << 25) 
#define HRTIM_TIMC_RSTCR_TIMDCMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define HRTIM_TIMC_RSTCR_TIMBCMP4          (0x1UL << 24) 
#define HRTIM_TIMC_RSTCR_TIMBCMP4_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define HRTIM_TIMC_RSTCR_TIMBCMP2          (0x1UL << 23) 
#define HRTIM_TIMC_RSTCR_TIMBCMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define HRTIM_TIMC_RSTCR_TIMBCMP1          (0x1UL << 22) 
#define HRTIM_TIMC_RSTCR_TIMBCMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define HRTIM_TIMC_RSTCR_TIMACMP4          (0x1UL << 21) 
#define HRTIM_TIMC_RSTCR_TIMACMP4_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define HRTIM_TIMC_RSTCR_TIMACMP2          (0x1UL << 20) 
#define HRTIM_TIMC_RSTCR_TIMACMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define HRTIM_TIMC_RSTCR_TIMACMP1          (0x1UL << 19) 
#define HRTIM_TIMC_RSTCR_TIMACMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define HRTIM_TIMC_RSTCR_EXTEVNT10          (0x1UL << 18) 
#define HRTIM_TIMC_RSTCR_EXTEVNT10_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HRTIM_TIMC_RSTCR_EXTEVNT9          (0x1UL << 17) 
#define HRTIM_TIMC_RSTCR_EXTEVNT9_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HRTIM_TIMC_RSTCR_EXTEVNT8          (0x1UL << 16) 
#define HRTIM_TIMC_RSTCR_EXTEVNT8_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define HRTIM_TIMC_RSTCR_EXTEVNT7          (0x1UL << 15) 
#define HRTIM_TIMC_RSTCR_EXTEVNT7_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define HRTIM_TIMC_RSTCR_EXTEVNT6          (0x1UL << 14) 
#define HRTIM_TIMC_RSTCR_EXTEVNT6_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define HRTIM_TIMC_RSTCR_EXTEVNT5          (0x1UL << 13) 
#define HRTIM_TIMC_RSTCR_EXTEVNT5_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define HRTIM_TIMC_RSTCR_EXTEVNT4          (0x1UL << 12) 
#define HRTIM_TIMC_RSTCR_EXTEVNT4_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define HRTIM_TIMC_RSTCR_EXTEVNT3          (0x1UL << 11) 
#define HRTIM_TIMC_RSTCR_EXTEVNT3_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define HRTIM_TIMC_RSTCR_EXTEVNT2          (0x1UL << 10) 
#define HRTIM_TIMC_RSTCR_EXTEVNT2_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define HRTIM_TIMC_RSTCR_EXTEVNT1          (0x1UL << 9) 
#define HRTIM_TIMC_RSTCR_EXTEVNT1_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HRTIM_TIMC_RSTCR_MSTCMP4          (0x1UL << 8) 
#define HRTIM_TIMC_RSTCR_MSTCMP4_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HRTIM_TIMC_RSTCR_MSTCMP3          (0x1UL << 7) 
#define HRTIM_TIMC_RSTCR_MSTCMP3_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define HRTIM_TIMC_RSTCR_MSTCMP2          (0x1UL << 6) 
#define HRTIM_TIMC_RSTCR_MSTCMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_TIMC_RSTCR_MSTCMP1          (0x1UL << 5) 
#define HRTIM_TIMC_RSTCR_MSTCMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define HRTIM_TIMC_RSTCR_MSTPER          (0x1UL << 4) 
#define HRTIM_TIMC_RSTCR_MSTPER_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_TIMC_RSTCR_CMP4          (0x1UL << 3) 
#define HRTIM_TIMC_RSTCR_CMP4_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_TIMC_RSTCR_CMP2          (0x1UL << 2) 
#define HRTIM_TIMC_RSTCR_CMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_TIMC_RSTCR_UPDT          (0x1UL << 1) 
#define HRTIM_TIMC_RSTCR_UPDT_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_TIMC_CHPCR_STRTPW          (0xFUL << 7) 
#define HRTIM_TIMC_CHPCR_STRTPW_VAL(X) (((uint32_t)(X) & 0xFUL) << 7)
#define HRTIM_TIMC_CHPCR_CHPDTY          (0x7UL << 4) 
#define HRTIM_TIMC_CHPCR_CHPDTY_VAL(X) (((uint32_t)(X) & 0x7UL) << 4)
#define HRTIM_TIMC_CHPCR_CHPFRQ          (0xFUL << 0) 
#define HRTIM_TIMC_CHPCR_CHPFRQ_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define HRTIM_TIMC_CPT1CCR_TECMP2          (0x1UL << 31) 
#define HRTIM_TIMC_CPT1CCR_TECMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HRTIM_TIMC_CPT1CCR_TECMP1          (0x1UL << 30) 
#define HRTIM_TIMC_CPT1CCR_TECMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define HRTIM_TIMC_CPT1CCR_TE1RST          (0x1UL << 29) 
#define HRTIM_TIMC_CPT1CCR_TE1RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define HRTIM_TIMC_CPT1CCR_TE1SET          (0x1UL << 28) 
#define HRTIM_TIMC_CPT1CCR_TE1SET_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define HRTIM_TIMC_CPT1CCR_TDCMP2          (0x1UL << 27) 
#define HRTIM_TIMC_CPT1CCR_TDCMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define HRTIM_TIMC_CPT1CCR_TDCMP1          (0x1UL << 26) 
#define HRTIM_TIMC_CPT1CCR_TDCMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define HRTIM_TIMC_CPT1CCR_TD1RST          (0x1UL << 25) 
#define HRTIM_TIMC_CPT1CCR_TD1RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define HRTIM_TIMC_CPT1CCR_TD1SET          (0x1UL << 24) 
#define HRTIM_TIMC_CPT1CCR_TD1SET_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define HRTIM_TIMC_CPT1CCR_TBCMP2          (0x1UL << 19) 
#define HRTIM_TIMC_CPT1CCR_TBCMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define HRTIM_TIMC_CPT1CCR_TBCMP1          (0x1UL << 18) 
#define HRTIM_TIMC_CPT1CCR_TBCMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HRTIM_TIMC_CPT1CCR_TB1RST          (0x1UL << 17) 
#define HRTIM_TIMC_CPT1CCR_TB1RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HRTIM_TIMC_CPT1CCR_TB1SET          (0x1UL << 16) 
#define HRTIM_TIMC_CPT1CCR_TB1SET_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define HRTIM_TIMC_CPT1CCR_TACMP2          (0x1UL << 15) 
#define HRTIM_TIMC_CPT1CCR_TACMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define HRTIM_TIMC_CPT1CCR_TACMP1          (0x1UL << 14) 
#define HRTIM_TIMC_CPT1CCR_TACMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define HRTIM_TIMC_CPT1CCR_TA1RST          (0x1UL << 13) 
#define HRTIM_TIMC_CPT1CCR_TA1RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define HRTIM_TIMC_CPT1CCR_TA1SET          (0x1UL << 12) 
#define HRTIM_TIMC_CPT1CCR_TA1SET_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define HRTIM_TIMC_CPT1CCR_EXEV10CPT          (0x1UL << 11) 
#define HRTIM_TIMC_CPT1CCR_EXEV10CPT_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define HRTIM_TIMC_CPT1CCR_EXEV9CPT          (0x1UL << 10) 
#define HRTIM_TIMC_CPT1CCR_EXEV9CPT_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define HRTIM_TIMC_CPT1CCR_EXEV8CPT          (0x1UL << 9) 
#define HRTIM_TIMC_CPT1CCR_EXEV8CPT_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HRTIM_TIMC_CPT1CCR_EXEV7CPT          (0x1UL << 8) 
#define HRTIM_TIMC_CPT1CCR_EXEV7CPT_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HRTIM_TIMC_CPT1CCR_EXEV6CPT          (0x1UL << 7) 
#define HRTIM_TIMC_CPT1CCR_EXEV6CPT_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define HRTIM_TIMC_CPT1CCR_EXEV5CPT          (0x1UL << 6) 
#define HRTIM_TIMC_CPT1CCR_EXEV5CPT_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_TIMC_CPT1CCR_EXEV4CPT          (0x1UL << 5) 
#define HRTIM_TIMC_CPT1CCR_EXEV4CPT_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define HRTIM_TIMC_CPT1CCR_EXEV3CPT          (0x1UL << 4) 
#define HRTIM_TIMC_CPT1CCR_EXEV3CPT_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_TIMC_CPT1CCR_EXEV2CPT          (0x1UL << 3) 
#define HRTIM_TIMC_CPT1CCR_EXEV2CPT_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_TIMC_CPT1CCR_EXEV1CPT          (0x1UL << 2) 
#define HRTIM_TIMC_CPT1CCR_EXEV1CPT_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_TIMC_CPT1CCR_UDPCPT          (0x1UL << 1) 
#define HRTIM_TIMC_CPT1CCR_UDPCPT_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_TIMC_CPT1CCR_SWCPT          (0x1UL << 0) 
#define HRTIM_TIMC_CPT1CCR_SWCPT_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_TIMC_CPT2CCR_TECMP2          (0x1UL << 31) 
#define HRTIM_TIMC_CPT2CCR_TECMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HRTIM_TIMC_CPT2CCR_TECMP1          (0x1UL << 30) 
#define HRTIM_TIMC_CPT2CCR_TECMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define HRTIM_TIMC_CPT2CCR_TE1RST          (0x1UL << 29) 
#define HRTIM_TIMC_CPT2CCR_TE1RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define HRTIM_TIMC_CPT2CCR_TE1SET          (0x1UL << 28) 
#define HRTIM_TIMC_CPT2CCR_TE1SET_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define HRTIM_TIMC_CPT2CCR_TDCMP2          (0x1UL << 27) 
#define HRTIM_TIMC_CPT2CCR_TDCMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define HRTIM_TIMC_CPT2CCR_TDCMP1          (0x1UL << 26) 
#define HRTIM_TIMC_CPT2CCR_TDCMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define HRTIM_TIMC_CPT2CCR_TD1RST          (0x1UL << 25) 
#define HRTIM_TIMC_CPT2CCR_TD1RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define HRTIM_TIMC_CPT2CCR_TD1SET          (0x1UL << 24) 
#define HRTIM_TIMC_CPT2CCR_TD1SET_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define HRTIM_TIMC_CPT2CCR_TBCMP2          (0x1UL << 19) 
#define HRTIM_TIMC_CPT2CCR_TBCMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define HRTIM_TIMC_CPT2CCR_TBCMP1          (0x1UL << 18) 
#define HRTIM_TIMC_CPT2CCR_TBCMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HRTIM_TIMC_CPT2CCR_TB1RST          (0x1UL << 17) 
#define HRTIM_TIMC_CPT2CCR_TB1RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HRTIM_TIMC_CPT2CCR_TB1SET          (0x1UL << 16) 
#define HRTIM_TIMC_CPT2CCR_TB1SET_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define HRTIM_TIMC_CPT2CCR_TACMP2          (0x1UL << 15) 
#define HRTIM_TIMC_CPT2CCR_TACMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define HRTIM_TIMC_CPT2CCR_TACMP1          (0x1UL << 14) 
#define HRTIM_TIMC_CPT2CCR_TACMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define HRTIM_TIMC_CPT2CCR_TA1RST          (0x1UL << 13) 
#define HRTIM_TIMC_CPT2CCR_TA1RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define HRTIM_TIMC_CPT2CCR_TA1SET          (0x1UL << 12) 
#define HRTIM_TIMC_CPT2CCR_TA1SET_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define HRTIM_TIMC_CPT2CCR_EXEV10CPT          (0x1UL << 11) 
#define HRTIM_TIMC_CPT2CCR_EXEV10CPT_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define HRTIM_TIMC_CPT2CCR_EXEV9CPT          (0x1UL << 10) 
#define HRTIM_TIMC_CPT2CCR_EXEV9CPT_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define HRTIM_TIMC_CPT2CCR_EXEV8CPT          (0x1UL << 9) 
#define HRTIM_TIMC_CPT2CCR_EXEV8CPT_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HRTIM_TIMC_CPT2CCR_EXEV7CPT          (0x1UL << 8) 
#define HRTIM_TIMC_CPT2CCR_EXEV7CPT_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HRTIM_TIMC_CPT2CCR_EXEV6CPT          (0x1UL << 7) 
#define HRTIM_TIMC_CPT2CCR_EXEV6CPT_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define HRTIM_TIMC_CPT2CCR_EXEV5CPT          (0x1UL << 6) 
#define HRTIM_TIMC_CPT2CCR_EXEV5CPT_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_TIMC_CPT2CCR_EXEV4CPT          (0x1UL << 5) 
#define HRTIM_TIMC_CPT2CCR_EXEV4CPT_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define HRTIM_TIMC_CPT2CCR_EXEV3CPT          (0x1UL << 4) 
#define HRTIM_TIMC_CPT2CCR_EXEV3CPT_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_TIMC_CPT2CCR_EXEV2CPT          (0x1UL << 3) 
#define HRTIM_TIMC_CPT2CCR_EXEV2CPT_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_TIMC_CPT2CCR_EXEV1CPT          (0x1UL << 2) 
#define HRTIM_TIMC_CPT2CCR_EXEV1CPT_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_TIMC_CPT2CCR_UDPCPT          (0x1UL << 1) 
#define HRTIM_TIMC_CPT2CCR_UDPCPT_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_TIMC_CPT2CCR_SWCPT          (0x1UL << 0) 
#define HRTIM_TIMC_CPT2CCR_SWCPT_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_TIMC_OUTCR_DIDL2          (0x1UL << 23) 
#define HRTIM_TIMC_OUTCR_DIDL2_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define HRTIM_TIMC_OUTCR_CHP2          (0x1UL << 22) 
#define HRTIM_TIMC_OUTCR_CHP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define HRTIM_TIMC_OUTCR_FAULT2          (0x3UL << 20) 
#define HRTIM_TIMC_OUTCR_FAULT2_VAL(X) (((uint32_t)(X) & 0x3UL) << 20)
#define HRTIM_TIMC_OUTCR_IDLES2          (0x1UL << 19) 
#define HRTIM_TIMC_OUTCR_IDLES2_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define HRTIM_TIMC_OUTCR_IDLEM2          (0x1UL << 18) 
#define HRTIM_TIMC_OUTCR_IDLEM2_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HRTIM_TIMC_OUTCR_POL2          (0x1UL << 17) 
#define HRTIM_TIMC_OUTCR_POL2_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HRTIM_TIMC_OUTCR_DLYPRT          (0x7UL << 10) 
#define HRTIM_TIMC_OUTCR_DLYPRT_VAL(X) (((uint32_t)(X) & 0x7UL) << 10)
#define HRTIM_TIMC_OUTCR_DLYPRTEN          (0x1UL << 9) 
#define HRTIM_TIMC_OUTCR_DLYPRTEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HRTIM_TIMC_OUTCR_DTEN          (0x1UL << 8) 
#define HRTIM_TIMC_OUTCR_DTEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HRTIM_TIMC_OUTCR_DIDL1          (0x1UL << 7) 
#define HRTIM_TIMC_OUTCR_DIDL1_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define HRTIM_TIMC_OUTCR_CHP1          (0x1UL << 6) 
#define HRTIM_TIMC_OUTCR_CHP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_TIMC_OUTCR_FAULT1          (0x3UL << 4) 
#define HRTIM_TIMC_OUTCR_FAULT1_VAL(X) (((uint32_t)(X) & 0x3UL) << 4)
#define HRTIM_TIMC_OUTCR_IDLES1          (0x1UL << 3) 
#define HRTIM_TIMC_OUTCR_IDLES1_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_TIMC_OUTCR_IDLEM1          (0x1UL << 2) 
#define HRTIM_TIMC_OUTCR_IDLEM1_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_TIMC_OUTCR_POL1          (0x1UL << 1) 
#define HRTIM_TIMC_OUTCR_POL1_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_TIMC_FLTCR_FLTLCK          (0x1UL << 31) 
#define HRTIM_TIMC_FLTCR_FLTLCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HRTIM_TIMC_FLTCR_FLT5EN          (0x1UL << 4) 
#define HRTIM_TIMC_FLTCR_FLT5EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_TIMC_FLTCR_FLT4EN          (0x1UL << 3) 
#define HRTIM_TIMC_FLTCR_FLT4EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_TIMC_FLTCR_FLT3EN          (0x1UL << 2) 
#define HRTIM_TIMC_FLTCR_FLT3EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_TIMC_FLTCR_FLT2EN          (0x1UL << 1) 
#define HRTIM_TIMC_FLTCR_FLT2EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_TIMC_FLTCR_FLT1EN          (0x1UL << 0) 
#define HRTIM_TIMC_FLTCR_FLT1EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)

