via/viaems/src/platforms/stm32h743/device.h
#define HRTIM_TIMC  ((struct HRTIM_TIMC*)(0x40017580UL))
struct HRTIM_TIMD {
  volatile uint32_t TIMDCR;
  volatile const uint32_t TIMDISR;
  volatile uint32_t TIMDICR;
  volatile uint32_t TIMDDIER5;
  volatile uint32_t CNTDR;
  volatile uint32_t PERDR;
  volatile uint32_t REPDR;
  volatile uint32_t CMP1DR;
  volatile uint32_t CMP1CDR;
  volatile uint32_t CMP2DR;
  volatile uint32_t CMP3DR;
  volatile uint32_t CMP4DR;
  volatile const uint32_t CPT1DR;
  volatile const uint32_t CPT2DR;
  volatile uint32_t DTDR;
  volatile uint32_t SETD1R;
  volatile uint32_t RSTD1R;
  volatile uint32_t SETD2R;
  volatile uint32_t RSTD2R;
  volatile uint32_t EEFDR1;
  volatile uint32_t EEFDR2;
  volatile uint32_t RSTDR;
  volatile uint32_t CHPDR;
  volatile uint32_t CPT1DCR;
  volatile uint32_t CPT2DCR;
  volatile uint32_t OUTDR;
  volatile uint32_t FLTDR;
};
#define HRTIM_TIMD_TIMDCR_UPDGAT          (0xFUL << 28) 
#define HRTIM_TIMD_TIMDCR_UPDGAT_VAL(X) (((uint32_t)(X) & 0xFUL) << 28)
#define HRTIM_TIMD_TIMDCR_PREEN          (0x1UL << 27) 
#define HRTIM_TIMD_TIMDCR_PREEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define HRTIM_TIMD_TIMDCR_DACSYNC          (0x3UL << 25) 
#define HRTIM_TIMD_TIMDCR_DACSYNC_VAL(X) (((uint32_t)(X) & 0x3UL) << 25)
#define HRTIM_TIMD_TIMDCR_MSTU          (0x1UL << 24) 
#define HRTIM_TIMD_TIMDCR_MSTU_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define HRTIM_TIMD_TIMDCR_TEU          (0x1UL << 23) 
#define HRTIM_TIMD_TIMDCR_TEU_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define HRTIM_TIMD_TIMDCR_TDU          (0x1UL << 22) 
#define HRTIM_TIMD_TIMDCR_TDU_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define HRTIM_TIMD_TIMDCR_TCU          (0x1UL << 21) 
#define HRTIM_TIMD_TIMDCR_TCU_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define HRTIM_TIMD_TIMDCR_TBU          (0x1UL << 20) 
#define HRTIM_TIMD_TIMDCR_TBU_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define HRTIM_TIMD_TIMDCR_TxRSTU          (0x1UL << 18) 
#define HRTIM_TIMD_TIMDCR_TxRSTU_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HRTIM_TIMD_TIMDCR_TxREPU          (0x1UL << 17) 
#define HRTIM_TIMD_TIMDCR_TxREPU_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HRTIM_TIMD_TIMDCR_DELCMP4          (0x3UL << 14) 
#define HRTIM_TIMD_TIMDCR_DELCMP4_VAL(X) (((uint32_t)(X) & 0x3UL) << 14)
#define HRTIM_TIMD_TIMDCR_DELCMP2          (0x3UL << 12) 
#define HRTIM_TIMD_TIMDCR_DELCMP2_VAL(X) (((uint32_t)(X) & 0x3UL) << 12)
#define HRTIM_TIMD_TIMDCR_SYNCSTRTx          (0x1UL << 11) 
#define HRTIM_TIMD_TIMDCR_SYNCSTRTx_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define HRTIM_TIMD_TIMDCR_SYNCRSTx          (0x1UL << 10) 
#define HRTIM_TIMD_TIMDCR_SYNCRSTx_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define HRTIM_TIMD_TIMDCR_PSHPLL          (0x1UL << 6) 
#define HRTIM_TIMD_TIMDCR_PSHPLL_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_TIMD_TIMDCR_HALF          (0x1UL << 5) 
#define HRTIM_TIMD_TIMDCR_HALF_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define HRTIM_TIMD_TIMDCR_RETRIG          (0x1UL << 4) 
#define HRTIM_TIMD_TIMDCR_RETRIG_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_TIMD_TIMDCR_CONT          (0x1UL << 3) 
#define HRTIM_TIMD_TIMDCR_CONT_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_TIMD_TIMDCR_CK_PSCx          (0x7UL << 0) 
#define HRTIM_TIMD_TIMDCR_CK_PSCx_VAL(X) (((uint32_t)(X) & 0x7UL) << 0)
#define HRTIM_TIMD_TIMDISR_O2STAT          (0x1UL << 19) 
#define HRTIM_TIMD_TIMDISR_O2STAT_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define HRTIM_TIMD_TIMDISR_O1STAT          (0x1UL << 18) 
#define HRTIM_TIMD_TIMDISR_O1STAT_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HRTIM_TIMD_TIMDISR_IPPSTAT          (0x1UL << 17) 
#define HRTIM_TIMD_TIMDISR_IPPSTAT_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HRTIM_TIMD_TIMDISR_CPPSTAT          (0x1UL << 16) 
#define HRTIM_TIMD_TIMDISR_CPPSTAT_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define HRTIM_TIMD_TIMDISR_DLYPRT          (0x1UL << 14) 
#define HRTIM_TIMD_TIMDISR_DLYPRT_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define HRTIM_TIMD_TIMDISR_RST          (0x1UL << 13) 
#define HRTIM_TIMD_TIMDISR_RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define HRTIM_TIMD_TIMDISR_RSTx2          (0x1UL << 12) 
#define HRTIM_TIMD_TIMDISR_RSTx2_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define HRTIM_TIMD_TIMDISR_SETx2          (0x1UL << 11) 
#define HRTIM_TIMD_TIMDISR_SETx2_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define HRTIM_TIMD_TIMDISR_RSTx1          (0x1UL << 10) 
#define HRTIM_TIMD_TIMDISR_RSTx1_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define HRTIM_TIMD_TIMDISR_SETx1          (0x1UL << 9) 
#define HRTIM_TIMD_TIMDISR_SETx1_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HRTIM_TIMD_TIMDISR_CPT2          (0x1UL << 8) 
#define HRTIM_TIMD_TIMDISR_CPT2_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HRTIM_TIMD_TIMDISR_CPT1          (0x1UL << 7) 
#define HRTIM_TIMD_TIMDISR_CPT1_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define HRTIM_TIMD_TIMDISR_UPD          (0x1UL << 6) 
#define HRTIM_TIMD_TIMDISR_UPD_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_TIMD_TIMDISR_REP          (0x1UL << 4) 
#define HRTIM_TIMD_TIMDISR_REP_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_TIMD_TIMDISR_CMP4          (0x1UL << 3) 
#define HRTIM_TIMD_TIMDISR_CMP4_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_TIMD_TIMDISR_CMP3          (0x1UL << 2) 
#define HRTIM_TIMD_TIMDISR_CMP3_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_TIMD_TIMDISR_CMP2          (0x1UL << 1) 
#define HRTIM_TIMD_TIMDISR_CMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_TIMD_TIMDISR_CMP1          (0x1UL << 0) 
#define HRTIM_TIMD_TIMDISR_CMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_TIMD_TIMDICR_DLYPRTC          (0x1UL << 14) 
#define HRTIM_TIMD_TIMDICR_DLYPRTC_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define HRTIM_TIMD_TIMDICR_RSTC          (0x1UL << 13) 
#define HRTIM_TIMD_TIMDICR_RSTC_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define HRTIM_TIMD_TIMDICR_RSTx2C          (0x1UL << 12) 
#define HRTIM_TIMD_TIMDICR_RSTx2C_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define HRTIM_TIMD_TIMDICR_SET2xC          (0x1UL << 11) 
#define HRTIM_TIMD_TIMDICR_SET2xC_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define HRTIM_TIMD_TIMDICR_RSTx1C          (0x1UL << 10) 
#define HRTIM_TIMD_TIMDICR_RSTx1C_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define HRTIM_TIMD_TIMDICR_SET1xC          (0x1UL << 9) 
#define HRTIM_TIMD_TIMDICR_SET1xC_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HRTIM_TIMD_TIMDICR_CPT2C          (0x1UL << 8) 
#define HRTIM_TIMD_TIMDICR_CPT2C_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HRTIM_TIMD_TIMDICR_CPT1C          (0x1UL << 7) 
#define HRTIM_TIMD_TIMDICR_CPT1C_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define HRTIM_TIMD_TIMDICR_UPDC          (0x1UL << 6) 
#define HRTIM_TIMD_TIMDICR_UPDC_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_TIMD_TIMDICR_REPC          (0x1UL << 4) 
#define HRTIM_TIMD_TIMDICR_REPC_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_TIMD_TIMDICR_CMP4C          (0x1UL << 3) 
#define HRTIM_TIMD_TIMDICR_CMP4C_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_TIMD_TIMDICR_CMP3C          (0x1UL << 2) 
#define HRTIM_TIMD_TIMDICR_CMP3C_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_TIMD_TIMDICR_CMP2C          (0x1UL << 1) 
#define HRTIM_TIMD_TIMDICR_CMP2C_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_TIMD_TIMDICR_CMP1C          (0x1UL << 0) 
#define HRTIM_TIMD_TIMDICR_CMP1C_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_TIMD_TIMDDIER5_DLYPRTDE          (0x1UL << 30) 
#define HRTIM_TIMD_TIMDDIER5_DLYPRTDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define HRTIM_TIMD_TIMDDIER5_RSTDE          (0x1UL << 29) 
#define HRTIM_TIMD_TIMDDIER5_RSTDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define HRTIM_TIMD_TIMDDIER5_RSTx2DE          (0x1UL << 28) 
#define HRTIM_TIMD_TIMDDIER5_RSTx2DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define HRTIM_TIMD_TIMDDIER5_SETx2DE          (0x1UL << 27) 
#define HRTIM_TIMD_TIMDDIER5_SETx2DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define HRTIM_TIMD_TIMDDIER5_RSTx1DE          (0x1UL << 26) 
#define HRTIM_TIMD_TIMDDIER5_RSTx1DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define HRTIM_TIMD_TIMDDIER5_SET1xDE          (0x1UL << 25) 
#define HRTIM_TIMD_TIMDDIER5_SET1xDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define HRTIM_TIMD_TIMDDIER5_CPT2DE          (0x1UL << 24) 
#define HRTIM_TIMD_TIMDDIER5_CPT2DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define HRTIM_TIMD_TIMDDIER5_CPT1DE          (0x1UL << 23) 
#define HRTIM_TIMD_TIMDDIER5_CPT1DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define HRTIM_TIMD_TIMDDIER5_UPDDE          (0x1UL << 22) 
#define HRTIM_TIMD_TIMDDIER5_UPDDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define HRTIM_TIMD_TIMDDIER5_REPDE          (0x1UL << 20) 
#define HRTIM_TIMD_TIMDDIER5_REPDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define HRTIM_TIMD_TIMDDIER5_CMP4DE          (0x1UL << 19) 
#define HRTIM_TIMD_TIMDDIER5_CMP4DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define HRTIM_TIMD_TIMDDIER5_CMP3DE          (0x1UL << 18) 
#define HRTIM_TIMD_TIMDDIER5_CMP3DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HRTIM_TIMD_TIMDDIER5_CMP2DE          (0x1UL << 17) 
#define HRTIM_TIMD_TIMDDIER5_CMP2DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HRTIM_TIMD_TIMDDIER5_CMP1DE          (0x1UL << 16) 
#define HRTIM_TIMD_TIMDDIER5_CMP1DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define HRTIM_TIMD_TIMDDIER5_DLYPRTIE          (0x1UL << 14) 
#define HRTIM_TIMD_TIMDDIER5_DLYPRTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define HRTIM_TIMD_TIMDDIER5_RSTIE          (0x1UL << 13) 
#define HRTIM_TIMD_TIMDDIER5_RSTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define HRTIM_TIMD_TIMDDIER5_RSTx2IE          (0x1UL << 12) 
#define HRTIM_TIMD_TIMDDIER5_RSTx2IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define HRTIM_TIMD_TIMDDIER5_SETx2IE          (0x1UL << 11) 
#define HRTIM_TIMD_TIMDDIER5_SETx2IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define HRTIM_TIMD_TIMDDIER5_RSTx1IE          (0x1UL << 10) 
#define HRTIM_TIMD_TIMDDIER5_RSTx1IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define HRTIM_TIMD_TIMDDIER5_SET1xIE          (0x1UL << 9) 
#define HRTIM_TIMD_TIMDDIER5_SET1xIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HRTIM_TIMD_TIMDDIER5_CPT2IE          (0x1UL << 8) 
#define HRTIM_TIMD_TIMDDIER5_CPT2IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HRTIM_TIMD_TIMDDIER5_CPT1IE          (0x1UL << 7) 
#define HRTIM_TIMD_TIMDDIER5_CPT1IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define HRTIM_TIMD_TIMDDIER5_UPDIE          (0x1UL << 6) 
#define HRTIM_TIMD_TIMDDIER5_UPDIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_TIMD_TIMDDIER5_REPIE          (0x1UL << 4) 
#define HRTIM_TIMD_TIMDDIER5_REPIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_TIMD_TIMDDIER5_CMP4IE          (0x1UL << 3) 
#define HRTIM_TIMD_TIMDDIER5_CMP4IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_TIMD_TIMDDIER5_CMP3IE          (0x1UL << 2) 
#define HRTIM_TIMD_TIMDDIER5_CMP3IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_TIMD_TIMDDIER5_CMP2IE          (0x1UL << 1) 
#define HRTIM_TIMD_TIMDDIER5_CMP2IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_TIMD_TIMDDIER5_CMP1IE          (0x1UL << 0) 
#define HRTIM_TIMD_TIMDDIER5_CMP1IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_TIMD_CNTDR_CNTx          (0xFFFFUL << 0) 
#define HRTIM_TIMD_CNTDR_CNTx_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define HRTIM_TIMD_PERDR_PERx          (0xFFFFUL << 0) 
#define HRTIM_TIMD_PERDR_PERx_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define HRTIM_TIMD_REPDR_REPx          (0xFFUL << 0) 
#define HRTIM_TIMD_REPDR_REPx_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HRTIM_TIMD_CMP1DR_CMP1x          (0xFFFFUL << 0) 
#define HRTIM_TIMD_CMP1DR_CMP1x_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define HRTIM_TIMD_CMP1CDR_REPx          (0xFFUL << 16) 
#define HRTIM_TIMD_CMP1CDR_REPx_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define HRTIM_TIMD_CMP1CDR_CMP1x          (0xFFFFUL << 0) 
#define HRTIM_TIMD_CMP1CDR_CMP1x_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define HRTIM_TIMD_CMP2DR_CMP2x          (0xFFFFUL << 0) 
#define HRTIM_TIMD_CMP2DR_CMP2x_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define HRTIM_TIMD_CMP3DR_CMP3x          (0xFFFFUL << 0) 
#define HRTIM_TIMD_CMP3DR_CMP3x_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define HRTIM_TIMD_CMP4DR_CMP4x          (0xFFFFUL << 0) 
#define HRTIM_TIMD_CMP4DR_CMP4x_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define HRTIM_TIMD_CPT1DR_CPT1x          (0xFFFFUL << 0) 
#define HRTIM_TIMD_CPT1DR_CPT1x_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define HRTIM_TIMD_CPT2DR_CPT2x          (0xFFFFUL << 0) 
#define HRTIM_TIMD_CPT2DR_CPT2x_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define HRTIM_TIMD_DTDR_DTFLKx          (0x1UL << 31) 
#define HRTIM_TIMD_DTDR_DTFLKx_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HRTIM_TIMD_DTDR_DTFSLKx          (0x1UL << 30) 
#define HRTIM_TIMD_DTDR_DTFSLKx_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define HRTIM_TIMD_DTDR_SDTFx          (0x1UL << 25) 
#define HRTIM_TIMD_DTDR_SDTFx_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define HRTIM_TIMD_DTDR_DTFx          (0x1FFUL << 16) 
#define HRTIM_TIMD_DTDR_DTFx_VAL(X) (((uint32_t)(X) & 0x1FFUL) << 16)
#define HRTIM_TIMD_DTDR_DTRLKx          (0x1UL << 15) 
#define HRTIM_TIMD_DTDR_DTRLKx_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define HRTIM_TIMD_DTDR_DTRSLKx          (0x1UL << 14) 
#define HRTIM_TIMD_DTDR_DTRSLKx_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define HRTIM_TIMD_DTDR_DTPRSC          (0x7UL << 10) 
#define HRTIM_TIMD_DTDR_DTPRSC_VAL(X) (((uint32_t)(X) & 0x7UL) << 10)
#define HRTIM_TIMD_DTDR_SDTRx          (0x1UL << 9) 
#define HRTIM_TIMD_DTDR_SDTRx_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HRTIM_TIMD_DTDR_DTRx          (0x1FFUL << 0) 
#define HRTIM_TIMD_DTDR_DTRx_VAL(X) (((uint32_t)(X) & 0x1FFUL) << 0)
#define HRTIM_TIMD_SETD1R_UPDATE          (0x1UL << 31) 
#define HRTIM_TIMD_SETD1R_UPDATE_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HRTIM_TIMD_SETD1R_EXTEVNT10          (0x1UL << 30) 
#define HRTIM_TIMD_SETD1R_EXTEVNT10_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define HRTIM_TIMD_SETD1R_EXTEVNT9          (0x1UL << 29) 
#define HRTIM_TIMD_SETD1R_EXTEVNT9_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define HRTIM_TIMD_SETD1R_EXTEVNT8          (0x1UL << 28) 
#define HRTIM_TIMD_SETD1R_EXTEVNT8_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define HRTIM_TIMD_SETD1R_EXTEVNT7          (0x1UL << 27) 
#define HRTIM_TIMD_SETD1R_EXTEVNT7_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define HRTIM_TIMD_SETD1R_EXTEVNT6          (0x1UL << 26) 
#define HRTIM_TIMD_SETD1R_EXTEVNT6_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define HRTIM_TIMD_SETD1R_EXTEVNT5          (0x1UL << 25) 
#define HRTIM_TIMD_SETD1R_EXTEVNT5_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define HRTIM_TIMD_SETD1R_EXTEVNT4          (0x1UL << 24) 
#define HRTIM_TIMD_SETD1R_EXTEVNT4_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define HRTIM_TIMD_SETD1R_EXTEVNT3          (0x1UL << 23) 
#define HRTIM_TIMD_SETD1R_EXTEVNT3_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define HRTIM_TIMD_SETD1R_EXTEVNT2          (0x1UL << 22) 
#define HRTIM_TIMD_SETD1R_EXTEVNT2_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define HRTIM_TIMD_SETD1R_EXTEVNT1          (0x1UL << 21) 
#define HRTIM_TIMD_SETD1R_EXTEVNT1_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define HRTIM_TIMD_SETD1R_TIMEVNT9          (0x1UL << 20) 
#define HRTIM_TIMD_SETD1R_TIMEVNT9_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define HRTIM_TIMD_SETD1R_TIMEVNT8          (0x1UL << 19) 
#define HRTIM_TIMD_SETD1R_TIMEVNT8_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define HRTIM_TIMD_SETD1R_TIMEVNT7          (0x1UL << 18) 
#define HRTIM_TIMD_SETD1R_TIMEVNT7_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HRTIM_TIMD_SETD1R_TIMEVNT6          (0x1UL << 17) 
#define HRTIM_TIMD_SETD1R_TIMEVNT6_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HRTIM_TIMD_SETD1R_TIMEVNT5          (0x1UL << 16) 
#define HRTIM_TIMD_SETD1R_TIMEVNT5_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define HRTIM_TIMD_SETD1R_TIMEVNT4          (0x1UL << 15) 
#define HRTIM_TIMD_SETD1R_TIMEVNT4_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define HRTIM_TIMD_SETD1R_TIMEVNT3          (0x1UL << 14) 
#define HRTIM_TIMD_SETD1R_TIMEVNT3_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define HRTIM_TIMD_SETD1R_TIMEVNT2          (0x1UL << 13) 
#define HRTIM_TIMD_SETD1R_TIMEVNT2_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define HRTIM_TIMD_SETD1R_TIMEVNT1          (0x1UL << 12) 
#define HRTIM_TIMD_SETD1R_TIMEVNT1_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define HRTIM_TIMD_SETD1R_MSTCMP4          (0x1UL << 11) 
#define HRTIM_TIMD_SETD1R_MSTCMP4_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define HRTIM_TIMD_SETD1R_MSTCMP3          (0x1UL << 10) 
#define HRTIM_TIMD_SETD1R_MSTCMP3_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define HRTIM_TIMD_SETD1R_MSTCMP2          (0x1UL << 9) 
#define HRTIM_TIMD_SETD1R_MSTCMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HRTIM_TIMD_SETD1R_MSTCMP1          (0x1UL << 8) 
#define HRTIM_TIMD_SETD1R_MSTCMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HRTIM_TIMD_SETD1R_MSTPER          (0x1UL << 7) 
#define HRTIM_TIMD_SETD1R_MSTPER_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define HRTIM_TIMD_SETD1R_CMP4          (0x1UL << 6) 
#define HRTIM_TIMD_SETD1R_CMP4_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_TIMD_SETD1R_CMP3          (0x1UL << 5) 
#define HRTIM_TIMD_SETD1R_CMP3_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define HRTIM_TIMD_SETD1R_CMP2          (0x1UL << 4) 
#define HRTIM_TIMD_SETD1R_CMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_TIMD_SETD1R_CMP1          (0x1UL << 3) 
#define HRTIM_TIMD_SETD1R_CMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_TIMD_SETD1R_PER          (0x1UL << 2) 
#define HRTIM_TIMD_SETD1R_PER_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_TIMD_SETD1R_RESYNC          (0x1UL << 1) 
#define HRTIM_TIMD_SETD1R_RESYNC_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_TIMD_SETD1R_SST          (0x1UL << 0) 
#define HRTIM_TIMD_SETD1R_SST_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_TIMD_RSTD1R_UPDATE          (0x1UL << 31) 
#define HRTIM_TIMD_RSTD1R_UPDATE_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HRTIM_TIMD_RSTD1R_EXTEVNT10          (0x1UL << 30) 
#define HRTIM_TIMD_RSTD1R_EXTEVNT10_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define HRTIM_TIMD_RSTD1R_EXTEVNT9          (0x1UL << 29) 
#define HRTIM_TIMD_RSTD1R_EXTEVNT9_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define HRTIM_TIMD_RSTD1R_EXTEVNT8          (0x1UL << 28) 
#define HRTIM_TIMD_RSTD1R_EXTEVNT8_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define HRTIM_TIMD_RSTD1R_EXTEVNT7          (0x1UL << 27) 
#define HRTIM_TIMD_RSTD1R_EXTEVNT7_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define HRTIM_TIMD_RSTD1R_EXTEVNT6          (0x1UL << 26) 
#define HRTIM_TIMD_RSTD1R_EXTEVNT6_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define HRTIM_TIMD_RSTD1R_EXTEVNT5          (0x1UL << 25) 
#define HRTIM_TIMD_RSTD1R_EXTEVNT5_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define HRTIM_TIMD_RSTD1R_EXTEVNT4          (0x1UL << 24) 
#define HRTIM_TIMD_RSTD1R_EXTEVNT4_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define HRTIM_TIMD_RSTD1R_EXTEVNT3          (0x1UL << 23) 
#define HRTIM_TIMD_RSTD1R_EXTEVNT3_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define HRTIM_TIMD_RSTD1R_EXTEVNT2          (0x1UL << 22) 
#define HRTIM_TIMD_RSTD1R_EXTEVNT2_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define HRTIM_TIMD_RSTD1R_EXTEVNT1          (0x1UL << 21) 
#define HRTIM_TIMD_RSTD1R_EXTEVNT1_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define HRTIM_TIMD_RSTD1R_TIMEVNT9          (0x1UL << 20) 
#define HRTIM_TIMD_RSTD1R_TIMEVNT9_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define HRTIM_TIMD_RSTD1R_TIMEVNT8          (0x1UL << 19) 
#define HRTIM_TIMD_RSTD1R_TIMEVNT8_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define HRTIM_TIMD_RSTD1R_TIMEVNT7          (0x1UL << 18) 
#define HRTIM_TIMD_RSTD1R_TIMEVNT7_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HRTIM_TIMD_RSTD1R_TIMEVNT6          (0x1UL << 17) 
#define HRTIM_TIMD_RSTD1R_TIMEVNT6_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HRTIM_TIMD_RSTD1R_TIMEVNT5          (0x1UL << 16) 
#define HRTIM_TIMD_RSTD1R_TIMEVNT5_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define HRTIM_TIMD_RSTD1R_TIMEVNT4          (0x1UL << 15) 
#define HRTIM_TIMD_RSTD1R_TIMEVNT4_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define HRTIM_TIMD_RSTD1R_TIMEVNT3          (0x1UL << 14) 
#define HRTIM_TIMD_RSTD1R_TIMEVNT3_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define HRTIM_TIMD_RSTD1R_TIMEVNT2          (0x1UL << 13) 
#define HRTIM_TIMD_RSTD1R_TIMEVNT2_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define HRTIM_TIMD_RSTD1R_TIMEVNT1          (0x1UL << 12) 
#define HRTIM_TIMD_RSTD1R_TIMEVNT1_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define HRTIM_TIMD_RSTD1R_MSTCMP4          (0x1UL << 11) 
#define HRTIM_TIMD_RSTD1R_MSTCMP4_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define HRTIM_TIMD_RSTD1R_MSTCMP3          (0x1UL << 10) 
#define HRTIM_TIMD_RSTD1R_MSTCMP3_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define HRTIM_TIMD_RSTD1R_MSTCMP2          (0x1UL << 9) 
#define HRTIM_TIMD_RSTD1R_MSTCMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HRTIM_TIMD_RSTD1R_MSTCMP1          (0x1UL << 8) 
#define HRTIM_TIMD_RSTD1R_MSTCMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HRTIM_TIMD_RSTD1R_MSTPER          (0x1UL << 7) 
#define HRTIM_TIMD_RSTD1R_MSTPER_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define HRTIM_TIMD_RSTD1R_CMP4          (0x1UL << 6) 
#define HRTIM_TIMD_RSTD1R_CMP4_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_TIMD_RSTD1R_CMP3          (0x1UL << 5) 
#define HRTIM_TIMD_RSTD1R_CMP3_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define HRTIM_TIMD_RSTD1R_CMP2          (0x1UL << 4) 
#define HRTIM_TIMD_RSTD1R_CMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_TIMD_RSTD1R_CMP1          (0x1UL << 3) 
#define HRTIM_TIMD_RSTD1R_CMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_TIMD_RSTD1R_PER          (0x1UL << 2) 
#define HRTIM_TIMD_RSTD1R_PER_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_TIMD_RSTD1R_RESYNC          (0x1UL << 1) 
#define HRTIM_TIMD_RSTD1R_RESYNC_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_TIMD_RSTD1R_SRT          (0x1UL << 0) 
#define HRTIM_TIMD_RSTD1R_SRT_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_TIMD_SETD2R_UPDATE          (0x1UL << 31) 
#define HRTIM_TIMD_SETD2R_UPDATE_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HRTIM_TIMD_SETD2R_EXTEVNT10          (0x1UL << 30) 
#define HRTIM_TIMD_SETD2R_EXTEVNT10_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define HRTIM_TIMD_SETD2R_EXTEVNT9          (0x1UL << 29) 
#define HRTIM_TIMD_SETD2R_EXTEVNT9_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define HRTIM_TIMD_SETD2R_EXTEVNT8          (0x1UL << 28) 
#define HRTIM_TIMD_SETD2R_EXTEVNT8_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define HRTIM_TIMD_SETD2R_EXTEVNT7          (0x1UL << 27) 
#define HRTIM_TIMD_SETD2R_EXTEVNT7_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define HRTIM_TIMD_SETD2R_EXTEVNT6          (0x1UL << 26) 
#define HRTIM_TIMD_SETD2R_EXTEVNT6_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define HRTIM_TIMD_SETD2R_EXTEVNT5          (0x1UL << 25) 
#define HRTIM_TIMD_SETD2R_EXTEVNT5_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define HRTIM_TIMD_SETD2R_EXTEVNT4          (0x1UL << 24) 
#define HRTIM_TIMD_SETD2R_EXTEVNT4_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define HRTIM_TIMD_SETD2R_EXTEVNT3          (0x1UL << 23) 
#define HRTIM_TIMD_SETD2R_EXTEVNT3_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define HRTIM_TIMD_SETD2R_EXTEVNT2          (0x1UL << 22) 
#define HRTIM_TIMD_SETD2R_EXTEVNT2_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define HRTIM_TIMD_SETD2R_EXTEVNT1          (0x1UL << 21) 
#define HRTIM_TIMD_SETD2R_EXTEVNT1_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define HRTIM_TIMD_SETD2R_TIMEVNT9          (0x1UL << 20) 
#define HRTIM_TIMD_SETD2R_TIMEVNT9_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define HRTIM_TIMD_SETD2R_TIMEVNT8          (0x1UL << 19) 
#define HRTIM_TIMD_SETD2R_TIMEVNT8_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define HRTIM_TIMD_SETD2R_TIMEVNT7          (0x1UL << 18) 
#define HRTIM_TIMD_SETD2R_TIMEVNT7_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HRTIM_TIMD_SETD2R_TIMEVNT6          (0x1UL << 17) 
