via/viaems/src/platforms/stm32h743/device.h
#define HRTIM_TIMD  ((struct HRTIM_TIMD*)(0x40017600UL))
struct HRTIM_TIME {
  volatile uint32_t TIMECR;
  volatile const uint32_t TIMEISR;
  volatile uint32_t TIMEICR;
  volatile uint32_t TIMEDIER5;
  volatile uint32_t CNTER;
  volatile uint32_t PERER;
  volatile uint32_t REPER;
  volatile uint32_t CMP1ER;
  volatile uint32_t CMP1CER;
  volatile uint32_t CMP2ER;
  volatile uint32_t CMP3ER;
  volatile uint32_t CMP4ER;
  volatile const uint32_t CPT1ER;
  volatile const uint32_t CPT2ER;
  volatile uint32_t DTER;
  volatile uint32_t SETE1R;
  volatile uint32_t RSTE1R;
  volatile uint32_t SETE2R;
  volatile uint32_t RSTE2R;
  volatile uint32_t EEFER1;
  volatile uint32_t EEFER2;
  volatile uint32_t RSTER;
  volatile uint32_t CHPER;
  volatile uint32_t CPT1ECR;
  volatile uint32_t CPT2ECR;
  volatile uint32_t OUTER;
  volatile uint32_t FLTER;
};
#define HRTIM_TIME_TIMECR_UPDGAT          (0xFUL << 28) 
#define HRTIM_TIME_TIMECR_UPDGAT_VAL(X) (((uint32_t)(X) & 0xFUL) << 28)
#define HRTIM_TIME_TIMECR_PREEN          (0x1UL << 27) 
#define HRTIM_TIME_TIMECR_PREEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define HRTIM_TIME_TIMECR_DACSYNC          (0x3UL << 25) 
#define HRTIM_TIME_TIMECR_DACSYNC_VAL(X) (((uint32_t)(X) & 0x3UL) << 25)
#define HRTIM_TIME_TIMECR_MSTU          (0x1UL << 24) 
#define HRTIM_TIME_TIMECR_MSTU_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define HRTIM_TIME_TIMECR_TEU          (0x1UL << 23) 
#define HRTIM_TIME_TIMECR_TEU_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define HRTIM_TIME_TIMECR_TDU          (0x1UL << 22) 
#define HRTIM_TIME_TIMECR_TDU_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define HRTIM_TIME_TIMECR_TCU          (0x1UL << 21) 
#define HRTIM_TIME_TIMECR_TCU_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define HRTIM_TIME_TIMECR_TBU          (0x1UL << 20) 
#define HRTIM_TIME_TIMECR_TBU_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define HRTIM_TIME_TIMECR_TxRSTU          (0x1UL << 18) 
#define HRTIM_TIME_TIMECR_TxRSTU_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HRTIM_TIME_TIMECR_TxREPU          (0x1UL << 17) 
#define HRTIM_TIME_TIMECR_TxREPU_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HRTIM_TIME_TIMECR_DELCMP4          (0x3UL << 14) 
#define HRTIM_TIME_TIMECR_DELCMP4_VAL(X) (((uint32_t)(X) & 0x3UL) << 14)
#define HRTIM_TIME_TIMECR_DELCMP2          (0x3UL << 12) 
#define HRTIM_TIME_TIMECR_DELCMP2_VAL(X) (((uint32_t)(X) & 0x3UL) << 12)
#define HRTIM_TIME_TIMECR_SYNCSTRTx          (0x1UL << 11) 
#define HRTIM_TIME_TIMECR_SYNCSTRTx_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define HRTIM_TIME_TIMECR_SYNCRSTx          (0x1UL << 10) 
#define HRTIM_TIME_TIMECR_SYNCRSTx_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define HRTIM_TIME_TIMECR_PSHPLL          (0x1UL << 6) 
#define HRTIM_TIME_TIMECR_PSHPLL_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_TIME_TIMECR_HALF          (0x1UL << 5) 
#define HRTIM_TIME_TIMECR_HALF_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define HRTIM_TIME_TIMECR_RETRIG          (0x1UL << 4) 
#define HRTIM_TIME_TIMECR_RETRIG_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_TIME_TIMECR_CONT          (0x1UL << 3) 
#define HRTIM_TIME_TIMECR_CONT_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_TIME_TIMECR_CK_PSCx          (0x7UL << 0) 
#define HRTIM_TIME_TIMECR_CK_PSCx_VAL(X) (((uint32_t)(X) & 0x7UL) << 0)
#define HRTIM_TIME_TIMEISR_O2STAT          (0x1UL << 19) 
#define HRTIM_TIME_TIMEISR_O2STAT_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define HRTIM_TIME_TIMEISR_O1STAT          (0x1UL << 18) 
#define HRTIM_TIME_TIMEISR_O1STAT_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HRTIM_TIME_TIMEISR_IPPSTAT          (0x1UL << 17) 
#define HRTIM_TIME_TIMEISR_IPPSTAT_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HRTIM_TIME_TIMEISR_CPPSTAT          (0x1UL << 16) 
#define HRTIM_TIME_TIMEISR_CPPSTAT_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define HRTIM_TIME_TIMEISR_DLYPRT          (0x1UL << 14) 
#define HRTIM_TIME_TIMEISR_DLYPRT_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define HRTIM_TIME_TIMEISR_RST          (0x1UL << 13) 
#define HRTIM_TIME_TIMEISR_RST_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define HRTIM_TIME_TIMEISR_RSTx2          (0x1UL << 12) 
#define HRTIM_TIME_TIMEISR_RSTx2_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define HRTIM_TIME_TIMEISR_SETx2          (0x1UL << 11) 
#define HRTIM_TIME_TIMEISR_SETx2_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define HRTIM_TIME_TIMEISR_RSTx1          (0x1UL << 10) 
#define HRTIM_TIME_TIMEISR_RSTx1_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define HRTIM_TIME_TIMEISR_SETx1          (0x1UL << 9) 
#define HRTIM_TIME_TIMEISR_SETx1_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HRTIM_TIME_TIMEISR_CPT2          (0x1UL << 8) 
#define HRTIM_TIME_TIMEISR_CPT2_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HRTIM_TIME_TIMEISR_CPT1          (0x1UL << 7) 
#define HRTIM_TIME_TIMEISR_CPT1_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define HRTIM_TIME_TIMEISR_UPD          (0x1UL << 6) 
#define HRTIM_TIME_TIMEISR_UPD_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_TIME_TIMEISR_REP          (0x1UL << 4) 
#define HRTIM_TIME_TIMEISR_REP_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_TIME_TIMEISR_CMP4          (0x1UL << 3) 
#define HRTIM_TIME_TIMEISR_CMP4_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_TIME_TIMEISR_CMP3          (0x1UL << 2) 
#define HRTIM_TIME_TIMEISR_CMP3_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_TIME_TIMEISR_CMP2          (0x1UL << 1) 
#define HRTIM_TIME_TIMEISR_CMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_TIME_TIMEISR_CMP1          (0x1UL << 0) 
#define HRTIM_TIME_TIMEISR_CMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_TIME_TIMEICR_DLYPRTC          (0x1UL << 14) 
#define HRTIM_TIME_TIMEICR_DLYPRTC_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define HRTIM_TIME_TIMEICR_RSTC          (0x1UL << 13) 
#define HRTIM_TIME_TIMEICR_RSTC_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define HRTIM_TIME_TIMEICR_RSTx2C          (0x1UL << 12) 
#define HRTIM_TIME_TIMEICR_RSTx2C_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define HRTIM_TIME_TIMEICR_SET2xC          (0x1UL << 11) 
#define HRTIM_TIME_TIMEICR_SET2xC_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define HRTIM_TIME_TIMEICR_RSTx1C          (0x1UL << 10) 
#define HRTIM_TIME_TIMEICR_RSTx1C_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define HRTIM_TIME_TIMEICR_SET1xC          (0x1UL << 9) 
#define HRTIM_TIME_TIMEICR_SET1xC_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HRTIM_TIME_TIMEICR_CPT2C          (0x1UL << 8) 
#define HRTIM_TIME_TIMEICR_CPT2C_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HRTIM_TIME_TIMEICR_CPT1C          (0x1UL << 7) 
#define HRTIM_TIME_TIMEICR_CPT1C_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define HRTIM_TIME_TIMEICR_UPDC          (0x1UL << 6) 
#define HRTIM_TIME_TIMEICR_UPDC_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_TIME_TIMEICR_REPC          (0x1UL << 4) 
#define HRTIM_TIME_TIMEICR_REPC_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_TIME_TIMEICR_CMP4C          (0x1UL << 3) 
#define HRTIM_TIME_TIMEICR_CMP4C_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_TIME_TIMEICR_CMP3C          (0x1UL << 2) 
#define HRTIM_TIME_TIMEICR_CMP3C_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_TIME_TIMEICR_CMP2C          (0x1UL << 1) 
#define HRTIM_TIME_TIMEICR_CMP2C_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_TIME_TIMEICR_CMP1C          (0x1UL << 0) 
#define HRTIM_TIME_TIMEICR_CMP1C_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_TIME_TIMEDIER5_DLYPRTDE          (0x1UL << 30) 
#define HRTIM_TIME_TIMEDIER5_DLYPRTDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define HRTIM_TIME_TIMEDIER5_RSTDE          (0x1UL << 29) 
#define HRTIM_TIME_TIMEDIER5_RSTDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define HRTIM_TIME_TIMEDIER5_RSTx2DE          (0x1UL << 28) 
#define HRTIM_TIME_TIMEDIER5_RSTx2DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define HRTIM_TIME_TIMEDIER5_SETx2DE          (0x1UL << 27) 
#define HRTIM_TIME_TIMEDIER5_SETx2DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define HRTIM_TIME_TIMEDIER5_RSTx1DE          (0x1UL << 26) 
#define HRTIM_TIME_TIMEDIER5_RSTx1DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define HRTIM_TIME_TIMEDIER5_SET1xDE          (0x1UL << 25) 
#define HRTIM_TIME_TIMEDIER5_SET1xDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define HRTIM_TIME_TIMEDIER5_CPT2DE          (0x1UL << 24) 
#define HRTIM_TIME_TIMEDIER5_CPT2DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define HRTIM_TIME_TIMEDIER5_CPT1DE          (0x1UL << 23) 
#define HRTIM_TIME_TIMEDIER5_CPT1DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define HRTIM_TIME_TIMEDIER5_UPDDE          (0x1UL << 22) 
#define HRTIM_TIME_TIMEDIER5_UPDDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define HRTIM_TIME_TIMEDIER5_REPDE          (0x1UL << 20) 
#define HRTIM_TIME_TIMEDIER5_REPDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define HRTIM_TIME_TIMEDIER5_CMP4DE          (0x1UL << 19) 
#define HRTIM_TIME_TIMEDIER5_CMP4DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define HRTIM_TIME_TIMEDIER5_CMP3DE          (0x1UL << 18) 
#define HRTIM_TIME_TIMEDIER5_CMP3DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HRTIM_TIME_TIMEDIER5_CMP2DE          (0x1UL << 17) 
#define HRTIM_TIME_TIMEDIER5_CMP2DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HRTIM_TIME_TIMEDIER5_CMP1DE          (0x1UL << 16) 
#define HRTIM_TIME_TIMEDIER5_CMP1DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define HRTIM_TIME_TIMEDIER5_DLYPRTIE          (0x1UL << 14) 
#define HRTIM_TIME_TIMEDIER5_DLYPRTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define HRTIM_TIME_TIMEDIER5_RSTIE          (0x1UL << 13) 
#define HRTIM_TIME_TIMEDIER5_RSTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define HRTIM_TIME_TIMEDIER5_RSTx2IE          (0x1UL << 12) 
#define HRTIM_TIME_TIMEDIER5_RSTx2IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define HRTIM_TIME_TIMEDIER5_SETx2IE          (0x1UL << 11) 
#define HRTIM_TIME_TIMEDIER5_SETx2IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define HRTIM_TIME_TIMEDIER5_RSTx1IE          (0x1UL << 10) 
#define HRTIM_TIME_TIMEDIER5_RSTx1IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define HRTIM_TIME_TIMEDIER5_SET1xIE          (0x1UL << 9) 
#define HRTIM_TIME_TIMEDIER5_SET1xIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HRTIM_TIME_TIMEDIER5_CPT2IE          (0x1UL << 8) 
#define HRTIM_TIME_TIMEDIER5_CPT2IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HRTIM_TIME_TIMEDIER5_CPT1IE          (0x1UL << 7) 
#define HRTIM_TIME_TIMEDIER5_CPT1IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define HRTIM_TIME_TIMEDIER5_UPDIE          (0x1UL << 6) 
#define HRTIM_TIME_TIMEDIER5_UPDIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_TIME_TIMEDIER5_REPIE          (0x1UL << 4) 
#define HRTIM_TIME_TIMEDIER5_REPIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_TIME_TIMEDIER5_CMP4IE          (0x1UL << 3) 
#define HRTIM_TIME_TIMEDIER5_CMP4IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_TIME_TIMEDIER5_CMP3IE          (0x1UL << 2) 
#define HRTIM_TIME_TIMEDIER5_CMP3IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_TIME_TIMEDIER5_CMP2IE          (0x1UL << 1) 
#define HRTIM_TIME_TIMEDIER5_CMP2IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_TIME_TIMEDIER5_CMP1IE          (0x1UL << 0) 
#define HRTIM_TIME_TIMEDIER5_CMP1IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_TIME_CNTER_CNTx          (0xFFFFUL << 0) 
#define HRTIM_TIME_CNTER_CNTx_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define HRTIM_TIME_PERER_PERx          (0xFFFFUL << 0) 
#define HRTIM_TIME_PERER_PERx_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define HRTIM_TIME_REPER_REPx          (0xFFUL << 0) 
#define HRTIM_TIME_REPER_REPx_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define HRTIM_TIME_CMP1ER_CMP1x          (0xFFFFUL << 0) 
#define HRTIM_TIME_CMP1ER_CMP1x_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define HRTIM_TIME_CMP1CER_REPx          (0xFFUL << 16) 
#define HRTIM_TIME_CMP1CER_REPx_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define HRTIM_TIME_CMP1CER_CMP1x          (0xFFFFUL << 0) 
#define HRTIM_TIME_CMP1CER_CMP1x_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define HRTIM_TIME_CMP2ER_CMP2x          (0xFFFFUL << 0) 
#define HRTIM_TIME_CMP2ER_CMP2x_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define HRTIM_TIME_CMP3ER_CMP3x          (0xFFFFUL << 0) 
#define HRTIM_TIME_CMP3ER_CMP3x_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define HRTIM_TIME_CMP4ER_CMP4x          (0xFFFFUL << 0) 
#define HRTIM_TIME_CMP4ER_CMP4x_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define HRTIM_TIME_CPT1ER_CPT1x          (0xFFFFUL << 0) 
#define HRTIM_TIME_CPT1ER_CPT1x_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define HRTIM_TIME_CPT2ER_CPT2x          (0xFFFFUL << 0) 
#define HRTIM_TIME_CPT2ER_CPT2x_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define HRTIM_TIME_DTER_DTFLKx          (0x1UL << 31) 
#define HRTIM_TIME_DTER_DTFLKx_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HRTIM_TIME_DTER_DTFSLKx          (0x1UL << 30) 
#define HRTIM_TIME_DTER_DTFSLKx_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define HRTIM_TIME_DTER_SDTFx          (0x1UL << 25) 
#define HRTIM_TIME_DTER_SDTFx_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define HRTIM_TIME_DTER_DTFx          (0x1FFUL << 16) 
#define HRTIM_TIME_DTER_DTFx_VAL(X) (((uint32_t)(X) & 0x1FFUL) << 16)
#define HRTIM_TIME_DTER_DTRLKx          (0x1UL << 15) 
#define HRTIM_TIME_DTER_DTRLKx_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define HRTIM_TIME_DTER_DTRSLKx          (0x1UL << 14) 
#define HRTIM_TIME_DTER_DTRSLKx_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define HRTIM_TIME_DTER_DTPRSC          (0x7UL << 10) 
#define HRTIM_TIME_DTER_DTPRSC_VAL(X) (((uint32_t)(X) & 0x7UL) << 10)
#define HRTIM_TIME_DTER_SDTRx          (0x1UL << 9) 
#define HRTIM_TIME_DTER_SDTRx_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HRTIM_TIME_DTER_DTRx          (0x1FFUL << 0) 
#define HRTIM_TIME_DTER_DTRx_VAL(X) (((uint32_t)(X) & 0x1FFUL) << 0)
#define HRTIM_TIME_SETE1R_UPDATE          (0x1UL << 31) 
#define HRTIM_TIME_SETE1R_UPDATE_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HRTIM_TIME_SETE1R_EXTEVNT10          (0x1UL << 30) 
#define HRTIM_TIME_SETE1R_EXTEVNT10_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define HRTIM_TIME_SETE1R_EXTEVNT9          (0x1UL << 29) 
#define HRTIM_TIME_SETE1R_EXTEVNT9_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define HRTIM_TIME_SETE1R_EXTEVNT8          (0x1UL << 28) 
#define HRTIM_TIME_SETE1R_EXTEVNT8_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define HRTIM_TIME_SETE1R_EXTEVNT7          (0x1UL << 27) 
#define HRTIM_TIME_SETE1R_EXTEVNT7_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define HRTIM_TIME_SETE1R_EXTEVNT6          (0x1UL << 26) 
#define HRTIM_TIME_SETE1R_EXTEVNT6_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define HRTIM_TIME_SETE1R_EXTEVNT5          (0x1UL << 25) 
#define HRTIM_TIME_SETE1R_EXTEVNT5_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define HRTIM_TIME_SETE1R_EXTEVNT4          (0x1UL << 24) 
#define HRTIM_TIME_SETE1R_EXTEVNT4_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define HRTIM_TIME_SETE1R_EXTEVNT3          (0x1UL << 23) 
#define HRTIM_TIME_SETE1R_EXTEVNT3_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define HRTIM_TIME_SETE1R_EXTEVNT2          (0x1UL << 22) 
#define HRTIM_TIME_SETE1R_EXTEVNT2_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define HRTIM_TIME_SETE1R_EXTEVNT1          (0x1UL << 21) 
#define HRTIM_TIME_SETE1R_EXTEVNT1_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define HRTIM_TIME_SETE1R_TIMEVNT9          (0x1UL << 20) 
#define HRTIM_TIME_SETE1R_TIMEVNT9_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define HRTIM_TIME_SETE1R_TIMEVNT8          (0x1UL << 19) 
#define HRTIM_TIME_SETE1R_TIMEVNT8_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define HRTIM_TIME_SETE1R_TIMEVNT7          (0x1UL << 18) 
#define HRTIM_TIME_SETE1R_TIMEVNT7_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HRTIM_TIME_SETE1R_TIMEVNT6          (0x1UL << 17) 
#define HRTIM_TIME_SETE1R_TIMEVNT6_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HRTIM_TIME_SETE1R_TIMEVNT5          (0x1UL << 16) 
#define HRTIM_TIME_SETE1R_TIMEVNT5_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define HRTIM_TIME_SETE1R_TIMEVNT4          (0x1UL << 15) 
#define HRTIM_TIME_SETE1R_TIMEVNT4_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define HRTIM_TIME_SETE1R_TIMEVNT3          (0x1UL << 14) 
#define HRTIM_TIME_SETE1R_TIMEVNT3_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define HRTIM_TIME_SETE1R_TIMEVNT2          (0x1UL << 13) 
#define HRTIM_TIME_SETE1R_TIMEVNT2_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define HRTIM_TIME_SETE1R_TIMEVNT1          (0x1UL << 12) 
#define HRTIM_TIME_SETE1R_TIMEVNT1_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define HRTIM_TIME_SETE1R_MSTCMP4          (0x1UL << 11) 
#define HRTIM_TIME_SETE1R_MSTCMP4_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define HRTIM_TIME_SETE1R_MSTCMP3          (0x1UL << 10) 
#define HRTIM_TIME_SETE1R_MSTCMP3_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define HRTIM_TIME_SETE1R_MSTCMP2          (0x1UL << 9) 
#define HRTIM_TIME_SETE1R_MSTCMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HRTIM_TIME_SETE1R_MSTCMP1          (0x1UL << 8) 
#define HRTIM_TIME_SETE1R_MSTCMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HRTIM_TIME_SETE1R_MSTPER          (0x1UL << 7) 
#define HRTIM_TIME_SETE1R_MSTPER_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define HRTIM_TIME_SETE1R_CMP4          (0x1UL << 6) 
#define HRTIM_TIME_SETE1R_CMP4_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_TIME_SETE1R_CMP3          (0x1UL << 5) 
#define HRTIM_TIME_SETE1R_CMP3_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define HRTIM_TIME_SETE1R_CMP2          (0x1UL << 4) 
#define HRTIM_TIME_SETE1R_CMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_TIME_SETE1R_CMP1          (0x1UL << 3) 
#define HRTIM_TIME_SETE1R_CMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_TIME_SETE1R_PER          (0x1UL << 2) 
#define HRTIM_TIME_SETE1R_PER_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_TIME_SETE1R_RESYNC          (0x1UL << 1) 
#define HRTIM_TIME_SETE1R_RESYNC_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_TIME_SETE1R_SST          (0x1UL << 0) 
#define HRTIM_TIME_SETE1R_SST_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_TIME_RSTE1R_UPDATE          (0x1UL << 31) 
#define HRTIM_TIME_RSTE1R_UPDATE_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HRTIM_TIME_RSTE1R_EXTEVNT10          (0x1UL << 30) 
#define HRTIM_TIME_RSTE1R_EXTEVNT10_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define HRTIM_TIME_RSTE1R_EXTEVNT9          (0x1UL << 29) 
#define HRTIM_TIME_RSTE1R_EXTEVNT9_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define HRTIM_TIME_RSTE1R_EXTEVNT8          (0x1UL << 28) 
#define HRTIM_TIME_RSTE1R_EXTEVNT8_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define HRTIM_TIME_RSTE1R_EXTEVNT7          (0x1UL << 27) 
#define HRTIM_TIME_RSTE1R_EXTEVNT7_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define HRTIM_TIME_RSTE1R_EXTEVNT6          (0x1UL << 26) 
#define HRTIM_TIME_RSTE1R_EXTEVNT6_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define HRTIM_TIME_RSTE1R_EXTEVNT5          (0x1UL << 25) 
#define HRTIM_TIME_RSTE1R_EXTEVNT5_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define HRTIM_TIME_RSTE1R_EXTEVNT4          (0x1UL << 24) 
#define HRTIM_TIME_RSTE1R_EXTEVNT4_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define HRTIM_TIME_RSTE1R_EXTEVNT3          (0x1UL << 23) 
#define HRTIM_TIME_RSTE1R_EXTEVNT3_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define HRTIM_TIME_RSTE1R_EXTEVNT2          (0x1UL << 22) 
#define HRTIM_TIME_RSTE1R_EXTEVNT2_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define HRTIM_TIME_RSTE1R_EXTEVNT1          (0x1UL << 21) 
#define HRTIM_TIME_RSTE1R_EXTEVNT1_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define HRTIM_TIME_RSTE1R_TIMEVNT9          (0x1UL << 20) 
#define HRTIM_TIME_RSTE1R_TIMEVNT9_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define HRTIM_TIME_RSTE1R_TIMEVNT8          (0x1UL << 19) 
#define HRTIM_TIME_RSTE1R_TIMEVNT8_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define HRTIM_TIME_RSTE1R_TIMEVNT7          (0x1UL << 18) 
#define HRTIM_TIME_RSTE1R_TIMEVNT7_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HRTIM_TIME_RSTE1R_TIMEVNT6          (0x1UL << 17) 
#define HRTIM_TIME_RSTE1R_TIMEVNT6_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HRTIM_TIME_RSTE1R_TIMEVNT5          (0x1UL << 16) 
#define HRTIM_TIME_RSTE1R_TIMEVNT5_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define HRTIM_TIME_RSTE1R_TIMEVNT4          (0x1UL << 15) 
#define HRTIM_TIME_RSTE1R_TIMEVNT4_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define HRTIM_TIME_RSTE1R_TIMEVNT3          (0x1UL << 14) 
#define HRTIM_TIME_RSTE1R_TIMEVNT3_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define HRTIM_TIME_RSTE1R_TIMEVNT2          (0x1UL << 13) 
#define HRTIM_TIME_RSTE1R_TIMEVNT2_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define HRTIM_TIME_RSTE1R_TIMEVNT1          (0x1UL << 12) 
#define HRTIM_TIME_RSTE1R_TIMEVNT1_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define HRTIM_TIME_RSTE1R_MSTCMP4          (0x1UL << 11) 
#define HRTIM_TIME_RSTE1R_MSTCMP4_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define HRTIM_TIME_RSTE1R_MSTCMP3          (0x1UL << 10) 
#define HRTIM_TIME_RSTE1R_MSTCMP3_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define HRTIM_TIME_RSTE1R_MSTCMP2          (0x1UL << 9) 
#define HRTIM_TIME_RSTE1R_MSTCMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HRTIM_TIME_RSTE1R_MSTCMP1          (0x1UL << 8) 
#define HRTIM_TIME_RSTE1R_MSTCMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HRTIM_TIME_RSTE1R_MSTPER          (0x1UL << 7) 
#define HRTIM_TIME_RSTE1R_MSTPER_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define HRTIM_TIME_RSTE1R_CMP4          (0x1UL << 6) 
#define HRTIM_TIME_RSTE1R_CMP4_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_TIME_RSTE1R_CMP3          (0x1UL << 5) 
#define HRTIM_TIME_RSTE1R_CMP3_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define HRTIM_TIME_RSTE1R_CMP2          (0x1UL << 4) 
#define HRTIM_TIME_RSTE1R_CMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_TIME_RSTE1R_CMP1          (0x1UL << 3) 
#define HRTIM_TIME_RSTE1R_CMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_TIME_RSTE1R_PER          (0x1UL << 2) 
#define HRTIM_TIME_RSTE1R_PER_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_TIME_RSTE1R_RESYNC          (0x1UL << 1) 
#define HRTIM_TIME_RSTE1R_RESYNC_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_TIME_RSTE1R_SRT          (0x1UL << 0) 
#define HRTIM_TIME_RSTE1R_SRT_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_TIME_SETE2R_UPDATE          (0x1UL << 31) 
#define HRTIM_TIME_SETE2R_UPDATE_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HRTIM_TIME_SETE2R_EXTEVNT10          (0x1UL << 30) 
#define HRTIM_TIME_SETE2R_EXTEVNT10_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define HRTIM_TIME_SETE2R_EXTEVNT9          (0x1UL << 29) 
#define HRTIM_TIME_SETE2R_EXTEVNT9_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define HRTIM_TIME_SETE2R_EXTEVNT8          (0x1UL << 28) 
#define HRTIM_TIME_SETE2R_EXTEVNT8_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define HRTIM_TIME_SETE2R_EXTEVNT7          (0x1UL << 27) 
#define HRTIM_TIME_SETE2R_EXTEVNT7_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define HRTIM_TIME_SETE2R_EXTEVNT6          (0x1UL << 26) 
#define HRTIM_TIME_SETE2R_EXTEVNT6_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define HRTIM_TIME_SETE2R_EXTEVNT5          (0x1UL << 25) 
#define HRTIM_TIME_SETE2R_EXTEVNT5_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define HRTIM_TIME_SETE2R_EXTEVNT4          (0x1UL << 24) 
#define HRTIM_TIME_SETE2R_EXTEVNT4_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define HRTIM_TIME_SETE2R_EXTEVNT3          (0x1UL << 23) 
#define HRTIM_TIME_SETE2R_EXTEVNT3_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define HRTIM_TIME_SETE2R_EXTEVNT2          (0x1UL << 22) 
#define HRTIM_TIME_SETE2R_EXTEVNT2_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define HRTIM_TIME_SETE2R_EXTEVNT1          (0x1UL << 21) 
#define HRTIM_TIME_SETE2R_EXTEVNT1_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define HRTIM_TIME_SETE2R_TIMEVNT9          (0x1UL << 20) 
#define HRTIM_TIME_SETE2R_TIMEVNT9_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define HRTIM_TIME_SETE2R_TIMEVNT8          (0x1UL << 19) 
#define HRTIM_TIME_SETE2R_TIMEVNT8_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define HRTIM_TIME_SETE2R_TIMEVNT7          (0x1UL << 18) 
#define HRTIM_TIME_SETE2R_TIMEVNT7_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HRTIM_TIME_SETE2R_TIMEVNT6          (0x1UL << 17) 
