via/viaems/src/platforms/stm32h743/device.h
#define HRTIM_TIME  ((struct HRTIM_TIME*)(0x40017680UL))
struct HRTIM_Common {
  volatile uint32_t CR1;
  volatile uint32_t CR2;
  volatile uint32_t ISR;
  volatile uint32_t ICR;
  volatile uint32_t IER;
  volatile uint32_t OENR;
  volatile uint32_t DISR;
  volatile const uint32_t ODSR;
  volatile uint32_t BMCR;
  volatile uint32_t BMTRG;
  volatile uint32_t BMCMPR6;
  volatile uint32_t BMPER;
  volatile uint32_t EECR1;
  volatile uint32_t EECR2;
  volatile uint32_t EECR3;
  volatile uint32_t ADC1R;
  volatile uint32_t ADC2R;
  volatile uint32_t ADC3R;
  volatile uint32_t ADC4R;
  volatile uint32_t DLLCR;
  volatile uint32_t FLTINR1;
  volatile uint32_t FLTINR2;
  volatile uint32_t BDMUPDR;
  volatile uint32_t BDTxUPR;
  volatile uint32_t BDMADR;
};
#define HRTIM_Common_CR1_AD4USRC          (0x7UL << 25) 
#define HRTIM_Common_CR1_AD4USRC_VAL(X) (((uint32_t)(X) & 0x7UL) << 25)
#define HRTIM_Common_CR1_AD3USRC          (0x7UL << 22) 
#define HRTIM_Common_CR1_AD3USRC_VAL(X) (((uint32_t)(X) & 0x7UL) << 22)
#define HRTIM_Common_CR1_AD2USRC          (0x7UL << 19) 
#define HRTIM_Common_CR1_AD2USRC_VAL(X) (((uint32_t)(X) & 0x7UL) << 19)
#define HRTIM_Common_CR1_AD1USRC          (0x7UL << 16) 
#define HRTIM_Common_CR1_AD1USRC_VAL(X) (((uint32_t)(X) & 0x7UL) << 16)
#define HRTIM_Common_CR1_TEUDIS          (0x1UL << 5) 
#define HRTIM_Common_CR1_TEUDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define HRTIM_Common_CR1_TDUDIS          (0x1UL << 4) 
#define HRTIM_Common_CR1_TDUDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_Common_CR1_TCUDIS          (0x1UL << 3) 
#define HRTIM_Common_CR1_TCUDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_Common_CR1_TBUDIS          (0x1UL << 2) 
#define HRTIM_Common_CR1_TBUDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_Common_CR1_TAUDIS          (0x1UL << 1) 
#define HRTIM_Common_CR1_TAUDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_Common_CR1_MUDIS          (0x1UL << 0) 
#define HRTIM_Common_CR1_MUDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_Common_CR2_TERST          (0x1UL << 13) 
#define HRTIM_Common_CR2_TERST_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define HRTIM_Common_CR2_TDRST          (0x1UL << 12) 
#define HRTIM_Common_CR2_TDRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define HRTIM_Common_CR2_TCRST          (0x1UL << 11) 
#define HRTIM_Common_CR2_TCRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define HRTIM_Common_CR2_TBRST          (0x1UL << 10) 
#define HRTIM_Common_CR2_TBRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define HRTIM_Common_CR2_TARST          (0x1UL << 9) 
#define HRTIM_Common_CR2_TARST_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HRTIM_Common_CR2_MRST          (0x1UL << 8) 
#define HRTIM_Common_CR2_MRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HRTIM_Common_CR2_TESWU          (0x1UL << 5) 
#define HRTIM_Common_CR2_TESWU_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define HRTIM_Common_CR2_TDSWU          (0x1UL << 4) 
#define HRTIM_Common_CR2_TDSWU_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_Common_CR2_TCSWU          (0x1UL << 3) 
#define HRTIM_Common_CR2_TCSWU_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_Common_CR2_TBSWU          (0x1UL << 2) 
#define HRTIM_Common_CR2_TBSWU_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_Common_CR2_TASWU          (0x1UL << 1) 
#define HRTIM_Common_CR2_TASWU_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_Common_CR2_MSWU          (0x1UL << 0) 
#define HRTIM_Common_CR2_MSWU_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_Common_ISR_BMPER          (0x1UL << 17) 
#define HRTIM_Common_ISR_BMPER_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HRTIM_Common_ISR_DLLRDY          (0x1UL << 16) 
#define HRTIM_Common_ISR_DLLRDY_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define HRTIM_Common_ISR_SYSFLT          (0x1UL << 5) 
#define HRTIM_Common_ISR_SYSFLT_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define HRTIM_Common_ISR_FLT5          (0x1UL << 4) 
#define HRTIM_Common_ISR_FLT5_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_Common_ISR_FLT4          (0x1UL << 3) 
#define HRTIM_Common_ISR_FLT4_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_Common_ISR_FLT3          (0x1UL << 2) 
#define HRTIM_Common_ISR_FLT3_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_Common_ISR_FLT2          (0x1UL << 1) 
#define HRTIM_Common_ISR_FLT2_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_Common_ISR_FLT1          (0x1UL << 0) 
#define HRTIM_Common_ISR_FLT1_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_Common_ICR_BMPERC          (0x1UL << 17) 
#define HRTIM_Common_ICR_BMPERC_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HRTIM_Common_ICR_DLLRDYC          (0x1UL << 16) 
#define HRTIM_Common_ICR_DLLRDYC_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define HRTIM_Common_ICR_SYSFLTC          (0x1UL << 5) 
#define HRTIM_Common_ICR_SYSFLTC_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define HRTIM_Common_ICR_FLT5C          (0x1UL << 4) 
#define HRTIM_Common_ICR_FLT5C_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_Common_ICR_FLT4C          (0x1UL << 3) 
#define HRTIM_Common_ICR_FLT4C_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_Common_ICR_FLT3C          (0x1UL << 2) 
#define HRTIM_Common_ICR_FLT3C_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_Common_ICR_FLT2C          (0x1UL << 1) 
#define HRTIM_Common_ICR_FLT2C_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_Common_ICR_FLT1C          (0x1UL << 0) 
#define HRTIM_Common_ICR_FLT1C_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_Common_IER_BMPERIE          (0x1UL << 17) 
#define HRTIM_Common_IER_BMPERIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HRTIM_Common_IER_DLLRDYIE          (0x1UL << 16) 
#define HRTIM_Common_IER_DLLRDYIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define HRTIM_Common_IER_SYSFLTE          (0x1UL << 5) 
#define HRTIM_Common_IER_SYSFLTE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define HRTIM_Common_IER_FLT5IE          (0x1UL << 4) 
#define HRTIM_Common_IER_FLT5IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_Common_IER_FLT4IE          (0x1UL << 3) 
#define HRTIM_Common_IER_FLT4IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_Common_IER_FLT3IE          (0x1UL << 2) 
#define HRTIM_Common_IER_FLT3IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_Common_IER_FLT2IE          (0x1UL << 1) 
#define HRTIM_Common_IER_FLT2IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_Common_IER_FLT1IE          (0x1UL << 0) 
#define HRTIM_Common_IER_FLT1IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_Common_OENR_TE2OEN          (0x1UL << 9) 
#define HRTIM_Common_OENR_TE2OEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HRTIM_Common_OENR_TE1OEN          (0x1UL << 8) 
#define HRTIM_Common_OENR_TE1OEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HRTIM_Common_OENR_TD2OEN          (0x1UL << 7) 
#define HRTIM_Common_OENR_TD2OEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define HRTIM_Common_OENR_TD1OEN          (0x1UL << 6) 
#define HRTIM_Common_OENR_TD1OEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_Common_OENR_TC2OEN          (0x1UL << 5) 
#define HRTIM_Common_OENR_TC2OEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define HRTIM_Common_OENR_TC1OEN          (0x1UL << 4) 
#define HRTIM_Common_OENR_TC1OEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_Common_OENR_TB2OEN          (0x1UL << 3) 
#define HRTIM_Common_OENR_TB2OEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_Common_OENR_TB1OEN          (0x1UL << 2) 
#define HRTIM_Common_OENR_TB1OEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_Common_OENR_TA2OEN          (0x1UL << 1) 
#define HRTIM_Common_OENR_TA2OEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_Common_OENR_TA1OEN          (0x1UL << 0) 
#define HRTIM_Common_OENR_TA1OEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_Common_DISR_TE2ODIS          (0x1UL << 9) 
#define HRTIM_Common_DISR_TE2ODIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HRTIM_Common_DISR_TE1ODIS          (0x1UL << 8) 
#define HRTIM_Common_DISR_TE1ODIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HRTIM_Common_DISR_TD2ODIS          (0x1UL << 7) 
#define HRTIM_Common_DISR_TD2ODIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define HRTIM_Common_DISR_TD1ODIS          (0x1UL << 6) 
#define HRTIM_Common_DISR_TD1ODIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_Common_DISR_TC2ODIS          (0x1UL << 5) 
#define HRTIM_Common_DISR_TC2ODIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define HRTIM_Common_DISR_TC1ODIS          (0x1UL << 4) 
#define HRTIM_Common_DISR_TC1ODIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_Common_DISR_TB2ODIS          (0x1UL << 3) 
#define HRTIM_Common_DISR_TB2ODIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_Common_DISR_TB1ODIS          (0x1UL << 2) 
#define HRTIM_Common_DISR_TB1ODIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_Common_DISR_TA2ODIS          (0x1UL << 1) 
#define HRTIM_Common_DISR_TA2ODIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_Common_DISR_TA1ODIS          (0x1UL << 0) 
#define HRTIM_Common_DISR_TA1ODIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_Common_ODSR_TE2ODS          (0x1UL << 9) 
#define HRTIM_Common_ODSR_TE2ODS_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HRTIM_Common_ODSR_TE1ODS          (0x1UL << 8) 
#define HRTIM_Common_ODSR_TE1ODS_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HRTIM_Common_ODSR_TD2ODS          (0x1UL << 7) 
#define HRTIM_Common_ODSR_TD2ODS_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define HRTIM_Common_ODSR_TD1ODS          (0x1UL << 6) 
#define HRTIM_Common_ODSR_TD1ODS_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_Common_ODSR_TC2ODS          (0x1UL << 5) 
#define HRTIM_Common_ODSR_TC2ODS_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define HRTIM_Common_ODSR_TC1ODS          (0x1UL << 4) 
#define HRTIM_Common_ODSR_TC1ODS_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_Common_ODSR_TB2ODS          (0x1UL << 3) 
#define HRTIM_Common_ODSR_TB2ODS_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_Common_ODSR_TB1ODS          (0x1UL << 2) 
#define HRTIM_Common_ODSR_TB1ODS_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_Common_ODSR_TA2ODS          (0x1UL << 1) 
#define HRTIM_Common_ODSR_TA2ODS_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_Common_ODSR_TA1ODS          (0x1UL << 0) 
#define HRTIM_Common_ODSR_TA1ODS_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_Common_BMCR_BMSTAT          (0x1UL << 31) 
#define HRTIM_Common_BMCR_BMSTAT_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HRTIM_Common_BMCR_TEBM          (0x1UL << 21) 
#define HRTIM_Common_BMCR_TEBM_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define HRTIM_Common_BMCR_TDBM          (0x1UL << 20) 
#define HRTIM_Common_BMCR_TDBM_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define HRTIM_Common_BMCR_TCBM          (0x1UL << 19) 
#define HRTIM_Common_BMCR_TCBM_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define HRTIM_Common_BMCR_TBBM          (0x1UL << 18) 
#define HRTIM_Common_BMCR_TBBM_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HRTIM_Common_BMCR_TABM          (0x1UL << 17) 
#define HRTIM_Common_BMCR_TABM_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HRTIM_Common_BMCR_MTBM          (0x1UL << 16) 
#define HRTIM_Common_BMCR_MTBM_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define HRTIM_Common_BMCR_BMPREN          (0x1UL << 10) 
#define HRTIM_Common_BMCR_BMPREN_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define HRTIM_Common_BMCR_BMPRSC          (0xFUL << 6) 
#define HRTIM_Common_BMCR_BMPRSC_VAL(X) (((uint32_t)(X) & 0xFUL) << 6)
#define HRTIM_Common_BMCR_BMCLK          (0xFUL << 2) 
#define HRTIM_Common_BMCR_BMCLK_VAL(X) (((uint32_t)(X) & 0xFUL) << 2)
#define HRTIM_Common_BMCR_BMOM          (0x1UL << 1) 
#define HRTIM_Common_BMCR_BMOM_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_Common_BMCR_BME          (0x1UL << 0) 
#define HRTIM_Common_BMCR_BME_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_Common_BMTRG_OCHPEV          (0x1UL << 31) 
#define HRTIM_Common_BMTRG_OCHPEV_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HRTIM_Common_BMTRG_TECMP2          (0x1UL << 26) 
#define HRTIM_Common_BMTRG_TECMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define HRTIM_Common_BMTRG_TECMP1          (0x1UL << 25) 
#define HRTIM_Common_BMTRG_TECMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define HRTIM_Common_BMTRG_TEREP          (0x1UL << 24) 
#define HRTIM_Common_BMTRG_TEREP_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define HRTIM_Common_BMTRG_TERST          (0x1UL << 23) 
#define HRTIM_Common_BMTRG_TERST_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define HRTIM_Common_BMTRG_TDCMP2          (0x1UL << 22) 
#define HRTIM_Common_BMTRG_TDCMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define HRTIM_Common_BMTRG_TDCMP1          (0x1UL << 21) 
#define HRTIM_Common_BMTRG_TDCMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define HRTIM_Common_BMTRG_TDREP          (0x1UL << 20) 
#define HRTIM_Common_BMTRG_TDREP_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define HRTIM_Common_BMTRG_TDRST          (0x1UL << 19) 
#define HRTIM_Common_BMTRG_TDRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define HRTIM_Common_BMTRG_TCCMP2          (0x1UL << 18) 
#define HRTIM_Common_BMTRG_TCCMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HRTIM_Common_BMTRG_TCCMP1          (0x1UL << 17) 
#define HRTIM_Common_BMTRG_TCCMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HRTIM_Common_BMTRG_TCREP          (0x1UL << 16) 
#define HRTIM_Common_BMTRG_TCREP_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define HRTIM_Common_BMTRG_TCRST          (0x1UL << 15) 
#define HRTIM_Common_BMTRG_TCRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define HRTIM_Common_BMTRG_TBCMP2          (0x1UL << 14) 
#define HRTIM_Common_BMTRG_TBCMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define HRTIM_Common_BMTRG_TBCMP1          (0x1UL << 13) 
#define HRTIM_Common_BMTRG_TBCMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define HRTIM_Common_BMTRG_TBREP          (0x1UL << 12) 
#define HRTIM_Common_BMTRG_TBREP_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define HRTIM_Common_BMTRG_TBRST          (0x1UL << 11) 
#define HRTIM_Common_BMTRG_TBRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define HRTIM_Common_BMTRG_TACMP2          (0x1UL << 10) 
#define HRTIM_Common_BMTRG_TACMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define HRTIM_Common_BMTRG_TACMP1          (0x1UL << 9) 
#define HRTIM_Common_BMTRG_TACMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HRTIM_Common_BMTRG_TAREP          (0x1UL << 8) 
#define HRTIM_Common_BMTRG_TAREP_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HRTIM_Common_BMTRG_TARST          (0x1UL << 7) 
#define HRTIM_Common_BMTRG_TARST_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define HRTIM_Common_BMTRG_MSTCMP4          (0x1UL << 6) 
#define HRTIM_Common_BMTRG_MSTCMP4_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_Common_BMTRG_MSTCMP3          (0x1UL << 5) 
#define HRTIM_Common_BMTRG_MSTCMP3_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define HRTIM_Common_BMTRG_MSTCMP2          (0x1UL << 4) 
#define HRTIM_Common_BMTRG_MSTCMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_Common_BMTRG_MSTCMP1          (0x1UL << 3) 
#define HRTIM_Common_BMTRG_MSTCMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_Common_BMTRG_MSTREP          (0x1UL << 2) 
#define HRTIM_Common_BMTRG_MSTREP_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_Common_BMTRG_MSTRST          (0x1UL << 1) 
#define HRTIM_Common_BMTRG_MSTRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_Common_BMTRG_SW          (0x1UL << 0) 
#define HRTIM_Common_BMTRG_SW_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_Common_BMCMPR6_BMCMP          (0xFFFFUL << 0) 
#define HRTIM_Common_BMCMPR6_BMCMP_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define HRTIM_Common_BMPER_BMPER          (0xFFFFUL << 0) 
#define HRTIM_Common_BMPER_BMPER_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define HRTIM_Common_EECR1_EE5FAST          (0x1UL << 29) 
#define HRTIM_Common_EECR1_EE5FAST_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define HRTIM_Common_EECR1_EE5SNS          (0x3UL << 27) 
#define HRTIM_Common_EECR1_EE5SNS_VAL(X) (((uint32_t)(X) & 0x3UL) << 27)
#define HRTIM_Common_EECR1_EE5POL          (0x1UL << 26) 
#define HRTIM_Common_EECR1_EE5POL_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define HRTIM_Common_EECR1_EE5SRC          (0x3UL << 24) 
#define HRTIM_Common_EECR1_EE5SRC_VAL(X) (((uint32_t)(X) & 0x3UL) << 24)
#define HRTIM_Common_EECR1_EE4FAST          (0x1UL << 23) 
#define HRTIM_Common_EECR1_EE4FAST_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define HRTIM_Common_EECR1_EE4SNS          (0x3UL << 21) 
#define HRTIM_Common_EECR1_EE4SNS_VAL(X) (((uint32_t)(X) & 0x3UL) << 21)
#define HRTIM_Common_EECR1_EE4POL          (0x1UL << 20) 
#define HRTIM_Common_EECR1_EE4POL_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define HRTIM_Common_EECR1_EE4SRC          (0x3UL << 18) 
#define HRTIM_Common_EECR1_EE4SRC_VAL(X) (((uint32_t)(X) & 0x3UL) << 18)
#define HRTIM_Common_EECR1_EE3FAST          (0x1UL << 17) 
#define HRTIM_Common_EECR1_EE3FAST_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HRTIM_Common_EECR1_EE3SNS          (0x3UL << 15) 
#define HRTIM_Common_EECR1_EE3SNS_VAL(X) (((uint32_t)(X) & 0x3UL) << 15)
#define HRTIM_Common_EECR1_EE3POL          (0x1UL << 14) 
#define HRTIM_Common_EECR1_EE3POL_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define HRTIM_Common_EECR1_EE3SRC          (0x3UL << 12) 
#define HRTIM_Common_EECR1_EE3SRC_VAL(X) (((uint32_t)(X) & 0x3UL) << 12)
#define HRTIM_Common_EECR1_EE2FAST          (0x1UL << 11) 
#define HRTIM_Common_EECR1_EE2FAST_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define HRTIM_Common_EECR1_EE2SNS          (0x3UL << 9) 
#define HRTIM_Common_EECR1_EE2SNS_VAL(X) (((uint32_t)(X) & 0x3UL) << 9)
#define HRTIM_Common_EECR1_EE2POL          (0x1UL << 8) 
#define HRTIM_Common_EECR1_EE2POL_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HRTIM_Common_EECR1_EE2SRC          (0x3UL << 6) 
#define HRTIM_Common_EECR1_EE2SRC_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define HRTIM_Common_EECR1_EE1FAST          (0x1UL << 5) 
#define HRTIM_Common_EECR1_EE1FAST_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define HRTIM_Common_EECR1_EE1SNS          (0x3UL << 3) 
#define HRTIM_Common_EECR1_EE1SNS_VAL(X) (((uint32_t)(X) & 0x3UL) << 3)
#define HRTIM_Common_EECR1_EE1POL          (0x1UL << 2) 
#define HRTIM_Common_EECR1_EE1POL_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_Common_EECR1_EE1SRC          (0x3UL << 0) 
#define HRTIM_Common_EECR1_EE1SRC_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define HRTIM_Common_EECR2_EE10SNS          (0x3UL << 27) 
#define HRTIM_Common_EECR2_EE10SNS_VAL(X) (((uint32_t)(X) & 0x3UL) << 27)
#define HRTIM_Common_EECR2_EE10POL          (0x1UL << 26) 
#define HRTIM_Common_EECR2_EE10POL_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define HRTIM_Common_EECR2_EE10SRC          (0x3UL << 24) 
#define HRTIM_Common_EECR2_EE10SRC_VAL(X) (((uint32_t)(X) & 0x3UL) << 24)
#define HRTIM_Common_EECR2_EE9SNS          (0x3UL << 21) 
#define HRTIM_Common_EECR2_EE9SNS_VAL(X) (((uint32_t)(X) & 0x3UL) << 21)
#define HRTIM_Common_EECR2_EE9POL          (0x1UL << 20) 
#define HRTIM_Common_EECR2_EE9POL_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define HRTIM_Common_EECR2_EE9SRC          (0x3UL << 18) 
#define HRTIM_Common_EECR2_EE9SRC_VAL(X) (((uint32_t)(X) & 0x3UL) << 18)
#define HRTIM_Common_EECR2_EE8SNS          (0x3UL << 15) 
#define HRTIM_Common_EECR2_EE8SNS_VAL(X) (((uint32_t)(X) & 0x3UL) << 15)
#define HRTIM_Common_EECR2_EE8POL          (0x1UL << 14) 
#define HRTIM_Common_EECR2_EE8POL_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define HRTIM_Common_EECR2_EE8SRC          (0x3UL << 12) 
#define HRTIM_Common_EECR2_EE8SRC_VAL(X) (((uint32_t)(X) & 0x3UL) << 12)
#define HRTIM_Common_EECR2_EE7SNS          (0x3UL << 9) 
#define HRTIM_Common_EECR2_EE7SNS_VAL(X) (((uint32_t)(X) & 0x3UL) << 9)
#define HRTIM_Common_EECR2_EE7POL          (0x1UL << 8) 
#define HRTIM_Common_EECR2_EE7POL_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HRTIM_Common_EECR2_EE7SRC          (0x3UL << 6) 
#define HRTIM_Common_EECR2_EE7SRC_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define HRTIM_Common_EECR2_EE6SNS          (0x3UL << 3) 
#define HRTIM_Common_EECR2_EE6SNS_VAL(X) (((uint32_t)(X) & 0x3UL) << 3)
#define HRTIM_Common_EECR2_EE6POL          (0x1UL << 2) 
#define HRTIM_Common_EECR2_EE6POL_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_Common_EECR2_EE6SRC          (0x3UL << 0) 
#define HRTIM_Common_EECR2_EE6SRC_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define HRTIM_Common_EECR3_EE10SNS          (0x3UL << 27) 
#define HRTIM_Common_EECR3_EE10SNS_VAL(X) (((uint32_t)(X) & 0x3UL) << 27)
#define HRTIM_Common_EECR3_EE10POL          (0x1UL << 26) 
#define HRTIM_Common_EECR3_EE10POL_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define HRTIM_Common_EECR3_EE10SRC          (0x3UL << 24) 
#define HRTIM_Common_EECR3_EE10SRC_VAL(X) (((uint32_t)(X) & 0x3UL) << 24)
#define HRTIM_Common_EECR3_EE9SNS          (0x3UL << 21) 
#define HRTIM_Common_EECR3_EE9SNS_VAL(X) (((uint32_t)(X) & 0x3UL) << 21)
#define HRTIM_Common_EECR3_EE9POL          (0x1UL << 20) 
#define HRTIM_Common_EECR3_EE9POL_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define HRTIM_Common_EECR3_EE9SRC          (0x3UL << 18) 
#define HRTIM_Common_EECR3_EE9SRC_VAL(X) (((uint32_t)(X) & 0x3UL) << 18)
#define HRTIM_Common_EECR3_EE8SNS          (0x3UL << 15) 
#define HRTIM_Common_EECR3_EE8SNS_VAL(X) (((uint32_t)(X) & 0x3UL) << 15)
#define HRTIM_Common_EECR3_EE8POL          (0x1UL << 14) 
#define HRTIM_Common_EECR3_EE8POL_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define HRTIM_Common_EECR3_EE8SRC          (0x3UL << 12) 
#define HRTIM_Common_EECR3_EE8SRC_VAL(X) (((uint32_t)(X) & 0x3UL) << 12)
#define HRTIM_Common_EECR3_EE7SNS          (0x3UL << 9) 
#define HRTIM_Common_EECR3_EE7SNS_VAL(X) (((uint32_t)(X) & 0x3UL) << 9)
#define HRTIM_Common_EECR3_EE7POL          (0x1UL << 8) 
#define HRTIM_Common_EECR3_EE7POL_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HRTIM_Common_EECR3_EE7SRC          (0x3UL << 6) 
#define HRTIM_Common_EECR3_EE7SRC_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define HRTIM_Common_EECR3_EE6SNS          (0x3UL << 3) 
#define HRTIM_Common_EECR3_EE6SNS_VAL(X) (((uint32_t)(X) & 0x3UL) << 3)
#define HRTIM_Common_EECR3_EE6POL          (0x1UL << 2) 
#define HRTIM_Common_EECR3_EE6POL_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_Common_EECR3_EE6SRC          (0x3UL << 0) 
#define HRTIM_Common_EECR3_EE6SRC_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define HRTIM_Common_ADC1R_AD1TEPER          (0x1UL << 31) 
#define HRTIM_Common_ADC1R_AD1TEPER_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HRTIM_Common_ADC1R_AD1TEC4          (0x1UL << 30) 
#define HRTIM_Common_ADC1R_AD1TEC4_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define HRTIM_Common_ADC1R_AD1TEC3          (0x1UL << 29) 
#define HRTIM_Common_ADC1R_AD1TEC3_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define HRTIM_Common_ADC1R_AD1TEC2          (0x1UL << 28) 
#define HRTIM_Common_ADC1R_AD1TEC2_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define HRTIM_Common_ADC1R_AD1TDPER          (0x1UL << 27) 
#define HRTIM_Common_ADC1R_AD1TDPER_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define HRTIM_Common_ADC1R_AD1TDC4          (0x1UL << 26) 
#define HRTIM_Common_ADC1R_AD1TDC4_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define HRTIM_Common_ADC1R_AD1TDC3          (0x1UL << 25) 
#define HRTIM_Common_ADC1R_AD1TDC3_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define HRTIM_Common_ADC1R_AD1TDC2          (0x1UL << 24) 
#define HRTIM_Common_ADC1R_AD1TDC2_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define HRTIM_Common_ADC1R_AD1TCPER          (0x1UL << 23) 
#define HRTIM_Common_ADC1R_AD1TCPER_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define HRTIM_Common_ADC1R_AD1TCC4          (0x1UL << 22) 
#define HRTIM_Common_ADC1R_AD1TCC4_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define HRTIM_Common_ADC1R_AD1TCC3          (0x1UL << 21) 
#define HRTIM_Common_ADC1R_AD1TCC3_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define HRTIM_Common_ADC1R_AD1TCC2          (0x1UL << 20) 
#define HRTIM_Common_ADC1R_AD1TCC2_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define HRTIM_Common_ADC1R_AD1TBRST          (0x1UL << 19) 
#define HRTIM_Common_ADC1R_AD1TBRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
