via/viaems/src/platforms/stm32h743/device.h
#define HRTIM_Common_ADC1R_AD1TBPER          (0x1UL << 18) 
#define HRTIM_Common_ADC1R_AD1TBPER_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HRTIM_Common_ADC1R_AD1TBC4          (0x1UL << 17) 
#define HRTIM_Common_ADC1R_AD1TBC4_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HRTIM_Common_ADC1R_AD1TBC3          (0x1UL << 16) 
#define HRTIM_Common_ADC1R_AD1TBC3_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define HRTIM_Common_ADC1R_AD1TBC2          (0x1UL << 15) 
#define HRTIM_Common_ADC1R_AD1TBC2_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define HRTIM_Common_ADC1R_AD1TARST          (0x1UL << 14) 
#define HRTIM_Common_ADC1R_AD1TARST_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define HRTIM_Common_ADC1R_AD1TAPER          (0x1UL << 13) 
#define HRTIM_Common_ADC1R_AD1TAPER_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define HRTIM_Common_ADC1R_AD1TAC4          (0x1UL << 12) 
#define HRTIM_Common_ADC1R_AD1TAC4_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define HRTIM_Common_ADC1R_AD1TAC3          (0x1UL << 11) 
#define HRTIM_Common_ADC1R_AD1TAC3_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define HRTIM_Common_ADC1R_AD1TAC2          (0x1UL << 10) 
#define HRTIM_Common_ADC1R_AD1TAC2_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define HRTIM_Common_ADC1R_AD1EEV5          (0x1UL << 9) 
#define HRTIM_Common_ADC1R_AD1EEV5_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HRTIM_Common_ADC1R_AD1EEV4          (0x1UL << 8) 
#define HRTIM_Common_ADC1R_AD1EEV4_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HRTIM_Common_ADC1R_AD1EEV3          (0x1UL << 7) 
#define HRTIM_Common_ADC1R_AD1EEV3_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define HRTIM_Common_ADC1R_AD1EEV2          (0x1UL << 6) 
#define HRTIM_Common_ADC1R_AD1EEV2_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_Common_ADC1R_AD1EEV1          (0x1UL << 5) 
#define HRTIM_Common_ADC1R_AD1EEV1_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define HRTIM_Common_ADC1R_AD1MPER          (0x1UL << 4) 
#define HRTIM_Common_ADC1R_AD1MPER_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_Common_ADC1R_AD1MC4          (0x1UL << 3) 
#define HRTIM_Common_ADC1R_AD1MC4_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_Common_ADC1R_AD1MC3          (0x1UL << 2) 
#define HRTIM_Common_ADC1R_AD1MC3_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_Common_ADC1R_AD1MC2          (0x1UL << 1) 
#define HRTIM_Common_ADC1R_AD1MC2_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_Common_ADC1R_AD1MC1          (0x1UL << 0) 
#define HRTIM_Common_ADC1R_AD1MC1_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_Common_ADC2R_AD2TERST          (0x1UL << 31) 
#define HRTIM_Common_ADC2R_AD2TERST_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HRTIM_Common_ADC2R_AD2TEC4          (0x1UL << 30) 
#define HRTIM_Common_ADC2R_AD2TEC4_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define HRTIM_Common_ADC2R_AD2TEC3          (0x1UL << 29) 
#define HRTIM_Common_ADC2R_AD2TEC3_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define HRTIM_Common_ADC2R_AD2TEC2          (0x1UL << 28) 
#define HRTIM_Common_ADC2R_AD2TEC2_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define HRTIM_Common_ADC2R_AD2TDRST          (0x1UL << 27) 
#define HRTIM_Common_ADC2R_AD2TDRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define HRTIM_Common_ADC2R_AD2TDPER          (0x1UL << 26) 
#define HRTIM_Common_ADC2R_AD2TDPER_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define HRTIM_Common_ADC2R_AD2TDC4          (0x1UL << 25) 
#define HRTIM_Common_ADC2R_AD2TDC4_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define HRTIM_Common_ADC2R_AD2TDC3          (0x1UL << 24) 
#define HRTIM_Common_ADC2R_AD2TDC3_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define HRTIM_Common_ADC2R_AD2TDC2          (0x1UL << 23) 
#define HRTIM_Common_ADC2R_AD2TDC2_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define HRTIM_Common_ADC2R_AD2TCRST          (0x1UL << 22) 
#define HRTIM_Common_ADC2R_AD2TCRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define HRTIM_Common_ADC2R_AD2TCPER          (0x1UL << 21) 
#define HRTIM_Common_ADC2R_AD2TCPER_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define HRTIM_Common_ADC2R_AD2TCC4          (0x1UL << 20) 
#define HRTIM_Common_ADC2R_AD2TCC4_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define HRTIM_Common_ADC2R_AD2TCC3          (0x1UL << 19) 
#define HRTIM_Common_ADC2R_AD2TCC3_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define HRTIM_Common_ADC2R_AD2TCC2          (0x1UL << 18) 
#define HRTIM_Common_ADC2R_AD2TCC2_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HRTIM_Common_ADC2R_AD2TBPER          (0x1UL << 17) 
#define HRTIM_Common_ADC2R_AD2TBPER_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HRTIM_Common_ADC2R_AD2TBC4          (0x1UL << 16) 
#define HRTIM_Common_ADC2R_AD2TBC4_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define HRTIM_Common_ADC2R_AD2TBC3          (0x1UL << 15) 
#define HRTIM_Common_ADC2R_AD2TBC3_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define HRTIM_Common_ADC2R_AD2TBC2          (0x1UL << 14) 
#define HRTIM_Common_ADC2R_AD2TBC2_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define HRTIM_Common_ADC2R_AD2TAPER          (0x1UL << 13) 
#define HRTIM_Common_ADC2R_AD2TAPER_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define HRTIM_Common_ADC2R_AD2TAC4          (0x1UL << 12) 
#define HRTIM_Common_ADC2R_AD2TAC4_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define HRTIM_Common_ADC2R_AD2TAC3          (0x1UL << 11) 
#define HRTIM_Common_ADC2R_AD2TAC3_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define HRTIM_Common_ADC2R_AD2TAC2          (0x1UL << 10) 
#define HRTIM_Common_ADC2R_AD2TAC2_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define HRTIM_Common_ADC2R_AD2EEV10          (0x1UL << 9) 
#define HRTIM_Common_ADC2R_AD2EEV10_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HRTIM_Common_ADC2R_AD2EEV9          (0x1UL << 8) 
#define HRTIM_Common_ADC2R_AD2EEV9_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HRTIM_Common_ADC2R_AD2EEV8          (0x1UL << 7) 
#define HRTIM_Common_ADC2R_AD2EEV8_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define HRTIM_Common_ADC2R_AD2EEV7          (0x1UL << 6) 
#define HRTIM_Common_ADC2R_AD2EEV7_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_Common_ADC2R_AD2EEV6          (0x1UL << 5) 
#define HRTIM_Common_ADC2R_AD2EEV6_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define HRTIM_Common_ADC2R_AD2MPER          (0x1UL << 4) 
#define HRTIM_Common_ADC2R_AD2MPER_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_Common_ADC2R_AD2MC4          (0x1UL << 3) 
#define HRTIM_Common_ADC2R_AD2MC4_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_Common_ADC2R_AD2MC3          (0x1UL << 2) 
#define HRTIM_Common_ADC2R_AD2MC3_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_Common_ADC2R_AD2MC2          (0x1UL << 1) 
#define HRTIM_Common_ADC2R_AD2MC2_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_Common_ADC2R_AD2MC1          (0x1UL << 0) 
#define HRTIM_Common_ADC2R_AD2MC1_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_Common_ADC3R_AD1TEPER          (0x1UL << 31) 
#define HRTIM_Common_ADC3R_AD1TEPER_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HRTIM_Common_ADC3R_AD1TEC4          (0x1UL << 30) 
#define HRTIM_Common_ADC3R_AD1TEC4_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define HRTIM_Common_ADC3R_AD1TEC3          (0x1UL << 29) 
#define HRTIM_Common_ADC3R_AD1TEC3_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define HRTIM_Common_ADC3R_AD1TEC2          (0x1UL << 28) 
#define HRTIM_Common_ADC3R_AD1TEC2_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define HRTIM_Common_ADC3R_AD1TDPER          (0x1UL << 27) 
#define HRTIM_Common_ADC3R_AD1TDPER_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define HRTIM_Common_ADC3R_AD1TDC4          (0x1UL << 26) 
#define HRTIM_Common_ADC3R_AD1TDC4_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define HRTIM_Common_ADC3R_AD1TDC3          (0x1UL << 25) 
#define HRTIM_Common_ADC3R_AD1TDC3_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define HRTIM_Common_ADC3R_AD1TDC2          (0x1UL << 24) 
#define HRTIM_Common_ADC3R_AD1TDC2_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define HRTIM_Common_ADC3R_AD1TCPER          (0x1UL << 23) 
#define HRTIM_Common_ADC3R_AD1TCPER_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define HRTIM_Common_ADC3R_AD1TCC4          (0x1UL << 22) 
#define HRTIM_Common_ADC3R_AD1TCC4_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define HRTIM_Common_ADC3R_AD1TCC3          (0x1UL << 21) 
#define HRTIM_Common_ADC3R_AD1TCC3_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define HRTIM_Common_ADC3R_AD1TCC2          (0x1UL << 20) 
#define HRTIM_Common_ADC3R_AD1TCC2_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define HRTIM_Common_ADC3R_AD1TBRST          (0x1UL << 19) 
#define HRTIM_Common_ADC3R_AD1TBRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define HRTIM_Common_ADC3R_AD1TBPER          (0x1UL << 18) 
#define HRTIM_Common_ADC3R_AD1TBPER_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HRTIM_Common_ADC3R_AD1TBC4          (0x1UL << 17) 
#define HRTIM_Common_ADC3R_AD1TBC4_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HRTIM_Common_ADC3R_AD1TBC3          (0x1UL << 16) 
#define HRTIM_Common_ADC3R_AD1TBC3_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define HRTIM_Common_ADC3R_AD1TBC2          (0x1UL << 15) 
#define HRTIM_Common_ADC3R_AD1TBC2_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define HRTIM_Common_ADC3R_AD1TARST          (0x1UL << 14) 
#define HRTIM_Common_ADC3R_AD1TARST_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define HRTIM_Common_ADC3R_AD1TAPER          (0x1UL << 13) 
#define HRTIM_Common_ADC3R_AD1TAPER_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define HRTIM_Common_ADC3R_AD1TAC4          (0x1UL << 12) 
#define HRTIM_Common_ADC3R_AD1TAC4_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define HRTIM_Common_ADC3R_AD1TAC3          (0x1UL << 11) 
#define HRTIM_Common_ADC3R_AD1TAC3_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define HRTIM_Common_ADC3R_AD1TAC2          (0x1UL << 10) 
#define HRTIM_Common_ADC3R_AD1TAC2_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define HRTIM_Common_ADC3R_AD1EEV5          (0x1UL << 9) 
#define HRTIM_Common_ADC3R_AD1EEV5_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HRTIM_Common_ADC3R_AD1EEV4          (0x1UL << 8) 
#define HRTIM_Common_ADC3R_AD1EEV4_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HRTIM_Common_ADC3R_AD1EEV3          (0x1UL << 7) 
#define HRTIM_Common_ADC3R_AD1EEV3_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define HRTIM_Common_ADC3R_AD1EEV2          (0x1UL << 6) 
#define HRTIM_Common_ADC3R_AD1EEV2_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_Common_ADC3R_AD1EEV1          (0x1UL << 5) 
#define HRTIM_Common_ADC3R_AD1EEV1_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define HRTIM_Common_ADC3R_AD1MPER          (0x1UL << 4) 
#define HRTIM_Common_ADC3R_AD1MPER_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_Common_ADC3R_AD1MC4          (0x1UL << 3) 
#define HRTIM_Common_ADC3R_AD1MC4_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_Common_ADC3R_AD1MC3          (0x1UL << 2) 
#define HRTIM_Common_ADC3R_AD1MC3_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_Common_ADC3R_AD1MC2          (0x1UL << 1) 
#define HRTIM_Common_ADC3R_AD1MC2_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_Common_ADC3R_AD1MC1          (0x1UL << 0) 
#define HRTIM_Common_ADC3R_AD1MC1_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_Common_ADC4R_AD2TERST          (0x1UL << 31) 
#define HRTIM_Common_ADC4R_AD2TERST_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HRTIM_Common_ADC4R_AD2TEC4          (0x1UL << 30) 
#define HRTIM_Common_ADC4R_AD2TEC4_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define HRTIM_Common_ADC4R_AD2TEC3          (0x1UL << 29) 
#define HRTIM_Common_ADC4R_AD2TEC3_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define HRTIM_Common_ADC4R_AD2TEC2          (0x1UL << 28) 
#define HRTIM_Common_ADC4R_AD2TEC2_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define HRTIM_Common_ADC4R_AD2TDRST          (0x1UL << 27) 
#define HRTIM_Common_ADC4R_AD2TDRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define HRTIM_Common_ADC4R_AD2TDPER          (0x1UL << 26) 
#define HRTIM_Common_ADC4R_AD2TDPER_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define HRTIM_Common_ADC4R_AD2TDC4          (0x1UL << 25) 
#define HRTIM_Common_ADC4R_AD2TDC4_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define HRTIM_Common_ADC4R_AD2TDC3          (0x1UL << 24) 
#define HRTIM_Common_ADC4R_AD2TDC3_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define HRTIM_Common_ADC4R_AD2TDC2          (0x1UL << 23) 
#define HRTIM_Common_ADC4R_AD2TDC2_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define HRTIM_Common_ADC4R_AD2TCRST          (0x1UL << 22) 
#define HRTIM_Common_ADC4R_AD2TCRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define HRTIM_Common_ADC4R_AD2TCPER          (0x1UL << 21) 
#define HRTIM_Common_ADC4R_AD2TCPER_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define HRTIM_Common_ADC4R_AD2TCC4          (0x1UL << 20) 
#define HRTIM_Common_ADC4R_AD2TCC4_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define HRTIM_Common_ADC4R_AD2TCC3          (0x1UL << 19) 
#define HRTIM_Common_ADC4R_AD2TCC3_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define HRTIM_Common_ADC4R_AD2TCC2          (0x1UL << 18) 
#define HRTIM_Common_ADC4R_AD2TCC2_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HRTIM_Common_ADC4R_AD2TBPER          (0x1UL << 17) 
#define HRTIM_Common_ADC4R_AD2TBPER_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HRTIM_Common_ADC4R_AD2TBC4          (0x1UL << 16) 
#define HRTIM_Common_ADC4R_AD2TBC4_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define HRTIM_Common_ADC4R_AD2TBC3          (0x1UL << 15) 
#define HRTIM_Common_ADC4R_AD2TBC3_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define HRTIM_Common_ADC4R_AD2TBC2          (0x1UL << 14) 
#define HRTIM_Common_ADC4R_AD2TBC2_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define HRTIM_Common_ADC4R_AD2TAPER          (0x1UL << 13) 
#define HRTIM_Common_ADC4R_AD2TAPER_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define HRTIM_Common_ADC4R_AD2TAC4          (0x1UL << 12) 
#define HRTIM_Common_ADC4R_AD2TAC4_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define HRTIM_Common_ADC4R_AD2TAC3          (0x1UL << 11) 
#define HRTIM_Common_ADC4R_AD2TAC3_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define HRTIM_Common_ADC4R_AD2TAC2          (0x1UL << 10) 
#define HRTIM_Common_ADC4R_AD2TAC2_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define HRTIM_Common_ADC4R_AD2EEV10          (0x1UL << 9) 
#define HRTIM_Common_ADC4R_AD2EEV10_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HRTIM_Common_ADC4R_AD2EEV9          (0x1UL << 8) 
#define HRTIM_Common_ADC4R_AD2EEV9_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HRTIM_Common_ADC4R_AD2EEV8          (0x1UL << 7) 
#define HRTIM_Common_ADC4R_AD2EEV8_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define HRTIM_Common_ADC4R_AD2EEV7          (0x1UL << 6) 
#define HRTIM_Common_ADC4R_AD2EEV7_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_Common_ADC4R_AD2EEV6          (0x1UL << 5) 
#define HRTIM_Common_ADC4R_AD2EEV6_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define HRTIM_Common_ADC4R_AD2MPER          (0x1UL << 4) 
#define HRTIM_Common_ADC4R_AD2MPER_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_Common_ADC4R_AD2MC4          (0x1UL << 3) 
#define HRTIM_Common_ADC4R_AD2MC4_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_Common_ADC4R_AD2MC3          (0x1UL << 2) 
#define HRTIM_Common_ADC4R_AD2MC3_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_Common_ADC4R_AD2MC2          (0x1UL << 1) 
#define HRTIM_Common_ADC4R_AD2MC2_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_Common_ADC4R_AD2MC1          (0x1UL << 0) 
#define HRTIM_Common_ADC4R_AD2MC1_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_Common_DLLCR_CALRTE          (0x3UL << 2) 
#define HRTIM_Common_DLLCR_CALRTE_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define HRTIM_Common_DLLCR_CALEN          (0x1UL << 1) 
#define HRTIM_Common_DLLCR_CALEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_Common_DLLCR_CAL          (0x1UL << 0) 
#define HRTIM_Common_DLLCR_CAL_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_Common_FLTINR1_FLT4LCK          (0x1UL << 31) 
#define HRTIM_Common_FLTINR1_FLT4LCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define HRTIM_Common_FLTINR1_FLT4F          (0xFUL << 27) 
#define HRTIM_Common_FLTINR1_FLT4F_VAL(X) (((uint32_t)(X) & 0xFUL) << 27)
#define HRTIM_Common_FLTINR1_FLT4SRC          (0x1UL << 26) 
#define HRTIM_Common_FLTINR1_FLT4SRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define HRTIM_Common_FLTINR1_FLT4P          (0x1UL << 25) 
#define HRTIM_Common_FLTINR1_FLT4P_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define HRTIM_Common_FLTINR1_FLT4E          (0x1UL << 24) 
#define HRTIM_Common_FLTINR1_FLT4E_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define HRTIM_Common_FLTINR1_FLT3LCK          (0x1UL << 23) 
#define HRTIM_Common_FLTINR1_FLT3LCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define HRTIM_Common_FLTINR1_FLT3F          (0xFUL << 19) 
#define HRTIM_Common_FLTINR1_FLT3F_VAL(X) (((uint32_t)(X) & 0xFUL) << 19)
#define HRTIM_Common_FLTINR1_FLT3SRC          (0x1UL << 18) 
#define HRTIM_Common_FLTINR1_FLT3SRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HRTIM_Common_FLTINR1_FLT3P          (0x1UL << 17) 
#define HRTIM_Common_FLTINR1_FLT3P_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HRTIM_Common_FLTINR1_FLT3E          (0x1UL << 16) 
#define HRTIM_Common_FLTINR1_FLT3E_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define HRTIM_Common_FLTINR1_FLT2LCK          (0x1UL << 15) 
#define HRTIM_Common_FLTINR1_FLT2LCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define HRTIM_Common_FLTINR1_FLT2F          (0xFUL << 11) 
#define HRTIM_Common_FLTINR1_FLT2F_VAL(X) (((uint32_t)(X) & 0xFUL) << 11)
#define HRTIM_Common_FLTINR1_FLT2SRC          (0x1UL << 10) 
#define HRTIM_Common_FLTINR1_FLT2SRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define HRTIM_Common_FLTINR1_FLT2P          (0x1UL << 9) 
#define HRTIM_Common_FLTINR1_FLT2P_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HRTIM_Common_FLTINR1_FLT2E          (0x1UL << 8) 
#define HRTIM_Common_FLTINR1_FLT2E_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HRTIM_Common_FLTINR1_FLT1LCK          (0x1UL << 7) 
#define HRTIM_Common_FLTINR1_FLT1LCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define HRTIM_Common_FLTINR1_FLT1F          (0xFUL << 3) 
#define HRTIM_Common_FLTINR1_FLT1F_VAL(X) (((uint32_t)(X) & 0xFUL) << 3)
#define HRTIM_Common_FLTINR1_FLT1SRC          (0x1UL << 2) 
#define HRTIM_Common_FLTINR1_FLT1SRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_Common_FLTINR1_FLT1P          (0x1UL << 1) 
#define HRTIM_Common_FLTINR1_FLT1P_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_Common_FLTINR1_FLT1E          (0x1UL << 0) 
#define HRTIM_Common_FLTINR1_FLT1E_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_Common_FLTINR2_FLTSD          (0x3UL << 24) 
#define HRTIM_Common_FLTINR2_FLTSD_VAL(X) (((uint32_t)(X) & 0x3UL) << 24)
#define HRTIM_Common_FLTINR2_FLT5LCK          (0x1UL << 7) 
#define HRTIM_Common_FLTINR2_FLT5LCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define HRTIM_Common_FLTINR2_FLT5F          (0xFUL << 3) 
#define HRTIM_Common_FLTINR2_FLT5F_VAL(X) (((uint32_t)(X) & 0xFUL) << 3)
#define HRTIM_Common_FLTINR2_FLT5SRC          (0x1UL << 2) 
#define HRTIM_Common_FLTINR2_FLT5SRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_Common_FLTINR2_FLT5P          (0x1UL << 1) 
#define HRTIM_Common_FLTINR2_FLT5P_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_Common_FLTINR2_FLT5E          (0x1UL << 0) 
#define HRTIM_Common_FLTINR2_FLT5E_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_Common_BDMUPDR_MCMP4          (0x1UL << 9) 
#define HRTIM_Common_BDMUPDR_MCMP4_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HRTIM_Common_BDMUPDR_MCMP3          (0x1UL << 8) 
#define HRTIM_Common_BDMUPDR_MCMP3_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HRTIM_Common_BDMUPDR_MCMP2          (0x1UL << 7) 
#define HRTIM_Common_BDMUPDR_MCMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define HRTIM_Common_BDMUPDR_MCMP1          (0x1UL << 6) 
#define HRTIM_Common_BDMUPDR_MCMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_Common_BDMUPDR_MREP          (0x1UL << 5) 
#define HRTIM_Common_BDMUPDR_MREP_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define HRTIM_Common_BDMUPDR_MPER          (0x1UL << 4) 
#define HRTIM_Common_BDMUPDR_MPER_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_Common_BDMUPDR_MCNT          (0x1UL << 3) 
#define HRTIM_Common_BDMUPDR_MCNT_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_Common_BDMUPDR_MDIER          (0x1UL << 2) 
#define HRTIM_Common_BDMUPDR_MDIER_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_Common_BDMUPDR_MICR          (0x1UL << 1) 
#define HRTIM_Common_BDMUPDR_MICR_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_Common_BDMUPDR_MCR          (0x1UL << 0) 
#define HRTIM_Common_BDMUPDR_MCR_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_Common_BDTxUPR_TIMxFLTR          (0x1UL << 20) 
#define HRTIM_Common_BDTxUPR_TIMxFLTR_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define HRTIM_Common_BDTxUPR_TIMxOUTR          (0x1UL << 19) 
#define HRTIM_Common_BDTxUPR_TIMxOUTR_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define HRTIM_Common_BDTxUPR_TIMxCHPR          (0x1UL << 18) 
#define HRTIM_Common_BDTxUPR_TIMxCHPR_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define HRTIM_Common_BDTxUPR_TIMxRSTR          (0x1UL << 17) 
#define HRTIM_Common_BDTxUPR_TIMxRSTR_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define HRTIM_Common_BDTxUPR_TIMxEEFR2          (0x1UL << 16) 
#define HRTIM_Common_BDTxUPR_TIMxEEFR2_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define HRTIM_Common_BDTxUPR_TIMxEEFR1          (0x1UL << 15) 
#define HRTIM_Common_BDTxUPR_TIMxEEFR1_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define HRTIM_Common_BDTxUPR_TIMxRST2R          (0x1UL << 14) 
#define HRTIM_Common_BDTxUPR_TIMxRST2R_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define HRTIM_Common_BDTxUPR_TIMxSET2R          (0x1UL << 13) 
#define HRTIM_Common_BDTxUPR_TIMxSET2R_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define HRTIM_Common_BDTxUPR_TIMxRST1R          (0x1UL << 12) 
#define HRTIM_Common_BDTxUPR_TIMxRST1R_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define HRTIM_Common_BDTxUPR_TIMxSET1R          (0x1UL << 11) 
#define HRTIM_Common_BDTxUPR_TIMxSET1R_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define HRTIM_Common_BDTxUPR_TIMx_DTxR          (0x1UL << 10) 
#define HRTIM_Common_BDTxUPR_TIMx_DTxR_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define HRTIM_Common_BDTxUPR_TIMxCMP4          (0x1UL << 9) 
#define HRTIM_Common_BDTxUPR_TIMxCMP4_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define HRTIM_Common_BDTxUPR_TIMxCMP3          (0x1UL << 8) 
#define HRTIM_Common_BDTxUPR_TIMxCMP3_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define HRTIM_Common_BDTxUPR_TIMxCMP2          (0x1UL << 7) 
#define HRTIM_Common_BDTxUPR_TIMxCMP2_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define HRTIM_Common_BDTxUPR_TIMxCMP1          (0x1UL << 6) 
#define HRTIM_Common_BDTxUPR_TIMxCMP1_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define HRTIM_Common_BDTxUPR_TIMxREP          (0x1UL << 5) 
#define HRTIM_Common_BDTxUPR_TIMxREP_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define HRTIM_Common_BDTxUPR_TIMxPER          (0x1UL << 4) 
#define HRTIM_Common_BDTxUPR_TIMxPER_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define HRTIM_Common_BDTxUPR_TIMxCNT          (0x1UL << 3) 
#define HRTIM_Common_BDTxUPR_TIMxCNT_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define HRTIM_Common_BDTxUPR_TIMxDIER          (0x1UL << 2) 
#define HRTIM_Common_BDTxUPR_TIMxDIER_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define HRTIM_Common_BDTxUPR_TIMxICR          (0x1UL << 1) 
#define HRTIM_Common_BDTxUPR_TIMxICR_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define HRTIM_Common_BDTxUPR_TIMxCR          (0x1UL << 0) 
#define HRTIM_Common_BDTxUPR_TIMxCR_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define HRTIM_Common_BDMADR_BDMADR          (0xFFFFFFFFUL << 0) 
#define HRTIM_Common_BDMADR_BDMADR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)

