via/viaems/src/platforms/stm32h743/device.h
#define HRTIM_Common  ((struct HRTIM_Common*)(0x40017780UL))
struct DFSDM {
  volatile uint32_t DFSDM_CHCFG0R1;
  volatile uint32_t DFSDM_CHCFG1R1;
  volatile uint32_t DFSDM_CHCFG2R1;
  volatile uint32_t DFSDM_CHCFG3R1;
  volatile uint32_t DFSDM_CHCFG4R1;
  volatile uint32_t DFSDM_CHCFG5R1;
  volatile uint32_t DFSDM_CHCFG6R1;
  volatile uint32_t DFSDM_CHCFG7R1;
  volatile uint32_t DFSDM_CHCFG0R2;
  volatile uint32_t DFSDM_CHCFG1R2;
  volatile uint32_t DFSDM_CHCFG2R2;
  volatile uint32_t DFSDM_CHCFG3R2;
  volatile uint32_t DFSDM_CHCFG4R2;
  volatile uint32_t DFSDM_CHCFG5R2;
  volatile uint32_t DFSDM_CHCFG6R2;
  volatile uint32_t DFSDM_CHCFG7R2;
  volatile uint32_t DFSDM_AWSCD0R;
  volatile uint32_t DFSDM_AWSCD1R;
  volatile uint32_t DFSDM_AWSCD2R;
  volatile uint32_t DFSDM_AWSCD3R;
  volatile uint32_t DFSDM_AWSCD4R;
  volatile uint32_t DFSDM_AWSCD5R;
  volatile uint32_t DFSDM_AWSCD6R;
  volatile uint32_t DFSDM_AWSCD7R;
  volatile const uint32_t DFSDM_CHWDAT0R;
  volatile const uint32_t DFSDM_CHWDAT1R;
  volatile const uint32_t DFSDM_CHWDAT2R;
  volatile const uint32_t DFSDM_CHWDAT3R;
  volatile const uint32_t DFSDM_CHWDAT4R;
  volatile const uint32_t DFSDM_CHWDAT5R;
  volatile const uint32_t DFSDM_CHWDAT6R;
  volatile const uint32_t DFSDM_CHWDAT7R;
  volatile uint32_t DFSDM_CHDATIN0R;
  volatile uint32_t DFSDM_CHDATIN1R;
  volatile uint32_t DFSDM_CHDATIN2R;
  volatile uint32_t DFSDM_CHDATIN3R;
  volatile uint32_t DFSDM_CHDATIN4R;
  volatile uint32_t DFSDM_CHDATIN5R;
  volatile uint32_t DFSDM_CHDATIN6R;
  volatile uint32_t DFSDM_CHDATIN7R;
  volatile uint32_t DFSDM0_CR1;
  volatile uint32_t DFSDM1_CR1;
  volatile uint32_t DFSDM2_CR1;
  volatile uint32_t DFSDM3_CR1;
  volatile uint32_t DFSDM0_CR2;
  volatile uint32_t DFSDM1_CR2;
  volatile uint32_t DFSDM2_CR2;
  volatile uint32_t DFSDM3_CR2;
  volatile const uint32_t DFSDM0_ISR;
  volatile const uint32_t DFSDM1_ISR;
  volatile const uint32_t DFSDM2_ISR;
  volatile const uint32_t DFSDM3_ISR;
  volatile uint32_t DFSDM0_ICR;
  volatile uint32_t DFSDM1_ICR;
  volatile uint32_t DFSDM2_ICR;
  volatile uint32_t DFSDM3_ICR;
  volatile uint32_t DFSDM0_JCHGR;
  volatile uint32_t DFSDM1_JCHGR;
  volatile uint32_t DFSDM2_JCHGR;
  volatile uint32_t DFSDM3_JCHGR;
  volatile uint32_t DFSDM0_FCR;
  volatile uint32_t DFSDM1_FCR;
  volatile uint32_t DFSDM2_FCR;
  volatile uint32_t DFSDM3_FCR;
  volatile const uint32_t DFSDM0_JDATAR;
  volatile const uint32_t DFSDM1_JDATAR;
  volatile const uint32_t DFSDM2_JDATAR;
  volatile const uint32_t DFSDM3_JDATAR;
  volatile const uint32_t DFSDM0_RDATAR;
  volatile const uint32_t DFSDM1_RDATAR;
  volatile const uint32_t DFSDM2_RDATAR;
  volatile const uint32_t DFSDM3_RDATAR;
  volatile uint32_t DFSDM0_AWHTR;
  volatile uint32_t DFSDM1_AWHTR;
  volatile uint32_t DFSDM2_AWHTR;
  volatile uint32_t DFSDM3_AWHTR;
  volatile uint32_t DFSDM0_AWLTR;
  volatile uint32_t DFSDM1_AWLTR;
  volatile uint32_t DFSDM2_AWLTR;
  volatile uint32_t DFSDM3_AWLTR;
  volatile const uint32_t DFSDM0_AWSR;
  volatile const uint32_t DFSDM1_AWSR;
  volatile const uint32_t DFSDM2_AWSR;
  volatile const uint32_t DFSDM3_AWSR;
  volatile uint32_t DFSDM0_AWCFR;
  volatile uint32_t DFSDM1_AWCFR;
  volatile uint32_t DFSDM2_AWCFR;
  volatile uint32_t DFSDM3_AWCFR;
  volatile const uint32_t DFSDM0_EXMAX;
  volatile const uint32_t DFSDM1_EXMAX;
  volatile const uint32_t DFSDM2_EXMAX;
  volatile const uint32_t DFSDM3_EXMAX;
  volatile const uint32_t DFSDM0_EXMIN;
  volatile const uint32_t DFSDM1_EXMIN;
  volatile const uint32_t DFSDM2_EXMIN;
  volatile const uint32_t DFSDM3_EXMIN;
  volatile const uint32_t DFSDM0_CNVTIMR;
  volatile const uint32_t DFSDM1_CNVTIMR;
  volatile const uint32_t DFSDM2_CNVTIMR;
  volatile const uint32_t DFSDM3_CNVTIMR;
};
#define DFSDM_DFSDM_CHCFG0R1_SITP          (0x3UL << 0) 
#define DFSDM_DFSDM_CHCFG0R1_SITP_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define DFSDM_DFSDM_CHCFG0R1_SPICKSEL          (0x3UL << 2) 
#define DFSDM_DFSDM_CHCFG0R1_SPICKSEL_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define DFSDM_DFSDM_CHCFG0R1_SCDEN          (0x1UL << 5) 
#define DFSDM_DFSDM_CHCFG0R1_SCDEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define DFSDM_DFSDM_CHCFG0R1_CKABEN          (0x1UL << 6) 
#define DFSDM_DFSDM_CHCFG0R1_CKABEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define DFSDM_DFSDM_CHCFG0R1_CHEN          (0x1UL << 7) 
#define DFSDM_DFSDM_CHCFG0R1_CHEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define DFSDM_DFSDM_CHCFG0R1_CHINSEL          (0x1UL << 8) 
#define DFSDM_DFSDM_CHCFG0R1_CHINSEL_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DFSDM_DFSDM_CHCFG0R1_DATMPX          (0x3UL << 12) 
#define DFSDM_DFSDM_CHCFG0R1_DATMPX_VAL(X) (((uint32_t)(X) & 0x3UL) << 12)
#define DFSDM_DFSDM_CHCFG0R1_DATPACK          (0x3UL << 14) 
#define DFSDM_DFSDM_CHCFG0R1_DATPACK_VAL(X) (((uint32_t)(X) & 0x3UL) << 14)
#define DFSDM_DFSDM_CHCFG0R1_CKOUTDIV          (0xFFUL << 16) 
#define DFSDM_DFSDM_CHCFG0R1_CKOUTDIV_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define DFSDM_DFSDM_CHCFG0R1_CKOUTSRC          (0x1UL << 30) 
#define DFSDM_DFSDM_CHCFG0R1_CKOUTSRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define DFSDM_DFSDM_CHCFG0R1_DFSDMEN          (0x1UL << 31) 
#define DFSDM_DFSDM_CHCFG0R1_DFSDMEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define DFSDM_DFSDM_CHCFG1R1_SITP          (0x3UL << 0) 
#define DFSDM_DFSDM_CHCFG1R1_SITP_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define DFSDM_DFSDM_CHCFG1R1_SPICKSEL          (0x3UL << 2) 
#define DFSDM_DFSDM_CHCFG1R1_SPICKSEL_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define DFSDM_DFSDM_CHCFG1R1_SCDEN          (0x1UL << 5) 
#define DFSDM_DFSDM_CHCFG1R1_SCDEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define DFSDM_DFSDM_CHCFG1R1_CKABEN          (0x1UL << 6) 
#define DFSDM_DFSDM_CHCFG1R1_CKABEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define DFSDM_DFSDM_CHCFG1R1_CHEN          (0x1UL << 7) 
#define DFSDM_DFSDM_CHCFG1R1_CHEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define DFSDM_DFSDM_CHCFG1R1_CHINSEL          (0x1UL << 8) 
#define DFSDM_DFSDM_CHCFG1R1_CHINSEL_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DFSDM_DFSDM_CHCFG1R1_DATMPX          (0x3UL << 12) 
#define DFSDM_DFSDM_CHCFG1R1_DATMPX_VAL(X) (((uint32_t)(X) & 0x3UL) << 12)
#define DFSDM_DFSDM_CHCFG1R1_DATPACK          (0x3UL << 14) 
#define DFSDM_DFSDM_CHCFG1R1_DATPACK_VAL(X) (((uint32_t)(X) & 0x3UL) << 14)
#define DFSDM_DFSDM_CHCFG1R1_CKOUTDIV          (0xFFUL << 16) 
#define DFSDM_DFSDM_CHCFG1R1_CKOUTDIV_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define DFSDM_DFSDM_CHCFG1R1_CKOUTSRC          (0x1UL << 30) 
#define DFSDM_DFSDM_CHCFG1R1_CKOUTSRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define DFSDM_DFSDM_CHCFG1R1_DFSDMEN          (0x1UL << 31) 
#define DFSDM_DFSDM_CHCFG1R1_DFSDMEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define DFSDM_DFSDM_CHCFG2R1_SITP          (0x3UL << 0) 
#define DFSDM_DFSDM_CHCFG2R1_SITP_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define DFSDM_DFSDM_CHCFG2R1_SPICKSEL          (0x3UL << 2) 
#define DFSDM_DFSDM_CHCFG2R1_SPICKSEL_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define DFSDM_DFSDM_CHCFG2R1_SCDEN          (0x1UL << 5) 
#define DFSDM_DFSDM_CHCFG2R1_SCDEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define DFSDM_DFSDM_CHCFG2R1_CKABEN          (0x1UL << 6) 
#define DFSDM_DFSDM_CHCFG2R1_CKABEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define DFSDM_DFSDM_CHCFG2R1_CHEN          (0x1UL << 7) 
#define DFSDM_DFSDM_CHCFG2R1_CHEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define DFSDM_DFSDM_CHCFG2R1_CHINSEL          (0x1UL << 8) 
#define DFSDM_DFSDM_CHCFG2R1_CHINSEL_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DFSDM_DFSDM_CHCFG2R1_DATMPX          (0x3UL << 12) 
#define DFSDM_DFSDM_CHCFG2R1_DATMPX_VAL(X) (((uint32_t)(X) & 0x3UL) << 12)
#define DFSDM_DFSDM_CHCFG2R1_DATPACK          (0x3UL << 14) 
#define DFSDM_DFSDM_CHCFG2R1_DATPACK_VAL(X) (((uint32_t)(X) & 0x3UL) << 14)
#define DFSDM_DFSDM_CHCFG2R1_CKOUTDIV          (0xFFUL << 16) 
#define DFSDM_DFSDM_CHCFG2R1_CKOUTDIV_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define DFSDM_DFSDM_CHCFG2R1_CKOUTSRC          (0x1UL << 30) 
#define DFSDM_DFSDM_CHCFG2R1_CKOUTSRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define DFSDM_DFSDM_CHCFG2R1_DFSDMEN          (0x1UL << 31) 
#define DFSDM_DFSDM_CHCFG2R1_DFSDMEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define DFSDM_DFSDM_CHCFG3R1_SITP          (0x3UL << 0) 
#define DFSDM_DFSDM_CHCFG3R1_SITP_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define DFSDM_DFSDM_CHCFG3R1_SPICKSEL          (0x3UL << 2) 
#define DFSDM_DFSDM_CHCFG3R1_SPICKSEL_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define DFSDM_DFSDM_CHCFG3R1_SCDEN          (0x1UL << 5) 
#define DFSDM_DFSDM_CHCFG3R1_SCDEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define DFSDM_DFSDM_CHCFG3R1_CKABEN          (0x1UL << 6) 
#define DFSDM_DFSDM_CHCFG3R1_CKABEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define DFSDM_DFSDM_CHCFG3R1_CHEN          (0x1UL << 7) 
#define DFSDM_DFSDM_CHCFG3R1_CHEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define DFSDM_DFSDM_CHCFG3R1_CHINSEL          (0x1UL << 8) 
#define DFSDM_DFSDM_CHCFG3R1_CHINSEL_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DFSDM_DFSDM_CHCFG3R1_DATMPX          (0x3UL << 12) 
#define DFSDM_DFSDM_CHCFG3R1_DATMPX_VAL(X) (((uint32_t)(X) & 0x3UL) << 12)
#define DFSDM_DFSDM_CHCFG3R1_DATPACK          (0x3UL << 14) 
#define DFSDM_DFSDM_CHCFG3R1_DATPACK_VAL(X) (((uint32_t)(X) & 0x3UL) << 14)
#define DFSDM_DFSDM_CHCFG3R1_CKOUTDIV          (0xFFUL << 16) 
#define DFSDM_DFSDM_CHCFG3R1_CKOUTDIV_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define DFSDM_DFSDM_CHCFG3R1_CKOUTSRC          (0x1UL << 30) 
#define DFSDM_DFSDM_CHCFG3R1_CKOUTSRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define DFSDM_DFSDM_CHCFG3R1_DFSDMEN          (0x1UL << 31) 
#define DFSDM_DFSDM_CHCFG3R1_DFSDMEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define DFSDM_DFSDM_CHCFG4R1_SITP          (0x3UL << 0) 
#define DFSDM_DFSDM_CHCFG4R1_SITP_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define DFSDM_DFSDM_CHCFG4R1_SPICKSEL          (0x3UL << 2) 
#define DFSDM_DFSDM_CHCFG4R1_SPICKSEL_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define DFSDM_DFSDM_CHCFG4R1_SCDEN          (0x1UL << 5) 
#define DFSDM_DFSDM_CHCFG4R1_SCDEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define DFSDM_DFSDM_CHCFG4R1_CKABEN          (0x1UL << 6) 
#define DFSDM_DFSDM_CHCFG4R1_CKABEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define DFSDM_DFSDM_CHCFG4R1_CHEN          (0x1UL << 7) 
#define DFSDM_DFSDM_CHCFG4R1_CHEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define DFSDM_DFSDM_CHCFG4R1_CHINSEL          (0x1UL << 8) 
#define DFSDM_DFSDM_CHCFG4R1_CHINSEL_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DFSDM_DFSDM_CHCFG4R1_DATMPX          (0x3UL << 12) 
#define DFSDM_DFSDM_CHCFG4R1_DATMPX_VAL(X) (((uint32_t)(X) & 0x3UL) << 12)
#define DFSDM_DFSDM_CHCFG4R1_DATPACK          (0x3UL << 14) 
#define DFSDM_DFSDM_CHCFG4R1_DATPACK_VAL(X) (((uint32_t)(X) & 0x3UL) << 14)
#define DFSDM_DFSDM_CHCFG4R1_CKOUTDIV          (0xFFUL << 16) 
#define DFSDM_DFSDM_CHCFG4R1_CKOUTDIV_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define DFSDM_DFSDM_CHCFG4R1_CKOUTSRC          (0x1UL << 30) 
#define DFSDM_DFSDM_CHCFG4R1_CKOUTSRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define DFSDM_DFSDM_CHCFG4R1_DFSDMEN          (0x1UL << 31) 
#define DFSDM_DFSDM_CHCFG4R1_DFSDMEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define DFSDM_DFSDM_CHCFG5R1_SITP          (0x3UL << 0) 
#define DFSDM_DFSDM_CHCFG5R1_SITP_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define DFSDM_DFSDM_CHCFG5R1_SPICKSEL          (0x3UL << 2) 
#define DFSDM_DFSDM_CHCFG5R1_SPICKSEL_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define DFSDM_DFSDM_CHCFG5R1_SCDEN          (0x1UL << 5) 
#define DFSDM_DFSDM_CHCFG5R1_SCDEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define DFSDM_DFSDM_CHCFG5R1_CKABEN          (0x1UL << 6) 
#define DFSDM_DFSDM_CHCFG5R1_CKABEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define DFSDM_DFSDM_CHCFG5R1_CHEN          (0x1UL << 7) 
#define DFSDM_DFSDM_CHCFG5R1_CHEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define DFSDM_DFSDM_CHCFG5R1_CHINSEL          (0x1UL << 8) 
#define DFSDM_DFSDM_CHCFG5R1_CHINSEL_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DFSDM_DFSDM_CHCFG5R1_DATMPX          (0x3UL << 12) 
#define DFSDM_DFSDM_CHCFG5R1_DATMPX_VAL(X) (((uint32_t)(X) & 0x3UL) << 12)
#define DFSDM_DFSDM_CHCFG5R1_DATPACK          (0x3UL << 14) 
#define DFSDM_DFSDM_CHCFG5R1_DATPACK_VAL(X) (((uint32_t)(X) & 0x3UL) << 14)
#define DFSDM_DFSDM_CHCFG5R1_CKOUTDIV          (0xFFUL << 16) 
#define DFSDM_DFSDM_CHCFG5R1_CKOUTDIV_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define DFSDM_DFSDM_CHCFG5R1_CKOUTSRC          (0x1UL << 30) 
#define DFSDM_DFSDM_CHCFG5R1_CKOUTSRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define DFSDM_DFSDM_CHCFG5R1_DFSDMEN          (0x1UL << 31) 
#define DFSDM_DFSDM_CHCFG5R1_DFSDMEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define DFSDM_DFSDM_CHCFG6R1_SITP          (0x3UL << 0) 
#define DFSDM_DFSDM_CHCFG6R1_SITP_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define DFSDM_DFSDM_CHCFG6R1_SPICKSEL          (0x3UL << 2) 
#define DFSDM_DFSDM_CHCFG6R1_SPICKSEL_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define DFSDM_DFSDM_CHCFG6R1_SCDEN          (0x1UL << 5) 
#define DFSDM_DFSDM_CHCFG6R1_SCDEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define DFSDM_DFSDM_CHCFG6R1_CKABEN          (0x1UL << 6) 
#define DFSDM_DFSDM_CHCFG6R1_CKABEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define DFSDM_DFSDM_CHCFG6R1_CHEN          (0x1UL << 7) 
#define DFSDM_DFSDM_CHCFG6R1_CHEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define DFSDM_DFSDM_CHCFG6R1_CHINSEL          (0x1UL << 8) 
#define DFSDM_DFSDM_CHCFG6R1_CHINSEL_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DFSDM_DFSDM_CHCFG6R1_DATMPX          (0x3UL << 12) 
#define DFSDM_DFSDM_CHCFG6R1_DATMPX_VAL(X) (((uint32_t)(X) & 0x3UL) << 12)
#define DFSDM_DFSDM_CHCFG6R1_DATPACK          (0x3UL << 14) 
#define DFSDM_DFSDM_CHCFG6R1_DATPACK_VAL(X) (((uint32_t)(X) & 0x3UL) << 14)
#define DFSDM_DFSDM_CHCFG6R1_CKOUTDIV          (0xFFUL << 16) 
#define DFSDM_DFSDM_CHCFG6R1_CKOUTDIV_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define DFSDM_DFSDM_CHCFG6R1_CKOUTSRC          (0x1UL << 30) 
#define DFSDM_DFSDM_CHCFG6R1_CKOUTSRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define DFSDM_DFSDM_CHCFG6R1_DFSDMEN          (0x1UL << 31) 
#define DFSDM_DFSDM_CHCFG6R1_DFSDMEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define DFSDM_DFSDM_CHCFG7R1_SITP          (0x3UL << 0) 
#define DFSDM_DFSDM_CHCFG7R1_SITP_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define DFSDM_DFSDM_CHCFG7R1_SPICKSEL          (0x3UL << 2) 
#define DFSDM_DFSDM_CHCFG7R1_SPICKSEL_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define DFSDM_DFSDM_CHCFG7R1_SCDEN          (0x1UL << 5) 
#define DFSDM_DFSDM_CHCFG7R1_SCDEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define DFSDM_DFSDM_CHCFG7R1_CKABEN          (0x1UL << 6) 
#define DFSDM_DFSDM_CHCFG7R1_CKABEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define DFSDM_DFSDM_CHCFG7R1_CHEN          (0x1UL << 7) 
#define DFSDM_DFSDM_CHCFG7R1_CHEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define DFSDM_DFSDM_CHCFG7R1_CHINSEL          (0x1UL << 8) 
#define DFSDM_DFSDM_CHCFG7R1_CHINSEL_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DFSDM_DFSDM_CHCFG7R1_DATMPX          (0x3UL << 12) 
#define DFSDM_DFSDM_CHCFG7R1_DATMPX_VAL(X) (((uint32_t)(X) & 0x3UL) << 12)
#define DFSDM_DFSDM_CHCFG7R1_DATPACK          (0x3UL << 14) 
#define DFSDM_DFSDM_CHCFG7R1_DATPACK_VAL(X) (((uint32_t)(X) & 0x3UL) << 14)
#define DFSDM_DFSDM_CHCFG7R1_CKOUTDIV          (0xFFUL << 16) 
#define DFSDM_DFSDM_CHCFG7R1_CKOUTDIV_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define DFSDM_DFSDM_CHCFG7R1_CKOUTSRC          (0x1UL << 30) 
#define DFSDM_DFSDM_CHCFG7R1_CKOUTSRC_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define DFSDM_DFSDM_CHCFG7R1_DFSDMEN          (0x1UL << 31) 
#define DFSDM_DFSDM_CHCFG7R1_DFSDMEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define DFSDM_DFSDM_CHCFG0R2_DTRBS          (0x1FUL << 3) 
#define DFSDM_DFSDM_CHCFG0R2_DTRBS_VAL(X) (((uint32_t)(X) & 0x1FUL) << 3)
#define DFSDM_DFSDM_CHCFG0R2_OFFSET          (0xFFFFFFUL << 8) 
#define DFSDM_DFSDM_CHCFG0R2_OFFSET_VAL(X) (((uint32_t)(X) & 0xFFFFFFUL) << 8)
#define DFSDM_DFSDM_CHCFG1R2_DTRBS          (0x1FUL << 3) 
#define DFSDM_DFSDM_CHCFG1R2_DTRBS_VAL(X) (((uint32_t)(X) & 0x1FUL) << 3)
#define DFSDM_DFSDM_CHCFG1R2_OFFSET          (0xFFFFFFUL << 8) 
#define DFSDM_DFSDM_CHCFG1R2_OFFSET_VAL(X) (((uint32_t)(X) & 0xFFFFFFUL) << 8)
#define DFSDM_DFSDM_CHCFG2R2_DTRBS          (0x1FUL << 3) 
#define DFSDM_DFSDM_CHCFG2R2_DTRBS_VAL(X) (((uint32_t)(X) & 0x1FUL) << 3)
#define DFSDM_DFSDM_CHCFG2R2_OFFSET          (0xFFFFFFUL << 8) 
#define DFSDM_DFSDM_CHCFG2R2_OFFSET_VAL(X) (((uint32_t)(X) & 0xFFFFFFUL) << 8)
#define DFSDM_DFSDM_CHCFG3R2_DTRBS          (0x1FUL << 3) 
#define DFSDM_DFSDM_CHCFG3R2_DTRBS_VAL(X) (((uint32_t)(X) & 0x1FUL) << 3)
#define DFSDM_DFSDM_CHCFG3R2_OFFSET          (0xFFFFFFUL << 8) 
#define DFSDM_DFSDM_CHCFG3R2_OFFSET_VAL(X) (((uint32_t)(X) & 0xFFFFFFUL) << 8)
#define DFSDM_DFSDM_CHCFG4R2_DTRBS          (0x1FUL << 3) 
#define DFSDM_DFSDM_CHCFG4R2_DTRBS_VAL(X) (((uint32_t)(X) & 0x1FUL) << 3)
#define DFSDM_DFSDM_CHCFG4R2_OFFSET          (0xFFFFFFUL << 8) 
#define DFSDM_DFSDM_CHCFG4R2_OFFSET_VAL(X) (((uint32_t)(X) & 0xFFFFFFUL) << 8)
#define DFSDM_DFSDM_CHCFG5R2_DTRBS          (0x1FUL << 3) 
#define DFSDM_DFSDM_CHCFG5R2_DTRBS_VAL(X) (((uint32_t)(X) & 0x1FUL) << 3)
#define DFSDM_DFSDM_CHCFG5R2_OFFSET          (0xFFFFFFUL << 8) 
#define DFSDM_DFSDM_CHCFG5R2_OFFSET_VAL(X) (((uint32_t)(X) & 0xFFFFFFUL) << 8)
#define DFSDM_DFSDM_CHCFG6R2_DTRBS          (0x1FUL << 3) 
#define DFSDM_DFSDM_CHCFG6R2_DTRBS_VAL(X) (((uint32_t)(X) & 0x1FUL) << 3)
#define DFSDM_DFSDM_CHCFG6R2_OFFSET          (0xFFFFFFUL << 8) 
#define DFSDM_DFSDM_CHCFG6R2_OFFSET_VAL(X) (((uint32_t)(X) & 0xFFFFFFUL) << 8)
#define DFSDM_DFSDM_CHCFG7R2_DTRBS          (0x1FUL << 3) 
#define DFSDM_DFSDM_CHCFG7R2_DTRBS_VAL(X) (((uint32_t)(X) & 0x1FUL) << 3)
#define DFSDM_DFSDM_CHCFG7R2_OFFSET          (0xFFFFFFUL << 8) 
#define DFSDM_DFSDM_CHCFG7R2_OFFSET_VAL(X) (((uint32_t)(X) & 0xFFFFFFUL) << 8)
#define DFSDM_DFSDM_AWSCD0R_SCDT          (0xFFUL << 0) 
#define DFSDM_DFSDM_AWSCD0R_SCDT_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DFSDM_DFSDM_AWSCD0R_BKSCD          (0xFUL << 12) 
#define DFSDM_DFSDM_AWSCD0R_BKSCD_VAL(X) (((uint32_t)(X) & 0xFUL) << 12)
#define DFSDM_DFSDM_AWSCD0R_AWFOSR          (0x1FUL << 16) 
#define DFSDM_DFSDM_AWSCD0R_AWFOSR_VAL(X) (((uint32_t)(X) & 0x1FUL) << 16)
#define DFSDM_DFSDM_AWSCD0R_AWFORD          (0x3UL << 22) 
#define DFSDM_DFSDM_AWSCD0R_AWFORD_VAL(X) (((uint32_t)(X) & 0x3UL) << 22)
#define DFSDM_DFSDM_AWSCD1R_SCDT          (0xFFUL << 0) 
#define DFSDM_DFSDM_AWSCD1R_SCDT_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DFSDM_DFSDM_AWSCD1R_BKSCD          (0xFUL << 12) 
#define DFSDM_DFSDM_AWSCD1R_BKSCD_VAL(X) (((uint32_t)(X) & 0xFUL) << 12)
#define DFSDM_DFSDM_AWSCD1R_AWFOSR          (0x1FUL << 16) 
#define DFSDM_DFSDM_AWSCD1R_AWFOSR_VAL(X) (((uint32_t)(X) & 0x1FUL) << 16)
#define DFSDM_DFSDM_AWSCD1R_AWFORD          (0x3UL << 22) 
#define DFSDM_DFSDM_AWSCD1R_AWFORD_VAL(X) (((uint32_t)(X) & 0x3UL) << 22)
#define DFSDM_DFSDM_AWSCD2R_SCDT          (0xFFUL << 0) 
#define DFSDM_DFSDM_AWSCD2R_SCDT_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DFSDM_DFSDM_AWSCD2R_BKSCD          (0xFUL << 12) 
#define DFSDM_DFSDM_AWSCD2R_BKSCD_VAL(X) (((uint32_t)(X) & 0xFUL) << 12)
#define DFSDM_DFSDM_AWSCD2R_AWFOSR          (0x1FUL << 16) 
#define DFSDM_DFSDM_AWSCD2R_AWFOSR_VAL(X) (((uint32_t)(X) & 0x1FUL) << 16)
#define DFSDM_DFSDM_AWSCD2R_AWFORD          (0x3UL << 22) 
#define DFSDM_DFSDM_AWSCD2R_AWFORD_VAL(X) (((uint32_t)(X) & 0x3UL) << 22)
#define DFSDM_DFSDM_AWSCD3R_SCDT          (0xFFUL << 0) 
#define DFSDM_DFSDM_AWSCD3R_SCDT_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DFSDM_DFSDM_AWSCD3R_BKSCD          (0xFUL << 12) 
#define DFSDM_DFSDM_AWSCD3R_BKSCD_VAL(X) (((uint32_t)(X) & 0xFUL) << 12)
#define DFSDM_DFSDM_AWSCD3R_AWFOSR          (0x1FUL << 16) 
#define DFSDM_DFSDM_AWSCD3R_AWFOSR_VAL(X) (((uint32_t)(X) & 0x1FUL) << 16)
#define DFSDM_DFSDM_AWSCD3R_AWFORD          (0x3UL << 22) 
#define DFSDM_DFSDM_AWSCD3R_AWFORD_VAL(X) (((uint32_t)(X) & 0x3UL) << 22)
#define DFSDM_DFSDM_AWSCD4R_SCDT          (0xFFUL << 0) 
#define DFSDM_DFSDM_AWSCD4R_SCDT_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DFSDM_DFSDM_AWSCD4R_BKSCD          (0xFUL << 12) 
#define DFSDM_DFSDM_AWSCD4R_BKSCD_VAL(X) (((uint32_t)(X) & 0xFUL) << 12)
#define DFSDM_DFSDM_AWSCD4R_AWFOSR          (0x1FUL << 16) 
#define DFSDM_DFSDM_AWSCD4R_AWFOSR_VAL(X) (((uint32_t)(X) & 0x1FUL) << 16)
#define DFSDM_DFSDM_AWSCD4R_AWFORD          (0x3UL << 22) 
#define DFSDM_DFSDM_AWSCD4R_AWFORD_VAL(X) (((uint32_t)(X) & 0x3UL) << 22)
#define DFSDM_DFSDM_AWSCD5R_SCDT          (0xFFUL << 0) 
#define DFSDM_DFSDM_AWSCD5R_SCDT_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DFSDM_DFSDM_AWSCD5R_BKSCD          (0xFUL << 12) 
#define DFSDM_DFSDM_AWSCD5R_BKSCD_VAL(X) (((uint32_t)(X) & 0xFUL) << 12)
#define DFSDM_DFSDM_AWSCD5R_AWFOSR          (0x1FUL << 16) 
#define DFSDM_DFSDM_AWSCD5R_AWFOSR_VAL(X) (((uint32_t)(X) & 0x1FUL) << 16)
#define DFSDM_DFSDM_AWSCD5R_AWFORD          (0x3UL << 22) 
#define DFSDM_DFSDM_AWSCD5R_AWFORD_VAL(X) (((uint32_t)(X) & 0x3UL) << 22)
#define DFSDM_DFSDM_AWSCD6R_SCDT          (0xFFUL << 0) 
#define DFSDM_DFSDM_AWSCD6R_SCDT_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DFSDM_DFSDM_AWSCD6R_BKSCD          (0xFUL << 12) 
#define DFSDM_DFSDM_AWSCD6R_BKSCD_VAL(X) (((uint32_t)(X) & 0xFUL) << 12)
#define DFSDM_DFSDM_AWSCD6R_AWFOSR          (0x1FUL << 16) 
#define DFSDM_DFSDM_AWSCD6R_AWFOSR_VAL(X) (((uint32_t)(X) & 0x1FUL) << 16)
#define DFSDM_DFSDM_AWSCD6R_AWFORD          (0x3UL << 22) 
#define DFSDM_DFSDM_AWSCD6R_AWFORD_VAL(X) (((uint32_t)(X) & 0x3UL) << 22)
#define DFSDM_DFSDM_AWSCD7R_SCDT          (0xFFUL << 0) 
#define DFSDM_DFSDM_AWSCD7R_SCDT_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DFSDM_DFSDM_AWSCD7R_BKSCD          (0xFUL << 12) 
#define DFSDM_DFSDM_AWSCD7R_BKSCD_VAL(X) (((uint32_t)(X) & 0xFUL) << 12)
#define DFSDM_DFSDM_AWSCD7R_AWFOSR          (0x1FUL << 16) 
#define DFSDM_DFSDM_AWSCD7R_AWFOSR_VAL(X) (((uint32_t)(X) & 0x1FUL) << 16)
#define DFSDM_DFSDM_AWSCD7R_AWFORD          (0x3UL << 22) 
#define DFSDM_DFSDM_AWSCD7R_AWFORD_VAL(X) (((uint32_t)(X) & 0x3UL) << 22)
#define DFSDM_DFSDM_CHWDAT0R_WDATA          (0xFFFFUL << 0) 
#define DFSDM_DFSDM_CHWDAT0R_WDATA_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define DFSDM_DFSDM_CHWDAT1R_WDATA          (0xFFFFUL << 0) 
#define DFSDM_DFSDM_CHWDAT1R_WDATA_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define DFSDM_DFSDM_CHWDAT2R_WDATA          (0xFFFFUL << 0) 
#define DFSDM_DFSDM_CHWDAT2R_WDATA_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define DFSDM_DFSDM_CHWDAT3R_WDATA          (0xFFFFUL << 0) 
#define DFSDM_DFSDM_CHWDAT3R_WDATA_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define DFSDM_DFSDM_CHWDAT4R_WDATA          (0xFFFFUL << 0) 
#define DFSDM_DFSDM_CHWDAT4R_WDATA_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define DFSDM_DFSDM_CHWDAT5R_WDATA          (0xFFFFUL << 0) 
#define DFSDM_DFSDM_CHWDAT5R_WDATA_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define DFSDM_DFSDM_CHWDAT6R_WDATA          (0xFFFFUL << 0) 
#define DFSDM_DFSDM_CHWDAT6R_WDATA_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define DFSDM_DFSDM_CHWDAT7R_WDATA          (0xFFFFUL << 0) 
#define DFSDM_DFSDM_CHWDAT7R_WDATA_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define DFSDM_DFSDM_CHDATIN0R_INDAT0          (0xFFFFUL << 0) 
#define DFSDM_DFSDM_CHDATIN0R_INDAT0_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define DFSDM_DFSDM_CHDATIN0R_INDAT1          (0xFFFFUL << 16) 
#define DFSDM_DFSDM_CHDATIN0R_INDAT1_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define DFSDM_DFSDM_CHDATIN1R_INDAT0          (0xFFFFUL << 0) 
#define DFSDM_DFSDM_CHDATIN1R_INDAT0_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define DFSDM_DFSDM_CHDATIN1R_INDAT1          (0xFFFFUL << 16) 
#define DFSDM_DFSDM_CHDATIN1R_INDAT1_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define DFSDM_DFSDM_CHDATIN2R_INDAT0          (0xFFFFUL << 0) 
#define DFSDM_DFSDM_CHDATIN2R_INDAT0_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define DFSDM_DFSDM_CHDATIN2R_INDAT1          (0xFFFFUL << 16) 
#define DFSDM_DFSDM_CHDATIN2R_INDAT1_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
