via/viaems/src/platforms/stm32h743/device.h
#define DFSDM_DFSDM_CHDATIN3R_INDAT0          (0xFFFFUL << 0) 
#define DFSDM_DFSDM_CHDATIN3R_INDAT0_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define DFSDM_DFSDM_CHDATIN3R_INDAT1          (0xFFFFUL << 16) 
#define DFSDM_DFSDM_CHDATIN3R_INDAT1_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define DFSDM_DFSDM_CHDATIN4R_INDAT0          (0xFFFFUL << 0) 
#define DFSDM_DFSDM_CHDATIN4R_INDAT0_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define DFSDM_DFSDM_CHDATIN4R_INDAT1          (0xFFFFUL << 16) 
#define DFSDM_DFSDM_CHDATIN4R_INDAT1_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define DFSDM_DFSDM_CHDATIN5R_INDAT0          (0xFFFFUL << 0) 
#define DFSDM_DFSDM_CHDATIN5R_INDAT0_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define DFSDM_DFSDM_CHDATIN5R_INDAT1          (0xFFFFUL << 16) 
#define DFSDM_DFSDM_CHDATIN5R_INDAT1_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define DFSDM_DFSDM_CHDATIN6R_INDAT0          (0xFFFFUL << 0) 
#define DFSDM_DFSDM_CHDATIN6R_INDAT0_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define DFSDM_DFSDM_CHDATIN6R_INDAT1          (0xFFFFUL << 16) 
#define DFSDM_DFSDM_CHDATIN6R_INDAT1_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define DFSDM_DFSDM_CHDATIN7R_INDAT0          (0xFFFFUL << 0) 
#define DFSDM_DFSDM_CHDATIN7R_INDAT0_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define DFSDM_DFSDM_CHDATIN7R_INDAT1          (0xFFFFUL << 16) 
#define DFSDM_DFSDM_CHDATIN7R_INDAT1_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define DFSDM_DFSDM0_CR1_DFEN          (0x1UL << 0) 
#define DFSDM_DFSDM0_CR1_DFEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define DFSDM_DFSDM0_CR1_JSWSTART          (0x1UL << 1) 
#define DFSDM_DFSDM0_CR1_JSWSTART_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define DFSDM_DFSDM0_CR1_JSYNC          (0x1UL << 3) 
#define DFSDM_DFSDM0_CR1_JSYNC_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define DFSDM_DFSDM0_CR1_JSCAN          (0x1UL << 4) 
#define DFSDM_DFSDM0_CR1_JSCAN_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define DFSDM_DFSDM0_CR1_JDMAEN          (0x1UL << 5) 
#define DFSDM_DFSDM0_CR1_JDMAEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define DFSDM_DFSDM0_CR1_JEXTSEL          (0x1FUL << 8) 
#define DFSDM_DFSDM0_CR1_JEXTSEL_VAL(X) (((uint32_t)(X) & 0x1FUL) << 8)
#define DFSDM_DFSDM0_CR1_JEXTEN          (0x3UL << 13) 
#define DFSDM_DFSDM0_CR1_JEXTEN_VAL(X) (((uint32_t)(X) & 0x3UL) << 13)
#define DFSDM_DFSDM0_CR1_RSWSTART          (0x1UL << 17) 
#define DFSDM_DFSDM0_CR1_RSWSTART_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define DFSDM_DFSDM0_CR1_RCONT          (0x1UL << 18) 
#define DFSDM_DFSDM0_CR1_RCONT_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define DFSDM_DFSDM0_CR1_RSYNC          (0x1UL << 19) 
#define DFSDM_DFSDM0_CR1_RSYNC_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define DFSDM_DFSDM0_CR1_RDMAEN          (0x1UL << 21) 
#define DFSDM_DFSDM0_CR1_RDMAEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define DFSDM_DFSDM0_CR1_RCH          (0x7UL << 24) 
#define DFSDM_DFSDM0_CR1_RCH_VAL(X) (((uint32_t)(X) & 0x7UL) << 24)
#define DFSDM_DFSDM0_CR1_FAST          (0x1UL << 29) 
#define DFSDM_DFSDM0_CR1_FAST_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define DFSDM_DFSDM0_CR1_AWFSEL          (0x1UL << 30) 
#define DFSDM_DFSDM0_CR1_AWFSEL_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define DFSDM_DFSDM1_CR1_DFEN          (0x1UL << 0) 
#define DFSDM_DFSDM1_CR1_DFEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define DFSDM_DFSDM1_CR1_JSWSTART          (0x1UL << 1) 
#define DFSDM_DFSDM1_CR1_JSWSTART_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define DFSDM_DFSDM1_CR1_JSYNC          (0x1UL << 3) 
#define DFSDM_DFSDM1_CR1_JSYNC_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define DFSDM_DFSDM1_CR1_JSCAN          (0x1UL << 4) 
#define DFSDM_DFSDM1_CR1_JSCAN_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define DFSDM_DFSDM1_CR1_JDMAEN          (0x1UL << 5) 
#define DFSDM_DFSDM1_CR1_JDMAEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define DFSDM_DFSDM1_CR1_JEXTSEL          (0x1FUL << 8) 
#define DFSDM_DFSDM1_CR1_JEXTSEL_VAL(X) (((uint32_t)(X) & 0x1FUL) << 8)
#define DFSDM_DFSDM1_CR1_JEXTEN          (0x3UL << 13) 
#define DFSDM_DFSDM1_CR1_JEXTEN_VAL(X) (((uint32_t)(X) & 0x3UL) << 13)
#define DFSDM_DFSDM1_CR1_RSWSTART          (0x1UL << 17) 
#define DFSDM_DFSDM1_CR1_RSWSTART_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define DFSDM_DFSDM1_CR1_RCONT          (0x1UL << 18) 
#define DFSDM_DFSDM1_CR1_RCONT_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define DFSDM_DFSDM1_CR1_RSYNC          (0x1UL << 19) 
#define DFSDM_DFSDM1_CR1_RSYNC_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define DFSDM_DFSDM1_CR1_RDMAEN          (0x1UL << 21) 
#define DFSDM_DFSDM1_CR1_RDMAEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define DFSDM_DFSDM1_CR1_RCH          (0x7UL << 24) 
#define DFSDM_DFSDM1_CR1_RCH_VAL(X) (((uint32_t)(X) & 0x7UL) << 24)
#define DFSDM_DFSDM1_CR1_FAST          (0x1UL << 29) 
#define DFSDM_DFSDM1_CR1_FAST_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define DFSDM_DFSDM1_CR1_AWFSEL          (0x1UL << 30) 
#define DFSDM_DFSDM1_CR1_AWFSEL_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define DFSDM_DFSDM2_CR1_DFEN          (0x1UL << 0) 
#define DFSDM_DFSDM2_CR1_DFEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define DFSDM_DFSDM2_CR1_JSWSTART          (0x1UL << 1) 
#define DFSDM_DFSDM2_CR1_JSWSTART_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define DFSDM_DFSDM2_CR1_JSYNC          (0x1UL << 3) 
#define DFSDM_DFSDM2_CR1_JSYNC_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define DFSDM_DFSDM2_CR1_JSCAN          (0x1UL << 4) 
#define DFSDM_DFSDM2_CR1_JSCAN_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define DFSDM_DFSDM2_CR1_JDMAEN          (0x1UL << 5) 
#define DFSDM_DFSDM2_CR1_JDMAEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define DFSDM_DFSDM2_CR1_JEXTSEL          (0x1FUL << 8) 
#define DFSDM_DFSDM2_CR1_JEXTSEL_VAL(X) (((uint32_t)(X) & 0x1FUL) << 8)
#define DFSDM_DFSDM2_CR1_JEXTEN          (0x3UL << 13) 
#define DFSDM_DFSDM2_CR1_JEXTEN_VAL(X) (((uint32_t)(X) & 0x3UL) << 13)
#define DFSDM_DFSDM2_CR1_RSWSTART          (0x1UL << 17) 
#define DFSDM_DFSDM2_CR1_RSWSTART_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define DFSDM_DFSDM2_CR1_RCONT          (0x1UL << 18) 
#define DFSDM_DFSDM2_CR1_RCONT_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define DFSDM_DFSDM2_CR1_RSYNC          (0x1UL << 19) 
#define DFSDM_DFSDM2_CR1_RSYNC_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define DFSDM_DFSDM2_CR1_RDMAEN          (0x1UL << 21) 
#define DFSDM_DFSDM2_CR1_RDMAEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define DFSDM_DFSDM2_CR1_RCH          (0x7UL << 24) 
#define DFSDM_DFSDM2_CR1_RCH_VAL(X) (((uint32_t)(X) & 0x7UL) << 24)
#define DFSDM_DFSDM2_CR1_FAST          (0x1UL << 29) 
#define DFSDM_DFSDM2_CR1_FAST_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define DFSDM_DFSDM2_CR1_AWFSEL          (0x1UL << 30) 
#define DFSDM_DFSDM2_CR1_AWFSEL_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define DFSDM_DFSDM3_CR1_DFEN          (0x1UL << 0) 
#define DFSDM_DFSDM3_CR1_DFEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define DFSDM_DFSDM3_CR1_JSWSTART          (0x1UL << 1) 
#define DFSDM_DFSDM3_CR1_JSWSTART_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define DFSDM_DFSDM3_CR1_JSYNC          (0x1UL << 3) 
#define DFSDM_DFSDM3_CR1_JSYNC_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define DFSDM_DFSDM3_CR1_JSCAN          (0x1UL << 4) 
#define DFSDM_DFSDM3_CR1_JSCAN_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define DFSDM_DFSDM3_CR1_JDMAEN          (0x1UL << 5) 
#define DFSDM_DFSDM3_CR1_JDMAEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define DFSDM_DFSDM3_CR1_JEXTSEL          (0x1FUL << 8) 
#define DFSDM_DFSDM3_CR1_JEXTSEL_VAL(X) (((uint32_t)(X) & 0x1FUL) << 8)
#define DFSDM_DFSDM3_CR1_JEXTEN          (0x3UL << 13) 
#define DFSDM_DFSDM3_CR1_JEXTEN_VAL(X) (((uint32_t)(X) & 0x3UL) << 13)
#define DFSDM_DFSDM3_CR1_RSWSTART          (0x1UL << 17) 
#define DFSDM_DFSDM3_CR1_RSWSTART_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define DFSDM_DFSDM3_CR1_RCONT          (0x1UL << 18) 
#define DFSDM_DFSDM3_CR1_RCONT_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define DFSDM_DFSDM3_CR1_RSYNC          (0x1UL << 19) 
#define DFSDM_DFSDM3_CR1_RSYNC_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define DFSDM_DFSDM3_CR1_RDMAEN          (0x1UL << 21) 
#define DFSDM_DFSDM3_CR1_RDMAEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define DFSDM_DFSDM3_CR1_RCH          (0x7UL << 24) 
#define DFSDM_DFSDM3_CR1_RCH_VAL(X) (((uint32_t)(X) & 0x7UL) << 24)
#define DFSDM_DFSDM3_CR1_FAST          (0x1UL << 29) 
#define DFSDM_DFSDM3_CR1_FAST_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define DFSDM_DFSDM3_CR1_AWFSEL          (0x1UL << 30) 
#define DFSDM_DFSDM3_CR1_AWFSEL_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define DFSDM_DFSDM0_CR2_JEOCIE          (0x1UL << 0) 
#define DFSDM_DFSDM0_CR2_JEOCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define DFSDM_DFSDM0_CR2_REOCIE          (0x1UL << 1) 
#define DFSDM_DFSDM0_CR2_REOCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define DFSDM_DFSDM0_CR2_JOVRIE          (0x1UL << 2) 
#define DFSDM_DFSDM0_CR2_JOVRIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define DFSDM_DFSDM0_CR2_ROVRIE          (0x1UL << 3) 
#define DFSDM_DFSDM0_CR2_ROVRIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define DFSDM_DFSDM0_CR2_AWDIE          (0x1UL << 4) 
#define DFSDM_DFSDM0_CR2_AWDIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define DFSDM_DFSDM0_CR2_SCDIE          (0x1UL << 5) 
#define DFSDM_DFSDM0_CR2_SCDIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define DFSDM_DFSDM0_CR2_CKABIE          (0x1UL << 6) 
#define DFSDM_DFSDM0_CR2_CKABIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define DFSDM_DFSDM0_CR2_EXCH          (0xFFUL << 8) 
#define DFSDM_DFSDM0_CR2_EXCH_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define DFSDM_DFSDM0_CR2_AWDCH          (0xFFUL << 16) 
#define DFSDM_DFSDM0_CR2_AWDCH_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define DFSDM_DFSDM1_CR2_JEOCIE          (0x1UL << 0) 
#define DFSDM_DFSDM1_CR2_JEOCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define DFSDM_DFSDM1_CR2_REOCIE          (0x1UL << 1) 
#define DFSDM_DFSDM1_CR2_REOCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define DFSDM_DFSDM1_CR2_JOVRIE          (0x1UL << 2) 
#define DFSDM_DFSDM1_CR2_JOVRIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define DFSDM_DFSDM1_CR2_ROVRIE          (0x1UL << 3) 
#define DFSDM_DFSDM1_CR2_ROVRIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define DFSDM_DFSDM1_CR2_AWDIE          (0x1UL << 4) 
#define DFSDM_DFSDM1_CR2_AWDIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define DFSDM_DFSDM1_CR2_SCDIE          (0x1UL << 5) 
#define DFSDM_DFSDM1_CR2_SCDIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define DFSDM_DFSDM1_CR2_CKABIE          (0x1UL << 6) 
#define DFSDM_DFSDM1_CR2_CKABIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define DFSDM_DFSDM1_CR2_EXCH          (0xFFUL << 8) 
#define DFSDM_DFSDM1_CR2_EXCH_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define DFSDM_DFSDM1_CR2_AWDCH          (0xFFUL << 16) 
#define DFSDM_DFSDM1_CR2_AWDCH_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define DFSDM_DFSDM2_CR2_JEOCIE          (0x1UL << 0) 
#define DFSDM_DFSDM2_CR2_JEOCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define DFSDM_DFSDM2_CR2_REOCIE          (0x1UL << 1) 
#define DFSDM_DFSDM2_CR2_REOCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define DFSDM_DFSDM2_CR2_JOVRIE          (0x1UL << 2) 
#define DFSDM_DFSDM2_CR2_JOVRIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define DFSDM_DFSDM2_CR2_ROVRIE          (0x1UL << 3) 
#define DFSDM_DFSDM2_CR2_ROVRIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define DFSDM_DFSDM2_CR2_AWDIE          (0x1UL << 4) 
#define DFSDM_DFSDM2_CR2_AWDIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define DFSDM_DFSDM2_CR2_SCDIE          (0x1UL << 5) 
#define DFSDM_DFSDM2_CR2_SCDIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define DFSDM_DFSDM2_CR2_CKABIE          (0x1UL << 6) 
#define DFSDM_DFSDM2_CR2_CKABIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define DFSDM_DFSDM2_CR2_EXCH          (0xFFUL << 8) 
#define DFSDM_DFSDM2_CR2_EXCH_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define DFSDM_DFSDM2_CR2_AWDCH          (0xFFUL << 16) 
#define DFSDM_DFSDM2_CR2_AWDCH_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define DFSDM_DFSDM3_CR2_JEOCIE          (0x1UL << 0) 
#define DFSDM_DFSDM3_CR2_JEOCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define DFSDM_DFSDM3_CR2_REOCIE          (0x1UL << 1) 
#define DFSDM_DFSDM3_CR2_REOCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define DFSDM_DFSDM3_CR2_JOVRIE          (0x1UL << 2) 
#define DFSDM_DFSDM3_CR2_JOVRIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define DFSDM_DFSDM3_CR2_ROVRIE          (0x1UL << 3) 
#define DFSDM_DFSDM3_CR2_ROVRIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define DFSDM_DFSDM3_CR2_AWDIE          (0x1UL << 4) 
#define DFSDM_DFSDM3_CR2_AWDIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define DFSDM_DFSDM3_CR2_SCDIE          (0x1UL << 5) 
#define DFSDM_DFSDM3_CR2_SCDIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define DFSDM_DFSDM3_CR2_CKABIE          (0x1UL << 6) 
#define DFSDM_DFSDM3_CR2_CKABIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define DFSDM_DFSDM3_CR2_EXCH          (0xFFUL << 8) 
#define DFSDM_DFSDM3_CR2_EXCH_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define DFSDM_DFSDM3_CR2_AWDCH          (0xFFUL << 16) 
#define DFSDM_DFSDM3_CR2_AWDCH_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define DFSDM_DFSDM0_ISR_JEOCF          (0x1UL << 0) 
#define DFSDM_DFSDM0_ISR_JEOCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define DFSDM_DFSDM0_ISR_REOCF          (0x1UL << 1) 
#define DFSDM_DFSDM0_ISR_REOCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define DFSDM_DFSDM0_ISR_JOVRF          (0x1UL << 2) 
#define DFSDM_DFSDM0_ISR_JOVRF_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define DFSDM_DFSDM0_ISR_ROVRF          (0x1UL << 3) 
#define DFSDM_DFSDM0_ISR_ROVRF_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define DFSDM_DFSDM0_ISR_AWDF          (0x1UL << 4) 
#define DFSDM_DFSDM0_ISR_AWDF_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define DFSDM_DFSDM0_ISR_JCIP          (0x1UL << 13) 
#define DFSDM_DFSDM0_ISR_JCIP_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define DFSDM_DFSDM0_ISR_RCIP          (0x1UL << 14) 
#define DFSDM_DFSDM0_ISR_RCIP_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define DFSDM_DFSDM0_ISR_CKABF          (0xFFUL << 16) 
#define DFSDM_DFSDM0_ISR_CKABF_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define DFSDM_DFSDM0_ISR_SCDF          (0xFFUL << 24) 
#define DFSDM_DFSDM0_ISR_SCDF_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define DFSDM_DFSDM1_ISR_JEOCF          (0x1UL << 0) 
#define DFSDM_DFSDM1_ISR_JEOCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define DFSDM_DFSDM1_ISR_REOCF          (0x1UL << 1) 
#define DFSDM_DFSDM1_ISR_REOCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define DFSDM_DFSDM1_ISR_JOVRF          (0x1UL << 2) 
#define DFSDM_DFSDM1_ISR_JOVRF_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define DFSDM_DFSDM1_ISR_ROVRF          (0x1UL << 3) 
#define DFSDM_DFSDM1_ISR_ROVRF_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define DFSDM_DFSDM1_ISR_AWDF          (0x1UL << 4) 
#define DFSDM_DFSDM1_ISR_AWDF_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define DFSDM_DFSDM1_ISR_JCIP          (0x1UL << 13) 
#define DFSDM_DFSDM1_ISR_JCIP_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define DFSDM_DFSDM1_ISR_RCIP          (0x1UL << 14) 
#define DFSDM_DFSDM1_ISR_RCIP_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define DFSDM_DFSDM1_ISR_CKABF          (0xFFUL << 16) 
#define DFSDM_DFSDM1_ISR_CKABF_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define DFSDM_DFSDM1_ISR_SCDF          (0xFFUL << 24) 
#define DFSDM_DFSDM1_ISR_SCDF_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define DFSDM_DFSDM2_ISR_JEOCF          (0x1UL << 0) 
#define DFSDM_DFSDM2_ISR_JEOCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define DFSDM_DFSDM2_ISR_REOCF          (0x1UL << 1) 
#define DFSDM_DFSDM2_ISR_REOCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define DFSDM_DFSDM2_ISR_JOVRF          (0x1UL << 2) 
#define DFSDM_DFSDM2_ISR_JOVRF_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define DFSDM_DFSDM2_ISR_ROVRF          (0x1UL << 3) 
#define DFSDM_DFSDM2_ISR_ROVRF_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define DFSDM_DFSDM2_ISR_AWDF          (0x1UL << 4) 
#define DFSDM_DFSDM2_ISR_AWDF_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define DFSDM_DFSDM2_ISR_JCIP          (0x1UL << 13) 
#define DFSDM_DFSDM2_ISR_JCIP_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define DFSDM_DFSDM2_ISR_RCIP          (0x1UL << 14) 
#define DFSDM_DFSDM2_ISR_RCIP_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define DFSDM_DFSDM2_ISR_CKABF          (0xFFUL << 16) 
#define DFSDM_DFSDM2_ISR_CKABF_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define DFSDM_DFSDM2_ISR_SCDF          (0xFFUL << 24) 
#define DFSDM_DFSDM2_ISR_SCDF_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define DFSDM_DFSDM3_ISR_JEOCF          (0x1UL << 0) 
#define DFSDM_DFSDM3_ISR_JEOCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define DFSDM_DFSDM3_ISR_REOCF          (0x1UL << 1) 
#define DFSDM_DFSDM3_ISR_REOCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define DFSDM_DFSDM3_ISR_JOVRF          (0x1UL << 2) 
#define DFSDM_DFSDM3_ISR_JOVRF_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define DFSDM_DFSDM3_ISR_ROVRF          (0x1UL << 3) 
#define DFSDM_DFSDM3_ISR_ROVRF_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define DFSDM_DFSDM3_ISR_AWDF          (0x1UL << 4) 
#define DFSDM_DFSDM3_ISR_AWDF_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define DFSDM_DFSDM3_ISR_JCIP          (0x1UL << 13) 
#define DFSDM_DFSDM3_ISR_JCIP_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define DFSDM_DFSDM3_ISR_RCIP          (0x1UL << 14) 
#define DFSDM_DFSDM3_ISR_RCIP_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define DFSDM_DFSDM3_ISR_CKABF          (0xFFUL << 16) 
#define DFSDM_DFSDM3_ISR_CKABF_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define DFSDM_DFSDM3_ISR_SCDF          (0xFFUL << 24) 
#define DFSDM_DFSDM3_ISR_SCDF_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define DFSDM_DFSDM0_ICR_CLRJOVRF          (0x1UL << 2) 
#define DFSDM_DFSDM0_ICR_CLRJOVRF_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define DFSDM_DFSDM0_ICR_CLRROVRF          (0x1UL << 3) 
#define DFSDM_DFSDM0_ICR_CLRROVRF_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define DFSDM_DFSDM0_ICR_CLRCKABF          (0xFFUL << 16) 
#define DFSDM_DFSDM0_ICR_CLRCKABF_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define DFSDM_DFSDM0_ICR_CLRSCDF          (0xFFUL << 24) 
#define DFSDM_DFSDM0_ICR_CLRSCDF_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define DFSDM_DFSDM1_ICR_CLRJOVRF          (0x1UL << 2) 
#define DFSDM_DFSDM1_ICR_CLRJOVRF_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define DFSDM_DFSDM1_ICR_CLRROVRF          (0x1UL << 3) 
#define DFSDM_DFSDM1_ICR_CLRROVRF_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define DFSDM_DFSDM1_ICR_CLRCKABF          (0xFFUL << 16) 
#define DFSDM_DFSDM1_ICR_CLRCKABF_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define DFSDM_DFSDM1_ICR_CLRSCDF          (0xFFUL << 24) 
#define DFSDM_DFSDM1_ICR_CLRSCDF_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define DFSDM_DFSDM2_ICR_CLRJOVRF          (0x1UL << 2) 
#define DFSDM_DFSDM2_ICR_CLRJOVRF_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define DFSDM_DFSDM2_ICR_CLRROVRF          (0x1UL << 3) 
#define DFSDM_DFSDM2_ICR_CLRROVRF_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define DFSDM_DFSDM2_ICR_CLRCKABF          (0xFFUL << 16) 
#define DFSDM_DFSDM2_ICR_CLRCKABF_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define DFSDM_DFSDM2_ICR_CLRSCDF          (0xFFUL << 24) 
#define DFSDM_DFSDM2_ICR_CLRSCDF_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define DFSDM_DFSDM3_ICR_CLRJOVRF          (0x1UL << 2) 
#define DFSDM_DFSDM3_ICR_CLRJOVRF_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define DFSDM_DFSDM3_ICR_CLRROVRF          (0x1UL << 3) 
#define DFSDM_DFSDM3_ICR_CLRROVRF_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define DFSDM_DFSDM3_ICR_CLRCKABF          (0xFFUL << 16) 
#define DFSDM_DFSDM3_ICR_CLRCKABF_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define DFSDM_DFSDM3_ICR_CLRSCDF          (0xFFUL << 24) 
#define DFSDM_DFSDM3_ICR_CLRSCDF_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define DFSDM_DFSDM0_JCHGR_JCHG          (0xFFUL << 0) 
#define DFSDM_DFSDM0_JCHGR_JCHG_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DFSDM_DFSDM1_JCHGR_JCHG          (0xFFUL << 0) 
#define DFSDM_DFSDM1_JCHGR_JCHG_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DFSDM_DFSDM2_JCHGR_JCHG          (0xFFUL << 0) 
#define DFSDM_DFSDM2_JCHGR_JCHG_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DFSDM_DFSDM3_JCHGR_JCHG          (0xFFUL << 0) 
#define DFSDM_DFSDM3_JCHGR_JCHG_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DFSDM_DFSDM0_FCR_IOSR          (0xFFUL << 0) 
#define DFSDM_DFSDM0_FCR_IOSR_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DFSDM_DFSDM0_FCR_FOSR          (0x3FFUL << 16) 
#define DFSDM_DFSDM0_FCR_FOSR_VAL(X) (((uint32_t)(X) & 0x3FFUL) << 16)
#define DFSDM_DFSDM0_FCR_FORD          (0x7UL << 29) 
#define DFSDM_DFSDM0_FCR_FORD_VAL(X) (((uint32_t)(X) & 0x7UL) << 29)
#define DFSDM_DFSDM1_FCR_IOSR          (0xFFUL << 0) 
#define DFSDM_DFSDM1_FCR_IOSR_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DFSDM_DFSDM1_FCR_FOSR          (0x3FFUL << 16) 
#define DFSDM_DFSDM1_FCR_FOSR_VAL(X) (((uint32_t)(X) & 0x3FFUL) << 16)
#define DFSDM_DFSDM1_FCR_FORD          (0x7UL << 29) 
#define DFSDM_DFSDM1_FCR_FORD_VAL(X) (((uint32_t)(X) & 0x7UL) << 29)
#define DFSDM_DFSDM2_FCR_IOSR          (0xFFUL << 0) 
#define DFSDM_DFSDM2_FCR_IOSR_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DFSDM_DFSDM2_FCR_FOSR          (0x3FFUL << 16) 
#define DFSDM_DFSDM2_FCR_FOSR_VAL(X) (((uint32_t)(X) & 0x3FFUL) << 16)
#define DFSDM_DFSDM2_FCR_FORD          (0x7UL << 29) 
#define DFSDM_DFSDM2_FCR_FORD_VAL(X) (((uint32_t)(X) & 0x7UL) << 29)
#define DFSDM_DFSDM3_FCR_IOSR          (0xFFUL << 0) 
#define DFSDM_DFSDM3_FCR_IOSR_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DFSDM_DFSDM3_FCR_FOSR          (0x3FFUL << 16) 
#define DFSDM_DFSDM3_FCR_FOSR_VAL(X) (((uint32_t)(X) & 0x3FFUL) << 16)
#define DFSDM_DFSDM3_FCR_FORD          (0x7UL << 29) 
#define DFSDM_DFSDM3_FCR_FORD_VAL(X) (((uint32_t)(X) & 0x7UL) << 29)
#define DFSDM_DFSDM0_JDATAR_JDATACH          (0x7UL << 0) 
#define DFSDM_DFSDM0_JDATAR_JDATACH_VAL(X) (((uint32_t)(X) & 0x7UL) << 0)
#define DFSDM_DFSDM0_JDATAR_JDATA          (0xFFFFFFUL << 8) 
#define DFSDM_DFSDM0_JDATAR_JDATA_VAL(X) (((uint32_t)(X) & 0xFFFFFFUL) << 8)
#define DFSDM_DFSDM1_JDATAR_JDATACH          (0x7UL << 0) 
#define DFSDM_DFSDM1_JDATAR_JDATACH_VAL(X) (((uint32_t)(X) & 0x7UL) << 0)
#define DFSDM_DFSDM1_JDATAR_JDATA          (0xFFFFFFUL << 8) 
#define DFSDM_DFSDM1_JDATAR_JDATA_VAL(X) (((uint32_t)(X) & 0xFFFFFFUL) << 8)
#define DFSDM_DFSDM2_JDATAR_JDATACH          (0x7UL << 0) 
#define DFSDM_DFSDM2_JDATAR_JDATACH_VAL(X) (((uint32_t)(X) & 0x7UL) << 0)
#define DFSDM_DFSDM2_JDATAR_JDATA          (0xFFFFFFUL << 8) 
#define DFSDM_DFSDM2_JDATAR_JDATA_VAL(X) (((uint32_t)(X) & 0xFFFFFFUL) << 8)
#define DFSDM_DFSDM3_JDATAR_JDATACH          (0x7UL << 0) 
#define DFSDM_DFSDM3_JDATAR_JDATACH_VAL(X) (((uint32_t)(X) & 0x7UL) << 0)
#define DFSDM_DFSDM3_JDATAR_JDATA          (0xFFFFFFUL << 8) 
#define DFSDM_DFSDM3_JDATAR_JDATA_VAL(X) (((uint32_t)(X) & 0xFFFFFFUL) << 8)
#define DFSDM_DFSDM0_RDATAR_RDATACH          (0x7UL << 0) 
#define DFSDM_DFSDM0_RDATAR_RDATACH_VAL(X) (((uint32_t)(X) & 0x7UL) << 0)
#define DFSDM_DFSDM0_RDATAR_RPEND          (0x1UL << 4) 
#define DFSDM_DFSDM0_RDATAR_RPEND_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define DFSDM_DFSDM0_RDATAR_RDATA          (0xFFFFFFUL << 8) 
#define DFSDM_DFSDM0_RDATAR_RDATA_VAL(X) (((uint32_t)(X) & 0xFFFFFFUL) << 8)
#define DFSDM_DFSDM1_RDATAR_RDATACH          (0x7UL << 0) 
#define DFSDM_DFSDM1_RDATAR_RDATACH_VAL(X) (((uint32_t)(X) & 0x7UL) << 0)
#define DFSDM_DFSDM1_RDATAR_RPEND          (0x1UL << 4) 
#define DFSDM_DFSDM1_RDATAR_RPEND_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define DFSDM_DFSDM1_RDATAR_RDATA          (0xFFFFFFUL << 8) 
#define DFSDM_DFSDM1_RDATAR_RDATA_VAL(X) (((uint32_t)(X) & 0xFFFFFFUL) << 8)
#define DFSDM_DFSDM2_RDATAR_RDATACH          (0x7UL << 0) 
#define DFSDM_DFSDM2_RDATAR_RDATACH_VAL(X) (((uint32_t)(X) & 0x7UL) << 0)
#define DFSDM_DFSDM2_RDATAR_RPEND          (0x1UL << 4) 
#define DFSDM_DFSDM2_RDATAR_RPEND_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define DFSDM_DFSDM2_RDATAR_RDATA          (0xFFFFFFUL << 8) 
#define DFSDM_DFSDM2_RDATAR_RDATA_VAL(X) (((uint32_t)(X) & 0xFFFFFFUL) << 8)
#define DFSDM_DFSDM3_RDATAR_RDATACH          (0x7UL << 0) 
#define DFSDM_DFSDM3_RDATAR_RDATACH_VAL(X) (((uint32_t)(X) & 0x7UL) << 0)
#define DFSDM_DFSDM3_RDATAR_RPEND          (0x1UL << 4) 
