via/viaems/src/platforms/stm32h743/device.h
#define DFSDM_DFSDM3_RDATAR_RPEND_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define DFSDM_DFSDM3_RDATAR_RDATA          (0xFFFFFFUL << 8) 
#define DFSDM_DFSDM3_RDATAR_RDATA_VAL(X) (((uint32_t)(X) & 0xFFFFFFUL) << 8)
#define DFSDM_DFSDM0_AWHTR_BKAWH          (0xFUL << 0) 
#define DFSDM_DFSDM0_AWHTR_BKAWH_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define DFSDM_DFSDM0_AWHTR_AWHT          (0xFFFFFFUL << 8) 
#define DFSDM_DFSDM0_AWHTR_AWHT_VAL(X) (((uint32_t)(X) & 0xFFFFFFUL) << 8)
#define DFSDM_DFSDM1_AWHTR_BKAWH          (0xFUL << 0) 
#define DFSDM_DFSDM1_AWHTR_BKAWH_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define DFSDM_DFSDM1_AWHTR_AWHT          (0xFFFFFFUL << 8) 
#define DFSDM_DFSDM1_AWHTR_AWHT_VAL(X) (((uint32_t)(X) & 0xFFFFFFUL) << 8)
#define DFSDM_DFSDM2_AWHTR_BKAWH          (0xFUL << 0) 
#define DFSDM_DFSDM2_AWHTR_BKAWH_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define DFSDM_DFSDM2_AWHTR_AWHT          (0xFFFFFFUL << 8) 
#define DFSDM_DFSDM2_AWHTR_AWHT_VAL(X) (((uint32_t)(X) & 0xFFFFFFUL) << 8)
#define DFSDM_DFSDM3_AWHTR_BKAWH          (0xFUL << 0) 
#define DFSDM_DFSDM3_AWHTR_BKAWH_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define DFSDM_DFSDM3_AWHTR_AWHT          (0xFFFFFFUL << 8) 
#define DFSDM_DFSDM3_AWHTR_AWHT_VAL(X) (((uint32_t)(X) & 0xFFFFFFUL) << 8)
#define DFSDM_DFSDM0_AWLTR_BKAWL          (0xFUL << 0) 
#define DFSDM_DFSDM0_AWLTR_BKAWL_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define DFSDM_DFSDM0_AWLTR_AWLT          (0xFFFFFFUL << 8) 
#define DFSDM_DFSDM0_AWLTR_AWLT_VAL(X) (((uint32_t)(X) & 0xFFFFFFUL) << 8)
#define DFSDM_DFSDM1_AWLTR_BKAWL          (0xFUL << 0) 
#define DFSDM_DFSDM1_AWLTR_BKAWL_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define DFSDM_DFSDM1_AWLTR_AWLT          (0xFFFFFFUL << 8) 
#define DFSDM_DFSDM1_AWLTR_AWLT_VAL(X) (((uint32_t)(X) & 0xFFFFFFUL) << 8)
#define DFSDM_DFSDM2_AWLTR_BKAWL          (0xFUL << 0) 
#define DFSDM_DFSDM2_AWLTR_BKAWL_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define DFSDM_DFSDM2_AWLTR_AWLT          (0xFFFFFFUL << 8) 
#define DFSDM_DFSDM2_AWLTR_AWLT_VAL(X) (((uint32_t)(X) & 0xFFFFFFUL) << 8)
#define DFSDM_DFSDM3_AWLTR_BKAWL          (0xFUL << 0) 
#define DFSDM_DFSDM3_AWLTR_BKAWL_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define DFSDM_DFSDM3_AWLTR_AWLT          (0xFFFFFFUL << 8) 
#define DFSDM_DFSDM3_AWLTR_AWLT_VAL(X) (((uint32_t)(X) & 0xFFFFFFUL) << 8)
#define DFSDM_DFSDM0_AWSR_AWLTF          (0xFFUL << 0) 
#define DFSDM_DFSDM0_AWSR_AWLTF_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DFSDM_DFSDM0_AWSR_AWHTF          (0xFFUL << 8) 
#define DFSDM_DFSDM0_AWSR_AWHTF_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define DFSDM_DFSDM1_AWSR_AWLTF          (0xFFUL << 0) 
#define DFSDM_DFSDM1_AWSR_AWLTF_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DFSDM_DFSDM1_AWSR_AWHTF          (0xFFUL << 8) 
#define DFSDM_DFSDM1_AWSR_AWHTF_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define DFSDM_DFSDM2_AWSR_AWLTF          (0xFFUL << 0) 
#define DFSDM_DFSDM2_AWSR_AWLTF_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DFSDM_DFSDM2_AWSR_AWHTF          (0xFFUL << 8) 
#define DFSDM_DFSDM2_AWSR_AWHTF_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define DFSDM_DFSDM3_AWSR_AWLTF          (0xFFUL << 0) 
#define DFSDM_DFSDM3_AWSR_AWLTF_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DFSDM_DFSDM3_AWSR_AWHTF          (0xFFUL << 8) 
#define DFSDM_DFSDM3_AWSR_AWHTF_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define DFSDM_DFSDM0_AWCFR_CLRAWLTF          (0xFFUL << 0) 
#define DFSDM_DFSDM0_AWCFR_CLRAWLTF_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DFSDM_DFSDM0_AWCFR_CLRAWHTF          (0xFFUL << 8) 
#define DFSDM_DFSDM0_AWCFR_CLRAWHTF_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define DFSDM_DFSDM1_AWCFR_CLRAWLTF          (0xFFUL << 0) 
#define DFSDM_DFSDM1_AWCFR_CLRAWLTF_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DFSDM_DFSDM1_AWCFR_CLRAWHTF          (0xFFUL << 8) 
#define DFSDM_DFSDM1_AWCFR_CLRAWHTF_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define DFSDM_DFSDM2_AWCFR_CLRAWLTF          (0xFFUL << 0) 
#define DFSDM_DFSDM2_AWCFR_CLRAWLTF_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DFSDM_DFSDM2_AWCFR_CLRAWHTF          (0xFFUL << 8) 
#define DFSDM_DFSDM2_AWCFR_CLRAWHTF_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define DFSDM_DFSDM3_AWCFR_CLRAWLTF          (0xFFUL << 0) 
#define DFSDM_DFSDM3_AWCFR_CLRAWLTF_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define DFSDM_DFSDM3_AWCFR_CLRAWHTF          (0xFFUL << 8) 
#define DFSDM_DFSDM3_AWCFR_CLRAWHTF_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define DFSDM_DFSDM0_EXMAX_EXMAXCH          (0x7UL << 0) 
#define DFSDM_DFSDM0_EXMAX_EXMAXCH_VAL(X) (((uint32_t)(X) & 0x7UL) << 0)
#define DFSDM_DFSDM0_EXMAX_EXMAX          (0xFFFFFFUL << 8) 
#define DFSDM_DFSDM0_EXMAX_EXMAX_VAL(X) (((uint32_t)(X) & 0xFFFFFFUL) << 8)
#define DFSDM_DFSDM1_EXMAX_EXMAXCH          (0x7UL << 0) 
#define DFSDM_DFSDM1_EXMAX_EXMAXCH_VAL(X) (((uint32_t)(X) & 0x7UL) << 0)
#define DFSDM_DFSDM1_EXMAX_EXMAX          (0xFFFFFFUL << 8) 
#define DFSDM_DFSDM1_EXMAX_EXMAX_VAL(X) (((uint32_t)(X) & 0xFFFFFFUL) << 8)
#define DFSDM_DFSDM2_EXMAX_EXMAXCH          (0x7UL << 0) 
#define DFSDM_DFSDM2_EXMAX_EXMAXCH_VAL(X) (((uint32_t)(X) & 0x7UL) << 0)
#define DFSDM_DFSDM2_EXMAX_EXMAX          (0xFFFFFFUL << 8) 
#define DFSDM_DFSDM2_EXMAX_EXMAX_VAL(X) (((uint32_t)(X) & 0xFFFFFFUL) << 8)
#define DFSDM_DFSDM3_EXMAX_EXMAXCH          (0x7UL << 0) 
#define DFSDM_DFSDM3_EXMAX_EXMAXCH_VAL(X) (((uint32_t)(X) & 0x7UL) << 0)
#define DFSDM_DFSDM3_EXMAX_EXMAX          (0xFFFFFFUL << 8) 
#define DFSDM_DFSDM3_EXMAX_EXMAX_VAL(X) (((uint32_t)(X) & 0xFFFFFFUL) << 8)
#define DFSDM_DFSDM0_EXMIN_EXMINCH          (0x7UL << 0) 
#define DFSDM_DFSDM0_EXMIN_EXMINCH_VAL(X) (((uint32_t)(X) & 0x7UL) << 0)
#define DFSDM_DFSDM0_EXMIN_EXMIN          (0xFFFFFFUL << 8) 
#define DFSDM_DFSDM0_EXMIN_EXMIN_VAL(X) (((uint32_t)(X) & 0xFFFFFFUL) << 8)
#define DFSDM_DFSDM1_EXMIN_EXMINCH          (0x7UL << 0) 
#define DFSDM_DFSDM1_EXMIN_EXMINCH_VAL(X) (((uint32_t)(X) & 0x7UL) << 0)
#define DFSDM_DFSDM1_EXMIN_EXMIN          (0xFFFFFFUL << 8) 
#define DFSDM_DFSDM1_EXMIN_EXMIN_VAL(X) (((uint32_t)(X) & 0xFFFFFFUL) << 8)
#define DFSDM_DFSDM2_EXMIN_EXMINCH          (0x7UL << 0) 
#define DFSDM_DFSDM2_EXMIN_EXMINCH_VAL(X) (((uint32_t)(X) & 0x7UL) << 0)
#define DFSDM_DFSDM2_EXMIN_EXMIN          (0xFFFFFFUL << 8) 
#define DFSDM_DFSDM2_EXMIN_EXMIN_VAL(X) (((uint32_t)(X) & 0xFFFFFFUL) << 8)
#define DFSDM_DFSDM3_EXMIN_EXMINCH          (0x7UL << 0) 
#define DFSDM_DFSDM3_EXMIN_EXMINCH_VAL(X) (((uint32_t)(X) & 0x7UL) << 0)
#define DFSDM_DFSDM3_EXMIN_EXMIN          (0xFFFFFFUL << 8) 
#define DFSDM_DFSDM3_EXMIN_EXMIN_VAL(X) (((uint32_t)(X) & 0xFFFFFFUL) << 8)
#define DFSDM_DFSDM0_CNVTIMR_CNVCNT          (0xFFFFFFFUL << 4) 
#define DFSDM_DFSDM0_CNVTIMR_CNVCNT_VAL(X) (((uint32_t)(X) & 0xFFFFFFFUL) << 4)
#define DFSDM_DFSDM1_CNVTIMR_CNVCNT          (0xFFFFFFFUL << 4) 
#define DFSDM_DFSDM1_CNVTIMR_CNVCNT_VAL(X) (((uint32_t)(X) & 0xFFFFFFFUL) << 4)
#define DFSDM_DFSDM2_CNVTIMR_CNVCNT          (0xFFFFFFFUL << 4) 
#define DFSDM_DFSDM2_CNVTIMR_CNVCNT_VAL(X) (((uint32_t)(X) & 0xFFFFFFFUL) << 4)
#define DFSDM_DFSDM3_CNVTIMR_CNVCNT          (0xFFFFFFFUL << 4) 
#define DFSDM_DFSDM3_CNVTIMR_CNVCNT_VAL(X) (((uint32_t)(X) & 0xFFFFFFFUL) << 4)

#define DFSDM  ((struct DFSDM*)(0x40017000UL))
struct TIM16 {
  volatile uint32_t CR1;
  volatile uint32_t CR2;
  const volatile uint32_t RESERVED12[1];
  volatile uint32_t DIER;
  volatile uint32_t SR;
  volatile uint32_t EGR;
  volatile uint32_t CCMR1_Output;
  volatile uint32_t CCMR1_Input;
  const volatile uint32_t RESERVED32[1];
  volatile uint32_t CCER;
  volatile uint32_t CNT;
  volatile uint32_t PSC;
  volatile uint32_t ARR;
  volatile uint32_t RCR;
  volatile uint32_t CCR1;
  const volatile uint32_t RESERVED68[3];
  volatile uint32_t BDTR;
  volatile uint32_t DCR;
  volatile uint32_t DMAR;
  const volatile uint32_t RESERVED96[4];
  volatile uint32_t TIM16_AF1;
  const volatile uint32_t RESERVED104[1];
  volatile uint32_t TIM16_TISEL;
};
#define TIM16_CR1_CEN          (0x1UL << 0) 
#define TIM16_CR1_CEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define TIM16_CR1_UDIS          (0x1UL << 1) 
#define TIM16_CR1_UDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define TIM16_CR1_URS          (0x1UL << 2) 
#define TIM16_CR1_URS_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define TIM16_CR1_OPM          (0x1UL << 3) 
#define TIM16_CR1_OPM_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define TIM16_CR1_ARPE          (0x1UL << 7) 
#define TIM16_CR1_ARPE_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define TIM16_CR1_CKD          (0x3UL << 8) 
#define TIM16_CR1_CKD_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define TIM16_CR1_UIFREMAP          (0x1UL << 11) 
#define TIM16_CR1_UIFREMAP_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define TIM16_CR2_OIS1N          (0x1UL << 9) 
#define TIM16_CR2_OIS1N_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define TIM16_CR2_OIS1          (0x1UL << 8) 
#define TIM16_CR2_OIS1_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define TIM16_CR2_CCDS          (0x1UL << 3) 
#define TIM16_CR2_CCDS_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define TIM16_CR2_CCUS          (0x1UL << 2) 
#define TIM16_CR2_CCUS_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define TIM16_CR2_CCPC          (0x1UL << 0) 
#define TIM16_CR2_CCPC_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define TIM16_DIER_UIE          (0x1UL << 0) 
#define TIM16_DIER_UIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define TIM16_DIER_CC1IE          (0x1UL << 1) 
#define TIM16_DIER_CC1IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define TIM16_DIER_COMIE          (0x1UL << 5) 
#define TIM16_DIER_COMIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define TIM16_DIER_BIE          (0x1UL << 7) 
#define TIM16_DIER_BIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define TIM16_DIER_UDE          (0x1UL << 8) 
#define TIM16_DIER_UDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define TIM16_DIER_CC1DE          (0x1UL << 9) 
#define TIM16_DIER_CC1DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define TIM16_DIER_COMDE          (0x1UL << 13) 
#define TIM16_DIER_COMDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define TIM16_SR_CC1OF          (0x1UL << 9) 
#define TIM16_SR_CC1OF_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define TIM16_SR_BIF          (0x1UL << 7) 
#define TIM16_SR_BIF_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define TIM16_SR_COMIF          (0x1UL << 5) 
#define TIM16_SR_COMIF_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define TIM16_SR_CC1IF          (0x1UL << 1) 
#define TIM16_SR_CC1IF_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define TIM16_SR_UIF          (0x1UL << 0) 
#define TIM16_SR_UIF_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define TIM16_EGR_BG          (0x1UL << 7) 
#define TIM16_EGR_BG_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define TIM16_EGR_COMG          (0x1UL << 5) 
#define TIM16_EGR_COMG_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define TIM16_EGR_CC1G          (0x1UL << 1) 
#define TIM16_EGR_CC1G_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define TIM16_EGR_UG          (0x1UL << 0) 
#define TIM16_EGR_UG_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define TIM16_CCMR1_Output_CC1S          (0x3UL << 0) 
#define TIM16_CCMR1_Output_CC1S_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define TIM16_CCMR1_Output_OC1FE          (0x1UL << 2) 
#define TIM16_CCMR1_Output_OC1FE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define TIM16_CCMR1_Output_OC1PE          (0x1UL << 3) 
#define TIM16_CCMR1_Output_OC1PE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define TIM16_CCMR1_Output_OC1M          (0x7UL << 4) 
#define TIM16_CCMR1_Output_OC1M_VAL(X) (((uint32_t)(X) & 0x7UL) << 4)
#define TIM16_CCMR1_Output_OC1M_3          (0x1UL << 16) 
#define TIM16_CCMR1_Output_OC1M_3_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define TIM16_CCMR1_Input_IC1F          (0xFUL << 4) 
#define TIM16_CCMR1_Input_IC1F_VAL(X) (((uint32_t)(X) & 0xFUL) << 4)
#define TIM16_CCMR1_Input_IC1PSC          (0x3UL << 2) 
#define TIM16_CCMR1_Input_IC1PSC_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define TIM16_CCMR1_Input_CC1S          (0x3UL << 0) 
#define TIM16_CCMR1_Input_CC1S_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define TIM16_CCER_CC1NP          (0x1UL << 3) 
#define TIM16_CCER_CC1NP_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define TIM16_CCER_CC1NE          (0x1UL << 2) 
#define TIM16_CCER_CC1NE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define TIM16_CCER_CC1P          (0x1UL << 1) 
#define TIM16_CCER_CC1P_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define TIM16_CCER_CC1E          (0x1UL << 0) 
#define TIM16_CCER_CC1E_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define TIM16_CNT_CNT          (0xFFFFUL << 0) 
#define TIM16_CNT_CNT_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define TIM16_CNT_UIFCPY          (0x1UL << 31) 
#define TIM16_CNT_UIFCPY_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define TIM16_PSC_PSC          (0xFFFFUL << 0) 
#define TIM16_PSC_PSC_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define TIM16_ARR_ARR          (0xFFFFUL << 0) 
#define TIM16_ARR_ARR_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define TIM16_RCR_REP          (0xFFUL << 0) 
#define TIM16_RCR_REP_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define TIM16_CCR1_CCR1          (0xFFFFUL << 0) 
#define TIM16_CCR1_CCR1_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define TIM16_BDTR_DTG          (0xFFUL << 0) 
#define TIM16_BDTR_DTG_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define TIM16_BDTR_LOCK          (0x3UL << 8) 
#define TIM16_BDTR_LOCK_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define TIM16_BDTR_OSSI          (0x1UL << 10) 
#define TIM16_BDTR_OSSI_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define TIM16_BDTR_OSSR          (0x1UL << 11) 
#define TIM16_BDTR_OSSR_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define TIM16_BDTR_BKE          (0x1UL << 12) 
#define TIM16_BDTR_BKE_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define TIM16_BDTR_BKP          (0x1UL << 13) 
#define TIM16_BDTR_BKP_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define TIM16_BDTR_AOE          (0x1UL << 14) 
#define TIM16_BDTR_AOE_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define TIM16_BDTR_MOE          (0x1UL << 15) 
#define TIM16_BDTR_MOE_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define TIM16_BDTR_BKF          (0xFUL << 16) 
#define TIM16_BDTR_BKF_VAL(X) (((uint32_t)(X) & 0xFUL) << 16)
#define TIM16_DCR_DBL          (0x1FUL << 8) 
#define TIM16_DCR_DBL_VAL(X) (((uint32_t)(X) & 0x1FUL) << 8)
#define TIM16_DCR_DBA          (0x1FUL << 0) 
#define TIM16_DCR_DBA_VAL(X) (((uint32_t)(X) & 0x1FUL) << 0)
#define TIM16_DMAR_DMAB          (0xFFFFUL << 0) 
#define TIM16_DMAR_DMAB_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define TIM16_TIM16_AF1_BKINE          (0x1UL << 0) 
#define TIM16_TIM16_AF1_BKINE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define TIM16_TIM16_AF1_BKCMP1E          (0x1UL << 1) 
#define TIM16_TIM16_AF1_BKCMP1E_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define TIM16_TIM16_AF1_BKCMP2E          (0x1UL << 2) 
#define TIM16_TIM16_AF1_BKCMP2E_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define TIM16_TIM16_AF1_BKDFBK1E          (0x1UL << 8) 
#define TIM16_TIM16_AF1_BKDFBK1E_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define TIM16_TIM16_AF1_BKINP          (0x1UL << 9) 
#define TIM16_TIM16_AF1_BKINP_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define TIM16_TIM16_AF1_BKCMP1P          (0x1UL << 10) 
#define TIM16_TIM16_AF1_BKCMP1P_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define TIM16_TIM16_AF1_BKCMP2P          (0x1UL << 11) 
#define TIM16_TIM16_AF1_BKCMP2P_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define TIM16_TIM16_TISEL_TI1SEL          (0xFUL << 0) 
#define TIM16_TIM16_TISEL_TI1SEL_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)

#define TIM16  ((struct TIM16*)(0x40014400UL))
struct TIM17 {
  volatile uint32_t CR1;
  volatile uint32_t CR2;
  const volatile uint32_t RESERVED12[1];
  volatile uint32_t DIER;
  volatile uint32_t SR;
  volatile uint32_t EGR;
  volatile uint32_t CCMR1_Output;
  volatile uint32_t CCMR1_Input;
  const volatile uint32_t RESERVED32[1];
  volatile uint32_t CCER;
  volatile uint32_t CNT;
  volatile uint32_t PSC;
  volatile uint32_t ARR;
  volatile uint32_t RCR;
  volatile uint32_t CCR1;
  const volatile uint32_t RESERVED68[3];
  volatile uint32_t BDTR;
  volatile uint32_t DCR;
  volatile uint32_t DMAR;
  const volatile uint32_t RESERVED96[4];
  volatile uint32_t TIM17_AF1;
  const volatile uint32_t RESERVED104[1];
  volatile uint32_t TIM17_TISEL;
};
#define TIM17_CR1_CEN          (0x1UL << 0) 
#define TIM17_CR1_CEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define TIM17_CR1_UDIS          (0x1UL << 1) 
#define TIM17_CR1_UDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define TIM17_CR1_URS          (0x1UL << 2) 
#define TIM17_CR1_URS_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define TIM17_CR1_OPM          (0x1UL << 3) 
#define TIM17_CR1_OPM_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define TIM17_CR1_ARPE          (0x1UL << 7) 
#define TIM17_CR1_ARPE_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define TIM17_CR1_CKD          (0x3UL << 8) 
#define TIM17_CR1_CKD_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define TIM17_CR1_UIFREMAP          (0x1UL << 11) 
#define TIM17_CR1_UIFREMAP_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define TIM17_CR2_OIS1N          (0x1UL << 9) 
#define TIM17_CR2_OIS1N_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define TIM17_CR2_OIS1          (0x1UL << 8) 
#define TIM17_CR2_OIS1_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define TIM17_CR2_CCDS          (0x1UL << 3) 
#define TIM17_CR2_CCDS_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define TIM17_CR2_CCUS          (0x1UL << 2) 
#define TIM17_CR2_CCUS_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define TIM17_CR2_CCPC          (0x1UL << 0) 
#define TIM17_CR2_CCPC_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define TIM17_DIER_UIE          (0x1UL << 0) 
#define TIM17_DIER_UIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define TIM17_DIER_CC1IE          (0x1UL << 1) 
#define TIM17_DIER_CC1IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define TIM17_DIER_COMIE          (0x1UL << 5) 
#define TIM17_DIER_COMIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define TIM17_DIER_BIE          (0x1UL << 7) 
#define TIM17_DIER_BIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define TIM17_DIER_UDE          (0x1UL << 8) 
#define TIM17_DIER_UDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define TIM17_DIER_CC1DE          (0x1UL << 9) 
#define TIM17_DIER_CC1DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define TIM17_DIER_COMDE          (0x1UL << 13) 
#define TIM17_DIER_COMDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define TIM17_SR_CC1OF          (0x1UL << 9) 
#define TIM17_SR_CC1OF_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define TIM17_SR_BIF          (0x1UL << 7) 
#define TIM17_SR_BIF_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define TIM17_SR_COMIF          (0x1UL << 5) 
#define TIM17_SR_COMIF_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define TIM17_SR_CC1IF          (0x1UL << 1) 
#define TIM17_SR_CC1IF_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define TIM17_SR_UIF          (0x1UL << 0) 
#define TIM17_SR_UIF_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define TIM17_EGR_BG          (0x1UL << 7) 
#define TIM17_EGR_BG_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define TIM17_EGR_COMG          (0x1UL << 5) 
#define TIM17_EGR_COMG_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define TIM17_EGR_CC1G          (0x1UL << 1) 
#define TIM17_EGR_CC1G_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define TIM17_EGR_UG          (0x1UL << 0) 
#define TIM17_EGR_UG_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define TIM17_CCMR1_Output_CC1S          (0x3UL << 0) 
#define TIM17_CCMR1_Output_CC1S_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define TIM17_CCMR1_Output_OC1FE          (0x1UL << 2) 
#define TIM17_CCMR1_Output_OC1FE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define TIM17_CCMR1_Output_OC1PE          (0x1UL << 3) 
#define TIM17_CCMR1_Output_OC1PE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define TIM17_CCMR1_Output_OC1M          (0x7UL << 4) 
#define TIM17_CCMR1_Output_OC1M_VAL(X) (((uint32_t)(X) & 0x7UL) << 4)
#define TIM17_CCMR1_Output_OC1M_3          (0x1UL << 16) 
#define TIM17_CCMR1_Output_OC1M_3_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define TIM17_CCMR1_Input_IC1F          (0xFUL << 4) 
#define TIM17_CCMR1_Input_IC1F_VAL(X) (((uint32_t)(X) & 0xFUL) << 4)
#define TIM17_CCMR1_Input_IC1PSC          (0x3UL << 2) 
#define TIM17_CCMR1_Input_IC1PSC_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define TIM17_CCMR1_Input_CC1S          (0x3UL << 0) 
#define TIM17_CCMR1_Input_CC1S_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define TIM17_CCER_CC1NP          (0x1UL << 3) 
#define TIM17_CCER_CC1NP_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define TIM17_CCER_CC1NE          (0x1UL << 2) 
#define TIM17_CCER_CC1NE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define TIM17_CCER_CC1P          (0x1UL << 1) 
#define TIM17_CCER_CC1P_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define TIM17_CCER_CC1E          (0x1UL << 0) 
#define TIM17_CCER_CC1E_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define TIM17_CNT_CNT          (0xFFFFUL << 0) 
#define TIM17_CNT_CNT_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define TIM17_CNT_UIFCPY          (0x1UL << 31) 
#define TIM17_CNT_UIFCPY_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define TIM17_PSC_PSC          (0xFFFFUL << 0) 
#define TIM17_PSC_PSC_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define TIM17_ARR_ARR          (0xFFFFUL << 0) 
#define TIM17_ARR_ARR_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define TIM17_RCR_REP          (0xFFUL << 0) 
#define TIM17_RCR_REP_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define TIM17_CCR1_CCR1          (0xFFFFUL << 0) 
#define TIM17_CCR1_CCR1_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define TIM17_BDTR_DTG          (0xFFUL << 0) 
#define TIM17_BDTR_DTG_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define TIM17_BDTR_LOCK          (0x3UL << 8) 
#define TIM17_BDTR_LOCK_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define TIM17_BDTR_OSSI          (0x1UL << 10) 
#define TIM17_BDTR_OSSI_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define TIM17_BDTR_OSSR          (0x1UL << 11) 
#define TIM17_BDTR_OSSR_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define TIM17_BDTR_BKE          (0x1UL << 12) 
#define TIM17_BDTR_BKE_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define TIM17_BDTR_BKP          (0x1UL << 13) 
#define TIM17_BDTR_BKP_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define TIM17_BDTR_AOE          (0x1UL << 14) 
#define TIM17_BDTR_AOE_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define TIM17_BDTR_MOE          (0x1UL << 15) 
#define TIM17_BDTR_MOE_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define TIM17_BDTR_BKF          (0xFUL << 16) 
#define TIM17_BDTR_BKF_VAL(X) (((uint32_t)(X) & 0xFUL) << 16)
#define TIM17_DCR_DBL          (0x1FUL << 8) 
#define TIM17_DCR_DBL_VAL(X) (((uint32_t)(X) & 0x1FUL) << 8)
#define TIM17_DCR_DBA          (0x1FUL << 0) 
#define TIM17_DCR_DBA_VAL(X) (((uint32_t)(X) & 0x1FUL) << 0)
#define TIM17_DMAR_DMAB          (0xFFFFUL << 0) 
#define TIM17_DMAR_DMAB_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define TIM17_TIM17_AF1_BKINE          (0x1UL << 0) 
#define TIM17_TIM17_AF1_BKINE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define TIM17_TIM17_AF1_BKCMP1E          (0x1UL << 1) 
#define TIM17_TIM17_AF1_BKCMP1E_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define TIM17_TIM17_AF1_BKCMP2E          (0x1UL << 2) 
#define TIM17_TIM17_AF1_BKCMP2E_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define TIM17_TIM17_AF1_BKDFBK1E          (0x1UL << 8) 
#define TIM17_TIM17_AF1_BKDFBK1E_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define TIM17_TIM17_AF1_BKINP          (0x1UL << 9) 
#define TIM17_TIM17_AF1_BKINP_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define TIM17_TIM17_AF1_BKCMP1P          (0x1UL << 10) 
#define TIM17_TIM17_AF1_BKCMP1P_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define TIM17_TIM17_AF1_BKCMP2P          (0x1UL << 11) 
#define TIM17_TIM17_AF1_BKCMP2P_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define TIM17_TIM17_TISEL_TI1SEL          (0xFUL << 0) 
#define TIM17_TIM17_TISEL_TI1SEL_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)

