via/viaems/src/platforms/stm32h743/device.h
#define TIM17  ((struct TIM17*)(0x40014800UL))
struct TIM15 {
  volatile uint32_t CR1;
  volatile uint32_t CR2;
  volatile uint32_t SMCR;
  volatile uint32_t DIER;
  volatile uint32_t SR;
  volatile uint32_t EGR;
  volatile uint32_t CCMR1_Output;
  volatile uint32_t CCMR1_Input;
  const volatile uint32_t RESERVED32[1];
  volatile uint32_t CCER;
  volatile uint32_t CNT;
  volatile uint32_t PSC;
  volatile uint32_t ARR;
  volatile uint32_t RCR;
  volatile uint32_t CCR1;
  volatile uint32_t CCR2;
  const volatile uint32_t RESERVED68[2];
  volatile uint32_t BDTR;
  volatile uint32_t DCR;
  volatile uint32_t DMAR;
  const volatile uint32_t RESERVED96[4];
  volatile uint32_t AF1;
  const volatile uint32_t RESERVED104[1];
  volatile uint32_t TISEL;
};
#define TIM15_CR1_CEN          (0x1UL << 0) 
#define TIM15_CR1_CEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define TIM15_CR1_UDIS          (0x1UL << 1) 
#define TIM15_CR1_UDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define TIM15_CR1_URS          (0x1UL << 2) 
#define TIM15_CR1_URS_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define TIM15_CR1_OPM          (0x1UL << 3) 
#define TIM15_CR1_OPM_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define TIM15_CR1_ARPE          (0x1UL << 7) 
#define TIM15_CR1_ARPE_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define TIM15_CR1_CKD          (0x3UL << 8) 
#define TIM15_CR1_CKD_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define TIM15_CR1_UIFREMAP          (0x1UL << 11) 
#define TIM15_CR1_UIFREMAP_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define TIM15_CR2_CCPC          (0x1UL << 0) 
#define TIM15_CR2_CCPC_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define TIM15_CR2_CCUS          (0x1UL << 2) 
#define TIM15_CR2_CCUS_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define TIM15_CR2_CCDS          (0x1UL << 3) 
#define TIM15_CR2_CCDS_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define TIM15_CR2_MMS          (0x7UL << 4) 
#define TIM15_CR2_MMS_VAL(X) (((uint32_t)(X) & 0x7UL) << 4)
#define TIM15_CR2_TI1S          (0x1UL << 7) 
#define TIM15_CR2_TI1S_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define TIM15_CR2_OIS1          (0x1UL << 8) 
#define TIM15_CR2_OIS1_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define TIM15_CR2_OIS1N          (0x1UL << 9) 
#define TIM15_CR2_OIS1N_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define TIM15_CR2_OIS2          (0x1UL << 10) 
#define TIM15_CR2_OIS2_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define TIM15_SMCR_SMS          (0x7UL << 0) 
#define TIM15_SMCR_SMS_VAL(X) (((uint32_t)(X) & 0x7UL) << 0)
#define TIM15_SMCR_TS_2_0          (0x7UL << 4) 
#define TIM15_SMCR_TS_2_0_VAL(X) (((uint32_t)(X) & 0x7UL) << 4)
#define TIM15_SMCR_MSM          (0x1UL << 7) 
#define TIM15_SMCR_MSM_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define TIM15_SMCR_SMS_3          (0x1UL << 16) 
#define TIM15_SMCR_SMS_3_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define TIM15_SMCR_TS_4_3          (0x3UL << 20) 
#define TIM15_SMCR_TS_4_3_VAL(X) (((uint32_t)(X) & 0x3UL) << 20)
#define TIM15_DIER_UIE          (0x1UL << 0) 
#define TIM15_DIER_UIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define TIM15_DIER_CC1IE          (0x1UL << 1) 
#define TIM15_DIER_CC1IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define TIM15_DIER_CC2IE          (0x1UL << 2) 
#define TIM15_DIER_CC2IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define TIM15_DIER_COMIE          (0x1UL << 5) 
#define TIM15_DIER_COMIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define TIM15_DIER_TIE          (0x1UL << 6) 
#define TIM15_DIER_TIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define TIM15_DIER_BIE          (0x1UL << 7) 
#define TIM15_DIER_BIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define TIM15_DIER_UDE          (0x1UL << 8) 
#define TIM15_DIER_UDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define TIM15_DIER_CC1DE          (0x1UL << 9) 
#define TIM15_DIER_CC1DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define TIM15_DIER_CC2DE          (0x1UL << 10) 
#define TIM15_DIER_CC2DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define TIM15_DIER_COMDE          (0x1UL << 13) 
#define TIM15_DIER_COMDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define TIM15_DIER_TDE          (0x1UL << 14) 
#define TIM15_DIER_TDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define TIM15_SR_CC2OF          (0x1UL << 10) 
#define TIM15_SR_CC2OF_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define TIM15_SR_CC1OF          (0x1UL << 9) 
#define TIM15_SR_CC1OF_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define TIM15_SR_BIF          (0x1UL << 7) 
#define TIM15_SR_BIF_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define TIM15_SR_TIF          (0x1UL << 6) 
#define TIM15_SR_TIF_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define TIM15_SR_COMIF          (0x1UL << 5) 
#define TIM15_SR_COMIF_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define TIM15_SR_CC2IF          (0x1UL << 2) 
#define TIM15_SR_CC2IF_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define TIM15_SR_CC1IF          (0x1UL << 1) 
#define TIM15_SR_CC1IF_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define TIM15_SR_UIF          (0x1UL << 0) 
#define TIM15_SR_UIF_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define TIM15_EGR_BG          (0x1UL << 7) 
#define TIM15_EGR_BG_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define TIM15_EGR_TG          (0x1UL << 6) 
#define TIM15_EGR_TG_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define TIM15_EGR_COMG          (0x1UL << 5) 
#define TIM15_EGR_COMG_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define TIM15_EGR_CC2G          (0x1UL << 2) 
#define TIM15_EGR_CC2G_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define TIM15_EGR_CC1G          (0x1UL << 1) 
#define TIM15_EGR_CC1G_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define TIM15_EGR_UG          (0x1UL << 0) 
#define TIM15_EGR_UG_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define TIM15_CCMR1_Output_CC1S          (0x3UL << 0) 
#define TIM15_CCMR1_Output_CC1S_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define TIM15_CCMR1_Output_OC1FE          (0x1UL << 2) 
#define TIM15_CCMR1_Output_OC1FE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define TIM15_CCMR1_Output_OC1PE          (0x1UL << 3) 
#define TIM15_CCMR1_Output_OC1PE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define TIM15_CCMR1_Output_OC1M          (0x7UL << 4) 
#define TIM15_CCMR1_Output_OC1M_VAL(X) (((uint32_t)(X) & 0x7UL) << 4)
#define TIM15_CCMR1_Output_CC2S          (0x3UL << 8) 
#define TIM15_CCMR1_Output_CC2S_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define TIM15_CCMR1_Output_OC2FE          (0x1UL << 10) 
#define TIM15_CCMR1_Output_OC2FE_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define TIM15_CCMR1_Output_OC2PE          (0x1UL << 11) 
#define TIM15_CCMR1_Output_OC2PE_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define TIM15_CCMR1_Output_OC2M          (0x7UL << 12) 
#define TIM15_CCMR1_Output_OC2M_VAL(X) (((uint32_t)(X) & 0x7UL) << 12)
#define TIM15_CCMR1_Output_OC1M_3          (0x1UL << 16) 
#define TIM15_CCMR1_Output_OC1M_3_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define TIM15_CCMR1_Output_OC2M_3          (0x1UL << 24) 
#define TIM15_CCMR1_Output_OC2M_3_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define TIM15_CCMR1_Input_IC2F          (0xFUL << 12) 
#define TIM15_CCMR1_Input_IC2F_VAL(X) (((uint32_t)(X) & 0xFUL) << 12)
#define TIM15_CCMR1_Input_IC2PSC          (0x3UL << 10) 
#define TIM15_CCMR1_Input_IC2PSC_VAL(X) (((uint32_t)(X) & 0x3UL) << 10)
#define TIM15_CCMR1_Input_CC2S          (0x3UL << 8) 
#define TIM15_CCMR1_Input_CC2S_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define TIM15_CCMR1_Input_IC1F          (0xFUL << 4) 
#define TIM15_CCMR1_Input_IC1F_VAL(X) (((uint32_t)(X) & 0xFUL) << 4)
#define TIM15_CCMR1_Input_IC1PSC          (0x3UL << 2) 
#define TIM15_CCMR1_Input_IC1PSC_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define TIM15_CCMR1_Input_CC1S          (0x3UL << 0) 
#define TIM15_CCMR1_Input_CC1S_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define TIM15_CCER_CC2NP          (0x1UL << 7) 
#define TIM15_CCER_CC2NP_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define TIM15_CCER_CC2P          (0x1UL << 5) 
#define TIM15_CCER_CC2P_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define TIM15_CCER_CC2E          (0x1UL << 4) 
#define TIM15_CCER_CC2E_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define TIM15_CCER_CC1NP          (0x1UL << 3) 
#define TIM15_CCER_CC1NP_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define TIM15_CCER_CC1NE          (0x1UL << 2) 
#define TIM15_CCER_CC1NE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define TIM15_CCER_CC1P          (0x1UL << 1) 
#define TIM15_CCER_CC1P_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define TIM15_CCER_CC1E          (0x1UL << 0) 
#define TIM15_CCER_CC1E_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define TIM15_CNT_CNT          (0xFFFFUL << 0) 
#define TIM15_CNT_CNT_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define TIM15_CNT_UIFCPY          (0x1UL << 31) 
#define TIM15_CNT_UIFCPY_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define TIM15_PSC_PSC          (0xFFFFUL << 0) 
#define TIM15_PSC_PSC_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define TIM15_ARR_ARR          (0xFFFFUL << 0) 
#define TIM15_ARR_ARR_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define TIM15_RCR_REP          (0xFFUL << 0) 
#define TIM15_RCR_REP_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define TIM15_CCR1_CCR1          (0xFFFFUL << 0) 
#define TIM15_CCR1_CCR1_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define TIM15_CCR2_CCR2          (0xFFFFUL << 0) 
#define TIM15_CCR2_CCR2_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define TIM15_BDTR_MOE          (0x1UL << 15) 
#define TIM15_BDTR_MOE_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define TIM15_BDTR_AOE          (0x1UL << 14) 
#define TIM15_BDTR_AOE_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define TIM15_BDTR_BKP          (0x1UL << 13) 
#define TIM15_BDTR_BKP_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define TIM15_BDTR_BKE          (0x1UL << 12) 
#define TIM15_BDTR_BKE_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define TIM15_BDTR_OSSR          (0x1UL << 11) 
#define TIM15_BDTR_OSSR_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define TIM15_BDTR_OSSI          (0x1UL << 10) 
#define TIM15_BDTR_OSSI_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define TIM15_BDTR_LOCK          (0x3UL << 8) 
#define TIM15_BDTR_LOCK_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define TIM15_BDTR_DTG          (0xFFUL << 0) 
#define TIM15_BDTR_DTG_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define TIM15_BDTR_BKF          (0xFUL << 16) 
#define TIM15_BDTR_BKF_VAL(X) (((uint32_t)(X) & 0xFUL) << 16)
#define TIM15_DCR_DBL          (0x1FUL << 8) 
#define TIM15_DCR_DBL_VAL(X) (((uint32_t)(X) & 0x1FUL) << 8)
#define TIM15_DCR_DBA          (0x1FUL << 0) 
#define TIM15_DCR_DBA_VAL(X) (((uint32_t)(X) & 0x1FUL) << 0)
#define TIM15_DMAR_DMAB          (0xFFFFUL << 0) 
#define TIM15_DMAR_DMAB_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define TIM15_AF1_BKINE          (0x1UL << 0) 
#define TIM15_AF1_BKINE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define TIM15_AF1_BKCMP1E          (0x1UL << 1) 
#define TIM15_AF1_BKCMP1E_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define TIM15_AF1_BKCMP2E          (0x1UL << 2) 
#define TIM15_AF1_BKCMP2E_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define TIM15_AF1_BKDF1BK0E          (0x1UL << 8) 
#define TIM15_AF1_BKDF1BK0E_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define TIM15_AF1_BKINP          (0x1UL << 9) 
#define TIM15_AF1_BKINP_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define TIM15_AF1_BKCMP1P          (0x1UL << 10) 
#define TIM15_AF1_BKCMP1P_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define TIM15_AF1_BKCMP2P          (0x1UL << 11) 
#define TIM15_AF1_BKCMP2P_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define TIM15_TISEL_TI1SEL          (0xFUL << 0) 
#define TIM15_TISEL_TI1SEL_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define TIM15_TISEL_TI2SEL          (0xFUL << 8) 
#define TIM15_TISEL_TI2SEL_VAL(X) (((uint32_t)(X) & 0xFUL) << 8)

#define TIM15  ((struct TIM15*)(0x40014000UL))
struct USART1 {
  volatile uint32_t CR1;
  volatile uint32_t CR2;
  volatile uint32_t CR3;
  volatile uint32_t BRR;
  volatile uint32_t GTPR;
  volatile uint32_t RTOR;
  volatile uint32_t RQR;
  volatile const uint32_t ISR;
  volatile uint32_t ICR;
  volatile const uint32_t RDR;
  volatile uint32_t TDR;
  volatile uint32_t PRESC;
};
