via/viaems/src/platforms/stm32h743/device.h
#define USART2_CR1_RXFFIE          (0x1UL << 31) 
#define USART2_CR1_RXFFIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define USART2_CR1_TXFEIE          (0x1UL << 30) 
#define USART2_CR1_TXFEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define USART2_CR1_FIFOEN          (0x1UL << 29) 
#define USART2_CR1_FIFOEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define USART2_CR1_M1          (0x1UL << 28) 
#define USART2_CR1_M1_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define USART2_CR1_EOBIE          (0x1UL << 27) 
#define USART2_CR1_EOBIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define USART2_CR1_RTOIE          (0x1UL << 26) 
#define USART2_CR1_RTOIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define USART2_CR1_DEAT4          (0x1UL << 25) 
#define USART2_CR1_DEAT4_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define USART2_CR1_DEAT3          (0x1UL << 24) 
#define USART2_CR1_DEAT3_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define USART2_CR1_DEAT2          (0x1UL << 23) 
#define USART2_CR1_DEAT2_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define USART2_CR1_DEAT1          (0x1UL << 22) 
#define USART2_CR1_DEAT1_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define USART2_CR1_DEAT0          (0x1UL << 21) 
#define USART2_CR1_DEAT0_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define USART2_CR1_DEDT4          (0x1UL << 20) 
#define USART2_CR1_DEDT4_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define USART2_CR1_DEDT3          (0x1UL << 19) 
#define USART2_CR1_DEDT3_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define USART2_CR1_DEDT2          (0x1UL << 18) 
#define USART2_CR1_DEDT2_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define USART2_CR1_DEDT1          (0x1UL << 17) 
#define USART2_CR1_DEDT1_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define USART2_CR1_DEDT0          (0x1UL << 16) 
#define USART2_CR1_DEDT0_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define USART2_CR1_OVER8          (0x1UL << 15) 
#define USART2_CR1_OVER8_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define USART2_CR1_CMIE          (0x1UL << 14) 
#define USART2_CR1_CMIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define USART2_CR1_MME          (0x1UL << 13) 
#define USART2_CR1_MME_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define USART2_CR1_M0          (0x1UL << 12) 
#define USART2_CR1_M0_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define USART2_CR1_WAKE          (0x1UL << 11) 
#define USART2_CR1_WAKE_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define USART2_CR1_PCE          (0x1UL << 10) 
#define USART2_CR1_PCE_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define USART2_CR1_PS          (0x1UL << 9) 
#define USART2_CR1_PS_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define USART2_CR1_PEIE          (0x1UL << 8) 
#define USART2_CR1_PEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define USART2_CR1_TXEIE          (0x1UL << 7) 
#define USART2_CR1_TXEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define USART2_CR1_TCIE          (0x1UL << 6) 
#define USART2_CR1_TCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define USART2_CR1_RXNEIE          (0x1UL << 5) 
#define USART2_CR1_RXNEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define USART2_CR1_IDLEIE          (0x1UL << 4) 
#define USART2_CR1_IDLEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define USART2_CR1_TE          (0x1UL << 3) 
#define USART2_CR1_TE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define USART2_CR1_RE          (0x1UL << 2) 
#define USART2_CR1_RE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define USART2_CR1_UESM          (0x1UL << 1) 
#define USART2_CR1_UESM_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define USART2_CR1_UE          (0x1UL << 0) 
#define USART2_CR1_UE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define USART2_CR2_ADD4_7          (0xFUL << 28) 
#define USART2_CR2_ADD4_7_VAL(X) (((uint32_t)(X) & 0xFUL) << 28)
#define USART2_CR2_ADD0_3          (0xFUL << 24) 
#define USART2_CR2_ADD0_3_VAL(X) (((uint32_t)(X) & 0xFUL) << 24)
#define USART2_CR2_RTOEN          (0x1UL << 23) 
#define USART2_CR2_RTOEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define USART2_CR2_ABRMOD1          (0x1UL << 22) 
#define USART2_CR2_ABRMOD1_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define USART2_CR2_ABRMOD0          (0x1UL << 21) 
#define USART2_CR2_ABRMOD0_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define USART2_CR2_ABREN          (0x1UL << 20) 
#define USART2_CR2_ABREN_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define USART2_CR2_MSBFIRST          (0x1UL << 19) 
#define USART2_CR2_MSBFIRST_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define USART2_CR2_TAINV          (0x1UL << 18) 
#define USART2_CR2_TAINV_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define USART2_CR2_TXINV          (0x1UL << 17) 
#define USART2_CR2_TXINV_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define USART2_CR2_RXINV          (0x1UL << 16) 
#define USART2_CR2_RXINV_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define USART2_CR2_SWAP          (0x1UL << 15) 
#define USART2_CR2_SWAP_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define USART2_CR2_LINEN          (0x1UL << 14) 
#define USART2_CR2_LINEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define USART2_CR2_STOP          (0x3UL << 12) 
#define USART2_CR2_STOP_VAL(X) (((uint32_t)(X) & 0x3UL) << 12)
#define USART2_CR2_CLKEN          (0x1UL << 11) 
#define USART2_CR2_CLKEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define USART2_CR2_CPOL          (0x1UL << 10) 
#define USART2_CR2_CPOL_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define USART2_CR2_CPHA          (0x1UL << 9) 
#define USART2_CR2_CPHA_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define USART2_CR2_LBCL          (0x1UL << 8) 
#define USART2_CR2_LBCL_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define USART2_CR2_LBDIE          (0x1UL << 6) 
#define USART2_CR2_LBDIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define USART2_CR2_LBDL          (0x1UL << 5) 
#define USART2_CR2_LBDL_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define USART2_CR2_ADDM7          (0x1UL << 4) 
#define USART2_CR2_ADDM7_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define USART2_CR2_DIS_NSS          (0x1UL << 3) 
#define USART2_CR2_DIS_NSS_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define USART2_CR2_SLVEN          (0x1UL << 0) 
#define USART2_CR2_SLVEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define USART2_CR3_TXFTCFG          (0x7UL << 29) 
#define USART2_CR3_TXFTCFG_VAL(X) (((uint32_t)(X) & 0x7UL) << 29)
#define USART2_CR3_RXFTIE          (0x1UL << 28) 
#define USART2_CR3_RXFTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define USART2_CR3_RXFTCFG          (0x7UL << 25) 
#define USART2_CR3_RXFTCFG_VAL(X) (((uint32_t)(X) & 0x7UL) << 25)
#define USART2_CR3_TCBGTIE          (0x1UL << 24) 
#define USART2_CR3_TCBGTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define USART2_CR3_TXFTIE          (0x1UL << 23) 
#define USART2_CR3_TXFTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define USART2_CR3_WUFIE          (0x1UL << 22) 
#define USART2_CR3_WUFIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define USART2_CR3_WUS          (0x3UL << 20) 
#define USART2_CR3_WUS_VAL(X) (((uint32_t)(X) & 0x3UL) << 20)
#define USART2_CR3_SCARCNT          (0x7UL << 17) 
#define USART2_CR3_SCARCNT_VAL(X) (((uint32_t)(X) & 0x7UL) << 17)
#define USART2_CR3_DEP          (0x1UL << 15) 
#define USART2_CR3_DEP_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define USART2_CR3_DEM          (0x1UL << 14) 
#define USART2_CR3_DEM_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define USART2_CR3_DDRE          (0x1UL << 13) 
#define USART2_CR3_DDRE_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define USART2_CR3_OVRDIS          (0x1UL << 12) 
#define USART2_CR3_OVRDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define USART2_CR3_ONEBIT          (0x1UL << 11) 
#define USART2_CR3_ONEBIT_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define USART2_CR3_CTSIE          (0x1UL << 10) 
#define USART2_CR3_CTSIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define USART2_CR3_CTSE          (0x1UL << 9) 
#define USART2_CR3_CTSE_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define USART2_CR3_RTSE          (0x1UL << 8) 
#define USART2_CR3_RTSE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define USART2_CR3_DMAT          (0x1UL << 7) 
#define USART2_CR3_DMAT_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define USART2_CR3_DMAR          (0x1UL << 6) 
#define USART2_CR3_DMAR_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define USART2_CR3_SCEN          (0x1UL << 5) 
#define USART2_CR3_SCEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define USART2_CR3_NACK          (0x1UL << 4) 
#define USART2_CR3_NACK_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define USART2_CR3_HDSEL          (0x1UL << 3) 
#define USART2_CR3_HDSEL_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define USART2_CR3_IRLP          (0x1UL << 2) 
#define USART2_CR3_IRLP_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define USART2_CR3_IREN          (0x1UL << 1) 
#define USART2_CR3_IREN_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define USART2_CR3_EIE          (0x1UL << 0) 
#define USART2_CR3_EIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define USART2_BRR_BRR_4_15          (0xFFFUL << 4) 
#define USART2_BRR_BRR_4_15_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 4)
#define USART2_BRR_BRR_0_3          (0xFUL << 0) 
#define USART2_BRR_BRR_0_3_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define USART2_GTPR_GT          (0xFFUL << 8) 
#define USART2_GTPR_GT_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define USART2_GTPR_PSC          (0xFFUL << 0) 
#define USART2_GTPR_PSC_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define USART2_RTOR_BLEN          (0xFFUL << 24) 
#define USART2_RTOR_BLEN_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define USART2_RTOR_RTO          (0xFFFFFFUL << 0) 
#define USART2_RTOR_RTO_VAL(X) (((uint32_t)(X) & 0xFFFFFFUL) << 0)
#define USART2_RQR_TXFRQ          (0x1UL << 4) 
#define USART2_RQR_TXFRQ_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define USART2_RQR_RXFRQ          (0x1UL << 3) 
#define USART2_RQR_RXFRQ_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define USART2_RQR_MMRQ          (0x1UL << 2) 
#define USART2_RQR_MMRQ_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define USART2_RQR_SBKRQ          (0x1UL << 1) 
#define USART2_RQR_SBKRQ_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define USART2_RQR_ABRRQ          (0x1UL << 0) 
#define USART2_RQR_ABRRQ_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define USART2_ISR_TXFT          (0x1UL << 27) 
#define USART2_ISR_TXFT_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define USART2_ISR_RXFT          (0x1UL << 26) 
#define USART2_ISR_RXFT_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define USART2_ISR_TCBGT          (0x1UL << 25) 
#define USART2_ISR_TCBGT_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define USART2_ISR_RXFF          (0x1UL << 24) 
#define USART2_ISR_RXFF_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define USART2_ISR_TXFE          (0x1UL << 23) 
#define USART2_ISR_TXFE_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define USART2_ISR_REACK          (0x1UL << 22) 
#define USART2_ISR_REACK_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define USART2_ISR_TEACK          (0x1UL << 21) 
#define USART2_ISR_TEACK_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define USART2_ISR_WUF          (0x1UL << 20) 
#define USART2_ISR_WUF_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define USART2_ISR_RWU          (0x1UL << 19) 
#define USART2_ISR_RWU_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define USART2_ISR_SBKF          (0x1UL << 18) 
#define USART2_ISR_SBKF_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define USART2_ISR_CMF          (0x1UL << 17) 
#define USART2_ISR_CMF_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define USART2_ISR_BUSY          (0x1UL << 16) 
#define USART2_ISR_BUSY_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define USART2_ISR_ABRF          (0x1UL << 15) 
#define USART2_ISR_ABRF_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define USART2_ISR_ABRE          (0x1UL << 14) 
#define USART2_ISR_ABRE_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define USART2_ISR_UDR          (0x1UL << 13) 
#define USART2_ISR_UDR_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define USART2_ISR_EOBF          (0x1UL << 12) 
#define USART2_ISR_EOBF_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define USART2_ISR_RTOF          (0x1UL << 11) 
#define USART2_ISR_RTOF_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define USART2_ISR_CTS          (0x1UL << 10) 
#define USART2_ISR_CTS_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define USART2_ISR_CTSIF          (0x1UL << 9) 
#define USART2_ISR_CTSIF_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define USART2_ISR_LBDF          (0x1UL << 8) 
#define USART2_ISR_LBDF_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define USART2_ISR_TXE          (0x1UL << 7) 
#define USART2_ISR_TXE_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define USART2_ISR_TC          (0x1UL << 6) 
#define USART2_ISR_TC_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define USART2_ISR_RXNE          (0x1UL << 5) 
#define USART2_ISR_RXNE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define USART2_ISR_IDLE          (0x1UL << 4) 
#define USART2_ISR_IDLE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define USART2_ISR_ORE          (0x1UL << 3) 
#define USART2_ISR_ORE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define USART2_ISR_NF          (0x1UL << 2) 
#define USART2_ISR_NF_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define USART2_ISR_FE          (0x1UL << 1) 
#define USART2_ISR_FE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define USART2_ISR_PE          (0x1UL << 0) 
#define USART2_ISR_PE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define USART2_ICR_WUCF          (0x1UL << 20) 
#define USART2_ICR_WUCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define USART2_ICR_CMCF          (0x1UL << 17) 
#define USART2_ICR_CMCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define USART2_ICR_UDRCF          (0x1UL << 13) 
#define USART2_ICR_UDRCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define USART2_ICR_EOBCF          (0x1UL << 12) 
#define USART2_ICR_EOBCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define USART2_ICR_RTOCF          (0x1UL << 11) 
#define USART2_ICR_RTOCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define USART2_ICR_CTSCF          (0x1UL << 9) 
#define USART2_ICR_CTSCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define USART2_ICR_LBDCF          (0x1UL << 8) 
#define USART2_ICR_LBDCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define USART2_ICR_TCBGTC          (0x1UL << 7) 
#define USART2_ICR_TCBGTC_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define USART2_ICR_TCCF          (0x1UL << 6) 
#define USART2_ICR_TCCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define USART2_ICR_TXFECF          (0x1UL << 5) 
#define USART2_ICR_TXFECF_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define USART2_ICR_IDLECF          (0x1UL << 4) 
#define USART2_ICR_IDLECF_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define USART2_ICR_ORECF          (0x1UL << 3) 
#define USART2_ICR_ORECF_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define USART2_ICR_NCF          (0x1UL << 2) 
#define USART2_ICR_NCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define USART2_ICR_FECF          (0x1UL << 1) 
#define USART2_ICR_FECF_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define USART2_ICR_PECF          (0x1UL << 0) 
#define USART2_ICR_PECF_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define USART2_RDR_RDR          (0x1FFUL << 0) 
#define USART2_RDR_RDR_VAL(X) (((uint32_t)(X) & 0x1FFUL) << 0)
#define USART2_TDR_TDR          (0x1FFUL << 0) 
#define USART2_TDR_TDR_VAL(X) (((uint32_t)(X) & 0x1FFUL) << 0)
#define USART2_PRESC_PRESCALER          (0xFUL << 0) 
#define USART2_PRESC_PRESCALER_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)

#define USART2  ((struct USART2*)(0x40004400UL))
struct USART3 {
  volatile uint32_t CR1;
  volatile uint32_t CR2;
  volatile uint32_t CR3;
  volatile uint32_t BRR;
  volatile uint32_t GTPR;
  volatile uint32_t RTOR;
  volatile uint32_t RQR;
  volatile const uint32_t ISR;
  volatile uint32_t ICR;
  volatile const uint32_t RDR;
  volatile uint32_t TDR;
  volatile uint32_t PRESC;
};
