via/viaems/src/platforms/stm32h743/device.h
#define TIM1_CR1_CEN          (0x1UL << 0) 
#define TIM1_CR1_CEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define TIM1_CR1_UDIS          (0x1UL << 1) 
#define TIM1_CR1_UDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define TIM1_CR1_URS          (0x1UL << 2) 
#define TIM1_CR1_URS_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define TIM1_CR1_OPM          (0x1UL << 3) 
#define TIM1_CR1_OPM_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define TIM1_CR1_DIR          (0x1UL << 4) 
#define TIM1_CR1_DIR_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define TIM1_CR1_CMS          (0x3UL << 5) 
#define TIM1_CR1_CMS_VAL(X) (((uint32_t)(X) & 0x3UL) << 5)
#define TIM1_CR1_ARPE          (0x1UL << 7) 
#define TIM1_CR1_ARPE_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define TIM1_CR1_CKD          (0x3UL << 8) 
#define TIM1_CR1_CKD_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define TIM1_CR1_UIFREMAP          (0x1UL << 11) 
#define TIM1_CR1_UIFREMAP_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define TIM1_CR2_MMS2          (0xFUL << 20) 
#define TIM1_CR2_MMS2_VAL(X) (((uint32_t)(X) & 0xFUL) << 20)
#define TIM1_CR2_OIS6          (0x1UL << 18) 
#define TIM1_CR2_OIS6_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define TIM1_CR2_OIS5          (0x1UL << 16) 
#define TIM1_CR2_OIS5_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define TIM1_CR2_OIS4          (0x1UL << 14) 
#define TIM1_CR2_OIS4_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define TIM1_CR2_OIS3N          (0x1UL << 13) 
#define TIM1_CR2_OIS3N_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define TIM1_CR2_OIS3          (0x1UL << 12) 
#define TIM1_CR2_OIS3_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define TIM1_CR2_OIS2N          (0x1UL << 11) 
#define TIM1_CR2_OIS2N_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define TIM1_CR2_OIS2          (0x1UL << 10) 
#define TIM1_CR2_OIS2_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define TIM1_CR2_OIS1N          (0x1UL << 9) 
#define TIM1_CR2_OIS1N_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define TIM1_CR2_OIS1          (0x1UL << 8) 
#define TIM1_CR2_OIS1_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define TIM1_CR2_TI1S          (0x1UL << 7) 
#define TIM1_CR2_TI1S_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define TIM1_CR2_MMS          (0x7UL << 4) 
#define TIM1_CR2_MMS_VAL(X) (((uint32_t)(X) & 0x7UL) << 4)
#define TIM1_CR2_CCDS          (0x1UL << 3) 
#define TIM1_CR2_CCDS_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define TIM1_CR2_CCUS          (0x1UL << 2) 
#define TIM1_CR2_CCUS_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define TIM1_CR2_CCPC          (0x1UL << 0) 
#define TIM1_CR2_CCPC_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define TIM1_SMCR_SMS          (0x7UL << 0) 
#define TIM1_SMCR_SMS_VAL(X) (((uint32_t)(X) & 0x7UL) << 0)
#define TIM1_SMCR_TS          (0x7UL << 4) 
#define TIM1_SMCR_TS_VAL(X) (((uint32_t)(X) & 0x7UL) << 4)
#define TIM1_SMCR_MSM          (0x1UL << 7) 
#define TIM1_SMCR_MSM_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define TIM1_SMCR_ETF          (0xFUL << 8) 
#define TIM1_SMCR_ETF_VAL(X) (((uint32_t)(X) & 0xFUL) << 8)
#define TIM1_SMCR_ETPS          (0x3UL << 12) 
#define TIM1_SMCR_ETPS_VAL(X) (((uint32_t)(X) & 0x3UL) << 12)
#define TIM1_SMCR_ECE          (0x1UL << 14) 
#define TIM1_SMCR_ECE_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define TIM1_SMCR_ETP          (0x1UL << 15) 
#define TIM1_SMCR_ETP_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define TIM1_SMCR_SMS_3          (0x1UL << 16) 
#define TIM1_SMCR_SMS_3_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define TIM1_SMCR_TS_4_3          (0x3UL << 20) 
#define TIM1_SMCR_TS_4_3_VAL(X) (((uint32_t)(X) & 0x3UL) << 20)
#define TIM1_DIER_TDE          (0x1UL << 14) 
#define TIM1_DIER_TDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define TIM1_DIER_COMDE          (0x1UL << 13) 
#define TIM1_DIER_COMDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define TIM1_DIER_CC4DE          (0x1UL << 12) 
#define TIM1_DIER_CC4DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define TIM1_DIER_CC3DE          (0x1UL << 11) 
#define TIM1_DIER_CC3DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define TIM1_DIER_CC2DE          (0x1UL << 10) 
#define TIM1_DIER_CC2DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define TIM1_DIER_CC1DE          (0x1UL << 9) 
#define TIM1_DIER_CC1DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define TIM1_DIER_UDE          (0x1UL << 8) 
#define TIM1_DIER_UDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define TIM1_DIER_TIE          (0x1UL << 6) 
#define TIM1_DIER_TIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define TIM1_DIER_CC4IE          (0x1UL << 4) 
#define TIM1_DIER_CC4IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define TIM1_DIER_CC3IE          (0x1UL << 3) 
#define TIM1_DIER_CC3IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define TIM1_DIER_CC2IE          (0x1UL << 2) 
#define TIM1_DIER_CC2IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define TIM1_DIER_CC1IE          (0x1UL << 1) 
#define TIM1_DIER_CC1IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define TIM1_DIER_UIE          (0x1UL << 0) 
#define TIM1_DIER_UIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define TIM1_DIER_BIE          (0x1UL << 7) 
#define TIM1_DIER_BIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define TIM1_DIER_COMIE          (0x1UL << 5) 
#define TIM1_DIER_COMIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define TIM1_SR_CC6IF          (0x1UL << 17) 
#define TIM1_SR_CC6IF_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define TIM1_SR_CC5IF          (0x1UL << 16) 
#define TIM1_SR_CC5IF_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define TIM1_SR_SBIF          (0x1UL << 13) 
#define TIM1_SR_SBIF_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define TIM1_SR_CC4OF          (0x1UL << 12) 
#define TIM1_SR_CC4OF_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define TIM1_SR_CC3OF          (0x1UL << 11) 
#define TIM1_SR_CC3OF_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define TIM1_SR_CC2OF          (0x1UL << 10) 
#define TIM1_SR_CC2OF_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define TIM1_SR_CC1OF          (0x1UL << 9) 
#define TIM1_SR_CC1OF_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define TIM1_SR_B2IF          (0x1UL << 8) 
#define TIM1_SR_B2IF_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define TIM1_SR_BIF          (0x1UL << 7) 
#define TIM1_SR_BIF_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define TIM1_SR_TIF          (0x1UL << 6) 
#define TIM1_SR_TIF_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define TIM1_SR_COMIF          (0x1UL << 5) 
#define TIM1_SR_COMIF_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define TIM1_SR_CC4IF          (0x1UL << 4) 
#define TIM1_SR_CC4IF_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define TIM1_SR_CC3IF          (0x1UL << 3) 
#define TIM1_SR_CC3IF_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define TIM1_SR_CC2IF          (0x1UL << 2) 
#define TIM1_SR_CC2IF_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define TIM1_SR_CC1IF          (0x1UL << 1) 
#define TIM1_SR_CC1IF_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define TIM1_SR_UIF          (0x1UL << 0) 
#define TIM1_SR_UIF_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define TIM1_EGR_UG          (0x1UL << 0) 
#define TIM1_EGR_UG_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define TIM1_EGR_CC1G          (0x1UL << 1) 
#define TIM1_EGR_CC1G_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define TIM1_EGR_CC2G          (0x1UL << 2) 
#define TIM1_EGR_CC2G_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define TIM1_EGR_CC3G          (0x1UL << 3) 
#define TIM1_EGR_CC3G_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define TIM1_EGR_CC4G          (0x1UL << 4) 
#define TIM1_EGR_CC4G_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define TIM1_EGR_COMG          (0x1UL << 5) 
#define TIM1_EGR_COMG_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define TIM1_EGR_TG          (0x1UL << 6) 
#define TIM1_EGR_TG_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define TIM1_EGR_BG          (0x1UL << 7) 
#define TIM1_EGR_BG_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define TIM1_EGR_B2G          (0x1UL << 8) 
#define TIM1_EGR_B2G_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define TIM1_CCMR1_Output_CC1S          (0x3UL << 0) 
#define TIM1_CCMR1_Output_CC1S_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define TIM1_CCMR1_Output_OC1FE          (0x1UL << 2) 
#define TIM1_CCMR1_Output_OC1FE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define TIM1_CCMR1_Output_OC1PE          (0x1UL << 3) 
#define TIM1_CCMR1_Output_OC1PE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define TIM1_CCMR1_Output_OC1M          (0x7UL << 4) 
#define TIM1_CCMR1_Output_OC1M_VAL(X) (((uint32_t)(X) & 0x7UL) << 4)
#define TIM1_CCMR1_Output_OC1CE          (0x1UL << 7) 
#define TIM1_CCMR1_Output_OC1CE_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define TIM1_CCMR1_Output_CC2S          (0x3UL << 8) 
#define TIM1_CCMR1_Output_CC2S_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define TIM1_CCMR1_Output_OC2FE          (0x1UL << 10) 
#define TIM1_CCMR1_Output_OC2FE_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define TIM1_CCMR1_Output_OC2PE          (0x1UL << 11) 
#define TIM1_CCMR1_Output_OC2PE_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define TIM1_CCMR1_Output_OC2M          (0x7UL << 12) 
#define TIM1_CCMR1_Output_OC2M_VAL(X) (((uint32_t)(X) & 0x7UL) << 12)
#define TIM1_CCMR1_Output_OC2CE          (0x1UL << 15) 
#define TIM1_CCMR1_Output_OC2CE_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define TIM1_CCMR1_Output_OC1M_3          (0x1UL << 16) 
#define TIM1_CCMR1_Output_OC1M_3_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define TIM1_CCMR1_Output_OC2M_3          (0x1UL << 24) 
#define TIM1_CCMR1_Output_OC2M_3_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define TIM1_CCMR1_Input_IC2F          (0xFUL << 12) 
#define TIM1_CCMR1_Input_IC2F_VAL(X) (((uint32_t)(X) & 0xFUL) << 12)
#define TIM1_CCMR1_Input_IC2PCS          (0x3UL << 10) 
#define TIM1_CCMR1_Input_IC2PCS_VAL(X) (((uint32_t)(X) & 0x3UL) << 10)
#define TIM1_CCMR1_Input_CC2S          (0x3UL << 8) 
#define TIM1_CCMR1_Input_CC2S_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define TIM1_CCMR1_Input_IC1F          (0xFUL << 4) 
#define TIM1_CCMR1_Input_IC1F_VAL(X) (((uint32_t)(X) & 0xFUL) << 4)
#define TIM1_CCMR1_Input_ICPCS          (0x3UL << 2) 
#define TIM1_CCMR1_Input_ICPCS_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define TIM1_CCMR1_Input_CC1S          (0x3UL << 0) 
#define TIM1_CCMR1_Input_CC1S_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define TIM1_CCMR2_Output_CC3S          (0x3UL << 0) 
#define TIM1_CCMR2_Output_CC3S_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define TIM1_CCMR2_Output_OC3FE          (0x1UL << 2) 
#define TIM1_CCMR2_Output_OC3FE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define TIM1_CCMR2_Output_OC3PE          (0x1UL << 3) 
#define TIM1_CCMR2_Output_OC3PE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define TIM1_CCMR2_Output_OC3M          (0x7UL << 4) 
#define TIM1_CCMR2_Output_OC3M_VAL(X) (((uint32_t)(X) & 0x7UL) << 4)
#define TIM1_CCMR2_Output_OC3CE          (0x1UL << 7) 
#define TIM1_CCMR2_Output_OC3CE_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define TIM1_CCMR2_Output_CC4S          (0x3UL << 8) 
#define TIM1_CCMR2_Output_CC4S_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define TIM1_CCMR2_Output_OC4FE          (0x1UL << 10) 
#define TIM1_CCMR2_Output_OC4FE_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define TIM1_CCMR2_Output_OC4PE          (0x1UL << 11) 
#define TIM1_CCMR2_Output_OC4PE_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define TIM1_CCMR2_Output_OC4M          (0x7UL << 12) 
#define TIM1_CCMR2_Output_OC4M_VAL(X) (((uint32_t)(X) & 0x7UL) << 12)
#define TIM1_CCMR2_Output_OC4CE          (0x1UL << 15) 
#define TIM1_CCMR2_Output_OC4CE_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define TIM1_CCMR2_Output_OC3M_3          (0x1UL << 16) 
#define TIM1_CCMR2_Output_OC3M_3_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define TIM1_CCMR2_Output_OC4M_4          (0x1UL << 24) 
#define TIM1_CCMR2_Output_OC4M_4_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define TIM1_CCMR2_Input_IC4F          (0xFUL << 12) 
#define TIM1_CCMR2_Input_IC4F_VAL(X) (((uint32_t)(X) & 0xFUL) << 12)
#define TIM1_CCMR2_Input_IC4PSC          (0x3UL << 10) 
#define TIM1_CCMR2_Input_IC4PSC_VAL(X) (((uint32_t)(X) & 0x3UL) << 10)
#define TIM1_CCMR2_Input_CC4S          (0x3UL << 8) 
#define TIM1_CCMR2_Input_CC4S_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define TIM1_CCMR2_Input_IC3F          (0xFUL << 4) 
#define TIM1_CCMR2_Input_IC3F_VAL(X) (((uint32_t)(X) & 0xFUL) << 4)
#define TIM1_CCMR2_Input_IC3PSC          (0x3UL << 2) 
#define TIM1_CCMR2_Input_IC3PSC_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define TIM1_CCMR2_Input_CC3S          (0x3UL << 0) 
#define TIM1_CCMR2_Input_CC3S_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define TIM1_CCER_CC1E          (0x1UL << 0) 
#define TIM1_CCER_CC1E_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define TIM1_CCER_CC1P          (0x1UL << 1) 
#define TIM1_CCER_CC1P_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define TIM1_CCER_CC1NE          (0x1UL << 2) 
#define TIM1_CCER_CC1NE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define TIM1_CCER_CC1NP          (0x1UL << 3) 
#define TIM1_CCER_CC1NP_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define TIM1_CCER_CC2E          (0x1UL << 4) 
#define TIM1_CCER_CC2E_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define TIM1_CCER_CC2P          (0x1UL << 5) 
#define TIM1_CCER_CC2P_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define TIM1_CCER_CC2NE          (0x1UL << 6) 
#define TIM1_CCER_CC2NE_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define TIM1_CCER_CC2NP          (0x1UL << 7) 
#define TIM1_CCER_CC2NP_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define TIM1_CCER_CC3E          (0x1UL << 8) 
#define TIM1_CCER_CC3E_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define TIM1_CCER_CC3P          (0x1UL << 9) 
#define TIM1_CCER_CC3P_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define TIM1_CCER_CC3NE          (0x1UL << 10) 
#define TIM1_CCER_CC3NE_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define TIM1_CCER_CC3NP          (0x1UL << 11) 
#define TIM1_CCER_CC3NP_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define TIM1_CCER_CC4E          (0x1UL << 12) 
#define TIM1_CCER_CC4E_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define TIM1_CCER_CC4P          (0x1UL << 13) 
#define TIM1_CCER_CC4P_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define TIM1_CCER_CC4NP          (0x1UL << 15) 
#define TIM1_CCER_CC4NP_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define TIM1_CCER_CC5E          (0x1UL << 16) 
#define TIM1_CCER_CC5E_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define TIM1_CCER_CC5P          (0x1UL << 17) 
#define TIM1_CCER_CC5P_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define TIM1_CCER_CC6E          (0x1UL << 20) 
#define TIM1_CCER_CC6E_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define TIM1_CCER_CC6P          (0x1UL << 21) 
#define TIM1_CCER_CC6P_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define TIM1_CNT_CNT          (0xFFFFUL << 0) 
#define TIM1_CNT_CNT_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define TIM1_CNT_UIFCPY          (0x1UL << 31) 
#define TIM1_CNT_UIFCPY_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define TIM1_PSC_PSC          (0xFFFFUL << 0) 
#define TIM1_PSC_PSC_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define TIM1_ARR_ARR          (0xFFFFUL << 0) 
#define TIM1_ARR_ARR_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define TIM1_CCR1_CCR1          (0xFFFFUL << 0) 
#define TIM1_CCR1_CCR1_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define TIM1_CCR2_CCR2          (0xFFFFUL << 0) 
#define TIM1_CCR2_CCR2_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define TIM1_CCR3_CCR3          (0xFFFFUL << 0) 
#define TIM1_CCR3_CCR3_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define TIM1_CCR4_CCR4          (0xFFFFUL << 0) 
#define TIM1_CCR4_CCR4_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define TIM1_DCR_DBL          (0x1FUL << 8) 
#define TIM1_DCR_DBL_VAL(X) (((uint32_t)(X) & 0x1FUL) << 8)
#define TIM1_DCR_DBA          (0x1FUL << 0) 
#define TIM1_DCR_DBA_VAL(X) (((uint32_t)(X) & 0x1FUL) << 0)
#define TIM1_DMAR_DMAB          (0xFFFFUL << 0) 
#define TIM1_DMAR_DMAB_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define TIM1_RCR_REP          (0xFFUL << 0) 
#define TIM1_RCR_REP_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define TIM1_BDTR_DTG          (0xFFUL << 0) 
#define TIM1_BDTR_DTG_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define TIM1_BDTR_LOCK          (0x3UL << 8) 
#define TIM1_BDTR_LOCK_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define TIM1_BDTR_OSSI          (0x1UL << 10) 
#define TIM1_BDTR_OSSI_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define TIM1_BDTR_OSSR          (0x1UL << 11) 
#define TIM1_BDTR_OSSR_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define TIM1_BDTR_BKE          (0x1UL << 12) 
#define TIM1_BDTR_BKE_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define TIM1_BDTR_BKP          (0x1UL << 13) 
#define TIM1_BDTR_BKP_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define TIM1_BDTR_AOE          (0x1UL << 14) 
#define TIM1_BDTR_AOE_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define TIM1_BDTR_MOE          (0x1UL << 15) 
#define TIM1_BDTR_MOE_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define TIM1_BDTR_BKF          (0xFUL << 16) 
#define TIM1_BDTR_BKF_VAL(X) (((uint32_t)(X) & 0xFUL) << 16)
#define TIM1_BDTR_BK2F          (0xFUL << 20) 
#define TIM1_BDTR_BK2F_VAL(X) (((uint32_t)(X) & 0xFUL) << 20)
#define TIM1_BDTR_BK2E          (0x1UL << 24) 
#define TIM1_BDTR_BK2E_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define TIM1_BDTR_BK2P          (0x1UL << 25) 
#define TIM1_BDTR_BK2P_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define TIM1_CCMR3_Output_OC5FE          (0x1UL << 2) 
#define TIM1_CCMR3_Output_OC5FE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define TIM1_CCMR3_Output_OC5PE          (0x1UL << 3) 
#define TIM1_CCMR3_Output_OC5PE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define TIM1_CCMR3_Output_OC5M          (0x7UL << 4) 
#define TIM1_CCMR3_Output_OC5M_VAL(X) (((uint32_t)(X) & 0x7UL) << 4)
#define TIM1_CCMR3_Output_OC5CE          (0x1UL << 7) 
#define TIM1_CCMR3_Output_OC5CE_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define TIM1_CCMR3_Output_OC6FE          (0x1UL << 10) 
#define TIM1_CCMR3_Output_OC6FE_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define TIM1_CCMR3_Output_OC6PE          (0x1UL << 11) 
#define TIM1_CCMR3_Output_OC6PE_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define TIM1_CCMR3_Output_OC6M          (0x7UL << 12) 
#define TIM1_CCMR3_Output_OC6M_VAL(X) (((uint32_t)(X) & 0x7UL) << 12)
#define TIM1_CCMR3_Output_OC6CE          (0x1UL << 15) 
#define TIM1_CCMR3_Output_OC6CE_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define TIM1_CCMR3_Output_OC5M3          (0x1UL << 16) 
#define TIM1_CCMR3_Output_OC5M3_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define TIM1_CCMR3_Output_OC6M3          (0x1UL << 24) 
#define TIM1_CCMR3_Output_OC6M3_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define TIM1_CCR5_CCR5          (0xFFFFUL << 0) 
#define TIM1_CCR5_CCR5_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define TIM1_CCR5_GC5C1          (0x1UL << 29) 
#define TIM1_CCR5_GC5C1_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define TIM1_CCR5_GC5C2          (0x1UL << 30) 
#define TIM1_CCR5_GC5C2_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define TIM1_CCR5_GC5C3          (0x1UL << 31) 
#define TIM1_CCR5_GC5C3_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define TIM1_CRR6_CCR6          (0xFFFFUL << 0) 
#define TIM1_CRR6_CCR6_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define TIM1_AF1_BKINE          (0x1UL << 0) 
#define TIM1_AF1_BKINE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define TIM1_AF1_BKCMP1E          (0x1UL << 1) 
#define TIM1_AF1_BKCMP1E_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define TIM1_AF1_BKCMP2E          (0x1UL << 2) 
#define TIM1_AF1_BKCMP2E_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define TIM1_AF1_BKDF1BK0E          (0x1UL << 8) 
#define TIM1_AF1_BKDF1BK0E_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define TIM1_AF1_BKINP          (0x1UL << 9) 
#define TIM1_AF1_BKINP_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define TIM1_AF1_BKCMP1P          (0x1UL << 10) 
#define TIM1_AF1_BKCMP1P_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define TIM1_AF1_BKCMP2P          (0x1UL << 11) 
#define TIM1_AF1_BKCMP2P_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define TIM1_AF1_ETRSEL          (0xFUL << 14) 
#define TIM1_AF1_ETRSEL_VAL(X) (((uint32_t)(X) & 0xFUL) << 14)
#define TIM1_AF2_BK2INE          (0x1UL << 0) 
#define TIM1_AF2_BK2INE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define TIM1_AF2_BK2CMP1E          (0x1UL << 1) 
#define TIM1_AF2_BK2CMP1E_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define TIM1_AF2_BK2CMP2E          (0x1UL << 2) 
#define TIM1_AF2_BK2CMP2E_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define TIM1_AF2_BK2DF1BK1E          (0x1UL << 8) 
#define TIM1_AF2_BK2DF1BK1E_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define TIM1_AF2_BK2INP          (0x1UL << 9) 
#define TIM1_AF2_BK2INP_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define TIM1_AF2_BK2CMP1P          (0x1UL << 10) 
#define TIM1_AF2_BK2CMP1P_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define TIM1_AF2_BK2CMP2P          (0x1UL << 11) 
#define TIM1_AF2_BK2CMP2P_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define TIM1_TISEL_TI1SEL          (0xFUL << 0) 
#define TIM1_TISEL_TI1SEL_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define TIM1_TISEL_TI2SEL          (0xFUL << 8) 
#define TIM1_TISEL_TI2SEL_VAL(X) (((uint32_t)(X) & 0xFUL) << 8)
#define TIM1_TISEL_TI3SEL          (0xFUL << 16) 
#define TIM1_TISEL_TI3SEL_VAL(X) (((uint32_t)(X) & 0xFUL) << 16)
#define TIM1_TISEL_TI4SEL          (0xFUL << 24) 
#define TIM1_TISEL_TI4SEL_VAL(X) (((uint32_t)(X) & 0xFUL) << 24)

#define TIM1  ((struct TIM1*)(0x40010000UL))
struct TIM8 {
  volatile uint32_t CR1;
  volatile uint32_t CR2;
  volatile uint32_t SMCR;
  volatile uint32_t DIER;
  volatile uint32_t SR;
  volatile uint32_t EGR;
  volatile uint32_t CCMR1_Output;
  volatile uint32_t CCMR1_Input;
  volatile uint32_t CCMR2_Output;
  volatile uint32_t CCMR2_Input;
  volatile uint32_t CCER;
  volatile uint32_t CNT;
  volatile uint32_t PSC;
  volatile uint32_t ARR;
  volatile uint32_t RCR;
  volatile uint32_t CCR1;
  volatile uint32_t CCR2;
  volatile uint32_t CCR3;
  volatile uint32_t CCR4;
  volatile uint32_t BDTR;
  volatile uint32_t DCR;
  volatile uint32_t DMAR;
  const volatile uint32_t RESERVED84[1];
  volatile uint32_t CCMR3_Output;
  volatile uint32_t CCR5;
  volatile uint32_t CRR6;
  volatile uint32_t AF1;
  volatile uint32_t AF2;
  volatile uint32_t TISEL;
};
