via/viaems/src/platforms/stm32h743/device.h
#define FDCAN1_FDCAN_TTLGT_LT_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define FDCAN1_FDCAN_TTLGT_GT          (0xFFFFUL << 16) 
#define FDCAN1_FDCAN_TTLGT_GT_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define FDCAN1_FDCAN_TTCTC_CT          (0xFFFFUL << 0) 
#define FDCAN1_FDCAN_TTCTC_CT_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define FDCAN1_FDCAN_TTCTC_CC          (0x3FUL << 16) 
#define FDCAN1_FDCAN_TTCTC_CC_VAL(X) (((uint32_t)(X) & 0x3FUL) << 16)
#define FDCAN1_FDCAN_TTCPT_CT          (0x3FUL << 0) 
#define FDCAN1_FDCAN_TTCPT_CT_VAL(X) (((uint32_t)(X) & 0x3FUL) << 0)
#define FDCAN1_FDCAN_TTCPT_SWV          (0xFFFFUL << 16) 
#define FDCAN1_FDCAN_TTCPT_SWV_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define FDCAN1_FDCAN_TTCSM_CSM          (0xFFFFUL << 0) 
#define FDCAN1_FDCAN_TTCSM_CSM_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define FDCAN1_FDCAN_TTTS_SWTDEL          (0x3UL << 0) 
#define FDCAN1_FDCAN_TTTS_SWTDEL_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define FDCAN1_FDCAN_TTTS_EVTSEL          (0x3UL << 4) 
#define FDCAN1_FDCAN_TTTS_EVTSEL_VAL(X) (((uint32_t)(X) & 0x3UL) << 4)

#define FDCAN1  ((struct FDCAN1*)(0x4000A000UL))
struct FDCAN2 {
  volatile const uint32_t FDCAN_CREL;
  volatile const uint32_t FDCAN_ENDN;
  const volatile uint32_t RESERVED12[1];
  volatile const uint32_t FDCAN_DBTP;
  volatile const uint32_t FDCAN_TEST;
  volatile const uint32_t FDCAN_RWD;
  volatile uint32_t FDCAN_CCCR;
  volatile uint32_t FDCAN_NBTP;
  volatile uint32_t FDCAN_TSCC;
  volatile uint32_t FDCAN_TSCV;
  volatile uint32_t FDCAN_TOCC;
  volatile uint32_t FDCAN_TOCV;
  const volatile uint32_t RESERVED64[4];
  volatile uint32_t FDCAN_ECR;
  volatile uint32_t FDCAN_PSR;
  volatile const uint32_t FDCAN_TDCR;
  const volatile uint32_t RESERVED80[1];
  volatile const uint32_t FDCAN_IR;
  volatile const uint32_t FDCAN_IE;
  volatile const uint32_t FDCAN_ILS;
  volatile uint32_t FDCAN_ILE;
  const volatile uint32_t RESERVED128[8];
  volatile uint32_t FDCAN_GFC;
  volatile uint32_t FDCAN_SIDFC;
  volatile uint32_t FDCAN_XIDFC;
  const volatile uint32_t RESERVED144[1];
  volatile uint32_t FDCAN_XIDAM;
  volatile const uint32_t FDCAN_HPMS;
  volatile const uint32_t FDCAN_NDAT1;
  volatile const uint32_t FDCAN_NDAT2;
  volatile uint32_t FDCAN_RXF0C;
  volatile uint32_t FDCAN_RXF0S;
  volatile uint32_t FDCAN_RXF0A;
  volatile uint32_t FDCAN_RXBC;
  volatile uint32_t FDCAN_RXF1C;
  volatile uint32_t FDCAN_RXF1S;
  volatile uint32_t FDCAN_RXF1A;
  volatile uint32_t FDCAN_RXESC;
  volatile uint32_t FDCAN_TXBC;
  volatile const uint32_t FDCAN_TXFQS;
  volatile uint32_t FDCAN_TXESC;
  volatile const uint32_t FDCAN_TXBRP;
  volatile uint32_t FDCAN_TXBAR;
  volatile uint32_t FDCAN_TXBCR;
  volatile uint32_t FDCAN_TXBTO;
  volatile const uint32_t FDCAN_TXBCF;
  volatile uint32_t FDCAN_TXBTIE;
  volatile uint32_t FDCAN_TXBCIE;
  const volatile uint32_t RESERVED240[2];
  volatile uint32_t FDCAN_TXEFC;
  volatile uint32_t FDCAN_TXEFS;
  volatile uint32_t FDCAN_TXEFA;
  const volatile uint32_t RESERVED256[1];
  volatile uint32_t FDCAN_TTTMC;
  volatile uint32_t FDCAN_TTRMC;
  volatile uint32_t FDCAN_TTOCF;
  volatile uint32_t FDCAN_TTMLM;
  volatile uint32_t FDCAN_TURCF;
  volatile uint32_t FDCAN_TTOCN;
  volatile uint32_t CAN_TTGTP;
  volatile uint32_t FDCAN_TTTMK;
  volatile uint32_t FDCAN_TTIR;
  volatile uint32_t FDCAN_TTIE;
  volatile uint32_t FDCAN_TTILS;
  volatile uint32_t FDCAN_TTOST;
  volatile const uint32_t FDCAN_TURNA;
  volatile const uint32_t FDCAN_TTLGT;
  volatile const uint32_t FDCAN_TTCTC;
  volatile const uint32_t FDCAN_TTCPT;
  volatile const uint32_t FDCAN_TTCSM;
  const volatile uint32_t RESERVED768[111];
  volatile uint32_t FDCAN_TTTS;
};
#define FDCAN2_FDCAN_CREL_REL          (0xFUL << 28) 
#define FDCAN2_FDCAN_CREL_REL_VAL(X) (((uint32_t)(X) & 0xFUL) << 28)
#define FDCAN2_FDCAN_CREL_STEP          (0xFUL << 24) 
#define FDCAN2_FDCAN_CREL_STEP_VAL(X) (((uint32_t)(X) & 0xFUL) << 24)
#define FDCAN2_FDCAN_CREL_SUBSTEP          (0xFUL << 20) 
#define FDCAN2_FDCAN_CREL_SUBSTEP_VAL(X) (((uint32_t)(X) & 0xFUL) << 20)
#define FDCAN2_FDCAN_CREL_YEAR          (0xFUL << 16) 
#define FDCAN2_FDCAN_CREL_YEAR_VAL(X) (((uint32_t)(X) & 0xFUL) << 16)
#define FDCAN2_FDCAN_CREL_MON          (0xFFUL << 8) 
#define FDCAN2_FDCAN_CREL_MON_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define FDCAN2_FDCAN_CREL_DAY          (0xFFUL << 0) 
#define FDCAN2_FDCAN_CREL_DAY_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define FDCAN2_FDCAN_ENDN_ETV          (0xFFFFFFFFUL << 0) 
#define FDCAN2_FDCAN_ENDN_ETV_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define FDCAN2_FDCAN_DBTP_DSJW          (0xFUL << 0) 
#define FDCAN2_FDCAN_DBTP_DSJW_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define FDCAN2_FDCAN_DBTP_DTSEG2          (0xFUL << 4) 
#define FDCAN2_FDCAN_DBTP_DTSEG2_VAL(X) (((uint32_t)(X) & 0xFUL) << 4)
#define FDCAN2_FDCAN_DBTP_DTSEG1          (0x1FUL << 8) 
#define FDCAN2_FDCAN_DBTP_DTSEG1_VAL(X) (((uint32_t)(X) & 0x1FUL) << 8)
#define FDCAN2_FDCAN_DBTP_DBRP          (0x1FUL << 16) 
#define FDCAN2_FDCAN_DBTP_DBRP_VAL(X) (((uint32_t)(X) & 0x1FUL) << 16)
#define FDCAN2_FDCAN_DBTP_TDC          (0x1UL << 23) 
#define FDCAN2_FDCAN_DBTP_TDC_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define FDCAN2_FDCAN_TEST_LBCK          (0x1UL << 4) 
#define FDCAN2_FDCAN_TEST_LBCK_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define FDCAN2_FDCAN_TEST_TX          (0x3UL << 5) 
#define FDCAN2_FDCAN_TEST_TX_VAL(X) (((uint32_t)(X) & 0x3UL) << 5)
#define FDCAN2_FDCAN_TEST_RX          (0x1UL << 7) 
#define FDCAN2_FDCAN_TEST_RX_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define FDCAN2_FDCAN_RWD_WDV          (0xFFUL << 8) 
#define FDCAN2_FDCAN_RWD_WDV_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define FDCAN2_FDCAN_RWD_WDC          (0xFFUL << 0) 
#define FDCAN2_FDCAN_RWD_WDC_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define FDCAN2_FDCAN_CCCR_INIT          (0x1UL << 0) 
#define FDCAN2_FDCAN_CCCR_INIT_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define FDCAN2_FDCAN_CCCR_CCE          (0x1UL << 1) 
#define FDCAN2_FDCAN_CCCR_CCE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define FDCAN2_FDCAN_CCCR_ASM          (0x1UL << 2) 
#define FDCAN2_FDCAN_CCCR_ASM_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define FDCAN2_FDCAN_CCCR_CSA          (0x1UL << 3) 
#define FDCAN2_FDCAN_CCCR_CSA_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define FDCAN2_FDCAN_CCCR_CSR          (0x1UL << 4) 
#define FDCAN2_FDCAN_CCCR_CSR_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define FDCAN2_FDCAN_CCCR_MON          (0x1UL << 5) 
#define FDCAN2_FDCAN_CCCR_MON_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define FDCAN2_FDCAN_CCCR_DAR          (0x1UL << 6) 
#define FDCAN2_FDCAN_CCCR_DAR_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define FDCAN2_FDCAN_CCCR_TEST          (0x1UL << 7) 
#define FDCAN2_FDCAN_CCCR_TEST_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define FDCAN2_FDCAN_CCCR_FDOE          (0x1UL << 8) 
#define FDCAN2_FDCAN_CCCR_FDOE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define FDCAN2_FDCAN_CCCR_BSE          (0x1UL << 9) 
#define FDCAN2_FDCAN_CCCR_BSE_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define FDCAN2_FDCAN_CCCR_PXHD          (0x1UL << 12) 
#define FDCAN2_FDCAN_CCCR_PXHD_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define FDCAN2_FDCAN_CCCR_EFBI          (0x1UL << 13) 
#define FDCAN2_FDCAN_CCCR_EFBI_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define FDCAN2_FDCAN_CCCR_TXP          (0x1UL << 14) 
#define FDCAN2_FDCAN_CCCR_TXP_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define FDCAN2_FDCAN_CCCR_NISO          (0x1UL << 15) 
#define FDCAN2_FDCAN_CCCR_NISO_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define FDCAN2_FDCAN_NBTP_NSJW          (0x7FUL << 25) 
#define FDCAN2_FDCAN_NBTP_NSJW_VAL(X) (((uint32_t)(X) & 0x7FUL) << 25)
#define FDCAN2_FDCAN_NBTP_NBRP          (0x1FFUL << 16) 
#define FDCAN2_FDCAN_NBTP_NBRP_VAL(X) (((uint32_t)(X) & 0x1FFUL) << 16)
#define FDCAN2_FDCAN_NBTP_NTSEG1          (0xFFUL << 8) 
#define FDCAN2_FDCAN_NBTP_NTSEG1_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define FDCAN2_FDCAN_NBTP_TSEG2          (0x7FUL << 0) 
#define FDCAN2_FDCAN_NBTP_TSEG2_VAL(X) (((uint32_t)(X) & 0x7FUL) << 0)
#define FDCAN2_FDCAN_TSCC_TCP          (0xFUL << 16) 
#define FDCAN2_FDCAN_TSCC_TCP_VAL(X) (((uint32_t)(X) & 0xFUL) << 16)
#define FDCAN2_FDCAN_TSCC_TSS          (0x3UL << 0) 
#define FDCAN2_FDCAN_TSCC_TSS_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define FDCAN2_FDCAN_TSCV_TSC          (0xFFFFUL << 0) 
#define FDCAN2_FDCAN_TSCV_TSC_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define FDCAN2_FDCAN_TOCC_ETOC          (0x1UL << 0) 
#define FDCAN2_FDCAN_TOCC_ETOC_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define FDCAN2_FDCAN_TOCC_TOS          (0x3UL << 1) 
#define FDCAN2_FDCAN_TOCC_TOS_VAL(X) (((uint32_t)(X) & 0x3UL) << 1)
#define FDCAN2_FDCAN_TOCC_TOP          (0xFFFFUL << 16) 
#define FDCAN2_FDCAN_TOCC_TOP_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define FDCAN2_FDCAN_TOCV_TOC          (0xFFFFUL << 0) 
#define FDCAN2_FDCAN_TOCV_TOC_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define FDCAN2_FDCAN_ECR_CEL          (0xFFUL << 16) 
#define FDCAN2_FDCAN_ECR_CEL_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define FDCAN2_FDCAN_ECR_RP          (0x1UL << 15) 
#define FDCAN2_FDCAN_ECR_RP_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define FDCAN2_FDCAN_ECR_TREC          (0x7FUL << 8) 
#define FDCAN2_FDCAN_ECR_TREC_VAL(X) (((uint32_t)(X) & 0x7FUL) << 8)
#define FDCAN2_FDCAN_ECR_TEC          (0xFFUL << 0) 
#define FDCAN2_FDCAN_ECR_TEC_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define FDCAN2_FDCAN_PSR_LEC          (0x7UL << 0) 
#define FDCAN2_FDCAN_PSR_LEC_VAL(X) (((uint32_t)(X) & 0x7UL) << 0)
#define FDCAN2_FDCAN_PSR_ACT          (0x3UL << 3) 
#define FDCAN2_FDCAN_PSR_ACT_VAL(X) (((uint32_t)(X) & 0x3UL) << 3)
#define FDCAN2_FDCAN_PSR_EP          (0x1UL << 5) 
#define FDCAN2_FDCAN_PSR_EP_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define FDCAN2_FDCAN_PSR_EW          (0x1UL << 6) 
#define FDCAN2_FDCAN_PSR_EW_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define FDCAN2_FDCAN_PSR_BO          (0x1UL << 7) 
#define FDCAN2_FDCAN_PSR_BO_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define FDCAN2_FDCAN_PSR_DLEC          (0x7UL << 8) 
#define FDCAN2_FDCAN_PSR_DLEC_VAL(X) (((uint32_t)(X) & 0x7UL) << 8)
#define FDCAN2_FDCAN_PSR_RESI          (0x1UL << 11) 
#define FDCAN2_FDCAN_PSR_RESI_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define FDCAN2_FDCAN_PSR_RBRS          (0x1UL << 12) 
#define FDCAN2_FDCAN_PSR_RBRS_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define FDCAN2_FDCAN_PSR_REDL          (0x1UL << 13) 
#define FDCAN2_FDCAN_PSR_REDL_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define FDCAN2_FDCAN_PSR_PXE          (0x1UL << 14) 
#define FDCAN2_FDCAN_PSR_PXE_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define FDCAN2_FDCAN_PSR_TDCV          (0x7FUL << 16) 
#define FDCAN2_FDCAN_PSR_TDCV_VAL(X) (((uint32_t)(X) & 0x7FUL) << 16)
#define FDCAN2_FDCAN_TDCR_TDCF          (0x7FUL << 0) 
#define FDCAN2_FDCAN_TDCR_TDCF_VAL(X) (((uint32_t)(X) & 0x7FUL) << 0)
#define FDCAN2_FDCAN_TDCR_TDCO          (0x7FUL << 8) 
#define FDCAN2_FDCAN_TDCR_TDCO_VAL(X) (((uint32_t)(X) & 0x7FUL) << 8)
#define FDCAN2_FDCAN_IR_RF0N          (0x1UL << 0) 
#define FDCAN2_FDCAN_IR_RF0N_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define FDCAN2_FDCAN_IR_RF0W          (0x1UL << 1) 
#define FDCAN2_FDCAN_IR_RF0W_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define FDCAN2_FDCAN_IR_RF0F          (0x1UL << 2) 
#define FDCAN2_FDCAN_IR_RF0F_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define FDCAN2_FDCAN_IR_RF0L          (0x1UL << 3) 
#define FDCAN2_FDCAN_IR_RF0L_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define FDCAN2_FDCAN_IR_RF1N          (0x1UL << 4) 
#define FDCAN2_FDCAN_IR_RF1N_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define FDCAN2_FDCAN_IR_RF1W          (0x1UL << 5) 
#define FDCAN2_FDCAN_IR_RF1W_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define FDCAN2_FDCAN_IR_RF1F          (0x1UL << 6) 
#define FDCAN2_FDCAN_IR_RF1F_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define FDCAN2_FDCAN_IR_RF1L          (0x1UL << 7) 
#define FDCAN2_FDCAN_IR_RF1L_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define FDCAN2_FDCAN_IR_HPM          (0x1UL << 8) 
#define FDCAN2_FDCAN_IR_HPM_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define FDCAN2_FDCAN_IR_TC          (0x1UL << 9) 
#define FDCAN2_FDCAN_IR_TC_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define FDCAN2_FDCAN_IR_TCF          (0x1UL << 10) 
#define FDCAN2_FDCAN_IR_TCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define FDCAN2_FDCAN_IR_TEF          (0x1UL << 11) 
#define FDCAN2_FDCAN_IR_TEF_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define FDCAN2_FDCAN_IR_TEFN          (0x1UL << 12) 
#define FDCAN2_FDCAN_IR_TEFN_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define FDCAN2_FDCAN_IR_TEFW          (0x1UL << 13) 
#define FDCAN2_FDCAN_IR_TEFW_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define FDCAN2_FDCAN_IR_TEFF          (0x1UL << 14) 
#define FDCAN2_FDCAN_IR_TEFF_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define FDCAN2_FDCAN_IR_TEFL          (0x1UL << 15) 
#define FDCAN2_FDCAN_IR_TEFL_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define FDCAN2_FDCAN_IR_TSW          (0x1UL << 16) 
#define FDCAN2_FDCAN_IR_TSW_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define FDCAN2_FDCAN_IR_MRAF          (0x1UL << 17) 
#define FDCAN2_FDCAN_IR_MRAF_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define FDCAN2_FDCAN_IR_TOO          (0x1UL << 18) 
#define FDCAN2_FDCAN_IR_TOO_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define FDCAN2_FDCAN_IR_DRX          (0x1UL << 19) 
#define FDCAN2_FDCAN_IR_DRX_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define FDCAN2_FDCAN_IR_ELO          (0x1UL << 22) 
#define FDCAN2_FDCAN_IR_ELO_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define FDCAN2_FDCAN_IR_EP          (0x1UL << 23) 
#define FDCAN2_FDCAN_IR_EP_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define FDCAN2_FDCAN_IR_EW          (0x1UL << 24) 
#define FDCAN2_FDCAN_IR_EW_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define FDCAN2_FDCAN_IR_BO          (0x1UL << 25) 
#define FDCAN2_FDCAN_IR_BO_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define FDCAN2_FDCAN_IR_WDI          (0x1UL << 26) 
#define FDCAN2_FDCAN_IR_WDI_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define FDCAN2_FDCAN_IR_PEA          (0x1UL << 27) 
#define FDCAN2_FDCAN_IR_PEA_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define FDCAN2_FDCAN_IR_PED          (0x1UL << 28) 
#define FDCAN2_FDCAN_IR_PED_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define FDCAN2_FDCAN_IR_ARA          (0x1UL << 29) 
#define FDCAN2_FDCAN_IR_ARA_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define FDCAN2_FDCAN_IE_RF0NE          (0x1UL << 0) 
#define FDCAN2_FDCAN_IE_RF0NE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define FDCAN2_FDCAN_IE_RF0WE          (0x1UL << 1) 
#define FDCAN2_FDCAN_IE_RF0WE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define FDCAN2_FDCAN_IE_RF0FE          (0x1UL << 2) 
#define FDCAN2_FDCAN_IE_RF0FE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define FDCAN2_FDCAN_IE_RF0LE          (0x1UL << 3) 
#define FDCAN2_FDCAN_IE_RF0LE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define FDCAN2_FDCAN_IE_RF1NE          (0x1UL << 4) 
#define FDCAN2_FDCAN_IE_RF1NE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define FDCAN2_FDCAN_IE_RF1WE          (0x1UL << 5) 
#define FDCAN2_FDCAN_IE_RF1WE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define FDCAN2_FDCAN_IE_RF1FE          (0x1UL << 6) 
#define FDCAN2_FDCAN_IE_RF1FE_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define FDCAN2_FDCAN_IE_RF1LE          (0x1UL << 7) 
#define FDCAN2_FDCAN_IE_RF1LE_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define FDCAN2_FDCAN_IE_HPME          (0x1UL << 8) 
#define FDCAN2_FDCAN_IE_HPME_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define FDCAN2_FDCAN_IE_TCE          (0x1UL << 9) 
#define FDCAN2_FDCAN_IE_TCE_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define FDCAN2_FDCAN_IE_TCFE          (0x1UL << 10) 
#define FDCAN2_FDCAN_IE_TCFE_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define FDCAN2_FDCAN_IE_TEFE          (0x1UL << 11) 
#define FDCAN2_FDCAN_IE_TEFE_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define FDCAN2_FDCAN_IE_TEFNE          (0x1UL << 12) 
#define FDCAN2_FDCAN_IE_TEFNE_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define FDCAN2_FDCAN_IE_TEFWE          (0x1UL << 13) 
#define FDCAN2_FDCAN_IE_TEFWE_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define FDCAN2_FDCAN_IE_TEFFE          (0x1UL << 14) 
#define FDCAN2_FDCAN_IE_TEFFE_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define FDCAN2_FDCAN_IE_TEFLE          (0x1UL << 15) 
#define FDCAN2_FDCAN_IE_TEFLE_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define FDCAN2_FDCAN_IE_TSWE          (0x1UL << 16) 
#define FDCAN2_FDCAN_IE_TSWE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define FDCAN2_FDCAN_IE_MRAFE          (0x1UL << 17) 
#define FDCAN2_FDCAN_IE_MRAFE_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define FDCAN2_FDCAN_IE_TOOE          (0x1UL << 18) 
#define FDCAN2_FDCAN_IE_TOOE_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define FDCAN2_FDCAN_IE_DRXE          (0x1UL << 19) 
#define FDCAN2_FDCAN_IE_DRXE_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define FDCAN2_FDCAN_IE_BECE          (0x1UL << 20) 
#define FDCAN2_FDCAN_IE_BECE_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define FDCAN2_FDCAN_IE_BEUE          (0x1UL << 21) 
#define FDCAN2_FDCAN_IE_BEUE_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define FDCAN2_FDCAN_IE_ELOE          (0x1UL << 22) 
#define FDCAN2_FDCAN_IE_ELOE_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define FDCAN2_FDCAN_IE_EPE          (0x1UL << 23) 
#define FDCAN2_FDCAN_IE_EPE_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define FDCAN2_FDCAN_IE_EWE          (0x1UL << 24) 
#define FDCAN2_FDCAN_IE_EWE_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define FDCAN2_FDCAN_IE_BOE          (0x1UL << 25) 
#define FDCAN2_FDCAN_IE_BOE_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define FDCAN2_FDCAN_IE_WDIE          (0x1UL << 26) 
#define FDCAN2_FDCAN_IE_WDIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define FDCAN2_FDCAN_IE_PEAE          (0x1UL << 27) 
#define FDCAN2_FDCAN_IE_PEAE_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define FDCAN2_FDCAN_IE_PEDE          (0x1UL << 28) 
#define FDCAN2_FDCAN_IE_PEDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define FDCAN2_FDCAN_IE_ARAE          (0x1UL << 29) 
#define FDCAN2_FDCAN_IE_ARAE_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define FDCAN2_FDCAN_ILS_RF0NL          (0x1UL << 0) 
#define FDCAN2_FDCAN_ILS_RF0NL_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define FDCAN2_FDCAN_ILS_RF0WL          (0x1UL << 1) 
#define FDCAN2_FDCAN_ILS_RF0WL_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define FDCAN2_FDCAN_ILS_RF0FL          (0x1UL << 2) 
#define FDCAN2_FDCAN_ILS_RF0FL_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define FDCAN2_FDCAN_ILS_RF0LL          (0x1UL << 3) 
#define FDCAN2_FDCAN_ILS_RF0LL_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define FDCAN2_FDCAN_ILS_RF1NL          (0x1UL << 4) 
#define FDCAN2_FDCAN_ILS_RF1NL_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define FDCAN2_FDCAN_ILS_RF1WL          (0x1UL << 5) 
#define FDCAN2_FDCAN_ILS_RF1WL_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define FDCAN2_FDCAN_ILS_RF1FL          (0x1UL << 6) 
#define FDCAN2_FDCAN_ILS_RF1FL_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define FDCAN2_FDCAN_ILS_RF1LL          (0x1UL << 7) 
#define FDCAN2_FDCAN_ILS_RF1LL_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define FDCAN2_FDCAN_ILS_HPML          (0x1UL << 8) 
#define FDCAN2_FDCAN_ILS_HPML_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define FDCAN2_FDCAN_ILS_TCL          (0x1UL << 9) 
#define FDCAN2_FDCAN_ILS_TCL_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define FDCAN2_FDCAN_ILS_TCFL          (0x1UL << 10) 
#define FDCAN2_FDCAN_ILS_TCFL_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define FDCAN2_FDCAN_ILS_TEFL          (0x1UL << 11) 
#define FDCAN2_FDCAN_ILS_TEFL_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define FDCAN2_FDCAN_ILS_TEFNL          (0x1UL << 12) 
#define FDCAN2_FDCAN_ILS_TEFNL_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define FDCAN2_FDCAN_ILS_TEFWL          (0x1UL << 13) 
#define FDCAN2_FDCAN_ILS_TEFWL_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define FDCAN2_FDCAN_ILS_TEFFL          (0x1UL << 14) 
#define FDCAN2_FDCAN_ILS_TEFFL_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define FDCAN2_FDCAN_ILS_TEFLL          (0x1UL << 15) 
#define FDCAN2_FDCAN_ILS_TEFLL_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define FDCAN2_FDCAN_ILS_TSWL          (0x1UL << 16) 
#define FDCAN2_FDCAN_ILS_TSWL_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define FDCAN2_FDCAN_ILS_MRAFL          (0x1UL << 17) 
#define FDCAN2_FDCAN_ILS_MRAFL_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define FDCAN2_FDCAN_ILS_TOOL          (0x1UL << 18) 
#define FDCAN2_FDCAN_ILS_TOOL_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define FDCAN2_FDCAN_ILS_DRXL          (0x1UL << 19) 
#define FDCAN2_FDCAN_ILS_DRXL_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define FDCAN2_FDCAN_ILS_BECL          (0x1UL << 20) 
#define FDCAN2_FDCAN_ILS_BECL_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define FDCAN2_FDCAN_ILS_BEUL          (0x1UL << 21) 
#define FDCAN2_FDCAN_ILS_BEUL_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define FDCAN2_FDCAN_ILS_ELOL          (0x1UL << 22) 
#define FDCAN2_FDCAN_ILS_ELOL_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define FDCAN2_FDCAN_ILS_EPL          (0x1UL << 23) 
#define FDCAN2_FDCAN_ILS_EPL_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define FDCAN2_FDCAN_ILS_EWL          (0x1UL << 24) 
#define FDCAN2_FDCAN_ILS_EWL_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define FDCAN2_FDCAN_ILS_BOL          (0x1UL << 25) 
#define FDCAN2_FDCAN_ILS_BOL_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define FDCAN2_FDCAN_ILS_WDIL          (0x1UL << 26) 
#define FDCAN2_FDCAN_ILS_WDIL_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define FDCAN2_FDCAN_ILS_PEAL          (0x1UL << 27) 
#define FDCAN2_FDCAN_ILS_PEAL_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define FDCAN2_FDCAN_ILS_PEDL          (0x1UL << 28) 
#define FDCAN2_FDCAN_ILS_PEDL_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define FDCAN2_FDCAN_ILS_ARAL          (0x1UL << 29) 
#define FDCAN2_FDCAN_ILS_ARAL_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define FDCAN2_FDCAN_ILE_EINT0          (0x1UL << 0) 
#define FDCAN2_FDCAN_ILE_EINT0_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define FDCAN2_FDCAN_ILE_EINT1          (0x1UL << 1) 
#define FDCAN2_FDCAN_ILE_EINT1_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define FDCAN2_FDCAN_GFC_RRFE          (0x1UL << 0) 
#define FDCAN2_FDCAN_GFC_RRFE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define FDCAN2_FDCAN_GFC_RRFS          (0x1UL << 1) 
#define FDCAN2_FDCAN_GFC_RRFS_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define FDCAN2_FDCAN_GFC_ANFE          (0x3UL << 2) 
#define FDCAN2_FDCAN_GFC_ANFE_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define FDCAN2_FDCAN_GFC_ANFS          (0x3UL << 4) 
#define FDCAN2_FDCAN_GFC_ANFS_VAL(X) (((uint32_t)(X) & 0x3UL) << 4)
#define FDCAN2_FDCAN_SIDFC_FLSSA          (0x3FFFUL << 2) 
#define FDCAN2_FDCAN_SIDFC_FLSSA_VAL(X) (((uint32_t)(X) & 0x3FFFUL) << 2)
#define FDCAN2_FDCAN_SIDFC_LSS          (0xFFUL << 16) 
#define FDCAN2_FDCAN_SIDFC_LSS_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define FDCAN2_FDCAN_XIDFC_FLESA          (0x3FFFUL << 2) 
#define FDCAN2_FDCAN_XIDFC_FLESA_VAL(X) (((uint32_t)(X) & 0x3FFFUL) << 2)
#define FDCAN2_FDCAN_XIDFC_LSE          (0xFFUL << 16) 
#define FDCAN2_FDCAN_XIDFC_LSE_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define FDCAN2_FDCAN_XIDAM_EIDM          (0x1FFFFFFFUL << 0) 
#define FDCAN2_FDCAN_XIDAM_EIDM_VAL(X) (((uint32_t)(X) & 0x1FFFFFFFUL) << 0)
#define FDCAN2_FDCAN_HPMS_BIDX          (0x3FUL << 0) 
#define FDCAN2_FDCAN_HPMS_BIDX_VAL(X) (((uint32_t)(X) & 0x3FUL) << 0)
#define FDCAN2_FDCAN_HPMS_MSI          (0x3UL << 6) 
#define FDCAN2_FDCAN_HPMS_MSI_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define FDCAN2_FDCAN_HPMS_FIDX          (0x7FUL << 8) 
#define FDCAN2_FDCAN_HPMS_FIDX_VAL(X) (((uint32_t)(X) & 0x7FUL) << 8)
#define FDCAN2_FDCAN_HPMS_FLST          (0x1UL << 15) 
#define FDCAN2_FDCAN_HPMS_FLST_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define FDCAN2_FDCAN_NDAT1_ND0          (0x1UL << 0) 
#define FDCAN2_FDCAN_NDAT1_ND0_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define FDCAN2_FDCAN_NDAT1_ND1          (0x1UL << 1) 
#define FDCAN2_FDCAN_NDAT1_ND1_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define FDCAN2_FDCAN_NDAT1_ND2          (0x1UL << 2) 
#define FDCAN2_FDCAN_NDAT1_ND2_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define FDCAN2_FDCAN_NDAT1_ND3          (0x1UL << 3) 
#define FDCAN2_FDCAN_NDAT1_ND3_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
