via/viaems/src/platforms/stm32h743/device.h
#define FDCAN2_FDCAN_NDAT1_ND4          (0x1UL << 4) 
#define FDCAN2_FDCAN_NDAT1_ND4_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define FDCAN2_FDCAN_NDAT1_ND5          (0x1UL << 5) 
#define FDCAN2_FDCAN_NDAT1_ND5_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define FDCAN2_FDCAN_NDAT1_ND6          (0x1UL << 6) 
#define FDCAN2_FDCAN_NDAT1_ND6_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define FDCAN2_FDCAN_NDAT1_ND7          (0x1UL << 7) 
#define FDCAN2_FDCAN_NDAT1_ND7_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define FDCAN2_FDCAN_NDAT1_ND8          (0x1UL << 8) 
#define FDCAN2_FDCAN_NDAT1_ND8_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define FDCAN2_FDCAN_NDAT1_ND9          (0x1UL << 9) 
#define FDCAN2_FDCAN_NDAT1_ND9_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define FDCAN2_FDCAN_NDAT1_ND10          (0x1UL << 10) 
#define FDCAN2_FDCAN_NDAT1_ND10_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define FDCAN2_FDCAN_NDAT1_ND11          (0x1UL << 11) 
#define FDCAN2_FDCAN_NDAT1_ND11_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define FDCAN2_FDCAN_NDAT1_ND12          (0x1UL << 12) 
#define FDCAN2_FDCAN_NDAT1_ND12_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define FDCAN2_FDCAN_NDAT1_ND13          (0x1UL << 13) 
#define FDCAN2_FDCAN_NDAT1_ND13_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define FDCAN2_FDCAN_NDAT1_ND14          (0x1UL << 14) 
#define FDCAN2_FDCAN_NDAT1_ND14_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define FDCAN2_FDCAN_NDAT1_ND15          (0x1UL << 15) 
#define FDCAN2_FDCAN_NDAT1_ND15_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define FDCAN2_FDCAN_NDAT1_ND16          (0x1UL << 16) 
#define FDCAN2_FDCAN_NDAT1_ND16_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define FDCAN2_FDCAN_NDAT1_ND17          (0x1UL << 17) 
#define FDCAN2_FDCAN_NDAT1_ND17_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define FDCAN2_FDCAN_NDAT1_ND18          (0x1UL << 18) 
#define FDCAN2_FDCAN_NDAT1_ND18_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define FDCAN2_FDCAN_NDAT1_ND19          (0x1UL << 19) 
#define FDCAN2_FDCAN_NDAT1_ND19_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define FDCAN2_FDCAN_NDAT1_ND20          (0x1UL << 20) 
#define FDCAN2_FDCAN_NDAT1_ND20_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define FDCAN2_FDCAN_NDAT1_ND21          (0x1UL << 21) 
#define FDCAN2_FDCAN_NDAT1_ND21_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define FDCAN2_FDCAN_NDAT1_ND22          (0x1UL << 22) 
#define FDCAN2_FDCAN_NDAT1_ND22_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define FDCAN2_FDCAN_NDAT1_ND23          (0x1UL << 23) 
#define FDCAN2_FDCAN_NDAT1_ND23_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define FDCAN2_FDCAN_NDAT1_ND24          (0x1UL << 24) 
#define FDCAN2_FDCAN_NDAT1_ND24_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define FDCAN2_FDCAN_NDAT1_ND25          (0x1UL << 25) 
#define FDCAN2_FDCAN_NDAT1_ND25_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define FDCAN2_FDCAN_NDAT1_ND26          (0x1UL << 26) 
#define FDCAN2_FDCAN_NDAT1_ND26_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define FDCAN2_FDCAN_NDAT1_ND27          (0x1UL << 27) 
#define FDCAN2_FDCAN_NDAT1_ND27_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define FDCAN2_FDCAN_NDAT1_ND28          (0x1UL << 28) 
#define FDCAN2_FDCAN_NDAT1_ND28_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define FDCAN2_FDCAN_NDAT1_ND29          (0x1UL << 29) 
#define FDCAN2_FDCAN_NDAT1_ND29_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define FDCAN2_FDCAN_NDAT1_ND30          (0x1UL << 30) 
#define FDCAN2_FDCAN_NDAT1_ND30_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define FDCAN2_FDCAN_NDAT1_ND31          (0x1UL << 31) 
#define FDCAN2_FDCAN_NDAT1_ND31_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define FDCAN2_FDCAN_NDAT2_ND32          (0x1UL << 0) 
#define FDCAN2_FDCAN_NDAT2_ND32_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define FDCAN2_FDCAN_NDAT2_ND33          (0x1UL << 1) 
#define FDCAN2_FDCAN_NDAT2_ND33_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define FDCAN2_FDCAN_NDAT2_ND34          (0x1UL << 2) 
#define FDCAN2_FDCAN_NDAT2_ND34_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define FDCAN2_FDCAN_NDAT2_ND35          (0x1UL << 3) 
#define FDCAN2_FDCAN_NDAT2_ND35_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define FDCAN2_FDCAN_NDAT2_ND36          (0x1UL << 4) 
#define FDCAN2_FDCAN_NDAT2_ND36_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define FDCAN2_FDCAN_NDAT2_ND37          (0x1UL << 5) 
#define FDCAN2_FDCAN_NDAT2_ND37_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define FDCAN2_FDCAN_NDAT2_ND38          (0x1UL << 6) 
#define FDCAN2_FDCAN_NDAT2_ND38_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define FDCAN2_FDCAN_NDAT2_ND39          (0x1UL << 7) 
#define FDCAN2_FDCAN_NDAT2_ND39_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define FDCAN2_FDCAN_NDAT2_ND40          (0x1UL << 8) 
#define FDCAN2_FDCAN_NDAT2_ND40_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define FDCAN2_FDCAN_NDAT2_ND41          (0x1UL << 9) 
#define FDCAN2_FDCAN_NDAT2_ND41_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define FDCAN2_FDCAN_NDAT2_ND42          (0x1UL << 10) 
#define FDCAN2_FDCAN_NDAT2_ND42_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define FDCAN2_FDCAN_NDAT2_ND43          (0x1UL << 11) 
#define FDCAN2_FDCAN_NDAT2_ND43_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define FDCAN2_FDCAN_NDAT2_ND44          (0x1UL << 12) 
#define FDCAN2_FDCAN_NDAT2_ND44_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define FDCAN2_FDCAN_NDAT2_ND45          (0x1UL << 13) 
#define FDCAN2_FDCAN_NDAT2_ND45_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define FDCAN2_FDCAN_NDAT2_ND46          (0x1UL << 14) 
#define FDCAN2_FDCAN_NDAT2_ND46_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define FDCAN2_FDCAN_NDAT2_ND47          (0x1UL << 15) 
#define FDCAN2_FDCAN_NDAT2_ND47_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define FDCAN2_FDCAN_NDAT2_ND48          (0x1UL << 16) 
#define FDCAN2_FDCAN_NDAT2_ND48_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define FDCAN2_FDCAN_NDAT2_ND49          (0x1UL << 17) 
#define FDCAN2_FDCAN_NDAT2_ND49_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define FDCAN2_FDCAN_NDAT2_ND50          (0x1UL << 18) 
#define FDCAN2_FDCAN_NDAT2_ND50_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define FDCAN2_FDCAN_NDAT2_ND51          (0x1UL << 19) 
#define FDCAN2_FDCAN_NDAT2_ND51_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define FDCAN2_FDCAN_NDAT2_ND52          (0x1UL << 20) 
#define FDCAN2_FDCAN_NDAT2_ND52_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define FDCAN2_FDCAN_NDAT2_ND53          (0x1UL << 21) 
#define FDCAN2_FDCAN_NDAT2_ND53_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define FDCAN2_FDCAN_NDAT2_ND54          (0x1UL << 22) 
#define FDCAN2_FDCAN_NDAT2_ND54_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define FDCAN2_FDCAN_NDAT2_ND55          (0x1UL << 23) 
#define FDCAN2_FDCAN_NDAT2_ND55_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define FDCAN2_FDCAN_NDAT2_ND56          (0x1UL << 24) 
#define FDCAN2_FDCAN_NDAT2_ND56_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define FDCAN2_FDCAN_NDAT2_ND57          (0x1UL << 25) 
#define FDCAN2_FDCAN_NDAT2_ND57_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define FDCAN2_FDCAN_NDAT2_ND58          (0x1UL << 26) 
#define FDCAN2_FDCAN_NDAT2_ND58_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define FDCAN2_FDCAN_NDAT2_ND59          (0x1UL << 27) 
#define FDCAN2_FDCAN_NDAT2_ND59_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define FDCAN2_FDCAN_NDAT2_ND60          (0x1UL << 28) 
#define FDCAN2_FDCAN_NDAT2_ND60_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define FDCAN2_FDCAN_NDAT2_ND61          (0x1UL << 29) 
#define FDCAN2_FDCAN_NDAT2_ND61_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define FDCAN2_FDCAN_NDAT2_ND62          (0x1UL << 30) 
#define FDCAN2_FDCAN_NDAT2_ND62_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define FDCAN2_FDCAN_NDAT2_ND63          (0x1UL << 31) 
#define FDCAN2_FDCAN_NDAT2_ND63_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define FDCAN2_FDCAN_RXF0C_F0SA          (0x3FFFUL << 2) 
#define FDCAN2_FDCAN_RXF0C_F0SA_VAL(X) (((uint32_t)(X) & 0x3FFFUL) << 2)
#define FDCAN2_FDCAN_RXF0C_F0S          (0xFFUL << 16) 
#define FDCAN2_FDCAN_RXF0C_F0S_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define FDCAN2_FDCAN_RXF0C_F0WM          (0xFFUL << 24) 
#define FDCAN2_FDCAN_RXF0C_F0WM_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define FDCAN2_FDCAN_RXF0S_F0FL          (0x7FUL << 0) 
#define FDCAN2_FDCAN_RXF0S_F0FL_VAL(X) (((uint32_t)(X) & 0x7FUL) << 0)
#define FDCAN2_FDCAN_RXF0S_F0G          (0x3FUL << 8) 
#define FDCAN2_FDCAN_RXF0S_F0G_VAL(X) (((uint32_t)(X) & 0x3FUL) << 8)
#define FDCAN2_FDCAN_RXF0S_F0P          (0x3FUL << 16) 
#define FDCAN2_FDCAN_RXF0S_F0P_VAL(X) (((uint32_t)(X) & 0x3FUL) << 16)
#define FDCAN2_FDCAN_RXF0S_F0F          (0x1UL << 24) 
#define FDCAN2_FDCAN_RXF0S_F0F_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define FDCAN2_FDCAN_RXF0S_RF0L          (0x1UL << 25) 
#define FDCAN2_FDCAN_RXF0S_RF0L_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define FDCAN2_FDCAN_RXF0A_FA01          (0x3FUL << 0) 
#define FDCAN2_FDCAN_RXF0A_FA01_VAL(X) (((uint32_t)(X) & 0x3FUL) << 0)
#define FDCAN2_FDCAN_RXBC_RBSA          (0x3FFFUL << 2) 
#define FDCAN2_FDCAN_RXBC_RBSA_VAL(X) (((uint32_t)(X) & 0x3FFFUL) << 2)
#define FDCAN2_FDCAN_RXF1C_F1SA          (0x3FFFUL << 2) 
#define FDCAN2_FDCAN_RXF1C_F1SA_VAL(X) (((uint32_t)(X) & 0x3FFFUL) << 2)
#define FDCAN2_FDCAN_RXF1C_F1S          (0x7FUL << 16) 
#define FDCAN2_FDCAN_RXF1C_F1S_VAL(X) (((uint32_t)(X) & 0x7FUL) << 16)
#define FDCAN2_FDCAN_RXF1C_F1WM          (0x7FUL << 24) 
#define FDCAN2_FDCAN_RXF1C_F1WM_VAL(X) (((uint32_t)(X) & 0x7FUL) << 24)
#define FDCAN2_FDCAN_RXF1S_F1FL          (0x7FUL << 0) 
#define FDCAN2_FDCAN_RXF1S_F1FL_VAL(X) (((uint32_t)(X) & 0x7FUL) << 0)
#define FDCAN2_FDCAN_RXF1S_F1GI          (0x7FUL << 8) 
#define FDCAN2_FDCAN_RXF1S_F1GI_VAL(X) (((uint32_t)(X) & 0x7FUL) << 8)
#define FDCAN2_FDCAN_RXF1S_F1PI          (0x7FUL << 16) 
#define FDCAN2_FDCAN_RXF1S_F1PI_VAL(X) (((uint32_t)(X) & 0x7FUL) << 16)
#define FDCAN2_FDCAN_RXF1S_F1F          (0x1UL << 24) 
#define FDCAN2_FDCAN_RXF1S_F1F_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define FDCAN2_FDCAN_RXF1S_RF1L          (0x1UL << 25) 
#define FDCAN2_FDCAN_RXF1S_RF1L_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define FDCAN2_FDCAN_RXF1S_DMS          (0x3UL << 30) 
#define FDCAN2_FDCAN_RXF1S_DMS_VAL(X) (((uint32_t)(X) & 0x3UL) << 30)
#define FDCAN2_FDCAN_RXF1A_F1AI          (0x3FUL << 0) 
#define FDCAN2_FDCAN_RXF1A_F1AI_VAL(X) (((uint32_t)(X) & 0x3FUL) << 0)
#define FDCAN2_FDCAN_RXESC_F0DS          (0x7UL << 0) 
#define FDCAN2_FDCAN_RXESC_F0DS_VAL(X) (((uint32_t)(X) & 0x7UL) << 0)
#define FDCAN2_FDCAN_RXESC_F1DS          (0x7UL << 4) 
#define FDCAN2_FDCAN_RXESC_F1DS_VAL(X) (((uint32_t)(X) & 0x7UL) << 4)
#define FDCAN2_FDCAN_RXESC_RBDS          (0x7UL << 8) 
#define FDCAN2_FDCAN_RXESC_RBDS_VAL(X) (((uint32_t)(X) & 0x7UL) << 8)
#define FDCAN2_FDCAN_TXBC_TBSA          (0x3FFFUL << 2) 
#define FDCAN2_FDCAN_TXBC_TBSA_VAL(X) (((uint32_t)(X) & 0x3FFFUL) << 2)
#define FDCAN2_FDCAN_TXBC_NDTB          (0x3FUL << 16) 
#define FDCAN2_FDCAN_TXBC_NDTB_VAL(X) (((uint32_t)(X) & 0x3FUL) << 16)
#define FDCAN2_FDCAN_TXBC_TFQS          (0x3FUL << 24) 
#define FDCAN2_FDCAN_TXBC_TFQS_VAL(X) (((uint32_t)(X) & 0x3FUL) << 24)
#define FDCAN2_FDCAN_TXBC_TFQM          (0x1UL << 30) 
#define FDCAN2_FDCAN_TXBC_TFQM_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define FDCAN2_FDCAN_TXFQS_TFFL          (0x3FUL << 0) 
#define FDCAN2_FDCAN_TXFQS_TFFL_VAL(X) (((uint32_t)(X) & 0x3FUL) << 0)
#define FDCAN2_FDCAN_TXFQS_TFGI          (0x1FUL << 8) 
#define FDCAN2_FDCAN_TXFQS_TFGI_VAL(X) (((uint32_t)(X) & 0x1FUL) << 8)
#define FDCAN2_FDCAN_TXFQS_TFQPI          (0x1FUL << 16) 
#define FDCAN2_FDCAN_TXFQS_TFQPI_VAL(X) (((uint32_t)(X) & 0x1FUL) << 16)
#define FDCAN2_FDCAN_TXFQS_TFQF          (0x1UL << 21) 
#define FDCAN2_FDCAN_TXFQS_TFQF_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define FDCAN2_FDCAN_TXESC_TBDS          (0x7UL << 0) 
#define FDCAN2_FDCAN_TXESC_TBDS_VAL(X) (((uint32_t)(X) & 0x7UL) << 0)
#define FDCAN2_FDCAN_TXBRP_TRP          (0xFFFFFFFFUL << 0) 
#define FDCAN2_FDCAN_TXBRP_TRP_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define FDCAN2_FDCAN_TXBAR_AR          (0xFFFFFFFFUL << 0) 
#define FDCAN2_FDCAN_TXBAR_AR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define FDCAN2_FDCAN_TXBCR_CR          (0xFFFFFFFFUL << 0) 
#define FDCAN2_FDCAN_TXBCR_CR_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define FDCAN2_FDCAN_TXBTO_TO          (0xFFFFFFFFUL << 0) 
#define FDCAN2_FDCAN_TXBTO_TO_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define FDCAN2_FDCAN_TXBCF_CF          (0xFFFFFFFFUL << 0) 
#define FDCAN2_FDCAN_TXBCF_CF_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define FDCAN2_FDCAN_TXBTIE_TIE          (0xFFFFFFFFUL << 0) 
#define FDCAN2_FDCAN_TXBTIE_TIE_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define FDCAN2_FDCAN_TXBCIE_CF          (0xFFFFFFFFUL << 0) 
#define FDCAN2_FDCAN_TXBCIE_CF_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define FDCAN2_FDCAN_TXEFC_EFSA          (0x3FFFUL << 2) 
#define FDCAN2_FDCAN_TXEFC_EFSA_VAL(X) (((uint32_t)(X) & 0x3FFFUL) << 2)
#define FDCAN2_FDCAN_TXEFC_EFS          (0x3FUL << 16) 
#define FDCAN2_FDCAN_TXEFC_EFS_VAL(X) (((uint32_t)(X) & 0x3FUL) << 16)
#define FDCAN2_FDCAN_TXEFC_EFWM          (0x3FUL << 24) 
#define FDCAN2_FDCAN_TXEFC_EFWM_VAL(X) (((uint32_t)(X) & 0x3FUL) << 24)
#define FDCAN2_FDCAN_TXEFS_EFFL          (0x3FUL << 0) 
#define FDCAN2_FDCAN_TXEFS_EFFL_VAL(X) (((uint32_t)(X) & 0x3FUL) << 0)
#define FDCAN2_FDCAN_TXEFS_EFGI          (0x1FUL << 8) 
#define FDCAN2_FDCAN_TXEFS_EFGI_VAL(X) (((uint32_t)(X) & 0x1FUL) << 8)
#define FDCAN2_FDCAN_TXEFS_EFF          (0x1UL << 24) 
#define FDCAN2_FDCAN_TXEFS_EFF_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define FDCAN2_FDCAN_TXEFS_TEFL          (0x1UL << 25) 
#define FDCAN2_FDCAN_TXEFS_TEFL_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define FDCAN2_FDCAN_TXEFA_EFAI          (0x1FUL << 0) 
#define FDCAN2_FDCAN_TXEFA_EFAI_VAL(X) (((uint32_t)(X) & 0x1FUL) << 0)
#define FDCAN2_FDCAN_TTTMC_TMSA          (0x3FFFUL << 2) 
#define FDCAN2_FDCAN_TTTMC_TMSA_VAL(X) (((uint32_t)(X) & 0x3FFFUL) << 2)
#define FDCAN2_FDCAN_TTTMC_TME          (0x7FUL << 16) 
#define FDCAN2_FDCAN_TTTMC_TME_VAL(X) (((uint32_t)(X) & 0x7FUL) << 16)
#define FDCAN2_FDCAN_TTRMC_RID          (0x1FFFFFFFUL << 0) 
#define FDCAN2_FDCAN_TTRMC_RID_VAL(X) (((uint32_t)(X) & 0x1FFFFFFFUL) << 0)
#define FDCAN2_FDCAN_TTRMC_XTD          (0x1UL << 30) 
#define FDCAN2_FDCAN_TTRMC_XTD_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define FDCAN2_FDCAN_TTRMC_RMPS          (0x1UL << 31) 
#define FDCAN2_FDCAN_TTRMC_RMPS_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define FDCAN2_FDCAN_TTOCF_OM          (0x3UL << 0) 
#define FDCAN2_FDCAN_TTOCF_OM_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define FDCAN2_FDCAN_TTOCF_GEN          (0x1UL << 3) 
#define FDCAN2_FDCAN_TTOCF_GEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define FDCAN2_FDCAN_TTOCF_TM          (0x1UL << 4) 
#define FDCAN2_FDCAN_TTOCF_TM_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define FDCAN2_FDCAN_TTOCF_LDSDL          (0x7UL << 5) 
#define FDCAN2_FDCAN_TTOCF_LDSDL_VAL(X) (((uint32_t)(X) & 0x7UL) << 5)
#define FDCAN2_FDCAN_TTOCF_IRTO          (0x7FUL << 8) 
#define FDCAN2_FDCAN_TTOCF_IRTO_VAL(X) (((uint32_t)(X) & 0x7FUL) << 8)
#define FDCAN2_FDCAN_TTOCF_EECS          (0x1UL << 15) 
#define FDCAN2_FDCAN_TTOCF_EECS_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define FDCAN2_FDCAN_TTOCF_AWL          (0xFFUL << 16) 
#define FDCAN2_FDCAN_TTOCF_AWL_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define FDCAN2_FDCAN_TTOCF_EGTF          (0x1UL << 24) 
#define FDCAN2_FDCAN_TTOCF_EGTF_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define FDCAN2_FDCAN_TTOCF_ECC          (0x1UL << 25) 
#define FDCAN2_FDCAN_TTOCF_ECC_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define FDCAN2_FDCAN_TTOCF_EVTP          (0x1UL << 26) 
#define FDCAN2_FDCAN_TTOCF_EVTP_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define FDCAN2_FDCAN_TTMLM_CCM          (0x3FUL << 0) 
#define FDCAN2_FDCAN_TTMLM_CCM_VAL(X) (((uint32_t)(X) & 0x3FUL) << 0)
#define FDCAN2_FDCAN_TTMLM_CSS          (0x3UL << 6) 
#define FDCAN2_FDCAN_TTMLM_CSS_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define FDCAN2_FDCAN_TTMLM_TXEW          (0xFUL << 8) 
#define FDCAN2_FDCAN_TTMLM_TXEW_VAL(X) (((uint32_t)(X) & 0xFUL) << 8)
#define FDCAN2_FDCAN_TTMLM_ENTT          (0xFFFUL << 16) 
#define FDCAN2_FDCAN_TTMLM_ENTT_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 16)
#define FDCAN2_FDCAN_TURCF_NCL          (0xFFFFUL << 0) 
#define FDCAN2_FDCAN_TURCF_NCL_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define FDCAN2_FDCAN_TURCF_DC          (0x3FFFUL << 16) 
#define FDCAN2_FDCAN_TURCF_DC_VAL(X) (((uint32_t)(X) & 0x3FFFUL) << 16)
#define FDCAN2_FDCAN_TURCF_ELT          (0x1UL << 31) 
#define FDCAN2_FDCAN_TURCF_ELT_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define FDCAN2_FDCAN_TTOCN_SGT          (0x1UL << 0) 
#define FDCAN2_FDCAN_TTOCN_SGT_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define FDCAN2_FDCAN_TTOCN_ECS          (0x1UL << 1) 
#define FDCAN2_FDCAN_TTOCN_ECS_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define FDCAN2_FDCAN_TTOCN_SWP          (0x1UL << 2) 
#define FDCAN2_FDCAN_TTOCN_SWP_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define FDCAN2_FDCAN_TTOCN_SWS          (0x3UL << 3) 
#define FDCAN2_FDCAN_TTOCN_SWS_VAL(X) (((uint32_t)(X) & 0x3UL) << 3)
#define FDCAN2_FDCAN_TTOCN_RTIE          (0x1UL << 5) 
#define FDCAN2_FDCAN_TTOCN_RTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define FDCAN2_FDCAN_TTOCN_TMC          (0x3UL << 6) 
#define FDCAN2_FDCAN_TTOCN_TMC_VAL(X) (((uint32_t)(X) & 0x3UL) << 6)
#define FDCAN2_FDCAN_TTOCN_TTIE          (0x1UL << 8) 
#define FDCAN2_FDCAN_TTOCN_TTIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define FDCAN2_FDCAN_TTOCN_GCS          (0x1UL << 9) 
#define FDCAN2_FDCAN_TTOCN_GCS_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define FDCAN2_FDCAN_TTOCN_FGP          (0x1UL << 10) 
#define FDCAN2_FDCAN_TTOCN_FGP_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define FDCAN2_FDCAN_TTOCN_TMG          (0x1UL << 11) 
#define FDCAN2_FDCAN_TTOCN_TMG_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define FDCAN2_FDCAN_TTOCN_NIG          (0x1UL << 12) 
#define FDCAN2_FDCAN_TTOCN_NIG_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define FDCAN2_FDCAN_TTOCN_ESCN          (0x1UL << 13) 
#define FDCAN2_FDCAN_TTOCN_ESCN_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define FDCAN2_FDCAN_TTOCN_LCKC          (0x1UL << 15) 
#define FDCAN2_FDCAN_TTOCN_LCKC_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define FDCAN2_CAN_TTGTP_NCL          (0xFFFFUL << 0) 
#define FDCAN2_CAN_TTGTP_NCL_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define FDCAN2_CAN_TTGTP_CTP          (0xFFFFUL << 16) 
#define FDCAN2_CAN_TTGTP_CTP_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define FDCAN2_FDCAN_TTTMK_TM          (0xFFFFUL << 0) 
#define FDCAN2_FDCAN_TTTMK_TM_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define FDCAN2_FDCAN_TTTMK_TICC          (0x7FUL << 16) 
#define FDCAN2_FDCAN_TTTMK_TICC_VAL(X) (((uint32_t)(X) & 0x7FUL) << 16)
#define FDCAN2_FDCAN_TTTMK_LCKM          (0x1UL << 31) 
#define FDCAN2_FDCAN_TTTMK_LCKM_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define FDCAN2_FDCAN_TTIR_SBC          (0x1UL << 0) 
#define FDCAN2_FDCAN_TTIR_SBC_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define FDCAN2_FDCAN_TTIR_SMC          (0x1UL << 1) 
#define FDCAN2_FDCAN_TTIR_SMC_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define FDCAN2_FDCAN_TTIR_CSM          (0x1UL << 2) 
#define FDCAN2_FDCAN_TTIR_CSM_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define FDCAN2_FDCAN_TTIR_SOG          (0x1UL << 3) 
#define FDCAN2_FDCAN_TTIR_SOG_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define FDCAN2_FDCAN_TTIR_RTMI          (0x1UL << 4) 
#define FDCAN2_FDCAN_TTIR_RTMI_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define FDCAN2_FDCAN_TTIR_TTMI          (0x1UL << 5) 
#define FDCAN2_FDCAN_TTIR_TTMI_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define FDCAN2_FDCAN_TTIR_SWE          (0x1UL << 6) 
#define FDCAN2_FDCAN_TTIR_SWE_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define FDCAN2_FDCAN_TTIR_GTW          (0x1UL << 7) 
#define FDCAN2_FDCAN_TTIR_GTW_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define FDCAN2_FDCAN_TTIR_GTD          (0x1UL << 8) 
#define FDCAN2_FDCAN_TTIR_GTD_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define FDCAN2_FDCAN_TTIR_GTE          (0x1UL << 9) 
#define FDCAN2_FDCAN_TTIR_GTE_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define FDCAN2_FDCAN_TTIR_TXU          (0x1UL << 10) 
#define FDCAN2_FDCAN_TTIR_TXU_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define FDCAN2_FDCAN_TTIR_TXO          (0x1UL << 11) 
#define FDCAN2_FDCAN_TTIR_TXO_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define FDCAN2_FDCAN_TTIR_SE1          (0x1UL << 12) 
#define FDCAN2_FDCAN_TTIR_SE1_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define FDCAN2_FDCAN_TTIR_SE2          (0x1UL << 13) 
#define FDCAN2_FDCAN_TTIR_SE2_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define FDCAN2_FDCAN_TTIR_ELC          (0x1UL << 14) 
#define FDCAN2_FDCAN_TTIR_ELC_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define FDCAN2_FDCAN_TTIR_IWTG          (0x1UL << 15) 
#define FDCAN2_FDCAN_TTIR_IWTG_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define FDCAN2_FDCAN_TTIR_WT          (0x1UL << 16) 
#define FDCAN2_FDCAN_TTIR_WT_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define FDCAN2_FDCAN_TTIR_AW          (0x1UL << 17) 
#define FDCAN2_FDCAN_TTIR_AW_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define FDCAN2_FDCAN_TTIR_CER          (0x1UL << 18) 
#define FDCAN2_FDCAN_TTIR_CER_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define FDCAN2_FDCAN_TTIE_SBCE          (0x1UL << 0) 
#define FDCAN2_FDCAN_TTIE_SBCE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define FDCAN2_FDCAN_TTIE_SMCE          (0x1UL << 1) 
#define FDCAN2_FDCAN_TTIE_SMCE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define FDCAN2_FDCAN_TTIE_CSME          (0x1UL << 2) 
#define FDCAN2_FDCAN_TTIE_CSME_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define FDCAN2_FDCAN_TTIE_SOGE          (0x1UL << 3) 
#define FDCAN2_FDCAN_TTIE_SOGE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define FDCAN2_FDCAN_TTIE_RTMIE          (0x1UL << 4) 
#define FDCAN2_FDCAN_TTIE_RTMIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define FDCAN2_FDCAN_TTIE_TTMIE          (0x1UL << 5) 
#define FDCAN2_FDCAN_TTIE_TTMIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define FDCAN2_FDCAN_TTIE_SWEE          (0x1UL << 6) 
#define FDCAN2_FDCAN_TTIE_SWEE_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define FDCAN2_FDCAN_TTIE_GTWE          (0x1UL << 7) 
#define FDCAN2_FDCAN_TTIE_GTWE_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define FDCAN2_FDCAN_TTIE_GTDE          (0x1UL << 8) 
#define FDCAN2_FDCAN_TTIE_GTDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define FDCAN2_FDCAN_TTIE_GTEE          (0x1UL << 9) 
#define FDCAN2_FDCAN_TTIE_GTEE_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define FDCAN2_FDCAN_TTIE_TXUE          (0x1UL << 10) 
#define FDCAN2_FDCAN_TTIE_TXUE_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define FDCAN2_FDCAN_TTIE_TXOE          (0x1UL << 11) 
#define FDCAN2_FDCAN_TTIE_TXOE_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define FDCAN2_FDCAN_TTIE_SE1E          (0x1UL << 12) 
#define FDCAN2_FDCAN_TTIE_SE1E_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define FDCAN2_FDCAN_TTIE_SE2E          (0x1UL << 13) 
#define FDCAN2_FDCAN_TTIE_SE2E_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define FDCAN2_FDCAN_TTIE_ELCE          (0x1UL << 14) 
#define FDCAN2_FDCAN_TTIE_ELCE_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define FDCAN2_FDCAN_TTIE_IWTGE          (0x1UL << 15) 
#define FDCAN2_FDCAN_TTIE_IWTGE_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define FDCAN2_FDCAN_TTIE_WTE          (0x1UL << 16) 
#define FDCAN2_FDCAN_TTIE_WTE_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define FDCAN2_FDCAN_TTIE_AWE          (0x1UL << 17) 
#define FDCAN2_FDCAN_TTIE_AWE_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define FDCAN2_FDCAN_TTIE_CERE          (0x1UL << 18) 
#define FDCAN2_FDCAN_TTIE_CERE_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define FDCAN2_FDCAN_TTILS_SBCL          (0x1UL << 0) 
#define FDCAN2_FDCAN_TTILS_SBCL_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define FDCAN2_FDCAN_TTILS_SMCL          (0x1UL << 1) 
#define FDCAN2_FDCAN_TTILS_SMCL_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define FDCAN2_FDCAN_TTILS_CSML          (0x1UL << 2) 
#define FDCAN2_FDCAN_TTILS_CSML_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define FDCAN2_FDCAN_TTILS_SOGL          (0x1UL << 3) 
#define FDCAN2_FDCAN_TTILS_SOGL_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define FDCAN2_FDCAN_TTILS_RTMIL          (0x1UL << 4) 
#define FDCAN2_FDCAN_TTILS_RTMIL_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
