via/viaems/src/platforms/stm32h743/device.h
#define FDCAN2_FDCAN_TTILS_TTMIL          (0x1UL << 5) 
#define FDCAN2_FDCAN_TTILS_TTMIL_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define FDCAN2_FDCAN_TTILS_SWEL          (0x1UL << 6) 
#define FDCAN2_FDCAN_TTILS_SWEL_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define FDCAN2_FDCAN_TTILS_GTWL          (0x1UL << 7) 
#define FDCAN2_FDCAN_TTILS_GTWL_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define FDCAN2_FDCAN_TTILS_GTDL          (0x1UL << 8) 
#define FDCAN2_FDCAN_TTILS_GTDL_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define FDCAN2_FDCAN_TTILS_GTEL          (0x1UL << 9) 
#define FDCAN2_FDCAN_TTILS_GTEL_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define FDCAN2_FDCAN_TTILS_TXUL          (0x1UL << 10) 
#define FDCAN2_FDCAN_TTILS_TXUL_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define FDCAN2_FDCAN_TTILS_TXOL          (0x1UL << 11) 
#define FDCAN2_FDCAN_TTILS_TXOL_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define FDCAN2_FDCAN_TTILS_SE1L          (0x1UL << 12) 
#define FDCAN2_FDCAN_TTILS_SE1L_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define FDCAN2_FDCAN_TTILS_SE2L          (0x1UL << 13) 
#define FDCAN2_FDCAN_TTILS_SE2L_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define FDCAN2_FDCAN_TTILS_ELCL          (0x1UL << 14) 
#define FDCAN2_FDCAN_TTILS_ELCL_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define FDCAN2_FDCAN_TTILS_IWTGL          (0x1UL << 15) 
#define FDCAN2_FDCAN_TTILS_IWTGL_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define FDCAN2_FDCAN_TTILS_WTL          (0x1UL << 16) 
#define FDCAN2_FDCAN_TTILS_WTL_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define FDCAN2_FDCAN_TTILS_AWL          (0x1UL << 17) 
#define FDCAN2_FDCAN_TTILS_AWL_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define FDCAN2_FDCAN_TTILS_CERL          (0x1UL << 18) 
#define FDCAN2_FDCAN_TTILS_CERL_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define FDCAN2_FDCAN_TTOST_EL          (0x3UL << 0) 
#define FDCAN2_FDCAN_TTOST_EL_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define FDCAN2_FDCAN_TTOST_MS          (0x3UL << 2) 
#define FDCAN2_FDCAN_TTOST_MS_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define FDCAN2_FDCAN_TTOST_SYS          (0x3UL << 4) 
#define FDCAN2_FDCAN_TTOST_SYS_VAL(X) (((uint32_t)(X) & 0x3UL) << 4)
#define FDCAN2_FDCAN_TTOST_GTP          (0x1UL << 6) 
#define FDCAN2_FDCAN_TTOST_GTP_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define FDCAN2_FDCAN_TTOST_QCS          (0x1UL << 7) 
#define FDCAN2_FDCAN_TTOST_QCS_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define FDCAN2_FDCAN_TTOST_RTO          (0xFFUL << 8) 
#define FDCAN2_FDCAN_TTOST_RTO_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define FDCAN2_FDCAN_TTOST_WGTD          (0x1UL << 22) 
#define FDCAN2_FDCAN_TTOST_WGTD_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define FDCAN2_FDCAN_TTOST_GFI          (0x1UL << 23) 
#define FDCAN2_FDCAN_TTOST_GFI_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define FDCAN2_FDCAN_TTOST_TMP          (0x7UL << 24) 
#define FDCAN2_FDCAN_TTOST_TMP_VAL(X) (((uint32_t)(X) & 0x7UL) << 24)
#define FDCAN2_FDCAN_TTOST_GSI          (0x1UL << 27) 
#define FDCAN2_FDCAN_TTOST_GSI_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define FDCAN2_FDCAN_TTOST_WFE          (0x1UL << 28) 
#define FDCAN2_FDCAN_TTOST_WFE_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define FDCAN2_FDCAN_TTOST_AWE          (0x1UL << 29) 
#define FDCAN2_FDCAN_TTOST_AWE_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define FDCAN2_FDCAN_TTOST_WECS          (0x1UL << 30) 
#define FDCAN2_FDCAN_TTOST_WECS_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define FDCAN2_FDCAN_TTOST_SPL          (0x1UL << 31) 
#define FDCAN2_FDCAN_TTOST_SPL_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define FDCAN2_FDCAN_TURNA_NAV          (0x3FFFFUL << 0) 
#define FDCAN2_FDCAN_TURNA_NAV_VAL(X) (((uint32_t)(X) & 0x3FFFFUL) << 0)
#define FDCAN2_FDCAN_TTLGT_LT          (0xFFFFUL << 0) 
#define FDCAN2_FDCAN_TTLGT_LT_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define FDCAN2_FDCAN_TTLGT_GT          (0xFFFFUL << 16) 
#define FDCAN2_FDCAN_TTLGT_GT_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define FDCAN2_FDCAN_TTCTC_CT          (0xFFFFUL << 0) 
#define FDCAN2_FDCAN_TTCTC_CT_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define FDCAN2_FDCAN_TTCTC_CC          (0x3FUL << 16) 
#define FDCAN2_FDCAN_TTCTC_CC_VAL(X) (((uint32_t)(X) & 0x3FUL) << 16)
#define FDCAN2_FDCAN_TTCPT_CT          (0x3FUL << 0) 
#define FDCAN2_FDCAN_TTCPT_CT_VAL(X) (((uint32_t)(X) & 0x3FUL) << 0)
#define FDCAN2_FDCAN_TTCPT_SWV          (0xFFFFUL << 16) 
#define FDCAN2_FDCAN_TTCPT_SWV_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define FDCAN2_FDCAN_TTCSM_CSM          (0xFFFFUL << 0) 
#define FDCAN2_FDCAN_TTCSM_CSM_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define FDCAN2_FDCAN_TTTS_SWTDEL          (0x3UL << 0) 
#define FDCAN2_FDCAN_TTTS_SWTDEL_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define FDCAN2_FDCAN_TTTS_EVTSEL          (0x3UL << 4) 
#define FDCAN2_FDCAN_TTTS_EVTSEL_VAL(X) (((uint32_t)(X) & 0x3UL) << 4)

#define FDCAN2  ((struct FDCAN2*)(0x4000A400UL))
struct CAN_CCU {
  volatile uint32_t CREL;
  volatile uint32_t CCFG;
  volatile uint32_t CSTAT;
  volatile uint32_t CWD;
  volatile uint32_t IR;
  volatile uint32_t IE;
};
#define CAN_CCU_CREL_DAY          (0xFFUL << 0) 
#define CAN_CCU_CREL_DAY_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define CAN_CCU_CREL_MON          (0xFFUL << 8) 
#define CAN_CCU_CREL_MON_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define CAN_CCU_CREL_YEAR          (0xFUL << 16) 
#define CAN_CCU_CREL_YEAR_VAL(X) (((uint32_t)(X) & 0xFUL) << 16)
#define CAN_CCU_CREL_SUBSTEP          (0xFUL << 20) 
#define CAN_CCU_CREL_SUBSTEP_VAL(X) (((uint32_t)(X) & 0xFUL) << 20)
#define CAN_CCU_CREL_STEP          (0xFUL << 24) 
#define CAN_CCU_CREL_STEP_VAL(X) (((uint32_t)(X) & 0xFUL) << 24)
#define CAN_CCU_CREL_REL          (0xFUL << 28) 
#define CAN_CCU_CREL_REL_VAL(X) (((uint32_t)(X) & 0xFUL) << 28)
#define CAN_CCU_CCFG_TQBT          (0x1FUL << 0) 
#define CAN_CCU_CCFG_TQBT_VAL(X) (((uint32_t)(X) & 0x1FUL) << 0)
#define CAN_CCU_CCFG_BCC          (0x1UL << 6) 
#define CAN_CCU_CCFG_BCC_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define CAN_CCU_CCFG_CFL          (0x1UL << 7) 
#define CAN_CCU_CCFG_CFL_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define CAN_CCU_CCFG_OCPM          (0xFFUL << 8) 
#define CAN_CCU_CCFG_OCPM_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define CAN_CCU_CCFG_CDIV          (0xFUL << 16) 
#define CAN_CCU_CCFG_CDIV_VAL(X) (((uint32_t)(X) & 0xFUL) << 16)
#define CAN_CCU_CCFG_SWR          (0x1UL << 31) 
#define CAN_CCU_CCFG_SWR_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define CAN_CCU_CSTAT_OCPC          (0x3FFFFUL << 0) 
#define CAN_CCU_CSTAT_OCPC_VAL(X) (((uint32_t)(X) & 0x3FFFFUL) << 0)
#define CAN_CCU_CSTAT_TQC          (0x7FFUL << 18) 
#define CAN_CCU_CSTAT_TQC_VAL(X) (((uint32_t)(X) & 0x7FFUL) << 18)
#define CAN_CCU_CSTAT_CALS          (0x3UL << 30) 
#define CAN_CCU_CSTAT_CALS_VAL(X) (((uint32_t)(X) & 0x3UL) << 30)
#define CAN_CCU_CWD_WDC          (0xFFFFUL << 0) 
#define CAN_CCU_CWD_WDC_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define CAN_CCU_CWD_WDV          (0xFFFFUL << 16) 
#define CAN_CCU_CWD_WDV_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define CAN_CCU_IR_CWE          (0x1UL << 0) 
#define CAN_CCU_IR_CWE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define CAN_CCU_IR_CSC          (0x1UL << 1) 
#define CAN_CCU_IR_CSC_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define CAN_CCU_IE_CWEE          (0x1UL << 0) 
#define CAN_CCU_IE_CWEE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define CAN_CCU_IE_CSCE          (0x1UL << 1) 
#define CAN_CCU_IE_CSCE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)

