via/viaems/src/platforms/stm32h743/device.h
#define CAN_CCU  ((struct CAN_CCU*)(0x4000A800UL))
struct MDIOS {
  volatile uint32_t CR;
  volatile const uint32_t WRFR;
  volatile uint32_t CWRFR;
  volatile const uint32_t RDFR;
  volatile uint32_t CRDFR;
  volatile const uint32_t SR;
  volatile uint32_t CLRFR;
  volatile const uint32_t DINR0;
  volatile const uint32_t DINR1;
  volatile const uint32_t DINR2;
  volatile const uint32_t DINR3;
  volatile const uint32_t DINR4;
  volatile const uint32_t DINR5;
  volatile const uint32_t DINR6;
  volatile const uint32_t DINR7;
  volatile const uint32_t DINR8;
  volatile const uint32_t DINR9;
  volatile const uint32_t DINR10;
  volatile const uint32_t DINR11;
  volatile const uint32_t DINR12;
  volatile const uint32_t DINR13;
  volatile const uint32_t DINR14;
  volatile const uint32_t DINR15;
  volatile const uint32_t DINR16;
  volatile const uint32_t DINR17;
  volatile const uint32_t DINR18;
  volatile const uint32_t DINR19;
  volatile const uint32_t DINR20;
  volatile const uint32_t DINR21;
  volatile const uint32_t DINR22;
  volatile const uint32_t DINR23;
  volatile const uint32_t DINR24;
  volatile const uint32_t DINR25;
  volatile const uint32_t DINR26;
  volatile const uint32_t DINR27;
  volatile const uint32_t DINR28;
  volatile const uint32_t DINR29;
  volatile const uint32_t DINR30;
  volatile const uint32_t DINR31;
  volatile uint32_t DOUTR0;
  volatile uint32_t DOUTR1;
  volatile uint32_t DOUTR2;
  volatile uint32_t DOUTR3;
  volatile uint32_t DOUTR4;
  volatile uint32_t DOUTR5;
  volatile uint32_t DOUTR6;
  volatile uint32_t DOUTR7;
  volatile uint32_t DOUTR8;
  volatile uint32_t DOUTR9;
  volatile uint32_t DOUTR10;
  volatile uint32_t DOUTR11;
  volatile uint32_t DOUTR12;
  volatile uint32_t DOUTR13;
  volatile uint32_t DOUTR14;
  volatile uint32_t DOUTR15;
  volatile uint32_t DOUTR16;
  volatile uint32_t DOUTR17;
  volatile uint32_t DOUTR18;
  volatile uint32_t DOUTR19;
  volatile uint32_t DOUTR20;
  volatile uint32_t DOUTR21;
  volatile uint32_t DOUTR22;
  volatile uint32_t DOUTR23;
  volatile uint32_t DOUTR24;
  volatile uint32_t DOUTR25;
  volatile uint32_t DOUTR26;
  volatile uint32_t DOUTR27;
  volatile uint32_t DOUTR28;
  volatile uint32_t DOUTR29;
  volatile uint32_t DOUTR30;
  volatile uint32_t DOUTR31;
};
#define MDIOS_CR_EN          (0x1UL << 0) 
#define MDIOS_CR_EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MDIOS_CR_WRIE          (0x1UL << 1) 
#define MDIOS_CR_WRIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define MDIOS_CR_RDIE          (0x1UL << 2) 
#define MDIOS_CR_RDIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define MDIOS_CR_EIE          (0x1UL << 3) 
#define MDIOS_CR_EIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define MDIOS_CR_DPC          (0x1UL << 7) 
#define MDIOS_CR_DPC_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define MDIOS_CR_PORT_ADDRESS          (0x1FUL << 8) 
#define MDIOS_CR_PORT_ADDRESS_VAL(X) (((uint32_t)(X) & 0x1FUL) << 8)
#define MDIOS_WRFR_WRF          (0xFFFFFFFFUL << 0) 
#define MDIOS_WRFR_WRF_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDIOS_CWRFR_CWRF          (0xFFFFFFFFUL << 0) 
#define MDIOS_CWRFR_CWRF_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDIOS_RDFR_RDF          (0xFFFFFFFFUL << 0) 
#define MDIOS_RDFR_RDF_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDIOS_CRDFR_CRDF          (0xFFFFFFFFUL << 0) 
#define MDIOS_CRDFR_CRDF_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define MDIOS_SR_PERF          (0x1UL << 0) 
#define MDIOS_SR_PERF_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MDIOS_SR_SERF          (0x1UL << 1) 
#define MDIOS_SR_SERF_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define MDIOS_SR_TERF          (0x1UL << 2) 
#define MDIOS_SR_TERF_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define MDIOS_CLRFR_CPERF          (0x1UL << 0) 
#define MDIOS_CLRFR_CPERF_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MDIOS_CLRFR_CSERF          (0x1UL << 1) 
#define MDIOS_CLRFR_CSERF_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define MDIOS_CLRFR_CTERF          (0x1UL << 2) 
#define MDIOS_CLRFR_CTERF_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define MDIOS_DINR0_DIN0          (0xFFFFUL << 0) 
#define MDIOS_DINR0_DIN0_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DINR1_DIN1          (0xFFFFUL << 0) 
#define MDIOS_DINR1_DIN1_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DINR2_DIN2          (0xFFFFUL << 0) 
#define MDIOS_DINR2_DIN2_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DINR3_DIN3          (0xFFFFUL << 0) 
#define MDIOS_DINR3_DIN3_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DINR4_DIN4          (0xFFFFUL << 0) 
#define MDIOS_DINR4_DIN4_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DINR5_DIN5          (0xFFFFUL << 0) 
#define MDIOS_DINR5_DIN5_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DINR6_DIN6          (0xFFFFUL << 0) 
#define MDIOS_DINR6_DIN6_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DINR7_DIN7          (0xFFFFUL << 0) 
#define MDIOS_DINR7_DIN7_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DINR8_DIN8          (0xFFFFUL << 0) 
#define MDIOS_DINR8_DIN8_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DINR9_DIN9          (0xFFFFUL << 0) 
#define MDIOS_DINR9_DIN9_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DINR10_DIN10          (0xFFFFUL << 0) 
#define MDIOS_DINR10_DIN10_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DINR11_DIN11          (0xFFFFUL << 0) 
#define MDIOS_DINR11_DIN11_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DINR12_DIN12          (0xFFFFUL << 0) 
#define MDIOS_DINR12_DIN12_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DINR13_DIN13          (0xFFFFUL << 0) 
#define MDIOS_DINR13_DIN13_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DINR14_DIN14          (0xFFFFUL << 0) 
#define MDIOS_DINR14_DIN14_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DINR15_DIN15          (0xFFFFUL << 0) 
#define MDIOS_DINR15_DIN15_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DINR16_DIN16          (0xFFFFUL << 0) 
#define MDIOS_DINR16_DIN16_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DINR17_DIN17          (0xFFFFUL << 0) 
#define MDIOS_DINR17_DIN17_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DINR18_DIN18          (0xFFFFUL << 0) 
#define MDIOS_DINR18_DIN18_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DINR19_DIN19          (0xFFFFUL << 0) 
#define MDIOS_DINR19_DIN19_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DINR20_DIN20          (0xFFFFUL << 0) 
#define MDIOS_DINR20_DIN20_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DINR21_DIN21          (0xFFFFUL << 0) 
#define MDIOS_DINR21_DIN21_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DINR22_DIN22          (0xFFFFUL << 0) 
#define MDIOS_DINR22_DIN22_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DINR23_DIN23          (0xFFFFUL << 0) 
#define MDIOS_DINR23_DIN23_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DINR24_DIN24          (0xFFFFUL << 0) 
#define MDIOS_DINR24_DIN24_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DINR25_DIN25          (0xFFFFUL << 0) 
#define MDIOS_DINR25_DIN25_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DINR26_DIN26          (0xFFFFUL << 0) 
#define MDIOS_DINR26_DIN26_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DINR27_DIN27          (0xFFFFUL << 0) 
#define MDIOS_DINR27_DIN27_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DINR28_DIN28          (0xFFFFUL << 0) 
#define MDIOS_DINR28_DIN28_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DINR29_DIN29          (0xFFFFUL << 0) 
#define MDIOS_DINR29_DIN29_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DINR30_DIN30          (0xFFFFUL << 0) 
#define MDIOS_DINR30_DIN30_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DINR31_DIN31          (0xFFFFUL << 0) 
#define MDIOS_DINR31_DIN31_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DOUTR0_DOUT0          (0xFFFFUL << 0) 
#define MDIOS_DOUTR0_DOUT0_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DOUTR1_DOUT1          (0xFFFFUL << 0) 
#define MDIOS_DOUTR1_DOUT1_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DOUTR2_DOUT2          (0xFFFFUL << 0) 
#define MDIOS_DOUTR2_DOUT2_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DOUTR3_DOUT3          (0xFFFFUL << 0) 
#define MDIOS_DOUTR3_DOUT3_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DOUTR4_DOUT4          (0xFFFFUL << 0) 
#define MDIOS_DOUTR4_DOUT4_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DOUTR5_DOUT5          (0xFFFFUL << 0) 
#define MDIOS_DOUTR5_DOUT5_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DOUTR6_DOUT6          (0xFFFFUL << 0) 
#define MDIOS_DOUTR6_DOUT6_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DOUTR7_DOUT7          (0xFFFFUL << 0) 
#define MDIOS_DOUTR7_DOUT7_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DOUTR8_DOUT8          (0xFFFFUL << 0) 
#define MDIOS_DOUTR8_DOUT8_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DOUTR9_DOUT9          (0xFFFFUL << 0) 
#define MDIOS_DOUTR9_DOUT9_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DOUTR10_DOUT10          (0xFFFFUL << 0) 
#define MDIOS_DOUTR10_DOUT10_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DOUTR11_DOUT11          (0xFFFFUL << 0) 
#define MDIOS_DOUTR11_DOUT11_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DOUTR12_DOUT12          (0xFFFFUL << 0) 
#define MDIOS_DOUTR12_DOUT12_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DOUTR13_DOUT13          (0xFFFFUL << 0) 
#define MDIOS_DOUTR13_DOUT13_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DOUTR14_DOUT14          (0xFFFFUL << 0) 
#define MDIOS_DOUTR14_DOUT14_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DOUTR15_DOUT15          (0xFFFFUL << 0) 
#define MDIOS_DOUTR15_DOUT15_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DOUTR16_DOUT16          (0xFFFFUL << 0) 
#define MDIOS_DOUTR16_DOUT16_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DOUTR17_DOUT17          (0xFFFFUL << 0) 
#define MDIOS_DOUTR17_DOUT17_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DOUTR18_DOUT18          (0xFFFFUL << 0) 
#define MDIOS_DOUTR18_DOUT18_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DOUTR19_DOUT19          (0xFFFFUL << 0) 
#define MDIOS_DOUTR19_DOUT19_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DOUTR20_DOUT20          (0xFFFFUL << 0) 
#define MDIOS_DOUTR20_DOUT20_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DOUTR21_DOUT21          (0xFFFFUL << 0) 
#define MDIOS_DOUTR21_DOUT21_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DOUTR22_DOUT22          (0xFFFFUL << 0) 
#define MDIOS_DOUTR22_DOUT22_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DOUTR23_DOUT23          (0xFFFFUL << 0) 
#define MDIOS_DOUTR23_DOUT23_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DOUTR24_DOUT24          (0xFFFFUL << 0) 
#define MDIOS_DOUTR24_DOUT24_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DOUTR25_DOUT25          (0xFFFFUL << 0) 
#define MDIOS_DOUTR25_DOUT25_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DOUTR26_DOUT26          (0xFFFFUL << 0) 
#define MDIOS_DOUTR26_DOUT26_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DOUTR27_DOUT27          (0xFFFFUL << 0) 
#define MDIOS_DOUTR27_DOUT27_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DOUTR28_DOUT28          (0xFFFFUL << 0) 
#define MDIOS_DOUTR28_DOUT28_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DOUTR29_DOUT29          (0xFFFFUL << 0) 
#define MDIOS_DOUTR29_DOUT29_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DOUTR30_DOUT30          (0xFFFFUL << 0) 
#define MDIOS_DOUTR30_DOUT30_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define MDIOS_DOUTR31_DOUT31          (0xFFFFUL << 0) 
#define MDIOS_DOUTR31_DOUT31_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)

#define MDIOS  ((struct MDIOS*)(0x40009400UL))
struct OPAMP {
  volatile uint32_t OPAMP1_CSR;
  volatile uint32_t OPAMP1_OTR;
  volatile uint32_t OPAMP1_HSOTR;
  const volatile uint32_t RESERVED16[1];
  volatile uint32_t OPAMP2_CSR;
  volatile uint32_t OPAMP2_OTR;
  volatile uint32_t OPAMP2_HSOTR;
};
#define OPAMP_OPAMP1_CSR_OPAEN          (0x1UL << 0) 
#define OPAMP_OPAMP1_CSR_OPAEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OPAMP_OPAMP1_CSR_FORCE_VP          (0x1UL << 1) 
#define OPAMP_OPAMP1_CSR_FORCE_VP_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OPAMP_OPAMP1_CSR_VP_SEL          (0x3UL << 2) 
#define OPAMP_OPAMP1_CSR_VP_SEL_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define OPAMP_OPAMP1_CSR_VM_SEL          (0x3UL << 5) 
#define OPAMP_OPAMP1_CSR_VM_SEL_VAL(X) (((uint32_t)(X) & 0x3UL) << 5)
#define OPAMP_OPAMP1_CSR_OPAHSM          (0x1UL << 8) 
#define OPAMP_OPAMP1_CSR_OPAHSM_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OPAMP_OPAMP1_CSR_CALON          (0x1UL << 11) 
#define OPAMP_OPAMP1_CSR_CALON_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define OPAMP_OPAMP1_CSR_CALSEL          (0x3UL << 12) 
#define OPAMP_OPAMP1_CSR_CALSEL_VAL(X) (((uint32_t)(X) & 0x3UL) << 12)
#define OPAMP_OPAMP1_CSR_PGA_GAIN          (0xFUL << 14) 
#define OPAMP_OPAMP1_CSR_PGA_GAIN_VAL(X) (((uint32_t)(X) & 0xFUL) << 14)
#define OPAMP_OPAMP1_CSR_USERTRIM          (0x1UL << 18) 
#define OPAMP_OPAMP1_CSR_USERTRIM_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define OPAMP_OPAMP1_CSR_TSTREF          (0x1UL << 29) 
#define OPAMP_OPAMP1_CSR_TSTREF_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define OPAMP_OPAMP1_CSR_CALOUT          (0x1UL << 30) 
#define OPAMP_OPAMP1_CSR_CALOUT_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define OPAMP_OPAMP1_OTR_TRIMOFFSETN          (0x1FUL << 0) 
#define OPAMP_OPAMP1_OTR_TRIMOFFSETN_VAL(X) (((uint32_t)(X) & 0x1FUL) << 0)
#define OPAMP_OPAMP1_OTR_TRIMOFFSETP          (0x1FUL << 8) 
#define OPAMP_OPAMP1_OTR_TRIMOFFSETP_VAL(X) (((uint32_t)(X) & 0x1FUL) << 8)
#define OPAMP_OPAMP1_HSOTR_TRIMLPOFFSETN          (0x1FUL << 0) 
#define OPAMP_OPAMP1_HSOTR_TRIMLPOFFSETN_VAL(X) (((uint32_t)(X) & 0x1FUL) << 0)
#define OPAMP_OPAMP1_HSOTR_TRIMLPOFFSETP          (0x1FUL << 8) 
#define OPAMP_OPAMP1_HSOTR_TRIMLPOFFSETP_VAL(X) (((uint32_t)(X) & 0x1FUL) << 8)
#define OPAMP_OPAMP2_CSR_OPAEN          (0x1UL << 0) 
#define OPAMP_OPAMP2_CSR_OPAEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define OPAMP_OPAMP2_CSR_FORCE_VP          (0x1UL << 1) 
#define OPAMP_OPAMP2_CSR_FORCE_VP_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define OPAMP_OPAMP2_CSR_VM_SEL          (0x3UL << 5) 
#define OPAMP_OPAMP2_CSR_VM_SEL_VAL(X) (((uint32_t)(X) & 0x3UL) << 5)
#define OPAMP_OPAMP2_CSR_OPAHSM          (0x1UL << 8) 
#define OPAMP_OPAMP2_CSR_OPAHSM_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define OPAMP_OPAMP2_CSR_CALON          (0x1UL << 11) 
#define OPAMP_OPAMP2_CSR_CALON_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define OPAMP_OPAMP2_CSR_CALSEL          (0x3UL << 12) 
#define OPAMP_OPAMP2_CSR_CALSEL_VAL(X) (((uint32_t)(X) & 0x3UL) << 12)
#define OPAMP_OPAMP2_CSR_PGA_GAIN          (0xFUL << 14) 
#define OPAMP_OPAMP2_CSR_PGA_GAIN_VAL(X) (((uint32_t)(X) & 0xFUL) << 14)
#define OPAMP_OPAMP2_CSR_USERTRIM          (0x1UL << 18) 
#define OPAMP_OPAMP2_CSR_USERTRIM_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define OPAMP_OPAMP2_CSR_TSTREF          (0x1UL << 29) 
#define OPAMP_OPAMP2_CSR_TSTREF_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define OPAMP_OPAMP2_CSR_CALOUT          (0x1UL << 30) 
#define OPAMP_OPAMP2_CSR_CALOUT_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define OPAMP_OPAMP2_OTR_TRIMOFFSETN          (0x1FUL << 0) 
#define OPAMP_OPAMP2_OTR_TRIMOFFSETN_VAL(X) (((uint32_t)(X) & 0x1FUL) << 0)
#define OPAMP_OPAMP2_OTR_TRIMOFFSETP          (0x1FUL << 8) 
#define OPAMP_OPAMP2_OTR_TRIMOFFSETP_VAL(X) (((uint32_t)(X) & 0x1FUL) << 8)
#define OPAMP_OPAMP2_HSOTR_TRIMLPOFFSETN          (0x1FUL << 0) 
#define OPAMP_OPAMP2_HSOTR_TRIMLPOFFSETN_VAL(X) (((uint32_t)(X) & 0x1FUL) << 0)
#define OPAMP_OPAMP2_HSOTR_TRIMLPOFFSETP          (0x1FUL << 8) 
#define OPAMP_OPAMP2_HSOTR_TRIMLPOFFSETP_VAL(X) (((uint32_t)(X) & 0x1FUL) << 8)

#define OPAMP  ((struct OPAMP*)(0x40009000UL))
struct SWPMI {
  volatile uint32_t CR;
  volatile uint32_t BRR;
  const volatile uint32_t RESERVED12[1];
  volatile const uint32_t ISR;
  volatile uint32_t ICR;
  volatile uint32_t IER;
  volatile const uint32_t RFL;
  volatile uint32_t TDR;
  volatile const uint32_t RDR;
  volatile uint32_t OR;
};
#define SWPMI_CR_RXDMA          (0x1UL << 0) 
#define SWPMI_CR_RXDMA_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define SWPMI_CR_TXDMA          (0x1UL << 1) 
#define SWPMI_CR_TXDMA_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define SWPMI_CR_RXMODE          (0x1UL << 2) 
#define SWPMI_CR_RXMODE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define SWPMI_CR_TXMODE          (0x1UL << 3) 
#define SWPMI_CR_TXMODE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define SWPMI_CR_LPBK          (0x1UL << 4) 
#define SWPMI_CR_LPBK_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define SWPMI_CR_SWPACT          (0x1UL << 5) 
#define SWPMI_CR_SWPACT_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define SWPMI_CR_DEACT          (0x1UL << 10) 
#define SWPMI_CR_DEACT_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define SWPMI_CR_SWPTEN          (0x1UL << 11) 
#define SWPMI_CR_SWPTEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define SWPMI_BRR_BR          (0xFFUL << 0) 
#define SWPMI_BRR_BR_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define SWPMI_ISR_RXBFF          (0x1UL << 0) 
#define SWPMI_ISR_RXBFF_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define SWPMI_ISR_TXBEF          (0x1UL << 1) 
#define SWPMI_ISR_TXBEF_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define SWPMI_ISR_RXBERF          (0x1UL << 2) 
#define SWPMI_ISR_RXBERF_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define SWPMI_ISR_RXOVRF          (0x1UL << 3) 
#define SWPMI_ISR_RXOVRF_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define SWPMI_ISR_TXUNRF          (0x1UL << 4) 
#define SWPMI_ISR_TXUNRF_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define SWPMI_ISR_RXNE          (0x1UL << 5) 
#define SWPMI_ISR_RXNE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define SWPMI_ISR_TXE          (0x1UL << 6) 
#define SWPMI_ISR_TXE_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define SWPMI_ISR_TCF          (0x1UL << 7) 
#define SWPMI_ISR_TCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define SWPMI_ISR_SRF          (0x1UL << 8) 
#define SWPMI_ISR_SRF_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define SWPMI_ISR_SUSP          (0x1UL << 9) 
#define SWPMI_ISR_SUSP_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define SWPMI_ISR_DEACTF          (0x1UL << 10) 
#define SWPMI_ISR_DEACTF_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define SWPMI_ISR_RDYF          (0x1UL << 11) 
#define SWPMI_ISR_RDYF_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define SWPMI_ICR_CRXBFF          (0x1UL << 0) 
#define SWPMI_ICR_CRXBFF_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define SWPMI_ICR_CTXBEF          (0x1UL << 1) 
#define SWPMI_ICR_CTXBEF_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define SWPMI_ICR_CRXBERF          (0x1UL << 2) 
#define SWPMI_ICR_CRXBERF_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define SWPMI_ICR_CRXOVRF          (0x1UL << 3) 
#define SWPMI_ICR_CRXOVRF_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define SWPMI_ICR_CTXUNRF          (0x1UL << 4) 
#define SWPMI_ICR_CTXUNRF_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define SWPMI_ICR_CTCF          (0x1UL << 7) 
#define SWPMI_ICR_CTCF_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define SWPMI_ICR_CSRF          (0x1UL << 8) 
#define SWPMI_ICR_CSRF_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define SWPMI_ICR_CRDYF          (0x1UL << 11) 
#define SWPMI_ICR_CRDYF_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define SWPMI_IER_RXBFIE          (0x1UL << 0) 
#define SWPMI_IER_RXBFIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define SWPMI_IER_TXBEIE          (0x1UL << 1) 
#define SWPMI_IER_TXBEIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define SWPMI_IER_RXBERIE          (0x1UL << 2) 
#define SWPMI_IER_RXBERIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define SWPMI_IER_RXOVRIE          (0x1UL << 3) 
#define SWPMI_IER_RXOVRIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define SWPMI_IER_TXUNRIE          (0x1UL << 4) 
#define SWPMI_IER_TXUNRIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define SWPMI_IER_RIE          (0x1UL << 5) 
#define SWPMI_IER_RIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define SWPMI_IER_TIE          (0x1UL << 6) 
#define SWPMI_IER_TIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define SWPMI_IER_TCIE          (0x1UL << 7) 
#define SWPMI_IER_TCIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define SWPMI_IER_SRIE          (0x1UL << 8) 
#define SWPMI_IER_SRIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define SWPMI_IER_RDYIE          (0x1UL << 11) 
#define SWPMI_IER_RDYIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define SWPMI_RFL_RFL          (0x1FUL << 0) 
#define SWPMI_RFL_RFL_VAL(X) (((uint32_t)(X) & 0x1FUL) << 0)
#define SWPMI_TDR_TD          (0xFFFFFFFFUL << 0) 
#define SWPMI_TDR_TD_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define SWPMI_RDR_RD          (0xFFFFFFFFUL << 0) 
#define SWPMI_RDR_RD_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define SWPMI_OR_SWP_TBYP          (0x1UL << 0) 
#define SWPMI_OR_SWP_TBYP_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define SWPMI_OR_SWP_CLASS          (0x1UL << 1) 
#define SWPMI_OR_SWP_CLASS_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)

#define SWPMI  ((struct SWPMI*)(0x40008800UL))
struct TIM2 {
  volatile uint32_t CR1;
  volatile uint32_t CR2;
  volatile uint32_t SMCR;
  volatile uint32_t DIER;
  volatile uint32_t SR;
  volatile uint32_t EGR;
  volatile uint32_t CCMR1_Output;
  volatile uint32_t CCMR1_Input;
  volatile uint32_t CCMR2_Output;
  volatile uint32_t CCMR2_Input;
  volatile uint32_t CCER;
  volatile uint32_t CNT;
  volatile uint32_t PSC;
  volatile uint32_t ARR;
  const volatile uint32_t RESERVED52[1];
  volatile uint32_t CCR1;
  volatile uint32_t CCR2;
  volatile uint32_t CCR3;
  volatile uint32_t CCR4;
  const volatile uint32_t RESERVED72[1];
  volatile uint32_t DCR;
  volatile uint32_t DMAR;
  const volatile uint32_t RESERVED96[4];
  volatile uint32_t AF1;
  const volatile uint32_t RESERVED104[1];
  volatile uint32_t TISEL;
};
