via/viaems/src/platforms/stm32h743/device.h
#define TIM13_CR1_UIFREMAP          (0x1UL << 11) 
#define TIM13_CR1_UIFREMAP_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define TIM13_CR1_CKD          (0x3UL << 8) 
#define TIM13_CR1_CKD_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define TIM13_CR1_ARPE          (0x1UL << 7) 
#define TIM13_CR1_ARPE_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define TIM13_CR1_CMS          (0x3UL << 5) 
#define TIM13_CR1_CMS_VAL(X) (((uint32_t)(X) & 0x3UL) << 5)
#define TIM13_CR1_DIR          (0x1UL << 4) 
#define TIM13_CR1_DIR_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define TIM13_CR1_OPM          (0x1UL << 3) 
#define TIM13_CR1_OPM_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define TIM13_CR1_URS          (0x1UL << 2) 
#define TIM13_CR1_URS_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define TIM13_CR1_UDIS          (0x1UL << 1) 
#define TIM13_CR1_UDIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define TIM13_CR1_CEN          (0x1UL << 0) 
#define TIM13_CR1_CEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define TIM13_CR2_TI1S          (0x1UL << 7) 
#define TIM13_CR2_TI1S_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define TIM13_CR2_MMS          (0x7UL << 4) 
#define TIM13_CR2_MMS_VAL(X) (((uint32_t)(X) & 0x7UL) << 4)
#define TIM13_CR2_CCDS          (0x1UL << 3) 
#define TIM13_CR2_CCDS_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define TIM13_SMCR_TS_4_3          (0x3UL << 20) 
#define TIM13_SMCR_TS_4_3_VAL(X) (((uint32_t)(X) & 0x3UL) << 20)
#define TIM13_SMCR_SMS_3          (0x1UL << 16) 
#define TIM13_SMCR_SMS_3_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define TIM13_SMCR_ETP          (0x1UL << 15) 
#define TIM13_SMCR_ETP_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define TIM13_SMCR_ECE          (0x1UL << 14) 
#define TIM13_SMCR_ECE_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define TIM13_SMCR_ETPS          (0x3UL << 12) 
#define TIM13_SMCR_ETPS_VAL(X) (((uint32_t)(X) & 0x3UL) << 12)
#define TIM13_SMCR_ETF          (0xFUL << 8) 
#define TIM13_SMCR_ETF_VAL(X) (((uint32_t)(X) & 0xFUL) << 8)
#define TIM13_SMCR_MSM          (0x1UL << 7) 
#define TIM13_SMCR_MSM_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define TIM13_SMCR_TS          (0x7UL << 4) 
#define TIM13_SMCR_TS_VAL(X) (((uint32_t)(X) & 0x7UL) << 4)
#define TIM13_SMCR_SMS          (0x7UL << 0) 
#define TIM13_SMCR_SMS_VAL(X) (((uint32_t)(X) & 0x7UL) << 0)
#define TIM13_DIER_TDE          (0x1UL << 14) 
#define TIM13_DIER_TDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define TIM13_DIER_CC4DE          (0x1UL << 12) 
#define TIM13_DIER_CC4DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define TIM13_DIER_CC3DE          (0x1UL << 11) 
#define TIM13_DIER_CC3DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define TIM13_DIER_CC2DE          (0x1UL << 10) 
#define TIM13_DIER_CC2DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define TIM13_DIER_CC1DE          (0x1UL << 9) 
#define TIM13_DIER_CC1DE_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define TIM13_DIER_UDE          (0x1UL << 8) 
#define TIM13_DIER_UDE_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define TIM13_DIER_TIE          (0x1UL << 6) 
#define TIM13_DIER_TIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define TIM13_DIER_CC4IE          (0x1UL << 4) 
#define TIM13_DIER_CC4IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define TIM13_DIER_CC3IE          (0x1UL << 3) 
#define TIM13_DIER_CC3IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define TIM13_DIER_CC2IE          (0x1UL << 2) 
#define TIM13_DIER_CC2IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define TIM13_DIER_CC1IE          (0x1UL << 1) 
#define TIM13_DIER_CC1IE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define TIM13_DIER_UIE          (0x1UL << 0) 
#define TIM13_DIER_UIE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define TIM13_SR_CC4OF          (0x1UL << 12) 
#define TIM13_SR_CC4OF_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define TIM13_SR_CC3OF          (0x1UL << 11) 
#define TIM13_SR_CC3OF_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define TIM13_SR_CC2OF          (0x1UL << 10) 
#define TIM13_SR_CC2OF_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define TIM13_SR_CC1OF          (0x1UL << 9) 
#define TIM13_SR_CC1OF_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define TIM13_SR_TIF          (0x1UL << 6) 
#define TIM13_SR_TIF_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define TIM13_SR_CC4IF          (0x1UL << 4) 
#define TIM13_SR_CC4IF_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define TIM13_SR_CC3IF          (0x1UL << 3) 
#define TIM13_SR_CC3IF_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define TIM13_SR_CC2IF          (0x1UL << 2) 
#define TIM13_SR_CC2IF_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define TIM13_SR_CC1IF          (0x1UL << 1) 
#define TIM13_SR_CC1IF_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define TIM13_SR_UIF          (0x1UL << 0) 
#define TIM13_SR_UIF_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define TIM13_EGR_TG          (0x1UL << 6) 
#define TIM13_EGR_TG_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define TIM13_EGR_CC4G          (0x1UL << 4) 
#define TIM13_EGR_CC4G_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define TIM13_EGR_CC3G          (0x1UL << 3) 
#define TIM13_EGR_CC3G_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define TIM13_EGR_CC2G          (0x1UL << 2) 
#define TIM13_EGR_CC2G_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define TIM13_EGR_CC1G          (0x1UL << 1) 
#define TIM13_EGR_CC1G_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define TIM13_EGR_UG          (0x1UL << 0) 
#define TIM13_EGR_UG_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define TIM13_CCMR1_Output_CC1S          (0x3UL << 0) 
#define TIM13_CCMR1_Output_CC1S_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define TIM13_CCMR1_Output_OC1FE          (0x1UL << 2) 
#define TIM13_CCMR1_Output_OC1FE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define TIM13_CCMR1_Output_OC1PE          (0x1UL << 3) 
#define TIM13_CCMR1_Output_OC1PE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define TIM13_CCMR1_Output_OC1M          (0x7UL << 4) 
#define TIM13_CCMR1_Output_OC1M_VAL(X) (((uint32_t)(X) & 0x7UL) << 4)
#define TIM13_CCMR1_Output_OC1CE          (0x1UL << 7) 
#define TIM13_CCMR1_Output_OC1CE_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define TIM13_CCMR1_Output_CC2S          (0x3UL << 8) 
#define TIM13_CCMR1_Output_CC2S_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define TIM13_CCMR1_Output_OC2FE          (0x1UL << 10) 
#define TIM13_CCMR1_Output_OC2FE_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define TIM13_CCMR1_Output_OC2PE          (0x1UL << 11) 
#define TIM13_CCMR1_Output_OC2PE_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define TIM13_CCMR1_Output_OC2M          (0x7UL << 12) 
#define TIM13_CCMR1_Output_OC2M_VAL(X) (((uint32_t)(X) & 0x7UL) << 12)
#define TIM13_CCMR1_Output_OC2CE          (0x1UL << 15) 
#define TIM13_CCMR1_Output_OC2CE_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define TIM13_CCMR1_Output_OC1M_3          (0x1UL << 16) 
#define TIM13_CCMR1_Output_OC1M_3_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define TIM13_CCMR1_Output_OC2M_3          (0x1UL << 24) 
#define TIM13_CCMR1_Output_OC2M_3_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define TIM13_CCMR1_Input_IC2F          (0xFUL << 12) 
#define TIM13_CCMR1_Input_IC2F_VAL(X) (((uint32_t)(X) & 0xFUL) << 12)
#define TIM13_CCMR1_Input_IC2PCS          (0x3UL << 10) 
#define TIM13_CCMR1_Input_IC2PCS_VAL(X) (((uint32_t)(X) & 0x3UL) << 10)
#define TIM13_CCMR1_Input_CC2S          (0x3UL << 8) 
#define TIM13_CCMR1_Input_CC2S_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define TIM13_CCMR1_Input_IC1F          (0xFUL << 4) 
#define TIM13_CCMR1_Input_IC1F_VAL(X) (((uint32_t)(X) & 0xFUL) << 4)
#define TIM13_CCMR1_Input_ICPCS          (0x3UL << 2) 
#define TIM13_CCMR1_Input_ICPCS_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define TIM13_CCMR1_Input_CC1S          (0x3UL << 0) 
#define TIM13_CCMR1_Input_CC1S_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define TIM13_CCMR2_Output_OC4M_3          (0x1UL << 24) 
#define TIM13_CCMR2_Output_OC4M_3_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define TIM13_CCMR2_Output_OC3M_3          (0x1UL << 16) 
#define TIM13_CCMR2_Output_OC3M_3_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define TIM13_CCMR2_Output_O24CE          (0x1UL << 15) 
#define TIM13_CCMR2_Output_O24CE_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define TIM13_CCMR2_Output_OC4M          (0x7UL << 12) 
#define TIM13_CCMR2_Output_OC4M_VAL(X) (((uint32_t)(X) & 0x7UL) << 12)
#define TIM13_CCMR2_Output_OC4PE          (0x1UL << 11) 
#define TIM13_CCMR2_Output_OC4PE_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define TIM13_CCMR2_Output_OC4FE          (0x1UL << 10) 
#define TIM13_CCMR2_Output_OC4FE_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define TIM13_CCMR2_Output_CC4S          (0x3UL << 8) 
#define TIM13_CCMR2_Output_CC4S_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define TIM13_CCMR2_Output_OC3CE          (0x1UL << 7) 
#define TIM13_CCMR2_Output_OC3CE_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define TIM13_CCMR2_Output_OC3M          (0x7UL << 4) 
#define TIM13_CCMR2_Output_OC3M_VAL(X) (((uint32_t)(X) & 0x7UL) << 4)
#define TIM13_CCMR2_Output_OC3PE          (0x1UL << 3) 
#define TIM13_CCMR2_Output_OC3PE_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define TIM13_CCMR2_Output_OC3FE          (0x1UL << 2) 
#define TIM13_CCMR2_Output_OC3FE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define TIM13_CCMR2_Output_CC3S          (0x3UL << 0) 
#define TIM13_CCMR2_Output_CC3S_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define TIM13_CCMR2_Input_IC4F          (0xFUL << 12) 
#define TIM13_CCMR2_Input_IC4F_VAL(X) (((uint32_t)(X) & 0xFUL) << 12)
#define TIM13_CCMR2_Input_IC4PSC          (0x3UL << 10) 
#define TIM13_CCMR2_Input_IC4PSC_VAL(X) (((uint32_t)(X) & 0x3UL) << 10)
#define TIM13_CCMR2_Input_CC4S          (0x3UL << 8) 
#define TIM13_CCMR2_Input_CC4S_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)
#define TIM13_CCMR2_Input_IC3F          (0xFUL << 4) 
#define TIM13_CCMR2_Input_IC3F_VAL(X) (((uint32_t)(X) & 0xFUL) << 4)
#define TIM13_CCMR2_Input_IC3PSC          (0x3UL << 2) 
#define TIM13_CCMR2_Input_IC3PSC_VAL(X) (((uint32_t)(X) & 0x3UL) << 2)
#define TIM13_CCMR2_Input_CC3S          (0x3UL << 0) 
#define TIM13_CCMR2_Input_CC3S_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define TIM13_CCER_CC4NP          (0x1UL << 15) 
#define TIM13_CCER_CC4NP_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define TIM13_CCER_CC4P          (0x1UL << 13) 
#define TIM13_CCER_CC4P_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define TIM13_CCER_CC4E          (0x1UL << 12) 
#define TIM13_CCER_CC4E_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define TIM13_CCER_CC3NP          (0x1UL << 11) 
#define TIM13_CCER_CC3NP_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define TIM13_CCER_CC3P          (0x1UL << 9) 
#define TIM13_CCER_CC3P_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define TIM13_CCER_CC3E          (0x1UL << 8) 
#define TIM13_CCER_CC3E_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define TIM13_CCER_CC2NP          (0x1UL << 7) 
#define TIM13_CCER_CC2NP_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define TIM13_CCER_CC2P          (0x1UL << 5) 
#define TIM13_CCER_CC2P_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define TIM13_CCER_CC2E          (0x1UL << 4) 
#define TIM13_CCER_CC2E_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define TIM13_CCER_CC1NP          (0x1UL << 3) 
#define TIM13_CCER_CC1NP_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define TIM13_CCER_CC1P          (0x1UL << 1) 
#define TIM13_CCER_CC1P_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define TIM13_CCER_CC1E          (0x1UL << 0) 
#define TIM13_CCER_CC1E_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define TIM13_CNT_CNT_L          (0xFFFFUL << 0) 
#define TIM13_CNT_CNT_L_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define TIM13_CNT_CNT_H          (0xFFFFUL << 16) 
#define TIM13_CNT_CNT_H_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define TIM13_PSC_PSC          (0xFFFFUL << 0) 
#define TIM13_PSC_PSC_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define TIM13_ARR_ARR_H          (0xFFFFUL << 16) 
#define TIM13_ARR_ARR_H_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define TIM13_ARR_ARR_L          (0xFFFFUL << 0) 
#define TIM13_ARR_ARR_L_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define TIM13_CCR1_CCR1_H          (0xFFFFUL << 16) 
#define TIM13_CCR1_CCR1_H_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define TIM13_CCR1_CCR1_L          (0xFFFFUL << 0) 
#define TIM13_CCR1_CCR1_L_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define TIM13_CCR2_CCR2_H          (0xFFFFUL << 16) 
#define TIM13_CCR2_CCR2_H_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define TIM13_CCR2_CCR2_L          (0xFFFFUL << 0) 
#define TIM13_CCR2_CCR2_L_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define TIM13_CCR3_CCR3_H          (0xFFFFUL << 16) 
#define TIM13_CCR3_CCR3_H_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define TIM13_CCR3_CCR3_L          (0xFFFFUL << 0) 
#define TIM13_CCR3_CCR3_L_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define TIM13_CCR4_CCR4_H          (0xFFFFUL << 16) 
#define TIM13_CCR4_CCR4_H_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define TIM13_CCR4_CCR4_L          (0xFFFFUL << 0) 
#define TIM13_CCR4_CCR4_L_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define TIM13_DCR_DBL          (0x1FUL << 8) 
#define TIM13_DCR_DBL_VAL(X) (((uint32_t)(X) & 0x1FUL) << 8)
#define TIM13_DCR_DBA          (0x1FUL << 0) 
#define TIM13_DCR_DBA_VAL(X) (((uint32_t)(X) & 0x1FUL) << 0)
#define TIM13_DMAR_DMAB          (0xFFFFUL << 0) 
#define TIM13_DMAR_DMAB_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 0)
#define TIM13_AF1_ETRSEL          (0xFUL << 14) 
#define TIM13_AF1_ETRSEL_VAL(X) (((uint32_t)(X) & 0xFUL) << 14)
#define TIM13_TISEL_TI1SEL          (0xFUL << 0) 
#define TIM13_TISEL_TI1SEL_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define TIM13_TISEL_TI2SEL          (0xFUL << 8) 
#define TIM13_TISEL_TI2SEL_VAL(X) (((uint32_t)(X) & 0xFUL) << 8)
#define TIM13_TISEL_TI3SEL          (0xFUL << 16) 
#define TIM13_TISEL_TI3SEL_VAL(X) (((uint32_t)(X) & 0xFUL) << 16)
#define TIM13_TISEL_TI4SEL          (0xFUL << 24) 
#define TIM13_TISEL_TI4SEL_VAL(X) (((uint32_t)(X) & 0xFUL) << 24)

#define TIM13  ((struct TIM13*)(0x40001C00UL))
struct TIM14 {
  volatile uint32_t CR1;
  volatile uint32_t CR2;
  volatile uint32_t SMCR;
  volatile uint32_t DIER;
  volatile uint32_t SR;
  volatile uint32_t EGR;
  volatile uint32_t CCMR1_Output;
  volatile uint32_t CCMR1_Input;
  volatile uint32_t CCMR2_Output;
  volatile uint32_t CCMR2_Input;
  volatile uint32_t CCER;
  volatile uint32_t CNT;
  volatile uint32_t PSC;
  volatile uint32_t ARR;
  const volatile uint32_t RESERVED52[1];
  volatile uint32_t CCR1;
  volatile uint32_t CCR2;
  volatile uint32_t CCR3;
  volatile uint32_t CCR4;
  const volatile uint32_t RESERVED72[1];
  volatile uint32_t DCR;
  volatile uint32_t DMAR;
  const volatile uint32_t RESERVED96[4];
  volatile uint32_t AF1;
  const volatile uint32_t RESERVED104[1];
  volatile uint32_t TISEL;
};
