via/viaems/src/platforms/stm32h743/device.h
#define TIM7  ((struct TIM7*)(0x40001400UL))
struct NVIC {
  volatile uint32_t ISER0;
  volatile uint32_t ISER1;
  volatile uint32_t ISER2;
  volatile uint32_t ISER3;
  volatile uint32_t ISER4;
  const volatile uint32_t RESERVED128[27];
  volatile uint32_t ICER0;
  volatile uint32_t ICER1;
  volatile uint32_t ICER2;
  volatile uint32_t ICER3;
  volatile uint32_t ICER4;
  const volatile uint32_t RESERVED256[27];
  volatile uint32_t ISPR0;
  volatile uint32_t ISPR1;
  volatile uint32_t ISPR2;
  volatile uint32_t ISPR3;
  volatile uint32_t ISPR4;
  const volatile uint32_t RESERVED384[27];
  volatile uint32_t ICPR0;
  volatile uint32_t ICPR1;
  volatile uint32_t ICPR2;
  const volatile uint32_t RESERVED448[13];
  volatile uint32_t ICPR3;
  volatile uint32_t ICPR4;
  const volatile uint32_t RESERVED512[14];
  volatile const uint32_t IABR0;
  volatile const uint32_t IABR1;
  volatile const uint32_t IABR2;
  volatile uint32_t IABR3;
  volatile uint32_t IABR4;
  const volatile uint32_t RESERVED768[59];
  volatile uint32_t IPR0;
  volatile uint32_t IPR1;
  volatile uint32_t IPR2;
  volatile uint32_t IPR3;
  volatile uint32_t IPR4;
  volatile uint32_t IPR5;
  volatile uint32_t IPR6;
  volatile uint32_t IPR7;
  volatile uint32_t IPR8;
  volatile uint32_t IPR9;
  volatile uint32_t IPR10;
  volatile uint32_t IPR11;
  volatile uint32_t IPR12;
  volatile uint32_t IPR13;
  volatile uint32_t IPR14;
  volatile uint32_t IPR15;
  volatile uint32_t IPR16;
  volatile uint32_t IPR17;
  volatile uint32_t IPR18;
  volatile uint32_t IPR19;
  volatile uint32_t IPR20;
  volatile uint32_t IPR21;
  volatile uint32_t IPR22;
  volatile uint32_t IPR23;
  volatile uint32_t IPR24;
  volatile uint32_t IPR25;
  volatile uint32_t IPR26;
  volatile uint32_t IPR27;
  volatile uint32_t IPR28;
  volatile uint32_t IPR29;
  volatile uint32_t IPR30;
  volatile uint32_t IPR31;
  volatile uint32_t IPR32;
  volatile uint32_t IPR33;
  volatile uint32_t IPR34;
  volatile uint32_t IPR35;
  volatile uint32_t IPR36;
  volatile uint32_t IPR37;
  volatile uint32_t IPR38;
  volatile uint32_t IPR39;
};
#define NVIC_ISER0_SETENA          (0xFFFFFFFFUL << 0) 
#define NVIC_ISER0_SETENA_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define NVIC_ISER1_SETENA          (0xFFFFFFFFUL << 0) 
#define NVIC_ISER1_SETENA_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define NVIC_ISER2_SETENA          (0xFFFFFFFFUL << 0) 
#define NVIC_ISER2_SETENA_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define NVIC_ICER0_CLRENA          (0xFFFFFFFFUL << 0) 
#define NVIC_ICER0_CLRENA_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define NVIC_ICER1_CLRENA          (0xFFFFFFFFUL << 0) 
#define NVIC_ICER1_CLRENA_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define NVIC_ICER2_CLRENA          (0xFFFFFFFFUL << 0) 
#define NVIC_ICER2_CLRENA_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define NVIC_ISPR0_SETPEND          (0xFFFFFFFFUL << 0) 
#define NVIC_ISPR0_SETPEND_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define NVIC_ISPR1_SETPEND          (0xFFFFFFFFUL << 0) 
#define NVIC_ISPR1_SETPEND_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define NVIC_ISPR2_SETPEND          (0xFFFFFFFFUL << 0) 
#define NVIC_ISPR2_SETPEND_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define NVIC_ICPR0_CLRPEND          (0xFFFFFFFFUL << 0) 
#define NVIC_ICPR0_CLRPEND_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define NVIC_ICPR1_CLRPEND          (0xFFFFFFFFUL << 0) 
#define NVIC_ICPR1_CLRPEND_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define NVIC_ICPR2_CLRPEND          (0xFFFFFFFFUL << 0) 
#define NVIC_ICPR2_CLRPEND_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define NVIC_IABR0_ACTIVE          (0xFFFFFFFFUL << 0) 
#define NVIC_IABR0_ACTIVE_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define NVIC_IABR1_ACTIVE          (0xFFFFFFFFUL << 0) 
#define NVIC_IABR1_ACTIVE_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define NVIC_IABR2_ACTIVE          (0xFFFFFFFFUL << 0) 
#define NVIC_IABR2_ACTIVE_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define NVIC_IPR0_IPR_N0          (0xFFUL << 0) 
#define NVIC_IPR0_IPR_N0_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define NVIC_IPR0_IPR_N1          (0xFFUL << 8) 
#define NVIC_IPR0_IPR_N1_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define NVIC_IPR0_IPR_N2          (0xFFUL << 16) 
#define NVIC_IPR0_IPR_N2_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define NVIC_IPR0_IPR_N3          (0xFFUL << 24) 
#define NVIC_IPR0_IPR_N3_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define NVIC_IPR1_IPR_N0          (0xFFUL << 0) 
#define NVIC_IPR1_IPR_N0_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define NVIC_IPR1_IPR_N1          (0xFFUL << 8) 
#define NVIC_IPR1_IPR_N1_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define NVIC_IPR1_IPR_N2          (0xFFUL << 16) 
#define NVIC_IPR1_IPR_N2_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define NVIC_IPR1_IPR_N3          (0xFFUL << 24) 
#define NVIC_IPR1_IPR_N3_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define NVIC_IPR2_IPR_N0          (0xFFUL << 0) 
#define NVIC_IPR2_IPR_N0_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define NVIC_IPR2_IPR_N1          (0xFFUL << 8) 
#define NVIC_IPR2_IPR_N1_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define NVIC_IPR2_IPR_N2          (0xFFUL << 16) 
#define NVIC_IPR2_IPR_N2_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define NVIC_IPR2_IPR_N3          (0xFFUL << 24) 
#define NVIC_IPR2_IPR_N3_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define NVIC_IPR3_IPR_N0          (0xFFUL << 0) 
#define NVIC_IPR3_IPR_N0_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define NVIC_IPR3_IPR_N1          (0xFFUL << 8) 
#define NVIC_IPR3_IPR_N1_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define NVIC_IPR3_IPR_N2          (0xFFUL << 16) 
#define NVIC_IPR3_IPR_N2_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define NVIC_IPR3_IPR_N3          (0xFFUL << 24) 
#define NVIC_IPR3_IPR_N3_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define NVIC_IPR4_IPR_N0          (0xFFUL << 0) 
#define NVIC_IPR4_IPR_N0_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define NVIC_IPR4_IPR_N1          (0xFFUL << 8) 
#define NVIC_IPR4_IPR_N1_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define NVIC_IPR4_IPR_N2          (0xFFUL << 16) 
#define NVIC_IPR4_IPR_N2_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define NVIC_IPR4_IPR_N3          (0xFFUL << 24) 
#define NVIC_IPR4_IPR_N3_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define NVIC_IPR5_IPR_N0          (0xFFUL << 0) 
#define NVIC_IPR5_IPR_N0_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define NVIC_IPR5_IPR_N1          (0xFFUL << 8) 
#define NVIC_IPR5_IPR_N1_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define NVIC_IPR5_IPR_N2          (0xFFUL << 16) 
#define NVIC_IPR5_IPR_N2_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define NVIC_IPR5_IPR_N3          (0xFFUL << 24) 
#define NVIC_IPR5_IPR_N3_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define NVIC_IPR6_IPR_N0          (0xFFUL << 0) 
#define NVIC_IPR6_IPR_N0_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define NVIC_IPR6_IPR_N1          (0xFFUL << 8) 
#define NVIC_IPR6_IPR_N1_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define NVIC_IPR6_IPR_N2          (0xFFUL << 16) 
#define NVIC_IPR6_IPR_N2_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define NVIC_IPR6_IPR_N3          (0xFFUL << 24) 
#define NVIC_IPR6_IPR_N3_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define NVIC_IPR7_IPR_N0          (0xFFUL << 0) 
#define NVIC_IPR7_IPR_N0_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define NVIC_IPR7_IPR_N1          (0xFFUL << 8) 
#define NVIC_IPR7_IPR_N1_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define NVIC_IPR7_IPR_N2          (0xFFUL << 16) 
#define NVIC_IPR7_IPR_N2_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define NVIC_IPR7_IPR_N3          (0xFFUL << 24) 
#define NVIC_IPR7_IPR_N3_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define NVIC_IPR8_IPR_N0          (0xFFUL << 0) 
#define NVIC_IPR8_IPR_N0_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define NVIC_IPR8_IPR_N1          (0xFFUL << 8) 
#define NVIC_IPR8_IPR_N1_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define NVIC_IPR8_IPR_N2          (0xFFUL << 16) 
#define NVIC_IPR8_IPR_N2_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define NVIC_IPR8_IPR_N3          (0xFFUL << 24) 
#define NVIC_IPR8_IPR_N3_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define NVIC_IPR9_IPR_N0          (0xFFUL << 0) 
#define NVIC_IPR9_IPR_N0_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define NVIC_IPR9_IPR_N1          (0xFFUL << 8) 
#define NVIC_IPR9_IPR_N1_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define NVIC_IPR9_IPR_N2          (0xFFUL << 16) 
#define NVIC_IPR9_IPR_N2_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define NVIC_IPR9_IPR_N3          (0xFFUL << 24) 
#define NVIC_IPR9_IPR_N3_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define NVIC_IPR10_IPR_N0          (0xFFUL << 0) 
#define NVIC_IPR10_IPR_N0_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define NVIC_IPR10_IPR_N1          (0xFFUL << 8) 
#define NVIC_IPR10_IPR_N1_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define NVIC_IPR10_IPR_N2          (0xFFUL << 16) 
#define NVIC_IPR10_IPR_N2_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define NVIC_IPR10_IPR_N3          (0xFFUL << 24) 
#define NVIC_IPR10_IPR_N3_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define NVIC_IPR11_IPR_N0          (0xFFUL << 0) 
#define NVIC_IPR11_IPR_N0_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define NVIC_IPR11_IPR_N1          (0xFFUL << 8) 
#define NVIC_IPR11_IPR_N1_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define NVIC_IPR11_IPR_N2          (0xFFUL << 16) 
#define NVIC_IPR11_IPR_N2_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define NVIC_IPR11_IPR_N3          (0xFFUL << 24) 
#define NVIC_IPR11_IPR_N3_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define NVIC_IPR12_IPR_N0          (0xFFUL << 0) 
#define NVIC_IPR12_IPR_N0_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define NVIC_IPR12_IPR_N1          (0xFFUL << 8) 
#define NVIC_IPR12_IPR_N1_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define NVIC_IPR12_IPR_N2          (0xFFUL << 16) 
#define NVIC_IPR12_IPR_N2_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define NVIC_IPR12_IPR_N3          (0xFFUL << 24) 
#define NVIC_IPR12_IPR_N3_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define NVIC_IPR13_IPR_N0          (0xFFUL << 0) 
#define NVIC_IPR13_IPR_N0_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define NVIC_IPR13_IPR_N1          (0xFFUL << 8) 
#define NVIC_IPR13_IPR_N1_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define NVIC_IPR13_IPR_N2          (0xFFUL << 16) 
#define NVIC_IPR13_IPR_N2_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define NVIC_IPR13_IPR_N3          (0xFFUL << 24) 
#define NVIC_IPR13_IPR_N3_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define NVIC_IPR14_IPR_N0          (0xFFUL << 0) 
#define NVIC_IPR14_IPR_N0_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define NVIC_IPR14_IPR_N1          (0xFFUL << 8) 
#define NVIC_IPR14_IPR_N1_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define NVIC_IPR14_IPR_N2          (0xFFUL << 16) 
#define NVIC_IPR14_IPR_N2_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define NVIC_IPR14_IPR_N3          (0xFFUL << 24) 
#define NVIC_IPR14_IPR_N3_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define NVIC_IPR15_IPR_N0          (0xFFUL << 0) 
#define NVIC_IPR15_IPR_N0_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define NVIC_IPR15_IPR_N1          (0xFFUL << 8) 
#define NVIC_IPR15_IPR_N1_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define NVIC_IPR15_IPR_N2          (0xFFUL << 16) 
#define NVIC_IPR15_IPR_N2_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define NVIC_IPR15_IPR_N3          (0xFFUL << 24) 
#define NVIC_IPR15_IPR_N3_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define NVIC_IPR16_IPR_N0          (0xFFUL << 0) 
#define NVIC_IPR16_IPR_N0_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define NVIC_IPR16_IPR_N1          (0xFFUL << 8) 
#define NVIC_IPR16_IPR_N1_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define NVIC_IPR16_IPR_N2          (0xFFUL << 16) 
#define NVIC_IPR16_IPR_N2_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define NVIC_IPR16_IPR_N3          (0xFFUL << 24) 
#define NVIC_IPR16_IPR_N3_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define NVIC_IPR17_IPR_N0          (0xFFUL << 0) 
#define NVIC_IPR17_IPR_N0_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define NVIC_IPR17_IPR_N1          (0xFFUL << 8) 
#define NVIC_IPR17_IPR_N1_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define NVIC_IPR17_IPR_N2          (0xFFUL << 16) 
#define NVIC_IPR17_IPR_N2_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define NVIC_IPR17_IPR_N3          (0xFFUL << 24) 
#define NVIC_IPR17_IPR_N3_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define NVIC_IPR18_IPR_N0          (0xFFUL << 0) 
#define NVIC_IPR18_IPR_N0_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define NVIC_IPR18_IPR_N1          (0xFFUL << 8) 
#define NVIC_IPR18_IPR_N1_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define NVIC_IPR18_IPR_N2          (0xFFUL << 16) 
#define NVIC_IPR18_IPR_N2_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define NVIC_IPR18_IPR_N3          (0xFFUL << 24) 
#define NVIC_IPR18_IPR_N3_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define NVIC_IPR19_IPR_N0          (0xFFUL << 0) 
#define NVIC_IPR19_IPR_N0_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define NVIC_IPR19_IPR_N1          (0xFFUL << 8) 
#define NVIC_IPR19_IPR_N1_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define NVIC_IPR19_IPR_N2          (0xFFUL << 16) 
#define NVIC_IPR19_IPR_N2_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define NVIC_IPR19_IPR_N3          (0xFFUL << 24) 
#define NVIC_IPR19_IPR_N3_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define NVIC_IPR20_IPR_N0          (0xFFUL << 0) 
#define NVIC_IPR20_IPR_N0_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define NVIC_IPR20_IPR_N1          (0xFFUL << 8) 
#define NVIC_IPR20_IPR_N1_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define NVIC_IPR20_IPR_N2          (0xFFUL << 16) 
#define NVIC_IPR20_IPR_N2_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define NVIC_IPR20_IPR_N3          (0xFFUL << 24) 
#define NVIC_IPR20_IPR_N3_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define NVIC_IPR21_IPR_N0          (0xFFUL << 0) 
#define NVIC_IPR21_IPR_N0_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define NVIC_IPR21_IPR_N1          (0xFFUL << 8) 
#define NVIC_IPR21_IPR_N1_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define NVIC_IPR21_IPR_N2          (0xFFUL << 16) 
#define NVIC_IPR21_IPR_N2_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define NVIC_IPR21_IPR_N3          (0xFFUL << 24) 
#define NVIC_IPR21_IPR_N3_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define NVIC_IPR22_IPR_N0          (0xFFUL << 0) 
#define NVIC_IPR22_IPR_N0_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define NVIC_IPR22_IPR_N1          (0xFFUL << 8) 
#define NVIC_IPR22_IPR_N1_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define NVIC_IPR22_IPR_N2          (0xFFUL << 16) 
#define NVIC_IPR22_IPR_N2_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define NVIC_IPR22_IPR_N3          (0xFFUL << 24) 
#define NVIC_IPR22_IPR_N3_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define NVIC_IPR23_IPR_N0          (0xFFUL << 0) 
#define NVIC_IPR23_IPR_N0_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define NVIC_IPR23_IPR_N1          (0xFFUL << 8) 
#define NVIC_IPR23_IPR_N1_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define NVIC_IPR23_IPR_N2          (0xFFUL << 16) 
#define NVIC_IPR23_IPR_N2_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define NVIC_IPR23_IPR_N3          (0xFFUL << 24) 
#define NVIC_IPR23_IPR_N3_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define NVIC_IPR24_IPR_N0          (0xFFUL << 0) 
#define NVIC_IPR24_IPR_N0_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define NVIC_IPR24_IPR_N1          (0xFFUL << 8) 
#define NVIC_IPR24_IPR_N1_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define NVIC_IPR24_IPR_N2          (0xFFUL << 16) 
#define NVIC_IPR24_IPR_N2_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define NVIC_IPR24_IPR_N3          (0xFFUL << 24) 
#define NVIC_IPR24_IPR_N3_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define NVIC_IPR25_IPR_N0          (0xFFUL << 0) 
#define NVIC_IPR25_IPR_N0_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define NVIC_IPR25_IPR_N1          (0xFFUL << 8) 
#define NVIC_IPR25_IPR_N1_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define NVIC_IPR25_IPR_N2          (0xFFUL << 16) 
#define NVIC_IPR25_IPR_N2_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define NVIC_IPR25_IPR_N3          (0xFFUL << 24) 
#define NVIC_IPR25_IPR_N3_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define NVIC_IPR26_IPR_N0          (0xFFUL << 0) 
#define NVIC_IPR26_IPR_N0_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define NVIC_IPR26_IPR_N1          (0xFFUL << 8) 
#define NVIC_IPR26_IPR_N1_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define NVIC_IPR26_IPR_N2          (0xFFUL << 16) 
#define NVIC_IPR26_IPR_N2_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define NVIC_IPR26_IPR_N3          (0xFFUL << 24) 
#define NVIC_IPR26_IPR_N3_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define NVIC_IPR27_IPR_N0          (0xFFUL << 0) 
#define NVIC_IPR27_IPR_N0_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define NVIC_IPR27_IPR_N1          (0xFFUL << 8) 
#define NVIC_IPR27_IPR_N1_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define NVIC_IPR27_IPR_N2          (0xFFUL << 16) 
#define NVIC_IPR27_IPR_N2_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define NVIC_IPR27_IPR_N3          (0xFFUL << 24) 
#define NVIC_IPR27_IPR_N3_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define NVIC_IPR28_IPR_N0          (0xFFUL << 0) 
#define NVIC_IPR28_IPR_N0_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define NVIC_IPR28_IPR_N1          (0xFFUL << 8) 
#define NVIC_IPR28_IPR_N1_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define NVIC_IPR28_IPR_N2          (0xFFUL << 16) 
#define NVIC_IPR28_IPR_N2_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define NVIC_IPR28_IPR_N3          (0xFFUL << 24) 
#define NVIC_IPR28_IPR_N3_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define NVIC_IPR29_IPR_N0          (0xFFUL << 0) 
#define NVIC_IPR29_IPR_N0_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define NVIC_IPR29_IPR_N1          (0xFFUL << 8) 
#define NVIC_IPR29_IPR_N1_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define NVIC_IPR29_IPR_N2          (0xFFUL << 16) 
#define NVIC_IPR29_IPR_N2_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define NVIC_IPR29_IPR_N3          (0xFFUL << 24) 
#define NVIC_IPR29_IPR_N3_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define NVIC_IPR30_IPR_N0          (0xFFUL << 0) 
#define NVIC_IPR30_IPR_N0_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define NVIC_IPR30_IPR_N1          (0xFFUL << 8) 
#define NVIC_IPR30_IPR_N1_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define NVIC_IPR30_IPR_N2          (0xFFUL << 16) 
#define NVIC_IPR30_IPR_N2_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define NVIC_IPR30_IPR_N3          (0xFFUL << 24) 
#define NVIC_IPR30_IPR_N3_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define NVIC_IPR31_IPR_N0          (0xFFUL << 0) 
#define NVIC_IPR31_IPR_N0_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define NVIC_IPR31_IPR_N1          (0xFFUL << 8) 
#define NVIC_IPR31_IPR_N1_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define NVIC_IPR31_IPR_N2          (0xFFUL << 16) 
#define NVIC_IPR31_IPR_N2_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define NVIC_IPR31_IPR_N3          (0xFFUL << 24) 
#define NVIC_IPR31_IPR_N3_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define NVIC_IPR32_IPR_N0          (0xFFUL << 0) 
#define NVIC_IPR32_IPR_N0_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define NVIC_IPR32_IPR_N1          (0xFFUL << 8) 
#define NVIC_IPR32_IPR_N1_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define NVIC_IPR32_IPR_N2          (0xFFUL << 16) 
#define NVIC_IPR32_IPR_N2_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define NVIC_IPR32_IPR_N3          (0xFFUL << 24) 
#define NVIC_IPR32_IPR_N3_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define NVIC_IPR33_IPR_N0          (0xFFUL << 0) 
#define NVIC_IPR33_IPR_N0_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define NVIC_IPR33_IPR_N1          (0xFFUL << 8) 
#define NVIC_IPR33_IPR_N1_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define NVIC_IPR33_IPR_N2          (0xFFUL << 16) 
#define NVIC_IPR33_IPR_N2_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define NVIC_IPR33_IPR_N3          (0xFFUL << 24) 
#define NVIC_IPR33_IPR_N3_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define NVIC_IPR34_IPR_N0          (0xFFUL << 0) 
#define NVIC_IPR34_IPR_N0_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define NVIC_IPR34_IPR_N1          (0xFFUL << 8) 
#define NVIC_IPR34_IPR_N1_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define NVIC_IPR34_IPR_N2          (0xFFUL << 16) 
#define NVIC_IPR34_IPR_N2_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define NVIC_IPR34_IPR_N3          (0xFFUL << 24) 
#define NVIC_IPR34_IPR_N3_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define NVIC_IPR35_IPR_N0          (0xFFUL << 0) 
#define NVIC_IPR35_IPR_N0_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define NVIC_IPR35_IPR_N1          (0xFFUL << 8) 
#define NVIC_IPR35_IPR_N1_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define NVIC_IPR35_IPR_N2          (0xFFUL << 16) 
#define NVIC_IPR35_IPR_N2_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define NVIC_IPR35_IPR_N3          (0xFFUL << 24) 
#define NVIC_IPR35_IPR_N3_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define NVIC_IPR36_IPR_N0          (0xFFUL << 0) 
#define NVIC_IPR36_IPR_N0_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define NVIC_IPR36_IPR_N1          (0xFFUL << 8) 
#define NVIC_IPR36_IPR_N1_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define NVIC_IPR36_IPR_N2          (0xFFUL << 16) 
#define NVIC_IPR36_IPR_N2_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define NVIC_IPR36_IPR_N3          (0xFFUL << 24) 
#define NVIC_IPR36_IPR_N3_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define NVIC_IPR37_IPR_N0          (0xFFUL << 0) 
#define NVIC_IPR37_IPR_N0_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define NVIC_IPR37_IPR_N1          (0xFFUL << 8) 
#define NVIC_IPR37_IPR_N1_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define NVIC_IPR37_IPR_N2          (0xFFUL << 16) 
#define NVIC_IPR37_IPR_N2_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define NVIC_IPR37_IPR_N3          (0xFFUL << 24) 
#define NVIC_IPR37_IPR_N3_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define NVIC_IPR38_IPR_N0          (0xFFUL << 0) 
#define NVIC_IPR38_IPR_N0_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define NVIC_IPR38_IPR_N1          (0xFFUL << 8) 
#define NVIC_IPR38_IPR_N1_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define NVIC_IPR38_IPR_N2          (0xFFUL << 16) 
#define NVIC_IPR38_IPR_N2_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define NVIC_IPR38_IPR_N3          (0xFFUL << 24) 
#define NVIC_IPR38_IPR_N3_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define NVIC_IPR39_IPR_N0          (0xFFUL << 0) 
#define NVIC_IPR39_IPR_N0_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define NVIC_IPR39_IPR_N1          (0xFFUL << 8) 
#define NVIC_IPR39_IPR_N1_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define NVIC_IPR39_IPR_N2          (0xFFUL << 16) 
#define NVIC_IPR39_IPR_N2_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define NVIC_IPR39_IPR_N3          (0xFFUL << 24) 
#define NVIC_IPR39_IPR_N3_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)

