via/viaems/src/platforms/stm32h743/device.h
#define NVIC  ((struct NVIC*)(0xE000E100UL))
struct DBGMCU {
  volatile const uint32_t IDC;
  volatile uint32_t CR;
  const volatile uint32_t RESERVED52[11];
  volatile uint32_t APB3FZ1;
  const volatile uint32_t RESERVED60[1];
  volatile uint32_t APB1LFZ1;
  const volatile uint32_t RESERVED76[3];
  volatile uint32_t APB2FZ1;
  const volatile uint32_t RESERVED84[1];
  volatile uint32_t APB4FZ1;
};
#define DBGMCU_IDC_DEV_ID          (0xFFFUL << 0) 
#define DBGMCU_IDC_DEV_ID_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 0)
#define DBGMCU_IDC_REV_ID          (0xFFFFUL << 16) 
#define DBGMCU_IDC_REV_ID_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define DBGMCU_CR_DBGSLEEP_D1          (0x1UL << 0) 
#define DBGMCU_CR_DBGSLEEP_D1_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define DBGMCU_CR_DBGSTOP_D1          (0x1UL << 1) 
#define DBGMCU_CR_DBGSTOP_D1_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define DBGMCU_CR_DBGSTBY_D1          (0x1UL << 2) 
#define DBGMCU_CR_DBGSTBY_D1_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define DBGMCU_CR_DBGSLEEP_D2          (0x1UL << 3) 
#define DBGMCU_CR_DBGSLEEP_D2_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define DBGMCU_CR_DBGSTOP_D2          (0x1UL << 4) 
#define DBGMCU_CR_DBGSTOP_D2_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define DBGMCU_CR_DBGSTBY_D2          (0x1UL << 5) 
#define DBGMCU_CR_DBGSTBY_D2_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define DBGMCU_CR_DBGSTOP_D3          (0x1UL << 7) 
#define DBGMCU_CR_DBGSTOP_D3_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define DBGMCU_CR_DBGSTBY_D3          (0x1UL << 8) 
#define DBGMCU_CR_DBGSTBY_D3_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DBGMCU_CR_TRACECLKEN          (0x1UL << 20) 
#define DBGMCU_CR_TRACECLKEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 20)
#define DBGMCU_CR_D1DBGCKEN          (0x1UL << 21) 
#define DBGMCU_CR_D1DBGCKEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define DBGMCU_CR_D3DBGCKEN          (0x1UL << 22) 
#define DBGMCU_CR_D3DBGCKEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define DBGMCU_CR_TRGOEN          (0x1UL << 28) 
#define DBGMCU_CR_TRGOEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define DBGMCU_APB3FZ1_WWDG1          (0x1UL << 6) 
#define DBGMCU_APB3FZ1_WWDG1_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define DBGMCU_APB1LFZ1_DBG_TIM2          (0x1UL << 0) 
#define DBGMCU_APB1LFZ1_DBG_TIM2_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define DBGMCU_APB1LFZ1_DBG_TIM3          (0x1UL << 1) 
#define DBGMCU_APB1LFZ1_DBG_TIM3_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define DBGMCU_APB1LFZ1_DBG_TIM4          (0x1UL << 2) 
#define DBGMCU_APB1LFZ1_DBG_TIM4_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define DBGMCU_APB1LFZ1_DBG_TIM5          (0x1UL << 3) 
#define DBGMCU_APB1LFZ1_DBG_TIM5_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define DBGMCU_APB1LFZ1_DBG_TIM6          (0x1UL << 4) 
#define DBGMCU_APB1LFZ1_DBG_TIM6_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define DBGMCU_APB1LFZ1_DBG_TIM7          (0x1UL << 5) 
#define DBGMCU_APB1LFZ1_DBG_TIM7_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define DBGMCU_APB1LFZ1_DBG_TIM12          (0x1UL << 6) 
#define DBGMCU_APB1LFZ1_DBG_TIM12_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define DBGMCU_APB1LFZ1_DBG_TIM13          (0x1UL << 7) 
#define DBGMCU_APB1LFZ1_DBG_TIM13_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define DBGMCU_APB1LFZ1_DBG_TIM14          (0x1UL << 8) 
#define DBGMCU_APB1LFZ1_DBG_TIM14_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define DBGMCU_APB1LFZ1_DBG_LPTIM1          (0x1UL << 9) 
#define DBGMCU_APB1LFZ1_DBG_LPTIM1_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define DBGMCU_APB1LFZ1_DBG_I2C1          (0x1UL << 21) 
#define DBGMCU_APB1LFZ1_DBG_I2C1_VAL(X) (((uint32_t)(X) & 0x1UL) << 21)
#define DBGMCU_APB1LFZ1_DBG_I2C2          (0x1UL << 22) 
#define DBGMCU_APB1LFZ1_DBG_I2C2_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define DBGMCU_APB1LFZ1_DBG_I2C3          (0x1UL << 23) 
#define DBGMCU_APB1LFZ1_DBG_I2C3_VAL(X) (((uint32_t)(X) & 0x1UL) << 23)
#define DBGMCU_APB2FZ1_DBG_TIM1          (0x1UL << 0) 
#define DBGMCU_APB2FZ1_DBG_TIM1_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define DBGMCU_APB2FZ1_DBG_TIM8          (0x1UL << 1) 
#define DBGMCU_APB2FZ1_DBG_TIM8_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define DBGMCU_APB2FZ1_DBG_TIM15          (0x1UL << 16) 
#define DBGMCU_APB2FZ1_DBG_TIM15_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define DBGMCU_APB2FZ1_DBG_TIM16          (0x1UL << 17) 
#define DBGMCU_APB2FZ1_DBG_TIM16_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define DBGMCU_APB2FZ1_DBG_TIM17          (0x1UL << 18) 
#define DBGMCU_APB2FZ1_DBG_TIM17_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define DBGMCU_APB2FZ1_DBG_HRTIM          (0x1UL << 29) 
#define DBGMCU_APB2FZ1_DBG_HRTIM_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define DBGMCU_APB4FZ1_DBG_I2C4          (0x1UL << 7) 
#define DBGMCU_APB4FZ1_DBG_I2C4_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define DBGMCU_APB4FZ1_DBG_LPTIM2          (0x1UL << 9) 
#define DBGMCU_APB4FZ1_DBG_LPTIM2_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define DBGMCU_APB4FZ1_DBG_LPTIM3          (0x1UL << 10) 
#define DBGMCU_APB4FZ1_DBG_LPTIM3_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define DBGMCU_APB4FZ1_DBG_LPTIM4          (0x1UL << 11) 
#define DBGMCU_APB4FZ1_DBG_LPTIM4_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define DBGMCU_APB4FZ1_DBG_LPTIM5          (0x1UL << 12) 
#define DBGMCU_APB4FZ1_DBG_LPTIM5_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define DBGMCU_APB4FZ1_DBG_RTC          (0x1UL << 16) 
#define DBGMCU_APB4FZ1_DBG_RTC_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define DBGMCU_APB4FZ1_DBG_IWDG1          (0x1UL << 18) 
#define DBGMCU_APB4FZ1_DBG_IWDG1_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)

#define DBGMCU  ((struct DBGMCU*)(0x5C001000UL))
struct MPU {
  volatile const uint32_t MPU_TYPER;
  volatile uint32_t MPU_CTRL;
  volatile uint32_t MPU_RNR;
  volatile uint32_t MPU_RBAR;
  volatile uint32_t MPU_RASR;
};
#define MPU_MPU_TYPER_SEPARATE          (0x1UL << 0) 
#define MPU_MPU_TYPER_SEPARATE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MPU_MPU_TYPER_DREGION          (0xFFUL << 8) 
#define MPU_MPU_TYPER_DREGION_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define MPU_MPU_TYPER_IREGION          (0xFFUL << 16) 
#define MPU_MPU_TYPER_IREGION_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define MPU_MPU_CTRL_ENABLE          (0x1UL << 0) 
#define MPU_MPU_CTRL_ENABLE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MPU_MPU_CTRL_HFNMIENA          (0x1UL << 1) 
#define MPU_MPU_CTRL_HFNMIENA_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define MPU_MPU_CTRL_PRIVDEFENA          (0x1UL << 2) 
#define MPU_MPU_CTRL_PRIVDEFENA_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define MPU_MPU_RNR_REGION          (0xFFUL << 0) 
#define MPU_MPU_RNR_REGION_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define MPU_MPU_RBAR_REGION          (0xFUL << 0) 
#define MPU_MPU_RBAR_REGION_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define MPU_MPU_RBAR_VALID          (0x1UL << 4) 
#define MPU_MPU_RBAR_VALID_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define MPU_MPU_RBAR_ADDR          (0x7FFFFFFUL << 5) 
#define MPU_MPU_RBAR_ADDR_VAL(X) (((uint32_t)(X) & 0x7FFFFFFUL) << 5)
#define MPU_MPU_RASR_ENABLE          (0x1UL << 0) 
#define MPU_MPU_RASR_ENABLE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define MPU_MPU_RASR_SIZE          (0x1FUL << 1) 
#define MPU_MPU_RASR_SIZE_VAL(X) (((uint32_t)(X) & 0x1FUL) << 1)
#define MPU_MPU_RASR_SRD          (0xFFUL << 8) 
#define MPU_MPU_RASR_SRD_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define MPU_MPU_RASR_B          (0x1UL << 16) 
#define MPU_MPU_RASR_B_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define MPU_MPU_RASR_C          (0x1UL << 17) 
#define MPU_MPU_RASR_C_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define MPU_MPU_RASR_S          (0x1UL << 18) 
#define MPU_MPU_RASR_S_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define MPU_MPU_RASR_TEX          (0x7UL << 19) 
#define MPU_MPU_RASR_TEX_VAL(X) (((uint32_t)(X) & 0x7UL) << 19)
#define MPU_MPU_RASR_AP          (0x7UL << 24) 
#define MPU_MPU_RASR_AP_VAL(X) (((uint32_t)(X) & 0x7UL) << 24)
#define MPU_MPU_RASR_XN          (0x1UL << 28) 
#define MPU_MPU_RASR_XN_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)

#define MPU  ((struct MPU*)(0xE000ED90UL))
struct STK {
  volatile uint32_t CSR;
  volatile uint32_t RVR;
  volatile uint32_t CVR;
  volatile uint32_t CALIB;
};
#define STK_CSR_ENABLE          (0x1UL << 0) 
#define STK_CSR_ENABLE_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define STK_CSR_TICKINT          (0x1UL << 1) 
#define STK_CSR_TICKINT_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define STK_CSR_CLKSOURCE          (0x1UL << 2) 
#define STK_CSR_CLKSOURCE_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define STK_CSR_COUNTFLAG          (0x1UL << 16) 
#define STK_CSR_COUNTFLAG_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define STK_RVR_RELOAD          (0xFFFFFFUL << 0) 
#define STK_RVR_RELOAD_VAL(X) (((uint32_t)(X) & 0xFFFFFFUL) << 0)
#define STK_CVR_CURRENT          (0xFFFFFFUL << 0) 
#define STK_CVR_CURRENT_VAL(X) (((uint32_t)(X) & 0xFFFFFFUL) << 0)
#define STK_CALIB_TENMS          (0xFFFFFFUL << 0) 
#define STK_CALIB_TENMS_VAL(X) (((uint32_t)(X) & 0xFFFFFFUL) << 0)
#define STK_CALIB_SKEW          (0x1UL << 30) 
#define STK_CALIB_SKEW_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define STK_CALIB_NOREF          (0x1UL << 31) 
#define STK_CALIB_NOREF_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)

#define STK  ((struct STK*)(0xE000E010UL))
struct NVIC_STIR {
  volatile uint32_t STIR;
};
#define NVIC_STIR_STIR_INTID          (0x1FFUL << 0) 
#define NVIC_STIR_STIR_INTID_VAL(X) (((uint32_t)(X) & 0x1FFUL) << 0)

