via/viaems/src/platforms/stm32h743/device.h
#define NVIC_STIR  ((struct NVIC_STIR*)(0xE000EF00UL))
struct FPU_CPACR {
  volatile uint32_t CPACR;
};
#define FPU_CPACR_CPACR_CP          (0xFUL << 20) 
#define FPU_CPACR_CPACR_CP_VAL(X) (((uint32_t)(X) & 0xFUL) << 20)

#define FPU_CPACR  ((struct FPU_CPACR*)(0xE000ED88UL))
struct SCB_ACTRL {
  volatile uint32_t ACTRL;
};
#define SCB_ACTRL_ACTRL_DISFOLD          (0x1UL << 2) 
#define SCB_ACTRL_ACTRL_DISFOLD_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define SCB_ACTRL_ACTRL_FPEXCODIS          (0x1UL << 10) 
#define SCB_ACTRL_ACTRL_FPEXCODIS_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define SCB_ACTRL_ACTRL_DISRAMODE          (0x1UL << 11) 
#define SCB_ACTRL_ACTRL_DISRAMODE_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define SCB_ACTRL_ACTRL_DISITMATBFLUSH          (0x1UL << 12) 
#define SCB_ACTRL_ACTRL_DISITMATBFLUSH_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)

#define SCB_ACTRL  ((struct SCB_ACTRL*)(0xE000E008UL))
struct FPU {
  volatile uint32_t FPCCR;
  volatile uint32_t FPCAR;
  volatile uint32_t FPSCR;
};
#define FPU_FPCCR_LSPACT          (0x1UL << 0) 
#define FPU_FPCCR_LSPACT_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define FPU_FPCCR_USER          (0x1UL << 1) 
#define FPU_FPCCR_USER_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define FPU_FPCCR_THREAD          (0x1UL << 3) 
#define FPU_FPCCR_THREAD_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define FPU_FPCCR_HFRDY          (0x1UL << 4) 
#define FPU_FPCCR_HFRDY_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define FPU_FPCCR_MMRDY          (0x1UL << 5) 
#define FPU_FPCCR_MMRDY_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define FPU_FPCCR_BFRDY          (0x1UL << 6) 
#define FPU_FPCCR_BFRDY_VAL(X) (((uint32_t)(X) & 0x1UL) << 6)
#define FPU_FPCCR_MONRDY          (0x1UL << 8) 
#define FPU_FPCCR_MONRDY_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define FPU_FPCCR_LSPEN          (0x1UL << 30) 
#define FPU_FPCCR_LSPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define FPU_FPCCR_ASPEN          (0x1UL << 31) 
#define FPU_FPCCR_ASPEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define FPU_FPCAR_ADDRESS          (0x1FFFFFFFUL << 3) 
#define FPU_FPCAR_ADDRESS_VAL(X) (((uint32_t)(X) & 0x1FFFFFFFUL) << 3)
#define FPU_FPSCR_IOC          (0x1UL << 0) 
#define FPU_FPSCR_IOC_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define FPU_FPSCR_DZC          (0x1UL << 1) 
#define FPU_FPSCR_DZC_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define FPU_FPSCR_OFC          (0x1UL << 2) 
#define FPU_FPSCR_OFC_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define FPU_FPSCR_UFC          (0x1UL << 3) 
#define FPU_FPSCR_UFC_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define FPU_FPSCR_IXC          (0x1UL << 4) 
#define FPU_FPSCR_IXC_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define FPU_FPSCR_IDC          (0x1UL << 7) 
#define FPU_FPSCR_IDC_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define FPU_FPSCR_RMode          (0x3UL << 22) 
#define FPU_FPSCR_RMode_VAL(X) (((uint32_t)(X) & 0x3UL) << 22)
#define FPU_FPSCR_FZ          (0x1UL << 24) 
#define FPU_FPSCR_FZ_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define FPU_FPSCR_DN          (0x1UL << 25) 
#define FPU_FPSCR_DN_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define FPU_FPSCR_AHP          (0x1UL << 26) 
#define FPU_FPSCR_AHP_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define FPU_FPSCR_V          (0x1UL << 28) 
#define FPU_FPSCR_V_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define FPU_FPSCR_C          (0x1UL << 29) 
#define FPU_FPSCR_C_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define FPU_FPSCR_Z          (0x1UL << 30) 
#define FPU_FPSCR_Z_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define FPU_FPSCR_N          (0x1UL << 31) 
#define FPU_FPSCR_N_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)

#define FPU  ((struct FPU*)(0xE000EF34UL))
struct SCB {
  volatile const uint32_t CPUID;
  volatile uint32_t ICSR;
  volatile uint32_t VTOR;
  volatile uint32_t AIRCR;
  volatile uint32_t SCR;
  volatile uint32_t CCR;
  volatile uint32_t SHPR1;
  volatile uint32_t SHPR2;
  volatile uint32_t SHPR3;
  volatile uint32_t SHCSR;
  volatile uint32_t CFSR_UFSR_BFSR_MMFSR;
  volatile uint32_t HFSR;
  const volatile uint32_t RESERVED52[1];
  volatile uint32_t MMFAR;
  volatile uint32_t BFAR;
};
#define SCB_CPUID_Revision          (0xFUL << 0) 
#define SCB_CPUID_Revision_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define SCB_CPUID_PartNo          (0xFFFUL << 4) 
#define SCB_CPUID_PartNo_VAL(X) (((uint32_t)(X) & 0xFFFUL) << 4)
#define SCB_CPUID_Constant          (0xFUL << 16) 
#define SCB_CPUID_Constant_VAL(X) (((uint32_t)(X) & 0xFUL) << 16)
#define SCB_CPUID_Variant          (0xFUL << 20) 
#define SCB_CPUID_Variant_VAL(X) (((uint32_t)(X) & 0xFUL) << 20)
#define SCB_CPUID_Implementer          (0xFFUL << 24) 
#define SCB_CPUID_Implementer_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define SCB_ICSR_VECTACTIVE          (0x1FFUL << 0) 
#define SCB_ICSR_VECTACTIVE_VAL(X) (((uint32_t)(X) & 0x1FFUL) << 0)
#define SCB_ICSR_RETTOBASE          (0x1UL << 11) 
#define SCB_ICSR_RETTOBASE_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define SCB_ICSR_VECTPENDING          (0x7FUL << 12) 
#define SCB_ICSR_VECTPENDING_VAL(X) (((uint32_t)(X) & 0x7FUL) << 12)
#define SCB_ICSR_ISRPENDING          (0x1UL << 22) 
#define SCB_ICSR_ISRPENDING_VAL(X) (((uint32_t)(X) & 0x1UL) << 22)
#define SCB_ICSR_PENDSTCLR          (0x1UL << 25) 
#define SCB_ICSR_PENDSTCLR_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define SCB_ICSR_PENDSTSET          (0x1UL << 26) 
#define SCB_ICSR_PENDSTSET_VAL(X) (((uint32_t)(X) & 0x1UL) << 26)
#define SCB_ICSR_PENDSVCLR          (0x1UL << 27) 
#define SCB_ICSR_PENDSVCLR_VAL(X) (((uint32_t)(X) & 0x1UL) << 27)
#define SCB_ICSR_PENDSVSET          (0x1UL << 28) 
#define SCB_ICSR_PENDSVSET_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define SCB_ICSR_NMIPENDSET          (0x1UL << 31) 
#define SCB_ICSR_NMIPENDSET_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define SCB_VTOR_TBLOFF          (0x1FFFFFUL << 9) 
#define SCB_VTOR_TBLOFF_VAL(X) (((uint32_t)(X) & 0x1FFFFFUL) << 9)
#define SCB_AIRCR_VECTRESET          (0x1UL << 0) 
#define SCB_AIRCR_VECTRESET_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define SCB_AIRCR_VECTCLRACTIVE          (0x1UL << 1) 
#define SCB_AIRCR_VECTCLRACTIVE_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define SCB_AIRCR_SYSRESETREQ          (0x1UL << 2) 
#define SCB_AIRCR_SYSRESETREQ_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define SCB_AIRCR_PRIGROUP          (0x7UL << 8) 
#define SCB_AIRCR_PRIGROUP_VAL(X) (((uint32_t)(X) & 0x7UL) << 8)
#define SCB_AIRCR_ENDIANESS          (0x1UL << 15) 
#define SCB_AIRCR_ENDIANESS_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define SCB_AIRCR_VECTKEYSTAT          (0xFFFFUL << 16) 
#define SCB_AIRCR_VECTKEYSTAT_VAL(X) (((uint32_t)(X) & 0xFFFFUL) << 16)
#define SCB_SCR_SLEEPONEXIT          (0x1UL << 1) 
#define SCB_SCR_SLEEPONEXIT_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define SCB_SCR_SLEEPDEEP          (0x1UL << 2) 
#define SCB_SCR_SLEEPDEEP_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define SCB_SCR_SEVEONPEND          (0x1UL << 4) 
#define SCB_SCR_SEVEONPEND_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define SCB_CCR_NONBASETHRDENA          (0x1UL << 0) 
#define SCB_CCR_NONBASETHRDENA_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define SCB_CCR_USERSETMPEND          (0x1UL << 1) 
#define SCB_CCR_USERSETMPEND_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define SCB_CCR_UNALIGN__TRP          (0x1UL << 3) 
#define SCB_CCR_UNALIGN__TRP_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define SCB_CCR_DIV_0_TRP          (0x1UL << 4) 
#define SCB_CCR_DIV_0_TRP_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define SCB_CCR_BFHFNMIGN          (0x1UL << 8) 
#define SCB_CCR_BFHFNMIGN_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define SCB_CCR_STKALIGN          (0x1UL << 9) 
#define SCB_CCR_STKALIGN_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define SCB_CCR_DC          (0x1UL << 16) 
#define SCB_CCR_DC_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define SCB_CCR_IC          (0x1UL << 17) 
#define SCB_CCR_IC_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define SCB_CCR_BP          (0x1UL << 18) 
#define SCB_CCR_BP_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define SCB_SHPR1_PRI_4          (0xFFUL << 0) 
#define SCB_SHPR1_PRI_4_VAL(X) (((uint32_t)(X) & 0xFFUL) << 0)
#define SCB_SHPR1_PRI_5          (0xFFUL << 8) 
#define SCB_SHPR1_PRI_5_VAL(X) (((uint32_t)(X) & 0xFFUL) << 8)
#define SCB_SHPR1_PRI_6          (0xFFUL << 16) 
#define SCB_SHPR1_PRI_6_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define SCB_SHPR2_PRI_11          (0xFFUL << 24) 
#define SCB_SHPR2_PRI_11_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define SCB_SHPR3_PRI_14          (0xFFUL << 16) 
#define SCB_SHPR3_PRI_14_VAL(X) (((uint32_t)(X) & 0xFFUL) << 16)
#define SCB_SHPR3_PRI_15          (0xFFUL << 24) 
#define SCB_SHPR3_PRI_15_VAL(X) (((uint32_t)(X) & 0xFFUL) << 24)
#define SCB_SHCSR_MEMFAULTACT          (0x1UL << 0) 
#define SCB_SHCSR_MEMFAULTACT_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define SCB_SHCSR_BUSFAULTACT          (0x1UL << 1) 
#define SCB_SHCSR_BUSFAULTACT_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define SCB_SHCSR_USGFAULTACT          (0x1UL << 3) 
#define SCB_SHCSR_USGFAULTACT_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define SCB_SHCSR_SVCALLACT          (0x1UL << 7) 
#define SCB_SHCSR_SVCALLACT_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define SCB_SHCSR_MONITORACT          (0x1UL << 8) 
#define SCB_SHCSR_MONITORACT_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define SCB_SHCSR_PENDSVACT          (0x1UL << 10) 
#define SCB_SHCSR_PENDSVACT_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define SCB_SHCSR_SYSTICKACT          (0x1UL << 11) 
#define SCB_SHCSR_SYSTICKACT_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define SCB_SHCSR_USGFAULTPENDED          (0x1UL << 12) 
#define SCB_SHCSR_USGFAULTPENDED_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define SCB_SHCSR_MEMFAULTPENDED          (0x1UL << 13) 
#define SCB_SHCSR_MEMFAULTPENDED_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define SCB_SHCSR_BUSFAULTPENDED          (0x1UL << 14) 
#define SCB_SHCSR_BUSFAULTPENDED_VAL(X) (((uint32_t)(X) & 0x1UL) << 14)
#define SCB_SHCSR_SVCALLPENDED          (0x1UL << 15) 
#define SCB_SHCSR_SVCALLPENDED_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define SCB_SHCSR_MEMFAULTENA          (0x1UL << 16) 
#define SCB_SHCSR_MEMFAULTENA_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define SCB_SHCSR_BUSFAULTENA          (0x1UL << 17) 
#define SCB_SHCSR_BUSFAULTENA_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define SCB_SHCSR_USGFAULTENA          (0x1UL << 18) 
#define SCB_SHCSR_USGFAULTENA_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define SCB_CFSR_UFSR_BFSR_MMFSR_IACCVIOL          (0x1UL << 0) 
#define SCB_CFSR_UFSR_BFSR_MMFSR_IACCVIOL_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define SCB_CFSR_UFSR_BFSR_MMFSR_DACCVIOL          (0x1UL << 1) 
#define SCB_CFSR_UFSR_BFSR_MMFSR_DACCVIOL_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define SCB_CFSR_UFSR_BFSR_MMFSR_MUNSTKERR          (0x1UL << 3) 
#define SCB_CFSR_UFSR_BFSR_MMFSR_MUNSTKERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define SCB_CFSR_UFSR_BFSR_MMFSR_MSTKERR          (0x1UL << 4) 
#define SCB_CFSR_UFSR_BFSR_MMFSR_MSTKERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define SCB_CFSR_UFSR_BFSR_MMFSR_MLSPERR          (0x1UL << 5) 
#define SCB_CFSR_UFSR_BFSR_MMFSR_MLSPERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 5)
#define SCB_CFSR_UFSR_BFSR_MMFSR_MMARVALID          (0x1UL << 7) 
#define SCB_CFSR_UFSR_BFSR_MMFSR_MMARVALID_VAL(X) (((uint32_t)(X) & 0x1UL) << 7)
#define SCB_CFSR_UFSR_BFSR_MMFSR_IBUSERR          (0x1UL << 8) 
#define SCB_CFSR_UFSR_BFSR_MMFSR_IBUSERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 8)
#define SCB_CFSR_UFSR_BFSR_MMFSR_PRECISERR          (0x1UL << 9) 
#define SCB_CFSR_UFSR_BFSR_MMFSR_PRECISERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 9)
#define SCB_CFSR_UFSR_BFSR_MMFSR_IMPRECISERR          (0x1UL << 10) 
#define SCB_CFSR_UFSR_BFSR_MMFSR_IMPRECISERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 10)
#define SCB_CFSR_UFSR_BFSR_MMFSR_UNSTKERR          (0x1UL << 11) 
#define SCB_CFSR_UFSR_BFSR_MMFSR_UNSTKERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 11)
#define SCB_CFSR_UFSR_BFSR_MMFSR_STKERR          (0x1UL << 12) 
#define SCB_CFSR_UFSR_BFSR_MMFSR_STKERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 12)
#define SCB_CFSR_UFSR_BFSR_MMFSR_LSPERR          (0x1UL << 13) 
#define SCB_CFSR_UFSR_BFSR_MMFSR_LSPERR_VAL(X) (((uint32_t)(X) & 0x1UL) << 13)
#define SCB_CFSR_UFSR_BFSR_MMFSR_BFARVALID          (0x1UL << 15) 
#define SCB_CFSR_UFSR_BFSR_MMFSR_BFARVALID_VAL(X) (((uint32_t)(X) & 0x1UL) << 15)
#define SCB_CFSR_UFSR_BFSR_MMFSR_UNDEFINSTR          (0x1UL << 16) 
#define SCB_CFSR_UFSR_BFSR_MMFSR_UNDEFINSTR_VAL(X) (((uint32_t)(X) & 0x1UL) << 16)
#define SCB_CFSR_UFSR_BFSR_MMFSR_INVSTATE          (0x1UL << 17) 
#define SCB_CFSR_UFSR_BFSR_MMFSR_INVSTATE_VAL(X) (((uint32_t)(X) & 0x1UL) << 17)
#define SCB_CFSR_UFSR_BFSR_MMFSR_INVPC          (0x1UL << 18) 
#define SCB_CFSR_UFSR_BFSR_MMFSR_INVPC_VAL(X) (((uint32_t)(X) & 0x1UL) << 18)
#define SCB_CFSR_UFSR_BFSR_MMFSR_NOCP          (0x1UL << 19) 
#define SCB_CFSR_UFSR_BFSR_MMFSR_NOCP_VAL(X) (((uint32_t)(X) & 0x1UL) << 19)
#define SCB_CFSR_UFSR_BFSR_MMFSR_UNALIGNED          (0x1UL << 24) 
#define SCB_CFSR_UFSR_BFSR_MMFSR_UNALIGNED_VAL(X) (((uint32_t)(X) & 0x1UL) << 24)
#define SCB_CFSR_UFSR_BFSR_MMFSR_DIVBYZERO          (0x1UL << 25) 
#define SCB_CFSR_UFSR_BFSR_MMFSR_DIVBYZERO_VAL(X) (((uint32_t)(X) & 0x1UL) << 25)
#define SCB_HFSR_VECTTBL          (0x1UL << 1) 
#define SCB_HFSR_VECTTBL_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define SCB_HFSR_FORCED          (0x1UL << 30) 
#define SCB_HFSR_FORCED_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define SCB_HFSR_DEBUG_VT          (0x1UL << 31) 
#define SCB_HFSR_DEBUG_VT_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)
#define SCB_MMFAR_ADDRESS          (0xFFFFFFFFUL << 0) 
#define SCB_MMFAR_ADDRESS_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)
#define SCB_BFAR_ADDRESS          (0xFFFFFFFFUL << 0) 
#define SCB_BFAR_ADDRESS_VAL(X) (((uint32_t)(X) & 0xFFFFFFFFUL) << 0)

#define SCB  ((struct SCB*)(0xE000ED00UL))
struct PF {
  volatile const uint32_t CLIDR;
  volatile const uint32_t CTR;
  volatile const uint32_t CCSIDR;
};
#define PF_CLIDR_CL1          (0x7UL << 0) 
#define PF_CLIDR_CL1_VAL(X) (((uint32_t)(X) & 0x7UL) << 0)
#define PF_CLIDR_CL2          (0x7UL << 3) 
#define PF_CLIDR_CL2_VAL(X) (((uint32_t)(X) & 0x7UL) << 3)
#define PF_CLIDR_CL3          (0x7UL << 6) 
#define PF_CLIDR_CL3_VAL(X) (((uint32_t)(X) & 0x7UL) << 6)
#define PF_CLIDR_CL4          (0x7UL << 9) 
#define PF_CLIDR_CL4_VAL(X) (((uint32_t)(X) & 0x7UL) << 9)
#define PF_CLIDR_CL5          (0x7UL << 12) 
#define PF_CLIDR_CL5_VAL(X) (((uint32_t)(X) & 0x7UL) << 12)
#define PF_CLIDR_CL6          (0x7UL << 15) 
#define PF_CLIDR_CL6_VAL(X) (((uint32_t)(X) & 0x7UL) << 15)
#define PF_CLIDR_CL7          (0x7UL << 18) 
#define PF_CLIDR_CL7_VAL(X) (((uint32_t)(X) & 0x7UL) << 18)
#define PF_CLIDR_LoUIS          (0x7UL << 21) 
#define PF_CLIDR_LoUIS_VAL(X) (((uint32_t)(X) & 0x7UL) << 21)
#define PF_CLIDR_LoC          (0x7UL << 24) 
#define PF_CLIDR_LoC_VAL(X) (((uint32_t)(X) & 0x7UL) << 24)
#define PF_CLIDR_LoU          (0x7UL << 27) 
#define PF_CLIDR_LoU_VAL(X) (((uint32_t)(X) & 0x7UL) << 27)
#define PF_CTR__IminLine          (0xFUL << 0) 
#define PF_CTR__IminLine_VAL(X) (((uint32_t)(X) & 0xFUL) << 0)
#define PF_CTR_DMinLine          (0xFUL << 16) 
#define PF_CTR_DMinLine_VAL(X) (((uint32_t)(X) & 0xFUL) << 16)
#define PF_CTR_ERG          (0xFUL << 20) 
#define PF_CTR_ERG_VAL(X) (((uint32_t)(X) & 0xFUL) << 20)
#define PF_CTR_CWG          (0xFUL << 24) 
#define PF_CTR_CWG_VAL(X) (((uint32_t)(X) & 0xFUL) << 24)
#define PF_CTR_Format          (0x7UL << 29) 
#define PF_CTR_Format_VAL(X) (((uint32_t)(X) & 0x7UL) << 29)
#define PF_CCSIDR_LineSize          (0x7UL << 0) 
#define PF_CCSIDR_LineSize_VAL(X) (((uint32_t)(X) & 0x7UL) << 0)
#define PF_CCSIDR_Associativity          (0x3FFUL << 3) 
#define PF_CCSIDR_Associativity_VAL(X) (((uint32_t)(X) & 0x3FFUL) << 3)
#define PF_CCSIDR_NumSets          (0x7FFFUL << 13) 
#define PF_CCSIDR_NumSets_VAL(X) (((uint32_t)(X) & 0x7FFFUL) << 13)
#define PF_CCSIDR_WA          (0x1UL << 28) 
#define PF_CCSIDR_WA_VAL(X) (((uint32_t)(X) & 0x1UL) << 28)
#define PF_CCSIDR_RA          (0x1UL << 29) 
#define PF_CCSIDR_RA_VAL(X) (((uint32_t)(X) & 0x1UL) << 29)
#define PF_CCSIDR_WB          (0x1UL << 30) 
#define PF_CCSIDR_WB_VAL(X) (((uint32_t)(X) & 0x1UL) << 30)
#define PF_CCSIDR_WT          (0x1UL << 31) 
#define PF_CCSIDR_WT_VAL(X) (((uint32_t)(X) & 0x1UL) << 31)

#define PF  ((struct PF*)(0xE000ED78UL))
struct AC {
  volatile uint32_t ITCMCR;
  volatile uint32_t DTCMCR;
  volatile uint32_t AHBPCR;
  volatile uint32_t CACR;
  volatile uint32_t AHBSCR;
  const volatile uint32_t RESERVED24[1];
  volatile uint32_t ABFSR;
};
#define AC_ITCMCR_EN          (0x1UL << 0) 
#define AC_ITCMCR_EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define AC_ITCMCR_RMW          (0x1UL << 1) 
#define AC_ITCMCR_RMW_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define AC_ITCMCR_RETEN          (0x1UL << 2) 
#define AC_ITCMCR_RETEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define AC_ITCMCR_SZ          (0xFUL << 3) 
#define AC_ITCMCR_SZ_VAL(X) (((uint32_t)(X) & 0xFUL) << 3)
#define AC_DTCMCR_EN          (0x1UL << 0) 
#define AC_DTCMCR_EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define AC_DTCMCR_RMW          (0x1UL << 1) 
#define AC_DTCMCR_RMW_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define AC_DTCMCR_RETEN          (0x1UL << 2) 
#define AC_DTCMCR_RETEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define AC_DTCMCR_SZ          (0xFUL << 3) 
#define AC_DTCMCR_SZ_VAL(X) (((uint32_t)(X) & 0xFUL) << 3)
#define AC_AHBPCR_EN          (0x1UL << 0) 
#define AC_AHBPCR_EN_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define AC_AHBPCR_SZ          (0x7UL << 1) 
#define AC_AHBPCR_SZ_VAL(X) (((uint32_t)(X) & 0x7UL) << 1)
#define AC_CACR_SIWT          (0x1UL << 0) 
#define AC_CACR_SIWT_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define AC_CACR_ECCEN          (0x1UL << 1) 
#define AC_CACR_ECCEN_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define AC_CACR_FORCEWT          (0x1UL << 2) 
#define AC_CACR_FORCEWT_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define AC_AHBSCR_CTL          (0x3UL << 0) 
#define AC_AHBSCR_CTL_VAL(X) (((uint32_t)(X) & 0x3UL) << 0)
#define AC_AHBSCR_TPRI          (0x1FFUL << 2) 
#define AC_AHBSCR_TPRI_VAL(X) (((uint32_t)(X) & 0x1FFUL) << 2)
#define AC_AHBSCR_INITCOUNT          (0x1FUL << 11) 
#define AC_AHBSCR_INITCOUNT_VAL(X) (((uint32_t)(X) & 0x1FUL) << 11)
#define AC_ABFSR_ITCM          (0x1UL << 0) 
#define AC_ABFSR_ITCM_VAL(X) (((uint32_t)(X) & 0x1UL) << 0)
#define AC_ABFSR_DTCM          (0x1UL << 1) 
#define AC_ABFSR_DTCM_VAL(X) (((uint32_t)(X) & 0x1UL) << 1)
#define AC_ABFSR_AHBP          (0x1UL << 2) 
#define AC_ABFSR_AHBP_VAL(X) (((uint32_t)(X) & 0x1UL) << 2)
#define AC_ABFSR_AXIM          (0x1UL << 3) 
#define AC_ABFSR_AXIM_VAL(X) (((uint32_t)(X) & 0x1UL) << 3)
#define AC_ABFSR_EPPB          (0x1UL << 4) 
#define AC_ABFSR_EPPB_VAL(X) (((uint32_t)(X) & 0x1UL) << 4)
#define AC_ABFSR_AXIMTYPE          (0x3UL << 8) 
#define AC_ABFSR_AXIMTYPE_VAL(X) (((uint32_t)(X) & 0x3UL) << 8)

#define AC  ((struct AC*)(0xE000EF90UL))
#endif